[
  {
    "name": "Reaching New Heights Residence",
    "organization": "Reaching New Heights Residence",
    "addressLine1": "237 Landing Road",
    "city": "Bronx",
    "stateAbbreviation": "NY",
    "postal": "10468",
    "phone": "(212) 803-5700",
    "website": "https://www.brc.org/transitional-housing-shelter",
    "capacity": 200,
    "description": "",
  },
  {
    "name": "Maya's Place",
    "organization": "Maya's Place",
    "addressLine1": "1774 Popham Avenue",
    "city": "Bronx",
    "stateAbbreviation": "NY",
    "postal": "10453",
    "phone": " (718) 583-2380",
    "website": "https://childrensvillage.org/",
    "description": ""
  },
  {
    "name": "Susan's Place Shelter for Women",
    "organization": "Susan's Place Shelter for Women",
    "addressLine1": "1911-21 Jerome Ave",
    "city": "Bronx",
    "stateAbbreviation": "NY",
    "postal": "10453",
    "phone": " (718) 943-1341",
    "website": "https://www.careforthehomeless.org/",
    "capacity": 200,
    "description": ""
  },
  {
    "name": "PATH DHS Shelter ",
    "organization": "PATH",
    "addressLine1": "151 East 151st Street",
    "city": "Bronx",
    "stateAbbreviation": "NY",
    "postal": "10450",
    "phone": " (718) 503-6400",
    "website": "https://www.nyc.gov/site/dhs/shelter/shelter.page",
    "description": ""
  },
  {
    "name": "Project Hospitality",
    "organization": "Project Hospitality",
    "addressLine1": "150 Richmond Terrace",
    "addressLine2": "(between Wall Street and Schuyler Street)",
    "city": " Staten Island",
    "stateAbbreviation": "NY",
    "postal": "10301",
    "phone": "718-876-7716",
    "description": ""
  },
  {
    "name": "Breaking Ground",
    "organization": "Breaking Ground",
    "addressLine1": "100-32 Atlantic Avenue (at 102 Street)",
    "city": "Queens",
    "stateAbbreviation": "NY",
    "postal": "11203",
    "phone": "(718) 360-8000",
    "website": "https://breakingground.org/",
    "description": "",
  },
  {
    "name": "Olivieri Center for Homeless",
    "organization": "Urban Pathways",
    "addressLine1": "257 West 30th Street",
    "city": "New York",
    "stateAbbreviation": "NY",
    "postal": "10000",
    "phone": " (212) 947-3211",
    "website": "https://www.coalitionforthehomeless.org/",
    "description": ""
  },
  {
    "name": "Mainchance Drop-In Center",
    "organization": " Grand Central Neighborhood Social Services Corporation",
    "addressLine1": "120 E 32nd St",
    "addressLine2": "",
    "city": "New York",
    "stateAbbreviation": "NY",
    "postal": "10016",
    "phone": " (212) 883-0680",
    "website": "http://www.grandcentralneighborhood.org/",
    "description": ""
  },
  {
    "name": "Gathering Place",
    "organization": "Gathering Place",
    "addressLine1": "2402 Atlantic Ave",
    "city": "Brooklyn",
    "stateAbbreviation": "NY",
    "postal": "11233",
    "phone": "718-385-8713",
    "website": "https://camba.org/",
    "description": ""
  },
  {
    "name": "The Living Room",
    "organization": "The Living Room",
    "addressLine1": "800 Barretto Street",
    "city": "Bronx",
    "stateAbbreviation": "NY",
    "postal": "10474",
    "phone": " (718) 893-3606",
    "website": "https://bronxworks.org/",
    "openSpace": null,
    "capacity": 50,
    "description": ""
  },
  {
    "addressLine1": "138 East Long Street",
    "city": "Carson City",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89706",
    "name": "Friends In Service Helping (FISH)",
    "organization": "Friends In Service Helping (FISH)",
    "phone": "(775) 882-3474",
    "website": "https://www.nvfish.com/",
    "description": "MISSION\nTo provide food, clothing, shelter and medical aid to the homeless and hungry within our community, with the objective to provide programs and referrals to families and individuals so they may become self-sufficient.\n\n"
  },
  {
    "addressLine1": "7400 South Virginia Street",
    "city": "Reno",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89511",
    "name": "Launching Pad Empowerment Center",
    "organization": "Launching Pad Empowerment Center",
    "phone": "(775) 853-5441",
    "website": "https://empowermentcenternv.org/",
    "description": "Mission\nTo provide safe and sober housing to recovering addicts and alcoholics with services, support, and commitment to our client's long term success using a 12-step recovery process.\n\nThe Launching Pad Empowerment Center offers a Recovery-Oriented System of Care, including housing, to homeless women and veterans who have completed or are currently enrolled in an American Society of Addiction Medicine (ASAM) level of addictions treatment.\n\nFAQ\nWhere is TheEmpowerment Center?\nThe 34 bed facility isin Washoe County, Nevada. It is a state licensed facility close to citybus lines, shopping, and employment centers.\nAre there residency requirements?\n    Prior or current treatment episode\n    Desire to stay clean and sober\n    Ability to follow program rules\n    Willingness to work a 12-step program of recovery\n    Ability to pay fees in a timely manner\nTheEmpowerment Center is not funded by tax dollars; therefore, it is imperative each resident pay fees in a timely manner.\nWhat does the program provide?\n    Semi-private rooms\n    All bills paid\n    Furnishings (including linens, towels, TV, Internet, phones, free long distance)\n    On site laundry facilities\n    Meals\n    Weekly life skills training, step study, and 12-step meetings\n    Weekly Women's Empowerment or Men's Strength of Character groups\n\n    Successful, experienced, sober staff, with experiential knowledge of the 12-steps of recovery\nTheEmpowerment Center prepares its members for success by providing democratically run, self-supporting housing. Residents interact with others in maintaining the facility, following guidelines, and obtaining gainful employment.\nWhat are the fees for residency?\nFees are $155 per week or $22.14 per day. Upon intake, residents pay their first and last week's fee and an administrative fee of $50. Limited scholarships are available for individuals seeking services at TheEmpowerment Center.\nHow long is the program?\nThe minimum length of stay is 90 days. However, residents are encouraged to stay up to two years in order to build a solid foundation of recovery."
  },
  {
    "addressLine1": "1290 MIll St",
    "city": "Reno",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89502",
    "name": "Casa de Vida",
    "organization": "Casa de Vida",
    "phone": "(775) 329-1070",
    "website": "https://twitter.com/casadevida_reno",
    "description": "Families and Pregnant Women help.\n\nThe mission for Casa de Vida is to provide a home and support services for young, unmarried pregnant women in need with the belief that each young woman and her baby are unique gifts from God."
  },
  {
    "addressLine1": "605 South 21st street",
    "city": "Sparks",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89431",
    "name": "Our Place - Housing-first Emergency Shelter",
    "organization": "Our Place - Housing-first Emergency Shelter",
    "phone": "(775) 327-7501",
    "website": "http://www.renoinitiative.org/",
    "description": "OUR Place is a low-barrier, housing-first emergency shelter.\nThey provide shelter and other services for 138 women, 38 families, 28 seniors, and all of their animal companions every day.\nThe facility is newly remodeled.\nRISE advocates operate these homes 24/7 and support the residents as they work toward their goals.\n"
  },
  {
    "addressLine1": "355 Record Street",
    "city": "Reno",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89512",
    "name": "Reno-Sparks Gospel Mission",
    "organization": "Reno-Sparks Gospel Mission",
    "phone": "(775) 329-0485",
    "website": "http://www.rsgm.org/",
    "description": "Facilities/Services Directory\n\nAdministrative Offices\n2115 Timber Way\nReno, NV 89512\n(775) 323-0386\n\nDowntown Mission/Men's Alcohol & Drug Recovery Services\n355 Record Street\nReno, NV 89512\n(775) 329-0485 (24 hours)\n\n Women's Alcohol & Drug Recovery Services\n(775) 323-0386, Ext. 12\n\nEmergency Lodging Services (Men and Women)\n355 Record Street\nReno, NV 89512\n(775) 329-0485 (24 hours)\n\nVolunteer Opportunities\n(775) 323-0386, Ext. 16\n\nTransitional Housing/Room Rental Services\n(775) 323-0386, Ext. 12\n\nDonation Pick Ups\n(775) 323-7999\n\nDonation Drop Offs\n2115 Timber Way\nReno, NV 89512\n(775) 323-0386\nHours: 8-4 pm Mon.-Thurs., 8-2 pm Fri.\n\n    We're here to help! Call us now at (775) 329-0485. Someone is there 24 hours a day.\nThe Reno-Sparks Gospel Mission offers both emergency and long-term services for men and women in need.\nFor men:\n    82 beds for addiction recovery\n    20 beds for emergency shelter\n    10 beds for transitional renters\nFor women:\n    18 beds for addiction recovery\n    18 beds for emergency shelter\n    4 beds for transitional renters\n\nAddiction Recovery\nWoman in deep thoughtWith 100 beds for men and women, the Mission offers one of the largest, most comprehensive addiction recovery programs in Northern Nevada, addressing addictions such as meth, alcohol, cocaine and gambling.\nThe Christian Addiction Recovery and Education program (C.A.R.E.) is a free, 13-month residential program that addresses a client's spiritual, psychological, educational, physical and emotional needs. All of the client's needs are provided for: shelter, food, clothing and personal hygiene products. Sorry, but cell phones are not allowed.\n\nClients desiring program entry must first complete a 30-45 day evaluation period.\nThe program is divided into four phases:\n1. Stabilization: Clients are introduced to intensive 12-Step coursework as well as basic Christianity and family of origin issues.\n2. Exploration: Clients explore the meaning and purpose of life through such studies as The Purpose Driven Life and Search for Significance, while learning how to develop healthy relationships in life.\n3. Maturation: Clients learn to take their Christian faith to deeper levels in such classes as Measure of Maturity and Walking with the Master. Addiction is revisited in the Life Recovery series that explores the 12-Step principles found in the Bible.\n4. Preparation: Men and women prepare to return to society as productive members through Planning for Success, which connects them with vocational training agencies, GED courses, computer basics, budgeting and finance and job interview/resume skills. Clients also prepare to join God in His work by firming up their spiritual foundation in the Experiencing God class.\n\nAll clients are held to strict guidelines to ensure their road to sobriety and a new life is a successful one!\n    If you or someone you know needs help, call (775) 329-0485 (24 hours) or (775) 323-0386.\n    To view or download a copy of our services brochure, click here\n \nEmergency Services\nDuring the winter months, the Mission provides emergency clothing and warm accessories to anyone in need. Year-round, the Mission provides up to 40 beds for homeless men and women in different shelters.\nEmergency Shelter:\n    Sign-ups at the Mission, 355 Record St., Reno\n    20 beds for men\n    Clients receive a hot dinner, showers, hygiene necessities\n    Call (775) 329-0485 (24 hours)\nWomen's Shelter:\n    A safe house for 18 homeless women and children\n    Women receive meals, showers, clothes and hygiene necessities\n    Women can stay for up to 10 days at a time (more if the demand is low)\n    Call (775) 329-0485 (24 hours)\nCommunity Services\nThe Reno-Sparks Gospel Mission gives back to the community in many ways:\n    Emergency groceries touch hundreds of lives each month as churches and schools contact us for help.\n    Holiday food events each year help about 1,500 families across Northern Nevada enjoy a traditional Thanksgiving or Christmas meal. Our holiday dinners reach more than 2,000 people in a variety of settings, including senior citizen centers.\n    Our four Thrift Depot stores offer great discounts on quality items, such as furniture, appliances, clothing and more.\n\n    We work with other charitable and social service agencies to ensure that everyone who comes to us gets the help they need. From substance abuse recovery to domestic violence counseling to GED classes to transitional housing, we make every effort to find the most appropriate solution.\nFood & Hunger Services\nHomeless man on the streetThe Gospel Mission annually prepares and provides more than 400,000 free meals to homeless and needy people across the Northern Nevada community.\nOur staff prepares up to 1,100 hot meals each day. Every day, we serve breakfast and dinner to any woman off the streets, and feed dinner to hundreds of men each night.\nVolunteer groups from local churches and businesses are active in preparing and serving the nightly meals to the homeless.\nThe Mission also provides countless meals throughout the year to needy families across the Reno-Sparks area. We work closely with individuals, families, churches and schools to supply food from our community pantry to those who are in need.\nDuring the holidays, we will serve thousands of meals to those less fortunate across Northern Nevada. We'll host several special dinner events during non-traditional times, such as Easter and the summertime.\nIf you are hungry or know of an individual or family that is, please contact us at (775) 323-7999.\nIf you would like to help serve a meal or learn of other ways you can help, please contact us at (775) 323-0386, Ext. 16.\nOther Services\n    Clothing vouchers for men, women and children\n    Emergency food assistance for individuals and families\n    Referrals to social service agencies to provide the best assistance\n\n    Evening meals for homeless men, women and women with children\n"
  },
  {
    "addressLine1": "500 East Fourth Street",
    "city": "Reno",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89512",
    "name": "St. Vincent's Center",
    "organization": "St. Vincent's Center",
    "phone": "(775) 322-7073",
    "website": "http://ccsnn.org/",
    "description": "More than 3,600 people benefit monthly from the Emergency Assistance Program, which provides assistance for individuals and families in emergency situations caused by loss of job, family crisis, illness, or other personal situations.\n\n\n\nServices include clothing, bus and prescription vouchers; limited rental assistance; short-term family housing; baby supplies; work permits; phone calls; toiletries; and referral to other local service agencies for specialized or additional assistance. No fees are charged for these services.\n\nCrossroads program\nThe Crossroads Program is a collaboration between Washoe County Social Services (WCSS) and Catholic Charities of Northern Nevada that began in January of 2011. The program provides a supportive living arrangement for men and women transitioning out of homelessness. Clients in the program are given a safe and caring environment to live in, along with wrap-around social services including drug and alcohol counseling, employment support, volunteer/work opportunities, and other tools to help them establish a new, more productive path in life.\nThe goal of Crossroads is to prevent relapses into homelessness and substance abuse, and to reduce public costs associated with jail, hospital and other emergency services. The program has shown tremendous success with many community partners, and Washoe County estimates that Crossroads is saving the community about $4 million per year.\nAverage length of stay at Crossroads - 102 days\n96% of residents volunteer in the community\n25% of residents have been reunited with their families\n100% of program participants are clean, sober and working toward their personal goals\n\n\nClients at Crossroads are wrapped in social services as they continue their regular treatment programs. They are surrounded by a live-in network which will aim to help them establish healthy relationships, a sense of community, and improved life and social skills. We believe Crossroads is a benchmark program that has the potential for expansion and replication both locally and statewide.\n\nThere are three Crossroads locations in Reno:\n\nCrossroads Main Campus\n395 Gould Street\nReno, NV 89512\n(775) 322-2143\n\nThe Park House\n1815 &1835 Montello Street\nReno, NV 89512\n(775) 284-8387\n\nThe River House\n480 Galetti Way\nBldgs. 14 and 15\nSparks, NV 89431\n(775) 785-4006\n\n\n"
  },
  {
    "addressLine1": "275 East Fourth Street",
    "city": "Reno",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "00000",
    "name": "St. Vincent's Transitional Center",
    "organization": "St. Vincent's Transitional Center",
    "phone": "(775) 322-7073",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "1525 East Ninth Street",
    "city": "Reno",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89512",
    "name": "Reno Housing Authority",
    "organization": "Reno Housing Authority",
    "phone": "(775) 329-3630",
    "website": "https://www.renoha.org/",
    "description": ""
  },
  {
    "addressLine1": "1931 Sutro",
    "city": "Reno",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89512",
    "name": "The Salvation Army Community Center",
    "organization": "The Salvation Army Community Center",
    "phone": "(775) 688-4555",
    "website": "http://www.gosalarmy.org/deloro/reno",
    "description": "Programs\n    Worship Services\n    Community Assistance\n    Men's Rehabilitation\n    Youth Programs\n    Women's Auxiliary\n    Business Recycling\n\nThe Salvation Army Reno Corps Community Center proudly serves Washoe County in Northern Nevada. We offer a variety of social and church services. We invite you to learn more about the good we do every day in your community."
  },
  {
    "addressLine1": "830 East Lake Mead Pkwy",
    "city": "Henderson",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89015",
    "name": "Salvation Army Food Bags Henderson",
    "organization": "Salvation Army Food Bags Henderson",
    "phone": "(702) 565-9578",
    "website": "https://www.salvationarmysouthernnevada.org/henderson-corps",
    "description": "Food bags and emergency hygiene kits are given to our homeless neighbors Mondays through Fridays 9am - 12 noon."
  },
  {
    "addressLine1": "4981 Shirley St",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "00000",
    "name": "Nevada Partnership For Homeless Youth",
    "organization": "Nevada Partnership For Homeless Youth",
    "phone": "(702) 383-1332",
    "website": "http://www.nphy.org/",
    "description": "NPHY is the most comprehensive service provider for the thousands of homeless youth in Southern Nevada, serving hundreds of youth through our core programs and touching the lives of thousands more through outreach each year.\nNPHY's programs stabilize homeless teens' lives, meeting their immediate needs and providing a safe, supportive environment and a path to self-sufficiency.\n\nThrough our work with homeless youth, NPHY creates productive, healthy adults who contribute to society.\n\nAre you a youth, ages 12 - 18, with nowhere to sleep tonight? Are you running away or afraid you're going to get kicked out? Are you in an unstable housing situation, couch surfing with friends, sleeping outside, or temporarily staying in a daily or weekly motel? Are you in need of a place to stay, food, clothing, hygiene supplies, or someone to talk to? Do you feel you're in danger?\nIf you said yes to any of these questions, call our crisis hotline 24-hours-a-day at 1-866-U-ARE-SAFE (1-866-827-3723) to talk to someone and get connected to immediate help.\nIf it's between 9 a.m. and 6 p.m. Monday - Friday, you can also come directly to our Drop-In Center, located at 4981 Shirley Street, Las Vegas, NV 89119 (near the intersection of Tropicana Ave. and Maryland Parkway, across Tropicana from the Thomas & Mack Center). Walk-in's are welcome."
  },
  {
    "addressLine1": "1601 Sandhill Road",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89104",
    "name": "Innovative Concept Transitional Housing,Inc.",
    "organization": "Innovative Concept Transitional Housing,Inc.",
    "phone": "(702) 689-1508",
    "website": "http://innovativeconcepttransitionalhousing.com/",
    "description": "Shared transitional housing program for homeless men women families. Vets and. seniors and disabled."
  },
  {
    "addressLine1": "1410 Maryland Parkway",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89104",
    "name": "Family Promise of Las Vegas",
    "organization": "Family Promise of Las Vegas",
    "phone": "(702) 638-8806",
    "website": "http://familypromiselv.com/",
    "description": "Family Promise is a nonprofit organizaon helping homeless families into homes and lastng independence. We believe that no child should have to sleep in a car or under a bridge, and that every family deserves a chance to be whole and have a roof over their head again.\n\n\nHost Congregations About four times a year, for a week at a time, each host congrega)on provides a place to sleep, meals (supper, breakfast and bag lunch) and hospitality for up to four families at a time. Families are hosted from dinner time to the next morning.\n\nHousing Programs\nFamily Promise administers a variety of housing projects for homeless parents with minor children. Our HUD sponsored program is for parents with disabilities; our other\nhousing programs assist homeless families to get into housing they can afford. To receive more information about our housing programs please contact us at (702) 638-8806.\n\nGuests\nSince Family Promise is primarily comprised of volunteers, only guest families without active substance abuse, domestic violence, or severe mental illness are accepted. Many guests are employed during the day and go to work. During the school year, children attend school.\n\nDay Center\nThe Day Center is the hub. Guests are brought from the hostng congregations to the Day Center from 7 am to 5 pm, their daytime home base. Here, homeless families work one on\none with a professional case manager to look for employment and housing and address problems that stand in the way of permanent independent housing for these families. The\n\nDay Center also provides families a mailing address, a place to shower, and a place to do laundry.\n\nOur Interfaith Shelter Network is unique to our community. When we opened our doors in 1996 we were the only shelter program that could keep parents together in the same room with children with no separation by gender. We can provide services to single parents with children, especially single fathers. We are one of only two existing shelter programs in our community that can provide shelter for single fathers. Dual parent families for us are defined as two parents in partnership to provide a nurturing and safe environment for their children. We have welcomed grandparents with their grandchildren through our doors as well.\n\nThe heart of our shelter program is the partnership from over 26 interfaith congregations across Clark County; Catholic, Jewish, Muslim Protestant, and Unitarian Universalist. We began our network with 12 congregations and over the past 17 years have grown to a network of 26 interfaith partners. All with a common goal to provide shelter and hospitality to families that need a place to call home while they work on goals to get back to work and into their own home again.\n\n\nOur Day Center is a place to call home during the day. From 7 a.m. to 5 p.m. daily, case managers work with each family to develop a personal plan. Children go to school, daycare or the Boys and Girls Clubs. Our Day Center looks and feels like home. There are showers, a laundry room, closets for personal belongings, access to internet, phones and fax. Our van drivers transport our families to the evening host site around 4:30 p.m. daily to be greeted by the host coordinator and the evening volunteers."
  },
  {
    "addressLine1": "1401 Las Vegas Blvd N",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89101",
    "name": "Courtyard Homeless Resource Center",
    "organization": "Courtyard Homeless Resource Center",
    "phone": "(702) 229-6117",
    "website": "https://www.lasvegasnevada.gov/Residents/Neighborhood-Services/Homeless-Services",
    "description": ""
  },
  {
    "addressLine1": "480 W Bonanza Rd",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "00000",
    "name": "Las Vegas Rescue Mission",
    "organization": "Las Vegas Rescue Mission",
    "phone": "(702) 382-1766",
    "website": "http://www.vegasrescue.org/",
    "description": "Emergency Shelter:\nEmergency shelter at the Mission is provided to men, women, and children on a first come first served basis. We currently have a total capacity of 170 emergency shelter beds. Our guests are allowed to stay seven nights and possibly longer depending on their particular circumstances. A shower and clean linens are provided daily. Dinner and breakfast are served each day of their stay. This is absolutely free of charge, thanks to kindness and generosity of those who donate to the Las Vegas Rescue Mission\n\n1 year recovery program\nThe Las Vegas Rescue Mission residential recovery program is for men and women with life-controlling addictions who want to make a positive life change. The focus of the program is on recovery, rehabilitation, and preparation for a return to productive living through the power and love of Jesus Christ. We offer this at no cost to those who have no income as a way to get off the streets to a safe environment where all their physical needs are provided for, so they can focus all their attention on recovery and their relationship with Jesus Christ.\n\nVisit the website provided for more details.\n\nDaily Meals\nDinner is served at 5:00 p.m. 7 days a week for anyone who is hungry. Breakfast is supplied for overnight emergency shelter guests, and lunch for those who are a part of our residential recovery program, including a bag lunch for those who are working off-site. Also, every night after chapel service, ice cream is served for our overnight guests and residents."
  },
  {
    "addressLine1": "1502 Las Vegas Blvd North",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89101",
    "name": "Catholic Charities Shelter for Men Las Vegas",
    "organization": "Catholic Charities Shelter for Men Las Vegas",
    "phone": "(702) 385-2662",
    "website": "http://www.catholiccharities.com/service_details/emergency-shelter/",
    "description": ""
  },
  {
    "addressLine1": "1 West Owens",
    "city": "North Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89030",
    "name": "The Shade Tree For Women",
    "organization": "The Shade Tree For Women",
    "phone": "(702) 385-0072",
    "website": "https://theshadetree.org/",
    "description": "Emergency and Transitional program for women, youth, children, and their pets impacted by domestic violence or being homeless.\nShade Tree is open to any woman, with or without children, and male and female unaccompanied youth who lack a safe, adequate place to live.\n\nWe provided victims of domestic violence, sexual assault, elder abuse, human trafficking, as well as homeless youth and families, the tools and resources they need to assist with recovery and healing.\nWe help the women pick up the pieces and guide them on their path to self-sufficiency.\nDay Shelter ProgramThe Day Shelter program operates seven (7) days a week from 8 a.m. to 4 p.m. 365 days a year.  Day Shelter is open to all women and children residing at The Shelter and any homeless woman in the community.   Clients can have a safe place to rest during the day and access to a hot lunch.\nEmergency Shelter ProgramThe Emergency Shelter program is the only 24-hour accessible program in Clark County designed specifically to meet the needs of the homeless, with an emphasis toward women, both with and without children.  The shelter is open to all homeless women who need a safe place to stay, day or night (30-90 days stay).  It offers assistance with all basic life needs such as meals, clothing, beds, showers, hygiene supplies and referrals. After her first 30 days, a woman may be offered an extension to stay in the program or she is moved to our long-term Transitional Shelter program. Possessions of ID, minimum state residency or US citizenship are not requirements for accessing services. 164 beds are available in this program, of which 84 are for families and 80 are for single women.\n\nTransitional Shelter ProgramThe Transitional Shelter program allows single women and families additional time (up to 1 year) to access programs and to achieve goals. Each resident is assigned a case manager who assists her in establishing a case plan that will help her move toward self-sufficiency.  Program goals are designed to aide residents in finding employment that pays a living wage, securing stable housing, saving money and accessing needed services. Each working resident in the Transitional Housing Program is required to save at least 30% of her income each month. 164 beds are also available in this program consisting of 84 beds for families and 80 beds for single women.\nSurvivors Service CenterThe Survivors Services Center provides critical assistance to victims of domestic violence, sexual assault/sexual abuse, street crime, and victims of elder abuse.  The Center assists victims with obtaining Temporary Protective Orders, applying for Victims Compensation, 9-1-1 telephones, accompanies victims to court, assists them through the legal process, and accessing services that may be needed due to situations of violence.  With the help of a Victims Advocate, each client develops a \"safety plan\" to help reduce the risk of future violence.  Group meetings are conducted weekly on-site by staff and volunteers to provide educational and emotional support.\nWorkforce Readiness ProgramThe Workforce Readiness program is designed to prepare women to enter or re-enter the job market at a self-sustaining wage.  Fourteen (14) core classes are offered during the course of a one-week period covering all aspects of job searching skills including work values, skills identification, time management, goal setting, affirmations, barriers to employment success, work ethics discussion, and mock interviews. Residents also receive appropriate attire from our boutique as well as bus passes for job searching, interviews, employment and training. They each receive an individual employment plan, individual follow-up and job retention assistance once they are employed. Also, if needed, further educational deficiencies are met through referrals to community-based adult education programs.\nLife SkillsThe Life Skills program offers over 58 on-site classes designed to enhance job development by addressing other deficiencies in life skills and increasing a womans opportunity for sustainable success. Classes offered covers topics such as Budgeting, Credit Counseling, Time Management, Healthy Relationships, Co-Dependency, Grief, Loss & Anxiety Reduction, Motivation, Assertive Skills, Housing I & II, Computer 101, EXCEL, Anger Management, ESL, Reading/Writing, Math, Health Class, Ask the Nurse, Ask the Lawyer and Yoga.\n\nMental Health Service CoordinationMental Health Service Coordination is provided by an experienced mental health staff member addressing mental health issues presented by our clients, making referrals to other community agencies as needed and serving as liaison to community based mental health programs. Residents who enter the shelter and are already under the care of a mental health professional are provided the necessary support and transportation to continue those services while living at the shelter.\nHousing AssistanceHousing Assistance and advocacy begins during the initial intake process because of the importance of connecting families with affordable housing. A full-time Housing Specialist assists residents with completing applications for public/subsidized housing and helps eligible residents find quality affordable housing. Residents are also offered Housing I and Housing II classes, which are taught by the Housing Specialist through our Life Skills Program.  These classes provide information and guidance that will help them secure and retain affordable and safe housing.\nChildrens Activity Center (CAC)The CAC program is designed to address the special needs of children who are experiencing homelessness and abuse: lack of self-esteem, poor social skills, developmental and educational delays.  The Center helps children deal with these issues in a safe and non-intimidating environment. As a life classroom where \"children are given hope for a brighter future\", the Center is a place where children feel safe and learn to trust. All lessons and activities are education centered and aligned with the three main focuses of the program: 1) to ensure that all children have an opportunity to have a childhood; 2) to promote education as the vehicle to breaking the cycle of homelessness/abuse; and 3) to nurture the relationship between mother and child. Activities are designed to allow the family to participate together, including on-going parenting classes. Children participating in the CAC program range in ages from 1 day up to age 18.\nStallman Touro Clinic at The Shade TreeThe on-site Stallman Touro Clinic provides basic health care services for shelter residents that include acute medical care, management of chronic illness, womens health, and the health of children. Being able to offer these services through the clinic help our residents get regular preventative health care, so they can stay healthy and be able to attain financial stability.\n\nNoahs Animal HouseNoahs Animal House is a pet sanctuary for shelter residents that allow women to escape abusive situations without leaving behind their pet. In homes where there is violence, pets are often threatened or injured by the violent partner. It is not uncommon for an abuser to continue to control the relationship using the family pet. Noahs is the first full service facility of its kind located on the grounds of the womens shelter in the western region of the United States.\nCourage for ChangeThe Courage for Change Program has been created in order to promote healthy change among individuals and families who have been impacted by any of the following: domestic violence, homelessness, all forms of abuse, and any other type of psychological trauma. Services may include one, or a combination of the following: Individual Therapy, Family Therapy, Comprehensive Mental Health Assessments, Psychosocial Rehabilitation (PSR), Basic Skills Training (BST) and Support Groups. We exist so that individuals and families can gain the strength and hope needed in order to move forward successfully in life!\n"
  },
  {
    "addressLine1": "35 W. Owens Avenue",
    "city": "North Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89030",
    "name": "The Salvation Army Day Resource Center - Homeless shelter",
    "organization": "The Salvation Army Day Resource Center - Homeless shelter",
    "phone": "(702) 701-5369",
    "website": "https://www.salvationarmysouthernnevada.org/homeless-services",
    "description": "The Shelter is open 365 days a year with a Day Resource Center to access, triage, and refer clients to our programs that can provide the long term help they might need.\n\nEach day an average of 350 individuals come to us for a reprieve from the weather, take a shower, use the restrooms, hydrate, or make telephone calls; simple, basic needs that we can sometimes take for granted."
  },
  {
    "addressLine1": "35 W. Owens",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "00000",
    "name": "Day Resource Center/ Emergency Lodge",
    "organization": "Day Resource Center/ Emergency Lodge",
    "phone": "(702) 870-4430",
    "website": "https://www.salvationarmysouthernnevada.org/",
    "description": "The Shelter is open 365 days a year with a Day Resource Center to access, triage, and refer clients to our programs that can provide the long term help they might need.\n\nEach day an average of 350 individuals come to us for a reprieve from the weather, take a shower, use the restrooms, hydrate, or make telephone calls; simple, basic needs that we can sometimes take for granted."
  },
  {
    "addressLine1": "2915 W. Charleston Avenue",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "00000",
    "name": "Safe Nest: Temporary Assistance for Domestic Crisis",
    "organization": "Safe Nest: Temporary Assistance for Domestic Crisis",
    "phone": "(702) 646-4981",
    "website": "http://www.safenest.org/",
    "description": "Shelter\nMaintaining more than 70 beds in a confidential location, Safe Nest's shelter provides a refuge for victims to recover from the trauma of domestic violence and transition to an abuse-free life.\nAdmission to the shelter starts with a call to the Crisis Hotline. After a confidential interview, counselors meet the family at a neutral location and transport them to the shelter. Food, clothing and other basic necessities are provided.\n\n\nAfter the family settles in, an advocate is assigned to the family to help them develop a plan focused on the objectives needed to transition to a new life. Shelter stay varies but most residents complete their plans within 60 days.\nWhile in shelter, residents can attend parenting classes, support groups, individual counseling, and skill-building workshops. Children's services include individual and group counseling, with an on-site therapist and a recreational counselor. Shelter clients are also provided employment counseling, housing assistance, referrals for financial and legal aid and many other resources.\nOne of the specialized programs within shelter is called the Family Conflict Prevention Project. This project is a combination of parenting education for mothers, behavioral education for the children, and counseling to strengthen the parent-child relationship. The 5-week structured curriculum is based on prevention principles promoted by the Office of Juvenile Justice and Delinquency Prevention. This project, in combination with individual counseling, support groups, and structured family activities, is an essential element of healing for shelter residents."
  },
  {
    "addressLine1": "1824 Leonard Lane",
    "city": "Las Vegas ",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89108",
    "name": "God In Me Ministry",
    "organization": "God In Me Ministry",
    "phone": "(702) 285-7797",
    "website": "mailto:anthonymosley@windowbright.com",
    "description": "Room & Board (furnished room, tv and food) are available by the month at a minimal rate. Call anytime\n\nGod In Me Ministry has been helping men and women transition back on their feet since 1977, which is longer than any other facility still open and two years before the rescue mission."
  },
  {
    "addressLine1": "7530 W. Sahara Ave. Ste. 105",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89117",
    "name": "Women's Development Center",
    "organization": "Women's Development Center",
    "phone": "(702) 796-7770",
    "website": "http://www.wdclv.org/",
    "description": "Assistance for women in need. Transitional Housing for Homeless, Single Parent (Female) Families.\nWDC provides a wide array of housing services for the homeless and low-income residents in our community. Housing services range from transitional housing for the homeless to foreclosure intervention services for those trying to save their homes.\nTransitional Housing Program\nThe Transitional Housing Program is structured to include a wide range of services designed to stabilize the family and help them move towards self-sufficiency. Services include a furnished one or two-bedroom apartment, person-centered case management, safety planning, employment readiness, money management, housing counseling, life skills coaching, crisis intervention, children's services, transportation, childcare and fun family activities.\n\nAffordable Rental Program\nThe Affordable Rental Program assists working poor families and individuals with a safe, secure and sanitary apartment that is affordable. The program provides a safety net to residents in case of financial crisis, loss of income, etc. The support service component helps to prevent future homelessness. The largest segments of households accessing this program are single female heads of households that are at 60 percent of area median income (AMI) or below.\n\n\nHOPWA Housing Program\nThe HOPWA Housing Program provides affordable permanent housing to families and individuals living with HIV/AIDS. WDC provides a variety of supportive services and collaborates with other community agencies to help ensure that residents receive all necessary services. WDC has also spearheaded a quarterly HOPWA Round Table meeting to improve service delivery to residents of the program.\n\nLindell Harbor Senior Apartments\nThe Lindell Harbor Senior Apartments provide income-eligible persons, 55 years of age and older, with a permanent, clean, safe and affordable apartment. Applicants must be at or below 50 percent of AMI. This cozy 19-unit community consists of 12 deluxe one-bedroom apartments, seven deluxe two-bedroom apartments, a recreation room and covered parking for all residents. Also, included in the energy-efficient apartments are washer/dryer hookups, dishwasher, garbage disposal and private patio/balcony. There is also an on-site laundry facility, barbeque and picnic area.\n\n\nHomeownership Services Program\nThe Homeownership Services Program provides various types of educational and counseling services to low-income families and individuals. Educational opportunities include Homebuyer Education, Financial Literacy and Rebuilding Your Credit. WDC offers classroom and online Homebuyer educational courses. One-on-one counseling includes housing, default and credit counseling services. The non-refundable registration fee for First-Time Homebuyer and Financial Literacy seminar is $20; payable by cash or money order the day of the event.\n\n*Operation of these programs is contingent upon grant funding\n"
  },
  {
    "addressLine1": "600 Palmhurst Dr.",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89145",
    "name": "Danielle House - Angels Power Ltd",
    "organization": "Danielle House - Angels Power Ltd",
    "phone": "(702) 233-8221",
    "website": "https://www.angelspowerltd.org/",
    "description": "I, Lori Power, Executive Director/Founder, with my daughter Danielle, Founder of Angel's Power Ltd., started this organization because we were victims, once, we are now survivors! When Danielle was 7, I married a man that molested her, I lost Danielle for 5 years , to her biological father, her stepfather got 20 to life in prison. Danielle wanted to start an organization that could help the non-offending family members & pets, be able to stay together with the victim. To help these families succeed in life and the victim to be able to follow their dreams, like she is. She wanted us to express that a victim does not have to stay a victim with the right interventions!"
  },
  {
    "addressLine1": "8635 W. Sahara blvd #538",
    "city": "Las Vegas",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89117",
    "name": "A Girl's Place",
    "organization": "A Girl's Place",
    "phone": "(702) 524-4913",
    "website": "https://www.agirlsplace.org/",
    "description": "Monday- Friday (8am-5pm) A Girls Place is a Non-Profit organization for young women ages 18 to 21 with nowhere to go. Through transitional housing and life-skill development,\n\nWe assist former foster and probation youth with nowhere to go.\n\n\nA monthly fee at a minimal rate, our program teaches participants the fundamental skills needed to achieve self- sufficiency."
  },
  {
    "addressLine1": "PO Box 51316",
    "city": "Sparks",
    "state": "Nevada",
    "stateAbbreviation": "NV",
    "postal": "89435",
    "name": "Hosanna Home Women's Transitional Shelter",
    "organization": "Hosanna Home Women's Transitional Shelter",
    "phone": "(775) 232-5416",
    "website": "http://www.hosannahome.org/",
    "description": "6 month Christian women's transitional shelter; must be sober (testing required); willing and able to work, attend church and classes."
  }
]