[
  {
    "addressLine1": "100 W. 13th Avenue",
    "city": "Anchorage",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99523",
    "name": "Abused Womens Aid in Crisis AWAIC - Emergency Shelter",
    "organization": "Abused Womens Aid in Crisis AWAIC - Emergency Shelter",
    "phone": "(907) 279-9581",
    "website": "http://www.awaic.org/",
    "description": ""
  },
  {
    "addressLine1": "2823 East Tudor Road",
    "city": "Anchorage",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99507",
    "name": "Anchorage Gospel Rescue Mission",
    "organization": "Anchorage Gospel Rescue Mission",
    "phone": "(907) 563-5603",
    "website": "https://www.anchoragerescue.org/",
    "description": "Daily meals and shelter for homeless individuals plus a two year residency program for long term rehabilitation from addictive behavior with faith-based support. Funded exclusively through private donations. No state, federal, or municipal funds used."
  },
  {
    "addressLine1": "1021 E. 3rd Avenue",
    "city": "Anchorage",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99523",
    "name": "Brother Francis Shelter",
    "organization": "Brother Francis Shelter",
    "phone": "(907) 277-1731",
    "website": "https://www.cssalaska.org/",
    "description": "Brother Francis Shelter, a program of Catholic Social Services, is an emergency shelter for men and women in Anchorage without a home. We serve the homeless with dignity, care, compassion and with an emphasis on moving our guests toward self-sufficiency.\n\nMost of our shelter guests want to transition out of homelessness, and our staff is trained and ready to provide them with every opportunity to do so.\n\n\nWe offer our guests access to a variety of different services and supportive programs to help them transition out of homelessness.\n\nShelter Services\n\nDue to recent budget cuts, daytime services have been drastically reduced at Brother Francis Shelter. However, clients will still have access to medical and health clinic.\n\nEvening Services: Overnight baggage storage, dinner, showers, laundry, basic medical care, medicine storage, clothing room\n\nMedical Care at Brother Francis Shelter\n\nFive days a week during the day and on a few evenings each week guests of Brother Francis Shelter has access to health care on site. Currently the clinics deals with: acute illnesses, wound care & skin infections, laceration repair, injuries, cough/colds/flu, sore throats, UTIs and more.\nMedical Respite\n\nThe medical respite program provides a space for the self-care and recuperation that patients who are discharged from medical facilities would have in their own homes and supportive case management services to address individuals' homelessness. Guest-patients recovering from acute physical ailments or injury will access to a space to recuperate on a short-term basis.\n\nPrograms\nCase Management\n\nCase Management provides guests the opportunity to receive personalized help in making and reaching goals to get back on one's feet. Case managers utilize a collaborative process for assessment, planning, facilitation, and advocacy of coordinated services.\nIn-House Program\n\nThe In-House Program aims to provide guests with an opportunity to acquire work experience onsite. All duties help the shelter serve its guests. By participating in the In-House program, a guest learns valuable social and employment skills, while increasing their sense of self-worth.\nEmployed Guest Program\n\nGuests in this program can stay at the Shelter during the day to sleep, or prepare for the upcoming shift at their job. Guests not in this program must leave the shelter for the day. This program is designed to help an employed guest get the rest needed to be successful at their payroll job, and to help the guest save money for permanent housing.\nSpecial Events and Workshops\n\nWhen available, the shelter serves as a location for outside community volunteers to host the following:\n\n    Resume writing workshops\n    Bible study\n    AA meetings\n    Yoga\n    Photography workshops\n    Improvisation theater workshops\n    And more!\n"
  },
  {
    "addressLine1": "4110 Spenard Road",
    "city": "Anchorage",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99517",
    "name": "Clare House",
    "organization": "Clare House",
    "phone": "(907) 563-4545",
    "website": "https://www.cssalaska.org/our-programs/clare-house/",
    "description": "Clare House provides services that address the basic needs of clients entering the emergency shelter program. This includes safe, warm shelter, food, water and other necessities for both moms and their children. While families are transitioning out of survival mode, Clare House offers 24-hour support and case management services to help guide families to permanent stability. This program provides our clients with stability, consistency and a positive support system, which works hand in hand in building trust and self-esteem.\n\nMoms and kids are often in compromised situations sleeping in a car or on the street with no where else to go before they find refuge at Clare House.\n\n\nCase management services are integral to helping women shift from homelessness to independence."
  },
  {
    "addressLine1": "755 A Street",
    "city": "Anchorage",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99501",
    "name": "Covenant House Alaska Shelter",
    "organization": "Covenant House Alaska Shelter",
    "phone": "(907) 272-1255",
    "website": "https://www.covenanthouse.org/homeless-shelters/anchorage-alaska",
    "description": "Shelter for Teens only, open intake policy, no one is turned away.\nServices:\nEmergency Shelter\nMeals\nClothing\nMedical care\nArts and music classes\nSubstance use counseling\nMental health care\nEmployment assistance\n"
  },
  {
    "addressLine1": "3745 Community Park Loop unity Park Loop",
    "city": "Anchorage",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99501",
    "name": "Intermission Shelter for Children",
    "organization": "Intermission Shelter for Children",
    "phone": "(907) 276-8511",
    "website": "",
    "description": "Shelter Children up to 12 years old.\n"
  },
  {
    "addressLine1": "564 E. 15th Avenue",
    "city": "Anchorage",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99501",
    "name": "Salvation Army McKinnel Shelter",
    "organization": "Salvation Army McKinnel Shelter",
    "phone": "(907) 276-1609",
    "website": "https://www.facebook.com/SalvationArmyAK/",
    "description": "Two parent families and single men with children"
  },
  {
    "addressLine1": "610 E 5TH Avenue",
    "city": "Anchorage",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99501",
    "name": "South Central Counseling Center Crossover House",
    "organization": "South Central Counseling Center Crossover House",
    "phone": "(907) 274-0352",
    "website": "",
    "description": "Emergency Shelter"
  },
  {
    "addressLine1": "240 E 3rd Ave",
    "city": "Anchorage",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99501",
    "name": "Downtown Soup Kitchen Hope Center",
    "organization": "Downtown Soup Kitchen Hope Center",
    "phone": "(907) 277-4302",
    "website": "https://www.downtownhopecenter.org/",
    "description": "Downtown Hope Center provides services to the homeless of Anchorage.\n\nWe are open 7 days a week providing the only single women's shelter in Anchorage. Women are provided with a healthy warm dinner provided daily by our Culinary Arts students. The women are offered a chance to join Feed Me Hope Bakery to learn a marketable job skill. Downtown Hope Center also provides lunch daily to over 400 homeless or economically struggling individuals.\n\n\nShowers, laundry service and clean clothing are also provided daily. In addition we have a 14 week Culinary Arts work force development program available to anyone in need of a skill to re-enter the workforce."
  },
  {
    "addressLine1": "1712 A Street",
    "city": "Anchorage",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99501",
    "name": "McKinnell House - Salvation Army",
    "organization": "McKinnell House - Salvation Army",
    "phone": "(907) 375-3500",
    "website": "http://mckinnellhouse.salvationarmy.org/",
    "description": "We provide emergency shelter for homeless families with children. Those who are unable to provide for their basic needs and cannot obtain the necessary assistance from other public or private agencies. Other eligibility criteria are considered upon application.\n\nMcKinnell House is part of The Salvation Army Family Enrichment (SAFE) Center, located at 1712 A Street. The shelter has sixteen family rooms with private bathrooms. Common areas include a shared children's play room, parent lounge, educational classroom and beautiful dining room.\n\nServices:\n24-hour lodging and staff support\nIndividualized case management\nEducational support in partnership with the Anchorage School District\nNutritious meals & snacks\nLife skills development\nCase management services continue six months after moving on to independent living\n"
  },
  {
    "addressLine1": "561 W Nelson Ave",
    "city": "Wasilla",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99687",
    "name": "Family Promise Mat-Su",
    "organization": "Family Promise Mat-Su",
    "phone": "(907) 357-6160",
    "website": "https://www.fpm-su.com/",
    "description": "Family Promise mobilizes community resources and local congregations to provide compassionate care through shelter, meals, and case management to families without housing.Our office is now located in a duplex at 690 S. Knik-Goosebay Rd., right next to the VFW. on the corner of Lake View and KGB. (We would like to thank the 1st Presbyterian Church of Wasilla for donating our space at their church for 5 years!)\n\nGuest families are sheltered overnight in area churches and receive hospitality from church members/volunteers. FPMS Office/Day center staff provide case management ensuring guests can regain their self sufficiency. 15 guests at a time can receive help in this way, and the average length of stay is 30 days."
  },
  {
    "addressLine1": "723 27th Avenue",
    "city": "Fairbanks",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99701",
    "name": "Fairbanks Rescue Mission",
    "organization": "Fairbanks Rescue Mission",
    "phone": "(907) 452-5343",
    "website": "http://fairbanksrescuemission.org/",
    "description": "Overnight shelter for men and women.\n\nWe exist to serve Christ and our community by addressing the physical, spiritual, mental, emotional, and social well-being of all thosewhom God brings to our doors.\n\nOur Programs:\nIn order for homeless and disadvantaged individuals to become self sufficient and independent, they need to have stability in their lives. This includes housing, freedom from addiction, adequate care for mental illness, a consistent source of income, and a well planned reintegration program into the community. It is our approach to utilize the agencies in the community to provide services for those that come to us in need. We like to say we have a \"Native Blanket Toss'' approach to services. The more capable people we surround our clients with, the higher we can launch them. Using other community agencies allows us to focus and to make the best possible use of our resources. Our clients are the ultimate benefactors as they receive meaningful services as well as knowledge of the community service support system."
  },
  {
    "addressLine1": "201 Union Street",
    "city": "Haines",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99827",
    "name": "Haines Christian Center",
    "organization": "Haines Christian Center",
    "phone": "(907) 766-2126",
    "website": "https://www.facebook.com/aptakaske.net/",
    "description": "Provides short term, emergency shelter on a very limited basis."
  },
  {
    "addressLine1": "247 S Franklin Street",
    "city": "Juneau",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99801",
    "name": "Glory Hole",
    "organization": "Glory Hole",
    "phone": "(907) 586-4159",
    "website": "",
    "description": "You can stay there all day.,, they have phones, clothing, food. a nice shelter."
  },
  {
    "addressLine1": "203 S Willow St",
    "city": "Kenai",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99611",
    "name": "Love in the Name of Christ (Love Inc,)",
    "organization": "Love in the Name of Christ (Love Inc,)",
    "phone": "(907) 283-0262",
    "website": "https://peninsulaloveinc.com/",
    "description": "Provides a family emergency shelter with 25 rooms for families with children. Stay up to 60-90 days and must agree to case management and actively seeking employment. Picture ID. Proof of insurance if in possession of a vehicle. Proof of income within 24 hours"
  },
  {
    "addressLine1": "14639 N Kenai Spur Hwy",
    "city": "Kenai",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99611",
    "name": "Friendship Mission",
    "organization": "Friendship Mission",
    "phone": "(907) 283-5277",
    "website": "http://www.kenaifriendshipmission.com/",
    "description": "Provides currently 8 beds for homeless men living in the Kenai Peninsula. After remodeling, it will provide 24 beds. Three meals a day for those staying there. There is no length of stay. Offers transportation to those living in the shelter who are looking and applying for a job. Those attending must follow the rules: 1. No drinking or drugs while staying there (including off-site usage). 2. Attend church and Bible studies with staff or church of their choice. 3. Look for a job if physically able.Adult men. Accepts those who are felons (not sexual offenders), on probation and parole."
  },
  {
    "addressLine1": "628 Park Ave",
    "city": "Ketchikan",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99901",
    "name": "Ketchikan Homeless Shelter",
    "organization": "Ketchikan Homeless Shelter",
    "phone": "907-225-4194",
    "website": "mailto:ktnfchs@gmail.com",
    "description": "Day Shelter only\n\nOur mission is to offer the homeless and hungry access to a safe non-judgmental day shelter and referrals to local resources. A self-serve breakfast is available every day.\nOpen seven days a week: Mon-Sat 8:00am - 4:00pm and Sunday 8:00am -2:30pm. Closed Mon-Fri 12:00-1:00pm for people to go to the Salvation Army for lunch.\n\nBrown Bag lunches on Saturday.  \n\nServices offered:\nWarm comfortable rest area\nComputer & printer for job and housing search\nShowers\nClean clothing  \nTutoring for GED, resume writing\nAA group  \nCoffee and refreshments\nReferrals to other agencies"
  },
  {
    "addressLine1": "628 Park Avenue",
    "city": "Ketchikan",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99901",
    "name": "Ketchikan Homeless Shelter",
    "organization": "Ketchikan Homeless Shelter",
    "phone": "(907) 225-4194",
    "website": "https://www.ketchikanpath.org/",
    "description": ""
  },
  {
    "addressLine1": "410 Thorsheim Street",
    "city": "Kodiak",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99615",
    "name": "Brother Francis Shelter Kodiak",
    "organization": "Brother Francis Shelter Kodiak",
    "phone": "(907) 486-5610",
    "website": "https://www.facebook.com/KodiakProjectHomelessConnect/",
    "description": "Emergency shelter with client intake from 8:30pm until 10:00pm nightly. Stay limit is 30 days."
  },
  {
    "addressLine1": "2nd and Division St",
    "city": "Nome",
    "state": "Alaska",
    "stateAbbreviation": "AK",
    "postal": "99762",
    "name": "Nome Emergency Shelter - Winter Months Only",
    "organization": "Nome Emergency Shelter - Winter Months Only",
    "phone": "(907) 387-0717",
    "website": "mailto:502sue@gmail.com",
    "description": "Nome Emergency Shelter during the winter months in Nome; generally Nov. 1 to April 30.\n\n\nOperating hours - from 9 pm to 9 am. Doors close nightly at 11 PM. After that entrance requires a police escort.\n\nWe continue to operate out of the Karmun Christian Education Center of the Nazarene Church at 2nd and Division St. We are what is called a 'wet shelter' meaning that we accept people who are inebriated, which is almost all of our guests. We serve dinner and breakfast - and offer a safe, warm place to sleep for any adult in need, regardless of their level of inebriation. We can't mix children in with population, but if a family is in need we try to place people in a local hotel."
  }
]