[
  {
    "addressLine1": "913 State Ave",
    "city": "Alamosa",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "81101",
    "name": "La Puente Home Shelter",
    "organization": "La Puente Home Shelter",
    "phone": "(719) 589-5909",
    "website": "http://www.lapuente.net/programs/shelter",
    "description": "La Puente Home is a shelter that serves three meals a day 365 days a year at 6 am, 12 noon and 6 pm. Anyone is welcome to come and share a meal at La Puente.\n\n\nWe welcome families, migrant farm workers, and other individuals in need to use our services; each guest is allowed to stay for up to one month as they work to get back on their feet. The Shelter has 45 beds that are split into a women's area, a men's area, and family accommodations. In addition, there are two public showers available for the use of any community members in need.\n\nIn addition to providing food, shelter, and a safe environment, the Shelter also addresses needs by connecting guests with community resources and by aiding them in identifying options and setting realistic goals.\n\nCommunity Meals\nLa Puente Home Shelter serves 3 meals a day. These meals are open to the community as well as the guests currently residing at the shelter.\nBreakfast- 6:00 AM\nLunch- Noon\nDinner- 6:00 PM\nAll food for our meals is donated and meals are prepared by shelter staff members or community volunteers and workgroups."
  },
  {
    "addressLine1": "128 La Posta Rd",
    "city": "Taos",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "87571",
    "name": "DREAMTREE PROJECT",
    "organization": "DREAMTREE PROJECT",
    "phone": "(575) 758-9595",
    "website": "https://www.dreamtreeproject.org/",
    "description": "The DreamTree Project operates an Emergency Youth Shelter for ages 12 to 18 and a Transitional Living Program for youth 16 to 24. Emergency Youth ShelterWe accept youth ages 12 to 17 who are homeless, runaways, or fleeing domestic violence. We provide 24-7 supervision and support, along with case management, life skills training, medication management, transportation, and educational support. In addition, we facilitate appointments and services for medical care, behavioral health care, dental care, vision care, and juvenile justice engagement. All residents are enrolled in high school/GED and are required to have a current mental health assessment. We have the capacity for up to 8 youth, who can stay up to 90 days.Transitional Living ProgramWe invite young adults ages 16 to 24 who are homeless, runaways, or fleeing domestic violence to apply to our program. We provide independent housing with 24-7 crisis support, along with case management, life skills training, employment support and educational support. In addition, we facilitate appointments and services for medical care, behavioral health care, dental care, vision care, and juvenile justice engagement. All residents are required to complete high school/GED and maintain employment. We have the capacity for up to 9 young adults, who can reside in the program for up to two years.Our goal is to have every youth experience safety and supportand to achieve a positive placement to re-establish stability."
  },
  {
    "addressLine1": "220 Albright Street",
    "city": "Taos",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "87571",
    "name": "Taos Mens Shelter",
    "organization": "Taos Mens Shelter",
    "phone": "(575) 779-9198",
    "website": "http://www.taosmensshelter.org/",
    "description": "Emergency overnight shelter for men 18 years of age or older.\n\nHours of Operation for the Homeless\nWinter Hours: 5:00pm to 8:00am\n"
  },
  {
    "addressLine1": "405 Castle Creek Rd # 16",
    "city": "Aspen ",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "81612",
    "name": "Aspen Homeless Shelter",
    "organization": "Aspen Homeless Shelter",
    "phone": "(970) 925-1342",
    "website": "https://www.aspenhomelessshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "1004 Grand Ave",
    "city": "Glenwood Springs ",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "00000",
    "name": "Feed My Sheep Homeless Ministry",
    "organization": "Feed My Sheep Homeless Ministry",
    "phone": "(970) 928-8340",
    "website": "http://www.feedmysheephomelessministry.org/",
    "description": "Day shelter in Glenwood Springs Colorado. Day Shelter Hours: Monday through Friday 8:00 AM to 3:00 PM.\nThe Day Center is located in central Glenwood Springs where the homeless and less fortunate can get a hot breakfast, lunch, showers, laundry, storage and communication services. Items such as tents, sleeping bags, blankets, flashlights and personal care kits are available. The Center is not just a place for these services, its a place where men and women can share, plan for the future, renew family relationships, search for work, receive respect and acceptance. The staff at Feed My Sheep, assist many clients with finding resources like jobs, housing, mental and medical care. We also help to restore lost identification and birth certificates, essential to the process of \"starting over\". The Center serves eight Veterans with VA Programs that are available and since my husband is a Veteran he makes trips to Grand Junction with those who need medical care. Our goal is to offer a supportive community program that provides for the mental, spiritual, emotional and physical needs of the less fortunate; creating hope for their future. This loving and supportive atmosphere has resulted in numerous lifestyle changes.\n\nOvernight Program\nOn December 13, 2005, hypothermia claimed the life of one of our local homeless women.  This was the first death we had experienced due to the severe winter conditions in our mountains.  Her death deeply affected our homeless community, producing fear and grief.  Feed My Sheep made the decision that this would not happen again and we started a Winter Overnight Program.  This Program began in two motel rooms in 2006 and now has grown to the basement of the Church of Christ.  We provide air mattresses, pillows, sheets and blankets to keep an average of 28-30 guests warm.  With the extra space at the Church, we have opened our program to individuals and families in a crisis situation such as sudden eviction, job loss, fire or anyone stranded due to road conditions."
  },
  {
    "addressLine1": "2178 Victor Street",
    "city": "Aurora",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80045",
    "name": "Comitis Crisis Center",
    "organization": "Comitis Crisis Center",
    "phone": "(303) 341-9160",
    "website": "https://www.coloradogives.org/ComitisCrisisCenter/overview",
    "description": ""
  },
  {
    "addressLine1": "6240 Smith Road",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80216",
    "name": "Catholic Charities of Denver",
    "organization": "Catholic Charities of Denver",
    "phone": "(855) 777-5280",
    "website": "https://ccdenver.org/",
    "description": "Marisol Homes is a shelter for shelter for single and expectant mothers.\nShelter Services:\nEmergency Shelter\nCommunity-based extended-stay shelter\nMaternity Care\nCase management\nPost-shelter support services\nChild care services for children up to 12 years old.\n\nEligibility:\nPregnant women who are experiencing homelessness\nSingle women with children who are experiencing homelessness\nDonation information:\ndonorrelations@ccdenver.org\n720-799-9311\n\n\n"
  },
  {
    "addressLine1": "6100 Smith Road",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80216",
    "name": "Denver Rescue Mission",
    "organization": "Denver Rescue Mission",
    "phone": "(303) 297-1815",
    "website": "https://denverrescuemission.org/",
    "description": "Meals:\nBreakfast: 5:30am\nLunch: 12 noon.\nDinner 6pm.\n\nFood\nIf you and your family are in housing but cannot afford food at this time, the Mission's Client Services can provide you with necessary items once a month including perishable and non-perishable food items. Harvest Farm offers food boxes for people in need.\nRequired Documents\n    Valid photo ID\n    Proof of residency\n    Proof of dependency for children (for single parents)\n\nShelter\nMen: Men experiencing homelessness who want to escape the dangers of sleeping on the street are welcome at our Lawrence Street Shelter. The shelter is open 365 days a year and can accommodate up to 315 men each night.\nWomen and Children: If you are a woman experiencing homelessness and are seeking immediate shelter for you and your children, please call 303.297.1815 to be referred to an appropriate shelter.\n\nClothing\nIf you or your loved ones need clothing, we invite you to visit Client Services at our Ministry Outreach Center.\nIf you are homeless, a first-time client or have a voucher, you may receive clothing free of charge.\n\nIf you do not fall under one of these categories, you will be charged $3.00 for six pounds of clothing, and $1.00 for every additional pound.\n\nAll clients wishing to receive clothing must show a valid ID."
  },
  {
    "addressLine1": "3080 Broadway",
    "city": "Boulder",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80304",
    "name": "Attention Homes Emergency Shelter For Children",
    "organization": "Attention Homes Emergency Shelter For Children",
    "phone": "(303) 447-1206",
    "website": "https://www.facebook.com/TGTHRcolorado%20",
    "description": ""
  },
  {
    "addressLine1": "4869 N. Broadway",
    "city": "Boulder",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80304",
    "name": "Boulder Shelter for the Homeless",
    "organization": "Boulder Shelter for the Homeless",
    "phone": "(303) 442-4646",
    "website": "http://www.bouldershelter.org/",
    "description": "The Shelter is located at 4869 North Broadway, which is on the northwest corner of Broadway and Lee Hill Road. The SKIP bus route stops right in front of the Shelter. View a map.\n\nHours of operation:\n    Open daily:  5pm - 10am\n    Closed daily: 10am - 5pm (no services available)\n\nThe mission of the Boulder Shelter for the Homeless is to provide safe shelter, food, support services, and an avenue to self-sufficiency for homeless adults in our community. We strive to accomplish our mission by adhering to our core values to treat all with dignity, to offer support and opportunity, to achieve results through competence and creativity, and to practice responsible stewardship.\n\nThe Shelter currently offers several programs designed to meet the needs of its clients:\n\n\nBoulder County Cares (BCC) street outreach program equips those living on the streets in winter with basic life-sustaining supplies, transportation, and referrals to appropriate services and agencies.\n\nThe Winter Sheltering program furnishes hot meals and a warm, safe place to spend the night for those who have no other options during the months of October through April. Additionally, the Shelter is open each morning year-round to provide a hot breakfast, access to showers, and other limited services to those not staying overnight at the Shelter. Winter Sheltering services are available from October 15 through April 15 for any adult in need. Dinner and breakfast, a safe place to sleep, storage space for personal belongings, phone and mail service, access to showers and laundry facilities, and meetings with case managers are all provided free of charge. Intake is from 5:00 p.m. to 7:00 p.m. daily. All residents must be checked in by 7:00 p.m. unless prior arrangements have been made. In order to stay at the Shelter, residents must abide by basic behavioral rules and get tested for TB.\n\n\nThe Transition Program is a year-round service offered to homeless men and women who are committed to regaining independent housing and who live drug- and alcohol-free, have sustainable income, and a clear budget and savings plan. The goal for the program is to serve homeless individuals in transition to permanent housing via case management and contract arrangements with the objective of clients developing individual life plans to identify and address issues that have led them to homelessness and to break the cycle of poverty. Program Goal: Clients have safe, temporary shelter; become more stable, and attain safe, sustainable housing upon exiting the program. Transition Program residents work closely with Shelter case managers to determine what has led them to homelessness, and what steps they must take to overcome their situation. Transition Program residents must live drug and alcohol free, pay a weekly program fee, and abide by a budget and savings plan. To qualify for the Transition Program residents must have sustainable income that can be verified and an obtainable transition plan. Program residents have the opportunity to stay in a semi-private dorm room. The year-round transition program has a maximum stay of nine months.Anyone desiring to enter the Transition Program needs to schedule an intake appointment with a Shelter case manager. Clients currently staying at the Shelter can schedule an appointment by speaking with a staff member.\n\nOff-site longer-term housing for individuals and families is provided through Transitional Housing.\n\n\nThe Housing First program is a collaborative regional initiative emphasizing placement of Boulder County's most chronically homeless individuals into permanent housing, supported by concentrated case management."
  },
  {
    "addressLine1": "400 E Simpson St # 201",
    "city": "Lafayette",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80026",
    "name": "Safehouse Progressive Alliance",
    "organization": "Safehouse Progressive Alliance",
    "phone": "303-673-9000",
    "website": "https://www.safehousealliance.org/",
    "description": "Safehouse Progressive Alliance for Nonviolence (SPAN) offers support and services that provide healing, hope and opportunity to adults, youth and children who have been impacted by domestic or dating violence.  Services include:\n- Safe, confidential emergency shelter\n- 24 Hour Crisis & Information Hotline\n-  Individual & Group Counseling for adults, youth & children\n- Support for LGBTQ survivors\n-  Abuse In Later Life Program\nSupport for immigrant survivors\n- Legal Advocacy\n-  Transitional Services\n-  Broomfield Outreach Program\n-  Violence Prevention Education\n-  Information & Referrals\n\nEmergency Shelter Program\nThe emergency shelter program offers a safe shelter at a confidential location for individuals and families who are seeking refuge from interpersonal violence and/or elder abuse.\nWe welcome all people who are abused, including anyone traditionally silenced because of their ethnicity, race, religion, age, ability, income level, sexual orientation, transgender identity or who are gender non-conforming. During your stay, we can provide case management, community referrals, group and individual counseling services, safety planning, and help meeting basic needs such as food and clothing. Our advocates will work to create an individualized case plan that can assist you beyond your stay at our emergency shelter.\n\nWe welcome all members of the Deaf and hard of hearing communities to contact us via relay. SPAN will also partner with DOVE to provide reasonable communication accommodations to members of the Deaf or hard of hearing communities while at our shelter.\n\nWe recognize the important role of pets as a part of the family. We partner with the Humane Society of Boulder Valley to safely foster pets for the duration of your stay.\nIf you or someone you know needs help because of an abusive relationship, call our 24-hour crisis hotline: 303.444.2424.beyond."
  },
  {
    "addressLine1": "4747 Table Mesa Drive",
    "city": "Boulder",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80305",
    "name": "Boulder Bridge House",
    "organization": "Boulder Bridge House",
    "phone": "(720) 325-7431",
    "website": "https://boulderbridgehouse.org/",
    "description": "We provide a wide variety of services both at the Bridge House and at the dinners we host at local churches in our community. Clients have the opportunity to get hot meals, medical and mental health services, and to meet with a case manager that will assist them with everything from employment services to addiction concerns.\nBridge House has a long history of providing low barrier accessible basic needs services to adults experiencing homelessness. Community Table dinners are offered weeknights as not only a source of nutritious meals but to provide a safe, welcoming environment for guests to connect. Bridge House outreach case management offers onsite information about housing, health care, and shelter services including our Ready to Work employment program.\n"
  },
  {
    "addressLine1": "1575 Yarmouth Ave.",
    "city": "Boulder",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80304",
    "name": "EFAA (Emergency Family Assistance Association)",
    "organization": "EFAA (Emergency Family Assistance Association)",
    "phone": "(303) 442-3042",
    "website": "http://www.efaa.org/",
    "description": "This program is for men, women, and children. Provides up to 12 weeks of emergency sheltering and services that support a family. Call for intake: M-T-TH-F 9:30am-4:30pm; Wed. 12-4:30pm."
  },
  {
    "addressLine1": "P.O.Box 1393",
    "city": "Boulder",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80306",
    "name": "Boulder Outreach for Homeless Overflow - BOHO",
    "organization": "Boulder Outreach for Homeless Overflow - BOHO",
    "phone": "(303) 605-8919",
    "website": "https://boulderbridgehouse.org/",
    "description": "Provides a warming shelter during winter months.\nOpen at 7:00 PM.  Please do not arrive before 6:30PM\nView website: http://www.boulderboho.org/get-help/locations for locations.\n\n\nOur Mission is to meet, as a community, the emergency needs for basic shelter and care not served because of gaps in the Boulder support network. One of those gaps is a Womens program to give safe private refuge. BOHO is piloting such a program to help the female homeless population. Another such program is Summer Sleep which faith base congregations open their grounds for the homeless to sleep in a safe legal manor. Both these programs have been a huge success to date."
  },
  {
    "addressLine1": "231 North Main Street",
    "city": "Brighton",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80601",
    "name": "Almost Home - Shelter and Housing Assistance",
    "organization": "Almost Home - Shelter and Housing Assistance",
    "phone": "(303) 659-6199",
    "website": "http://www.almosthomeonline.org/",
    "description": "Services:\nWe provide the greater Adams and Southern Weld County area with a 6 family emergency homeless shelter, bilingual case management and referrals, and financial assistance for rent and utilities.\n\nEmergency Shelter.\nShelter Guidelines\n1. Must be a US Citizen or have Legal Residency (Colorado ID and valid Social Security Card will be required of all adults.)\n2. Must be able to prove that you have been living in Adams County for the last 3 months.\n3. Must be a family with children.\n4. Families who have transportation (not including public transportation) or employment will be given first priority.\n5. Must pass a criminal background check.\n\nAlmost Home, Inc. operates a family shelter, which can accommodate up to six families who can stay for up to 45 days."
  },
  {
    "addressLine1": "Fort Lupton CO",
    "city": "Fort Lupton",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80621",
    "name": "Hope @ Miracle House",
    "organization": "Hope @ Miracle House",
    "phone": "517-6617",
    "website": "http://hopeatmiraclehouse.org/",
    "description": "Our Mission:\nHope @ Miracle House is a faith-based community organization that compassionately seeks to address the needs of homeless families through safe shelter, food, and supportive services.\n\nFamily Shelter\nWe are a family focused year round shelter in Fort Lupton, CO\nFor our intake time email the Program Director, Deb DeMille at programdirector0236@gmail.com.\n\n\nDuring these hours you may call our staff and speak with intake personnel about availability and qualifications for our program. After hours please leave a message and someone will return your call as soon as possible.\n\nPlease call: (720) 676-9697"
  },
  {
    "addressLine1": "709 S. Sierra Madre",
    "city": "Colorado Springs",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80907",
    "name": "R.J. Montgomery Center - The Salvation Army Homeless Shelter",
    "organization": "R.J. Montgomery Center - The Salvation Army Homeless Shelter",
    "phone": "(719) 578-9190",
    "website": "https://coloradosprings.salvationarmy.org/colorado_springs_corps/provide-shelter/",
    "description": "The R.J. Montgomery Center (Salvation Army Shelter) is Colorado Springs only 24/7 homeless shelter. The Center offers education, individualized care and a chance for kids to be kids in a safe, clean environment.\n\nThe shelter can house and feed up to 210 residents per night and averages about 187 individuals per night. The Center provides men, women and children with 24-hour shelter including case management, nutritious meals, and a safe place to rebuild their lives. 45% of our clients effectively move from The Salvation Army R.J. Montgomery Center to long-term housing solutions.\n\n\nHomeless shelter offering meals, showers, laundry facilities and counseling."
  },
  {
    "addressLine1": "201 North Weber Street",
    "city": "Colorado Springs",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80903",
    "name": "Ecumenical Social Ministries",
    "organization": "Ecumenical Social Ministries",
    "phone": "(719) 633-1537",
    "website": "http://ecusocmin.org/",
    "description": "Housing & Utilities Assistance Program\nThe Housing & Utilities Assistance Program provides services to prevent homelessness and forestall eviction, allowing families to remain in their homes. Clients are assisted with partial rental assistance or utility assistance. Budget counseling workshops are a mandatory component of the program.\n\nClients must make an appointment! Call 636-1916to schedule an appointment. This program meets the emergency needs of a client. A client can only seekeither rent or utility assistance once a year.\n\nLive in one of ESM's service area zip codes: 80903, 80905, 80906, 80907, 80909, 80910, 80916, or 80926. Residents of other zip codes may be referred to other agencies.\nHave lived in apartment for 2 months or longer.\nMust have verifiable proof of income.\nA copy of the signed lease.\nA three-day demand notice from the landlord.\nPhoto ID\nSocial security card for every person in the household.\nBudget counseling workshop is mandatory prior to receive assistance.\n\n\nESM provides a collaborative Christian response to low-income and homeless people in crisis through a variety of services:\n        Direct Services: clothing, prescription medications, personal hygiene items and transportation\n        Rental Program: partial rent assistance\n        Utilities Program: partial utility assistance\n        Jobs Program: job skills assessment, resume assistance, referrals, classes, tools, uniforms, home health care certification classes\n        Food Pantry: emergency food, commodities and holiday food baskets\n\n"
  },
  {
    "addressLine1": "1015 E Pikes Peak Ave",
    "city": "Colorado Springs",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80903",
    "name": "Greccio Housing",
    "organization": "Greccio Housing",
    "phone": "(719) 475-1422",
    "website": "http://www.greccio.org/",
    "description": "This is affordable housing not a homeless shelter.\n\nOur mission is to provide stable, safe, affordable housing, and to create supportive opportunities and services for our residents to enhance their individual growth.\n\nFull Description:\nGreccio Housing, a 501(c)(3) charitable organization, provides affordable rental housing options to income-qualified individuals, families, seniors, and veterans in the Colorado Springs community. We couple our housing options with supportive services provided through our Resource & Opportunity Center geared toward equipping residents with the skills and tools necessary to become self-sufficient and successful."
  },
  {
    "addressLine1": "14 W Bijou St",
    "city": "Colorado Springs",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80903",
    "name": "Catholic Charities Marian House & Hanifen Center",
    "organization": "Catholic Charities Marian House & Hanifen Center",
    "phone": "(719) 475-7314",
    "website": "https://www.twitter.com/CCharitiesCC",
    "description": "The Marian House is home to the Poverty Reduction services of Catholic Charities.\n\n\nDonations to the Marian House are accepted on a daily basis from the hours Mon. through Sat. 8:00am - 2:00pm. Marian House Client Services provides emergency and transition services to people who come into the Marian House for a meal, as well as people in the broader community who call in for assistance. We provide services to low-income families, the working poor, seniors on a fixed income, veterans, people who are homeless, and anyone else in need.\n\nOur qualified staff and volunteers assist clients to access a wide variety of services to help improve their life situations. These include:\nFinancial Literacy Classes\nParenting with Love and Logic Classes\nLegal Referrals through an on-site laywer and a bi-monthly Pro Bono Legal Clinic through the El Paso County Bar Association\nNutrition Support\nVolunteer Income Tax Assistance (VITA)\nEmployment search referrals - limited\nTemporary/Permanent housing referrals\nTransportation needs (bus tokens)\nAcquiring official documents (needed for jobs and housing)\nDaily life skills guidance\nSocial Security applications/referrals\nMedical referrals\nEducation program referrals\nCase Management\nCOPE Utility Assistance - By appointment only.\n\nAs part of our emergency services we maintain a Clothing Closet, providing (when available) adult seasonal clothing, men's work wear (heavy shirts & pants, boots and gloves), sleeping bags and blankets. We also distribute hygiene products and provide access to telephones.\n\nOur office is located in the Marian House at 14 W. Bijou St\n\nHours of operation are Monday through Friday 8:00a.m. - 4:30p.m.\nWalk-ins welcome from 10:30 a.m.-1:00 p.m. daily.\n\nAppointments necessary for times outside of Walk-in time"
  },
  {
    "addressLine1": "455 Gold Pass Heights",
    "city": "Colorado Springs",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80906",
    "name": "Partners In Housing",
    "organization": "Partners In Housing",
    "phone": "(719) 473-8890",
    "website": "https://partnersinhousing.org/",
    "description": ""
  },
  {
    "addressLine1": "610 S. Tejon St",
    "city": "Colorado Springs",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80903",
    "name": "Pikes Peak United Way - Homeward Pikes Peak",
    "organization": "Pikes Peak United Way - Homeward Pikes Peak",
    "phone": "(719) 375-8794",
    "website": "http://www.homewardpp.org/",
    "description": "Homeward Pikes Peak is the focal point for our community response to solving the problem of homelessness. The goal is for our community to be a great place to overcome homelessness, but a difficult place to be intentionally homeless. Pikes Peak United Way helped create this organization, and provides offices and administrative support for the organization so that it can be successful in tackling this important issue.\n\nHomeward Pikes Peak believes people can recover. Every day we house and counsel people struggling with homelessness and addiction because they often have no other options in Colorado Springs. We have a variety of housing programs for the homeless one sober living, one for mentally ill adults and one for disabled veterans. Of the 1,171 homeless in Colorado Springs, 228 had a chronic substance abuse issues and 236 had a serious mental illness. We can only serve 84 people/families at a given time. We also operate an outpatient substance abuse clinic specializing in womens services including pregnant women. We help people regardless of their ability to pay.  This creates a gap in funding and where we can use your help. We also save taxpayers over $2 million per year just in our housing programs by reducing ER visits, 911 calls, detox stays, and psychiatric hospitalizations. We create self-sufficiency, sober parents, effective employees and dignity."
  },
  {
    "addressLine1": "908 Yuma St",
    "city": "Colorado Springs",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80909",
    "name": "Salvation Army",
    "organization": "Salvation Army",
    "phone": "(719) 636-3891",
    "website": "http://coloradosprings.salvationarmy.org/",
    "description": "Provides a number of services for those in Colorado Springs including Transitional Housing and the New Hope Homeless Shelter.\n\nPrograms and Services\nSocial Services, Food Pantry & Utilities Assistance\nLicensed After School Program & Summer Day Camp\nCharacter Building Youth Programs\nSenior Meals & Activities\nHomeless Sheltering Services & Soup Run Feeding Services\nTransitional Housing Programs\nSunday School, Worship, Men's & Women's Bible Study\nEmergency Disaster Services\n\nLocations\nThe Salvation Army Shelter & Services at RJ Montgomery\n709 S. Sierra Madre, Colorado Springs CO 80903\nPhone: (719) 578-9190\nHours: 24 Hour Emergency Shelter\n\nThe Salvation Army Winter Warming Shelter\n505 S. Weber Street, Colorado Springs CO\nHours: Check-in: 7:00pm\nShelter Closes: 9:00am\n\nThe Salvation Army Family & Social Services\n908 Yuma Street, Colorado Springs, CO 80909\nPhone: (719) 636-3891\nHours: 9:00am-4:30pm\n\nThe Salvation Army Transitional Housing\n922 Yuma Street, Colorado Springs, CO 80909\nPhone: (719) 635-1287\nHours: Hours Vary - please call ahead.\n\n\n"
  },
  {
    "addressLine1": "423 E Cucharras St",
    "city": "Colorado Springs",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "00000",
    "name": "The PLACE",
    "organization": "The PLACE",
    "phone": "719-244-3959",
    "website": "https://theplacecos.org/",
    "description": "If you are a youth ages 15 up to age 20 in need of immediate overnight shelter services, please contact 719-630-3223 during M-F 9am-5pm, or 719-205-7129 after 5pm or on a weekend.\n\nEvery day of the year, The PLACE shelter is a warm, safe option to a night on the streets. This 20-bed facility is the only licensed youth shelter in Colorado Springs. Provide meals, clothing and a health clinic link for youth ages 15 to 21. (At 21 years old, youth are no longer able to stay at the shelter.)\n\n\nSupportive Housing for youth after they depart the shelter helps them live safely and cared for while they build their self-sufficiency.\n"
  },
  {
    "addressLine1": "5 W. Las Vegas",
    "city": "Colorado Springs",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80903",
    "name": "Springs Rescue Mission",
    "organization": "Springs Rescue Mission",
    "phone": "(719) 632-1822",
    "website": "http://www.springsrescuemission.org/",
    "description": "Office hours: Monday through Thursday, 9:30am - 4:00pm and Saturday, 9:00am - 11:30am.\n\nSprings Rescue Mission is an affiliate member of the Association of Gospel Rescue Missions, seeking to provide relief and rehabilitation services for the poor, homeless, and addicted neighbors of southern Colorado. We partner with government agencies, local non-profits, businesses, and individuals to provide programs, resources, and advocates to our most needy citizens.\n\nAre we a shelter?\nWinter Shelter only.\nNovember 1 - April 15\nSeven nights a week\nDoors open at 6 p.m.\nOur winter shelter is full nearly every night of the season. To ensure fairness, we use a lottery system. Names are drawn at random and the list of those who will be sheltered is posted at Samaritan's Kitchen each afternoon.\nIf you do not get in, please use the Salvation Army shelter on Weber Street and do not sleep outside the shelter.\n\nTo get your name on the lottery, please call (719) 632-1822\n\nDo we have a men's recovery program?Yes. Please call our main number (719) 632-1822 to be connected with someone on our New Life Program's staff.Springs Rescue Mission's Solution:\n\n\nA strategic and high-impact ministry focused on homeless and at-risk children, women, and men meet the challenges of homelessness through the following programs:\n\nNew Life Program\nThis 12-18 month residential recovery program serves men who are homeless, suffering from chronic addiction, or those having difficulty functioning in society due to a lack of life skills. We broke ground in mid-October 2011 to nearly double the number of beds in our men's resident facility, which means we will serve about 80 men at one time.\n\nSamaritan's Kitchen\nSprings Rescue Mission provides hot nutritious meals to the homeless and hungry, offers a monthly food box program to poor families and individuals, and educates through a Culinary Arts vocational training program. Between July 1, 2010 to June 30, 2011, we served more than 135,000 meals to our Pikes Peak neighbors in need.\n\nSupportive Family Services\nSprings Rescue Mission offers food, clothing, and other life-essentials to the homeless and working poor through our Supportive Family Services (formerly Direct Services); about 80% of these neighbors are single parents and families with children. In 2010, we offered assistance to more than 5,500 families."
  },
  {
    "addressLine1": "519 North Tejon Street",
    "city": "Colorado Springs",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80903",
    "name": "Family Promise of Colorado Springs",
    "organization": "Family Promise of Colorado Springs",
    "phone": "(719) 329-1244",
    "website": "https://www.ihn-cos.org/",
    "description": "Office and intake services are open from 9 am to 5 pm - Monday through FridayFamily Promise of Colorado Springs is a transitional shelter program which provides dedicated services to families with minor children.\n\nDetails Transitional Housing Program\nFamilies that have achieved a level of stability from the support of our Interfaith Hospitality Network but may be facing additional financial or personal obstacles before being able to successfully move into the open housing market are eligible for up to an additional six months of reduced cost housing and case management support.\n \nThrough our partnership with The Sisters of St. Francis, Family Promise currently has two homes dedicated to our Community Care Transitional Housing program. We expect to add additional houses and/or apartment units over the coming year."
  },
  {
    "addressLine1": "728 W 4th St",
    "city": "Pueblo",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "81003",
    "name": "Pueblo Rescue Mission New Shelter",
    "organization": "Pueblo Rescue Mission New Shelter",
    "phone": "(719) 924-8413",
    "website": "http://pueblorescuemission.org/",
    "description": ""
  },
  {
    "addressLine1": "6978 Colorado Boulevard",
    "city": "Commerce City",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80022",
    "name": "ACCESS Housing",
    "organization": "ACCESS Housing",
    "phone": "(303) 289-7078",
    "website": "https://www.acchouse.org/",
    "description": "Family Shelter\nWe strive to create a safe, welcoming, and non-judgemental shelter utilizing innovative, creative and groundbreaking programming to support families on the housing journey.\n\nOur Family Shelter program addresses the immediate, basic needs for families currently experiencing homelessness. We provide a family with one of our eight safe, clean and furnished two-bedroom units complete with necessary household goods. These units are the familys own private space as they navigate and advocate their way to housing stability. The normalcy provided by individual units allows families to recover and heal from trauma. Families meet bi-weekly with a case manager who provides housing, employment, mental and physical health, and other relevant referrals. In addition, staff and clients engage in trauma-informed discussions surrounding relationships, coping, as well as self- advocacy techniques for families as they navigate complex systems. So far this year, we have served 53 families and next year, we plan to serve 30-40 families.\n\n\nPlease we are only accepting direct referrals from Adams County TANF Program. If you are not a direct referral from Adams County, please call United Ways  211 number for more shelter options.\n\n\nContinuing Community\n\nOur Continuing Community program supports families to maintain their housing stability. We honor families hard work in achieving housing stability with continued support and a life-long community. As part of this program, our case manager provides continued services and referrals and encourages families to access our day sites food pantry, resource room, and family development room complete with a trauma-informed playroom and school zone catering to all ages. So far this year, we have served 50 families and we plan to serve 55 families next year."
  },
  {
    "addressLine1": "6621 E. 72nd Ave",
    "city": "Commerce City",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80022",
    "name": "Catholic Charities Northeast Emergency Assistance Center",
    "organization": "Catholic Charities Northeast Emergency Assistance Center",
    "phone": "(303) 287-1127",
    "website": "http://www.ccdenver.org/",
    "description": "emergency shelter for families. They also provide personal items and rent assistance for the needy."
  },
  {
    "addressLine1": "4330 48th Ave",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80216",
    "name": "Samaritan House 48th Shelter",
    "organization": "Samaritan House 48th Shelter",
    "phone": "(720) 799-9506",
    "website": "https://ccdenver.org/denver-samaritan-house/",
    "description": "Catholic Charities operates this shelter in partnership with the City of Denver.\nHours of Operation:\nThis is location is open throughout the year (24/7, 365 days a year) to serve single women in Denver; offered on a first-come, first-served basis.\nWhat they offer:\nClean bed\n3 Nutritious meals\nCounseling\nEmployment support\nConnection to housing\nReferrals to community-based resources\nShower services\nLaundry services\nCase management support.\nEligibility:\nWomen18 years old or older.\nIntake/Admission procedure:\nWalk-ups accepted from 8:00am through 8:00pm.\nDo not have to call in advance\nReferral is not required\nTransportation:\nYou can find daily transportation to the shelter from Samaritan House on Lawrence Street, is limited and leaves by 4:30pm.\n"
  },
  {
    "addressLine1": "24 N Chestnut St,",
    "city": "Cortez",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "81321",
    "name": "The Bridge Emergency Shelter",
    "organization": "The Bridge Emergency Shelter",
    "phone": "(970) 565-9808",
    "website": "https://thebridgeshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "1055 Avenida Del Sol",
    "city": "Durango",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "81301",
    "name": "Durango Community Shelter",
    "organization": "Durango Community Shelter",
    "phone": "(970) 259-1255",
    "website": "https://www.voacolorado.org/gethelp-southernco-durangocommunityshelter",
    "description": "The Durango Community Shelter continues to be the only 24/7/356 shelter service in Southwest Colorado and the only option for families and individuals trying to get back on their feet and regain self-sufficiency. The facility has sleeping quarters for men, women, and families as well as communal living spaces including a kitchen, living room, laundry facilities, and dining room.\n\nServices Provided\n    24/7/365 residential shelter services\n    Telephone crisis information and referral\n    Provision of all basic needs: nutritious meals, shower and laundry facilities, clothing closet and personal hygiene supplies\n    Extensive resource referral and task-oriented counseling for employment, housing and services acquisition\n    Medical respite bed program\nAccess Services\n    Call 24/7 crisis line 970-259-1255 and speak with a Shelter Advocate\n    Shelter guest must be 18 years or older, and children must be accompanied by a parent or guardian"
  },
  {
    "addressLine1": "2301 Lawrence St",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80205",
    "name": "Samaritan House Shelter Denver",
    "organization": "Samaritan House Shelter Denver",
    "phone": "(303) 294-0241",
    "website": "https://samhousedenver.org/",
    "description": "Catholic Charities Shelter.\n\nEligibility:\nIndividuals and families who meet the following criteria are welcome to participate in our lottery system.\n     Applicant must live independently and harmoniously within housing.\n\n     Applicant must agree to participate in the supportive services offered.\n     Applicant must agree to remain drug-free and alcohol-free.\n\n\nIf you are currently without housing and have a need, call to see what we can assist you with, from food to clothing to various other programs at:\nSamaritan House - Denver\n(303) 294-0241\n\nThe Mission - Fort Collins\n(970) 484-5010\n\nGuadalupe Community Center - Greeley\n(970) 353-6433\n\nFather Ed Judy House - Denver\n(720) 799-9400\n\nSamaritan House Women's Shelter - Denver\nMust be at Samaritan House by 6 PM\n(303) 294-0241\n\n\n\n\n\nLocated in downtown Denver, Samaritan House was built in 1986 and specifically designed and constructed for the homeless. It can accommodate over 320 men, women and children each night. There are separate facilities for single men, single women and families with children.\n\nResidents receive a bed, food, clothing and various services on site, including case management, medical care, and referrals for employment, social service assistance and educational opportunities.\n\n\nWe supply about 50% of the shelter housing available to families in the Denver area.\n120-Day Levels Program Requirements\nAttend 'Employment' and 'Life Skills' class series\nAttend 'Housing' and 'Money Management' class series\nRegularly submit 'Job Search' and 'Housing Search' logs\nRegularly deposit earnings into a supervised, personal housing fund\nMeet regularly with Case Manager\n\nOur Permanent Shelter Accommodations\nMen's Dorm with 126 beds\nWomens Dorm with 48 beds\n21 Family Rooms, for up to 75 children\nOverflow space for 100, additional men\n"
  },
  {
    "addressLine1": "850 Lincoln St",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80235",
    "name": "Christ Body Ministries",
    "organization": "Christ Body Ministries",
    "phone": "(303) 860-1272",
    "website": "http://www.christsbody.org/",
    "description": "Christ's Body Ministries is an inner-city pipeline for people in the larger body of Christ to serve poor, homeless, and broken people of all backgrounds, ages, races, and faiths. Since 1990, this 501(c)3 non-profit organization has been supported by the tax deductible donations of volunteers, churches, businesses, groups, foundations, and other benefactors.\n\nAt Christ's Body Ministries we feed, clothe, and share the gospel 365 days a year with Denvers poor, hungry, and hurting. In addition, thanks to our staff and many volunteers we also are able to:\n\n    Provide a safe warm day-shelter to all during the week with hot meals, bathrooms, showers, laundry, and phone service.\n    Furnish over 5,000 bags of groceries each year to those who would have otherwise gone without.\n    Supply well over 40,000 meals each year to homeless families and poor people in the inner-city.\n    Offer worship services, bible studies, prayers, counseling and personal freedom to the addicted and oppressed.\n\n    Provide countless coats, clothing, socks, gloves, blankets, sleeping bags, toiletries, personal items, transportation, emergency assistance, and referrals to other agencies.\n    In our respite care provide a safe place for five homeless friends discharged from the hospital to finish healing physically and spiritually.\n\nHours / Services\nSundays: 5:30PM 7:45PM | Location: 850 Lincoln\nHot meal served approximately 7:00PM following the optional evening church service which starts at 6:00PM. Clothing room opens at approximately 7:00PM.\n\n\nTuesdays, Wednesdays, & Thursdays: 10:00AM 3:00PM | Location: 850 Lincoln\n\nOatmeal and pastries are served from 10:00AM Noon. Bible study is from Noon 1:00PM and the hot meal is served from 1:00PM until about 2:30PM. Free showers and one load of laundry are for those on the list at 10:00AM. The clothing room is open from 11:00AM 11:30AM.\n\nFridays: 8:00AM Noon | Location: 850 Lincoln\nA pancake breakfast is served from 8:30Am until approximately 9:30AM and lunch is served from approximately 10:00Am 11:30AM.\n\nSaturdays: 2:00 to 3:00 PM | Location: Church In The City at 16th & York\nA hot meal is served in the basement from approximately 2:00 to 2:45 PM. Food baskets are distributed in the parking lot starting at approximately 2:00 PM. The food baskets are on a first come first served basis and there are no geographical restrictions and no ID is needed. Please DO NOT arrive or get in line before 1:45 PM."
  },
  {
    "addressLine1": "PO Box 9884",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80218",
    "name": "Joy House",
    "organization": "Joy House",
    "phone": "(303) 860-8404",
    "website": "http://www.providencenetwork.org/",
    "description": "Quick Summary: Safe house for victim's of domestic violence. Address not disclosed.\n\nFull Description\nServes women and children coming out of domestic violence. This safe haven and our live-in mentors offer you and your children a stable, nurturing environment to recover, grow and become financially independent.\n\nFull Services\nJob training\nLife-skills development\nIndividual and group counseling\nChild play therapy\nSpiritual guidance\nGoal setting and accountability\nSober living requirements and support groups\nCase management\nCommunity activities\n\nOffice Hours: Mondays through Fridays 8am to 4pm."
  },
  {
    "addressLine1": "2844 Lawrence St",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80205",
    "name": "Sacred Heart House of Denver",
    "organization": "Sacred Heart House of Denver",
    "phone": "(303) 296-6686",
    "website": "http://www.sacredhearthouse.org/",
    "description": "Sacred Heart House of Denver offers a continuum of services to homeless mothers with children and single women, who have the desire and commitment to become self-sufficient.\n\nOur In-House Stabilization Program provides temporary housing, food, clothing, transportation and case management with referrals for permanent/transitional housing, education/job training/placement, health care, child care, and counseling.\n\n\nResidents participate in a required series of living skills and parenting workshops. Our services are offered in a home-like, life-giving, safe environment. When residents move to their own housing, they are eligible to receive the services of our Follow-Up Program.\n\nTransitional Housing\nA two year Transitional Housing Program offers affordable living to mothers pursuing educational/job training goals. These women have successfully completed the In-House Stabilization Program or a similar program at another agency."
  },
  {
    "addressLine1": "2323 Curtis St",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80205",
    "name": "St Francis Center",
    "organization": "St Francis Center",
    "phone": "(303) 297-1576",
    "website": "http://www.sfcdenver.org/",
    "description": "St. Francis Center is a refuge for men and women who are homeless in the metro Denver area, providing shelter along with services that enable people to meet their basic needs for daily survival and to transition out of homelessness.\n\nOn an average day, over 700 different people visit St. Francis Center, and on a busy day, over 900 people may pass through our doors.\n\n\nWe welcome and treat everyone with dignity and respect, offering a safe and inviting place to stay during the day when other shelters are unavailable.\n\nHours of Operation\nCenter Hours\nTemporary Hours:   Monday    Sunday   7:00 am to 3:00 pm\n\nDay Services\nBasic Services\nWe provide multiple services that enable men and women who are homeless to meet basic needs for day-to-day survival. These services include separate showers for men and women; haircuts; an opportunity to earn new or cleaner clothes by helping with chores at SFC; storage for one bag of belongings; access to phones for local calls; and use of St. Francis Centers mailing address and phone number to receive mail, stay in touch with family, or search for a job or housing.\n\nHealth Services\nOur health clinic has expanded its services with a new collaboration between Stout Street Clinic and St. Francis Center. The Collaboration offers both doctors and nurses, greater drug prescription coverage, psychiatric services, and longer hours of service.\n\nSocial Services\nOffering a listening ear and providing information to individuals who are experiencing homelessness, St. Francis Center social services enables clients to speak with staff one on one regarding their concerns and issues. Additionally, the distribution of RTD bus fare, navigating the application process for benefits and housing, referring clients to obtain mental and physical health care, assisting with long distant phone calls and helping with budgeting comprise much of the assistance given in this office.\n\nAdjunct Services\nAdditional services are offered through a collaborative effort between members of the wider community and St. Francis Center to bring expanded health services, mental health services, veterans' assistance and wholesome meals to the day facility on designated days during the week.\n\nHousing Program\nSt. Francis Center Housing Program provides permanent housing and case management for participants who are ready to move to a more structured environment.\nSFC case managers help ensure a successful outcome by providing assistance with setting goals, obtaining financial benefits, stabilizing physical, mental health and substance abuse concerns, and by encouraging participants to develop their life skills by pursuing opportunities for enrichment through continuing education, recreational activities, volunteerism and meaningful work.\n "
  },
  {
    "addressLine1": "1535 High Street",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80218",
    "name": "The Gathering Place",
    "organization": "The Gathering Place",
    "phone": "(303) 321-4198",
    "website": "https://tgpdenver.org/",
    "description": "The Gathering Place exists to support women, their children, and transgender individuals experiencing homelessness and poverty. We provide programming and services to an average of 260 women and children every day.\n\nAre you interested in receiving services or utilizing programs at The Gathering Place?\n\nThere are no fees for any services or programs at The Gathering Place.\n    No ID is required and no intake appointment is necessary.\n\n    Adults with children under 18 will be asked to check in for the Family Program on the 3rd Floor.\n\nOur Mission\nThe Gathering Place exists to support women and their children experiencing homelessness and poverty by providing a safe daytime refuge and resources for self-sufficiency.\nOffice hours:\nMonday, Wednesday, Thursday, Friday 8:30 a.m. - 5 p.m.\nTuesday from 8:30 a.m. - 1:30 p.m.\n\nFrequently Asked Questions For The Gathering Place\nI'm not homeless, but need some help.  Will The Gathering Place help me?\nYes. The Gathering Place services and programs are free to all women, children, and transgender individuals who are in need.\n\nWhat is a \"member\"?\nInstead of the term client, The Gathering Place uses the term member to refer to the people who seek out and benefit from our services and programs. There is no membership fee.\n\nCan I bring my pet?\nNo. The Gathering Place follows ADA rules and allows service animals in the building, but pets are not permitted on the property. We also do not recommend that you leave your pet in your vehicle while at The Gathering Place, because that could place your pet in unsafe conditions especially during hot or cold weather.\n\nCan I get bus tickets?\nThe Gathering Place does not provide bus tickets as a general, readily accessible service."
  },
  {
    "addressLine1": "2100 Stout Street",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80205",
    "name": "Urban Peak Denver",
    "organization": "Urban Peak Denver",
    "phone": "(303) 974-2900",
    "website": "https://www.urbanpeak.org/",
    "description": ""
  },
  {
    "addressLine1": "1323 Gilpin St",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80218",
    "name": "Warren Village",
    "organization": "Warren Village",
    "phone": "(303) 321-2345",
    "website": "http://warrenvillage.org/",
    "description": "Children & Youth Women\n\nAt Warren Village, we understand that homelessness and poverty have far-reaching impacts.  The effects radiate from the individual affected to his or her family, friends and the community as a whole.  And there is no one more vulnerable than families with children.  Thats why we are dedicated to helping low income, single parent families become self-sufficient and stay that way.\nOur comprehensive program is designed to get our clients on solid footing so that when they leave us theyre ready to create sustainable stability for themselves and their families.\n\nAffordable Housing\nResidence at Warren Village is not an entitlement but rather a privilege, earned by progress toward specific personal and economic self-sufficiency goals. Our 93 subsidized apartments can accommodate single-parent families with up to six children.\nIf you need affordable housing and are ready to improve your life, Warren Village may be able to help. We accept housing applications from people who:\nAre a single parent\nAre 18 years or older\nHave custody of one or more children\nHave a high school diploma or GED\nAre motivated to set and achieve goals, and\nAre committed to full-time work and/or school, three life skills classes per month, and two hours of community service per month.\n\n\n\nFamily Services\nSkilled and dedicated advocates help residents by providing career and education counseling, financial education and plans for long-term housing.  Supportive services include life skills classes like parenting, budgeting and job retention skills and an Evening Family Enrichment program for parents and children.\n\n\n\n"
  },
  {
    "addressLine1": "1130 Park Ave. West",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80205",
    "name": "Lawrence Street Shelter Denver",
    "organization": "Lawrence Street Shelter Denver",
    "phone": "(303) 294-0157",
    "website": "https://denverrescuemission.org/",
    "description": "Provides emergency care to the poor and homeless and is an entry point for many of our New Life Program participants.\n\nOpen 365 days a year, the Lawrence Street Shelter offers 200 beds, and up to 115 additional mats, for a total of 315 overnight guests. Our clinic is located here, providing medical care (mainly for program residents) and referrals. Daily chapel and Sunday church services are offered for all; however, chapel attendance is not required in order to enjoy a meal or a bed."
  },
  {
    "addressLine1": "P.O. Box 1406",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80201",
    "name": "Delores Project Shelter",
    "organization": "Delores Project Shelter",
    "phone": "(303) 534-5411",
    "website": "https://www.thedeloresproject.org/",
    "description": "The Delores Project operates a strength-based, affirming community through shelter as an immediate response to homelessness, as well as supportive housing.\n\nThe Delores Project operates The Delores Shelter at Arroyo Village, a low barrier, strengths-based shelter for women and transgender individuals experiencing homelessness. The shelter operates 24/7 and all guests are regularly tested for COVID-19\n\n\nGuests staying in the shelter receive meals, access to hot showers, bus tickets, access to health services, toiletries, a clean bed, a phone for local calling, and housing-focused case management.\n\nGuests actively participate in shelter chores and our Guest Advisory Committee and are encouraged to foster a positive, safe and hospitable environment at our shelter. As we are an undisclosed location, individuals can access our shelter by calling and requesting a bed daily at 10am. More information about our transitional shelter services can be found here.\n\n\nCommunity Re-entry Program: The remaining five shelter beds are reserved for women and transgender individuals who require safe shelter and emergency services after being released from the Department of Corrections. These guests work exclusively with a Community Reentry Specialist or a Probation Officer to accomplish individualized goals once referred to our program. The Specialist works closely with our Shelter Manager to ensure the guest is moving forward towards stability. More information on our Community Transitions Program including how to access it, and a referral form, can be found here.\n\n\nThe Delores Project does not require identification or other documentation for use of our services. The Delores Project will not discriminate on the basis of race, color, gender, gender identity or expression, religion, creed, age over 40, ancestry, national origin, disability, sexual orientation, marital status, military status or any other applicable status protected by state or local law in any of its activities or operations."
  },
  {
    "addressLine1": "1680 Sherman St.",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80203",
    "name": "New Genesis (for men and women)",
    "organization": "New Genesis (for men and women)",
    "phone": "(303) 881-0953",
    "website": "https://www.newgenesis.org/",
    "description": "Provides a year round program for working men and women. $49/week Must provide verification of 32hrs/week of work. Sober-only program. 4pm-6pm daily intake. After care program.\n\nNew Genesis requires clients to pay rent, participate in the upkeep of the shelter, and work. This proves to be very effective in ultimately breaking the cycle of homelessness.\n\n\nRequiring accountability (by having clients pay rent) is economically efficient client fees cover 80% of costs, and provide significant leverage to our donor base.\n\nTight controls exist for the first 30 days, then freedom (and anxiety) gradually increase until clients are able to cope with day-to-day life on their own. 50% of clients make it through the first 30 days. Of those that do, 70% ultimately succeed.\n\nSuccessful graduates re-enter the community with newfound social skills, increased employment opportunities, and an appetite for independent living.\n\nThe program entails three distinct phases:\nOrientation Phase: New Genesis provides a thorough evaluation of the strengths a client brings into the experience and an individual service plan is developed.\nResidential Phase: Clients focus on continued sobriety, increased employment opportunities, restoring credit, and saving money.\n\nMentoring Phase: Graduates are challenged to give back to other clients of the program by facilitating group counseling and developing a speaker's bureau that communicates the work of New Genesis throughout the community.\n\n    MENS FACILITY\n    Orientation Phase: New Genesis provides a thorough evaluation of the strengths a resident brings into the experience and an individual service plan is developed. The residents also learn program requirements and house rules during this phase. Sobriety, employment and financial savings are the three objectives during their stay.\n    Vocational Phase: The residents focus on continued sobriety and are challenged to increased employment/income opportunities. They must also begin restoring credit and saving money.\n\n    Residential Phase: During this phase, the residents have already obtained and maintained employment and/or increased their income. This phase is dedicated to securing a housing plan. The resident can plan to graduate into our transitional housing plan or work with case managers to move into their own housing options.\n    MEN, WOMEN AND FAMILY TRANSITIONAL HOUSING\n    Our transitional housing program provides an apartment or house for single men, single women and families. They are required to be drug and alcohol free. The residents must be working, paying rent and saving for their permanent housing plan. The residents can stay in this program for up to two years, depending on the circumstances. They must also give back to the community by volunteering at the shelter.\n    MENTORING PHASE\n    The program also offers a mentoring phase and an on the job training program where graduates are challenged to give back to other residents by working alongside a staff member with the goal of becoming a program guide. All our staff, including the CEO are graduates of the program and have went through this phase.\n\n    CAREER RESOURCE CENTER  We are proud to announce our new Career Resource Center will be available after April 1, 2019 to all our residents.  The center will offer resume writing, online applications, mock interviews, resources for interviews and new hires.  We also welcome businesses to host job fairs and on the spot hiring in our facility.  \n"
  },
  {
    "addressLine1": "P.O. Box 1406",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80201",
    "name": "The Delores Project Shelters",
    "organization": "The Delores Project Shelters",
    "phone": "(303) 534-5411",
    "website": "https://www.thedeloresproject.org/",
    "description": "Provides both an emergency shelter and an extended stay shelter.\n\nEmergency Shelter\n\nEmergency Shelter is available on a first come, first serve basis available for up to a week at a time.\n\nGuests staying in the emergency shelter receive meals, access to hot showers, bus tickets, access to health services, toiletries, a clean bed, a phone for local calling, limited referrals to community support services and the option to be placed on a wait list for our transitional programs.\n\n\nGuests actively participate in shelter chores and our Guest Advisory Committee and are encouraged to foster a positive, safe and hospitable environment at our shelter. As we are an undisclosed location, individuals can access our shelter by calling and requesting a bed on Monday mornings. More information about our Emergency Shelter Program and how to access it can be found here.\n\nExtended Stay Shelter\n\nWe offer a variety of programs for guests who receive case management from us or from a partner program. These guests receive all of the services noted above for our Emergency guests, alongside the ability to stay at The Delores Project as long as they are moving towards stability. Below is an overview of the three Extended Stay Programs we offer:\n\nSteps to Stability Program: Guests in our Steps to Stability program receive robust and creative case management from our Transitional Advocate. 22 of our beds are reserved for this program that helps participating guests assess their strengths/needs, develop an individualized plan for taking steps towards self-defined goals and offers ongoing services to help guests progress towards stability. This program is accessible to our Emergency Guests who are looking for a program that meets their needs. Information on our Steps to Stability Program and how to access it can be found here.\n\nCommunity Partners Program: We reserve approximately 15 of our extended-stay shelter beds for women and transgender individuals receiving case management and specialized support services through a partner agency. The individuals Case Manager works with our Shelter Manager to ensure the guest is moving forward towards stability. More information on our Community Partners Program including how to access it can be found here. Please note that the waitlist for our Community Partners Program is currently closed.\n\nCommunity Transitions Program: The remaining five shelter beds are reserved for women and transgender individuals who require safe shelter and emergency services after being released from the Department of Corrections. These guests work exclusively with a Community Reentry Specialist or a Probation Officer to accomplish individualized goals once referred to our program. The Specialist works closely with our Shelter Manager to ensure the guest is moving forward towards stability. More information on our Community Transitions Program including how to access it, and a referral form, can be found here.\n\nThe Delores Project does not require identification or other documentation for use of our services. The Delores Project will not discriminate on the basis of race, color, gender, gender identity or expression, religion, creed, age over 40, ancestry, national origin, disability, sexual orientation, marital status, military status or any other applicable status protected by state or local law in any of its activities or operations.\n"
  },
  {
    "addressLine1": "1555 Race St",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80206",
    "name": "HOPE Program - HIV Day Shelter",
    "organization": "HOPE Program - HIV Day Shelter",
    "phone": "(303) 832-3354",
    "website": "",
    "description": "A day shelter for people who are HIV + and experiencing some form of homelessness"
  },
  {
    "addressLine1": "1901 29th St",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80216",
    "name": "Salvation Army Crossroads Men's Shelter",
    "organization": "Salvation Army Crossroads Men's Shelter",
    "phone": "(303) 295-3366",
    "website": "https://crossroadscenter.salvationarmy.org/",
    "description": ""
  },
  {
    "addressLine1": "2741 North Federal",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80211",
    "name": "The Salvation Army Lambuth Family Center",
    "organization": "The Salvation Army Lambuth Family Center",
    "phone": "(720) 305-4678",
    "website": "https://lambuthfamilycenter.salvationarmy.org/",
    "description": "Office hours: Mondays through Fridays 9am to 3pm.\n\nTransitional housing and food for single and two-parent families with children ages 17 and younger. The program usually lasts for six months to one year and includes an individualized plan of case management for adult self-sufficiency. The program is designed to help people successfully move out of homelessness.\n\nClients will need to provide the following:\n- Valid photo ID\n- Social Security card and birth certificates for all family members\n- Background check and drug screening\n- Immunization records for all children in the family\n\nFees: 25% of clients incomes.\nTwo weeks to four month waiting list."
  },
  {
    "addressLine1": "633 Fox St",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80204",
    "name": "Gift Of Mary Shelter For Women",
    "organization": "Gift Of Mary Shelter For Women",
    "phone": "(303) 860-8040",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "1600 N Downing St",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80218",
    "name": "Family Promise of Greater Denver Emergency Shelter",
    "organization": "Family Promise of Greater Denver Emergency Shelter",
    "phone": "(303) 675-0713",
    "website": "https://www.familypromiseofgreaterdenver.org/more-than-shelter-program",
    "description": "Family Promises Shelter Program strives to provide more than just shelter for families experiencing homelessness. By partnering with faith congregations, families receive shelter, meals, and supportive services while they work toward long-term housing. Families in the Shelter Program stay overnight at local faith congregations, moving every Sunday to a new location. Each overnight location is staffed by trained volunteers with 24-hour support from the Family Promise staff. Each family has their own space at the congregation for sleeping and storing their belongings. Additionally, families receive three meals a day, help with transportation, access to showers and laundry facilities, and individualized case management and housing navigation.\n\nTo access shelter, families should call 303-675-0713 ext. 1 to complete a phone intake. When space is available, families will be prioritized for shelter based on when they completed their phone take, along with a number of other vulnerability factors from their intake.\n\n\nWe are unable to accept walk ins. If you are in need of services please call us at 303-675-0713.\n\n\nDay Shelter\n\nFamilies in our Shelter Program can access our Day Site 7 days a week. At the Day Site, Family Promise staff provide case management, referrals, access to hygiene items and other physical resources, and overall support. Families can conduct housing and job searches through the use of the sites computer lab and phones. The Day Site also has a playroom for children, a kitchen, showers, laundry, and a backyard for relaxing and playing."
  },
  {
    "addressLine1": "1101 W 7th Ave",
    "city": "Denver",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80204",
    "name": "Haven of Hope",
    "organization": "Haven of Hope",
    "phone": "(303) 607-0855",
    "website": "https://thoh.org/",
    "description": ""
  },
  {
    "addressLine1": "3805 Marshall St",
    "city": "Wheat Ridge",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80033",
    "name": "Family Tree Inc in Wheat Ridge, Colorado",
    "organization": "Family Tree Inc in Wheat Ridge, Colorado",
    "phone": "(303) 422-2133",
    "website": "https://www.thefamilytree.org/",
    "description": "Family Tree works alongside people affected by child abuse, domestic violence and homelessness throughout their journey to safety and economic independence, providing emergency residential services, case management and advocacy, therapeutic services, outreach support, housing search and placement, education and employment support, among many other services.\n\nFamily Tree Housing and Family Stabilization Services works with individuals and families experiencing homelessness, or those at-risk of homelessness. We offer emergency shelter, an information help line, homeless prevention services, case management, education and employment services, and various other supportive services in order to help people achieve economic independence.\n\n\nFamily Tree Housing and Family Stabilization Services include:\n\n\nFamily Tree House of Hope: dedicated to providing safe shelter and supportive services for women with children experiencing homelessness. These families, overwhelmed with the daily struggle of where to stay the night and find their next meal, find a safe place to stay while they begin to get back on their feet. This is the only residential facility of its kind in Arapahoe County, however we serve the entire Metro Denver region.\n\n3301 South Grant Street Englewood, CO 80113\nPhone: (303) 762-9525\n\nFamily Tree Homelessness Program: provides housing navigation and placement services, comprehensive case management, education and employment services, along with connections to various resources to assist those experiencing homelessness or those at-risk of homelessness.\n\n3805 Marshall Street Wheat Ridge, CO 80033\nPhone: (303) 467-2604\n\nFamily Tree Child & Youth Services include:\n\nCommunity Family Resource Team - Youth Therapeutic Supportive Services\n    SafeCare Program - Family Supportive Services\n    Kinship Programs - Family Stabilization Services\n    Colorado Child Care Assistance Program - Douglas County Only\n\nFamily Tree Domestic Violence Services include:\n\nRoots of Courage - Domestic Violence Emergency Residential Services\n    Parenting Time Program\n    Domestic Violence Outreach Program\n    Legal Advocacy Program"
  },
  {
    "addressLine1": "3301 S Grant St",
    "city": "Englewood",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80113",
    "name": "House of Hope - The Family Tree",
    "organization": "House of Hope - The Family Tree",
    "phone": "(303) 762-9525",
    "website": "https://www.thefamilytree.org/house-hope",
    "description": "House of Hope is dedicated to providing safe shelter and resources for homeless women with children. These families, overwhelmed with the daily struggle of where to stay the night and find their next meal, find a safe place to stay while they begin to get back on their feet.\nHouse of Hope's basic goal is to provide food, shelter and a safe environment to the ever-increasing number of homeless families. Families work with the staff and a variety of community agencies to complete the goals outlined in their plans, which often include applying for housing programs, getting children into school and daycare, obtaining employment, achieving a GED, or attending a job training program. During their stay they also have the opportunity to meet individually with an on-site therapist and also attend life-skills workshops.\n\nThe only shelter for homeless families in Arapahoe County\n\nCase management services to assist families with becoming self-sufficient\nAssistance with obtaining housing employment, education, job-skills training and childcare\nFamilies can stay for up to 90 days\nOn-site therapist\nOn-site health clinic staffed by volunteer doctors and nurses\nCommunity referrals"
  },
  {
    "addressLine1": "460 Linden Center Dr",
    "city": "Fort Collins",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80524",
    "name": "Samaritan House Fort Collins",
    "organization": "Samaritan House Fort Collins",
    "phone": "(970) 484-5010",
    "website": "https://ccdenver.org/larimer-county-services/the-mission-in-fort-collins/",
    "description": "Samaritan House Fort Collins previously known as Mission Fort Collins assist anyone in need of shelter or food or who needs help getting a fresh start.\nExtended-stay housing program for men,women and families: includes shelter, meals, clothing, case management, housing placement, spiritual support, and other assistance. The program is up to 120 days for individuals and up to 180 days for families.\nCall 970-493-0141.\nExtended-stay program for veterans: In concert with the VA, provide shelter, meals, housing placement and case management to veterans experiencing homelessness. Call 970-616-8636.\n\nEmergency Overnight Shelter Call 970-493-0141- Families: Year-round lottery at The Mission at 3:30 p.m., entrance at 5 p.m.- Women: Nov. 1 - April 30, entrance at 10 p.m. at Community of Christ, 220 E. Oak St., Fort Collins, CO.- Men: Year-round lottery and entrance at The Mission at 10 p.m.\n\nHelp people threatened by homelessness:\nFamilies\nSingle men & women\nVeterans\nSeniors\n\nProvide a temporary home, a place for new beginnings.\nEach of the residents is matched with a case manager who helps him/her navigate 120-day Levels Program. Each resident commits to goals that will help them obtain stable income and housing.\n\n120-Day Levels Program Requirements:\nAttend \"Employment\" and \"Life Skills\" class series\nAttend \"Housing\" and \"Money Management\" class series\nRegularly submit \"Job Search\" and \"Housing Search\" logs\n\nRegularly deposit earnings into a supervised, personal housing fund\nMeet regularly with Case Manager\n\nPermanent Shelter:\nMens Dorm with 18 beds\nWomens Dorm with 6 beds\nFour, separate Family Rooms\n\nEmergency \"Overflow\" Shelter:\nMens room with 24 beds\nFour additional beds for women or families\n\nVeterans Program:\nShelters up to 16 men\nProvides veterans with 24/7 access to a housing facility\nConnects veterans to case management services\nAssists veterans in obtaining:\nIncome and Benefits\nStable Housing\nPhysical and Mental Health Services.\n"
  },
  {
    "addressLine1": "316 Jefferson St",
    "city": "Fort Collins",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80524",
    "name": "Fort Collins Rescue Mission",
    "organization": "Fort Collins Rescue Mission",
    "phone": "(970) 224-4302",
    "website": "https://www.fortcollinsrescuemission.org/",
    "description": "The homeless find a safe haven at Fort Collins Rescue Mission, where 75 warm beds await. A hot meal and warm shower here offer relief and comfort. Those who stay the night have the opportunity to seek recovery and a new direction through our Steps to Success Program, at the Mission, and through our New Life Program at Harvest Farm. Trained professionals also assess and serve the needs of individuals and families who are just struggling to make ends meet.\n\n\n\nFort Collins Rescue Mission offers emergency services to thousands of needy people throughout the year:\n\n\n\nFood\n\n\nBreakfast and dinner are served daily; lunch is served to those in programs.\n\n150 meals are served daily.\n\nBreakfast is from 6 a.m. to 7:30 a.m. Dinner is from 4:30 p.m. to 6:30 p.m. daily.\n\n\n\nShelter\n\n\nThe shelter has capacity for 90 men and women nightly.\n\n\n\nClothing\n\n\nDistribution for men, women and children.\n\n"
  },
  {
    "addressLine1": "3851 S. Taft Hill Rd.",
    "city": "Fort Collins",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80526",
    "name": "Springfield Court Apartments",
    "organization": "Springfield Court Apartments",
    "phone": "(970) 207-0155",
    "website": "https://www.mercyhousing.org/mountain-plains/springfield-court/",
    "description": ""
  },
  {
    "addressLine1": "242 Conifer Street",
    "city": "Fort Collins",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80524",
    "name": "Murphy Center for Hope - Homeward Alliance",
    "organization": "Murphy Center for Hope - Homeward Alliance",
    "phone": "(970) 658-9878",
    "website": "https://www.murphycenter.org/",
    "description": "Hours: 7 days a week, 8:00 am 5:00 pm (indoor services limited due to COVID-19)\n"
  },
  {
    "addressLine1": "1511 E. 11th St, Suite 200",
    "city": "Loveland",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80537",
    "name": "Family Promise of Larimer County",
    "organization": "Family Promise of Larimer County",
    "phone": "(970) 663-1716",
    "website": "http://www.honservice.org/",
    "description": "Hours of Operation: Mondays through Thursdays 9am to12 noon, 1pm to 4pm.\n\nFamilies accepted into the program are warmly welcomed and immediately provided all of the resources HNS has to offer.  Following the best practices of Family Promise, each familys situation is assessed and goals are prioritized:  employment, safe child care and school enrollment for children.  Common barriers that keep families from competing in the tight housing market in Colorado are:  poor credit history, past evictions, lack of living-wage employment.  These are areas that case managers, partnered with other agencies in the community, will help us address.\n\n\nChildren of school age are transported by the R2J School District to keep them in their current school whenever possible.\n\nAdults are connected to vital resources, including but not limited to House of Neighborly Service and other partners within Life Center.  Accountability is essential for families to address their barriers to housing.  The program requires limited spending, budgeting, debt reduction, repairing credit issues, and establishing savings.\n\n\nFamilies in the program are hosted by a rotating church network and an evening meal is coordinated seven nights a week.  To stretch the familys resources transportation is provided to the current church each afternoon at 5:00 pm and back to the Day Center at 7:00 am.\n\n1511 E. 11th Street, Suite 200\n(located within the Life Center)\nLoveland, CO 80537\nPhone: (970) 663-1716\nEmail: info@honservice.org\nHours of operation:\nPublic Walk-In Hours: Monday Thursday:  10:00 AM 5:00 PM\n\n(Staff is available to families in the program 7 days a week.)"
  },
  {
    "addressLine1": "137 South Lincoln Ave",
    "city": "Loveland",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80537",
    "name": "137 Homeless Connection",
    "organization": "137 Homeless Connection",
    "phone": "(970) 685-4173",
    "website": "http://www.lovelandshelter.com/",
    "description": ""
  },
  {
    "addressLine1": "562 29 Rd",
    "city": "Grand Junction",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "81504",
    "name": "HomewardBound of the Grand Valley",
    "organization": "HomewardBound of the Grand Valley",
    "phone": "(970) 256-9424",
    "website": "https://homewardboundgv.org/",
    "description": "Main Line (970) 256-9424\n\nGuest Line (970) 256-0028\n\n\nTemporary Nigh Shelter, Families, Women and Men; Intake at 5:00 pm for families/6:00 pm for individuals.\n\n\nIntake Schedule for Families:\n\n4:30 p.m. Permitted to be on Property\n\n5:00 pm Check-in/Intake\n\n5:00 to 6:00 pm Family Shower Time\n\n5:00 to 6:00 pm Dinner is Served\n\n9:00 pm Lights Out on Family Wing\n\n6:30 am Wake Up\n\n6:45 am Breakfast is Served\n\n8:00 am All Residents Exit the Building\n\n\n\nIntake Schedule for Singles:\n\n5:30 pm Permitted to be on Property\n\n6:00 pm Check-in/Intake\n\n6:00 to 7:00 pm Dinner is Served\n\n10:30 pm Lights Out, Lobby Closed, Limited Smoking Area\n\n6:30 am Wake Up\n\n6:45 am Breakfast is Served\n\n8:00 am All Residents Exit the Building\n\n"
  },
  {
    "addressLine1": "550 South Ave",
    "city": "Grand Junction",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "81501",
    "name": "Grand Junction Rescue Mission",
    "organization": "Grand Junction Rescue Mission",
    "phone": "(970) 243-4230",
    "website": "https://grandjunctionrescuemission.org/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 2837",
    "city": "Grand Junction",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "81501",
    "name": "The House Youth Shelter",
    "organization": "The House Youth Shelter",
    "phone": "(970) 241-1445",
    "website": "http://www.thehousegj.org/",
    "description": ""
  },
  {
    "addressLine1": "302 Pitkin Ave",
    "city": "Grand Junction",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "81501",
    "name": "Grand Valley Catholic Outreach Day Center",
    "organization": "Grand Valley Catholic Outreach Day Center",
    "phone": "(970) 263-9445",
    "website": "http://www.catholicoutreach.org/",
    "description": "Hours:\nMondays through Fridays\n8:00 am to 12:00 pm\n\nThe Day Center offers the amenities of home with a warm shower, laundry, telephone, mail, and storage to area homeless, ages 18 and older. Job search support is also provided.\n\nTwice each week medical personnel are present to assist the guests with preventive health care, distribute vaccinations, and provide testing. There is also an onsite counselor.\n\n\nA free bus service is operated by members of the St. Matthew Episcopal Church each Monday and Thursday morning."
  },
  {
    "addressLine1": "1235 North 4th Street",
    "city": "Grand Junction",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "81501",
    "name": "Salvation Army Day Center",
    "organization": "Salvation Army Day Center",
    "phone": "(970) 242-7513",
    "website": "https://grandjunction.salvationarmy.org/",
    "description": "Mondays through Saturdays 8am to 4:00pm, Sundays 12 noon to 3:30pm\n\nDay Shelter, Lunch, Limited Phone, Referrals Only.\nWe offer support to those who are in need in our community. Here is a list of ways we can help you and your family:\n\nFood Pantry: includes emergency food boxes, TEFAP and CSFP;\nClothing and Household items vouchers,\nCamping gear\nUtility assistance\nSchool supplies\nChristmas Assistance\n\n"
  },
  {
    "addressLine1": "1110 M Street",
    "city": "Greeley",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80631",
    "name": "Alternative Homes for Youth",
    "organization": "Alternative Homes for Youth",
    "phone": "(970) 353-6010",
    "website": "http://www.alternativehomesforyouth.org/",
    "description": "Alternative Homes for Youth (AHFY) specializes in transforming the effects of trauma, neglect, and abuse in the lives of children. Our commitment is to respond to the needs of the community and our clients by integrating current research to create individualized treatment plans and multi-modal treatment approaches which are adaptive, vital, and effective.\n\nResidential Services\n\nAlternative Homes for Youth (AHFY) treats adolescent males with sexually abusive behaviors, substance abuse challenges, mental health challenges, and challenges with other criminogenic behaviors ages 13-20 under a RCCF license. AHFY treats youth that are dually-diagnosed, according to the Diagnostic and Statistical manual of Mental Disorders (DSM-IVTR), with such classifications as, adjustment disorder, bipolar disorder, depression, or attention hyperactivity disorder (as well as several other DSM-IVTR distinctions). The youth may or may not require use of psychotropic medication.  \n\nMinimum criteria for admission in residential treatment program:\nMale youth 13 to 20 years of age\nYouth able to keep self and others safe without constant redirection\n(Offense specific)Youth with current sexual offense adjudications\n(Offense specific) Youth who are in the process of being adjudicated for a sexual crime, or\n(Offense specific) Youth who have been adjudicated of other crimes, and have inappropriate sexual behavior toward others that were not included in their adjudication, but need to be addressed, or\n(Offense Specific) Youth who admitted guilt and are invested in changing their sexually abusive behavior\n\n(Offense Specific) Youth with sexual or incestuous crimes against other children\nYouth with adequate intelligence and social functioning (IQ at least 80)\n\nYouth requiring treatment for mental health challenges including but not limited to Attention Deficit Hyperactivity Disorder, Bi-Polar Disorder, Post-Traumatic Stress Disorder\nYouth with other criminogenic challenges including but not limited to starting fires, trespassing, theft, substance abuse, etc.  \nYouth will not be accepted into AHFY if they do not meet the above criteria, are actively suicidal or psychotic, are unable to refrain from physically hurting themselves or others, or are not cognitively able to participate in the psycho-educational program component."
  },
  {
    "addressLine1": "1206 10th St",
    "city": "Greeley",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80631",
    "name": "Greeley Transitional House",
    "organization": "Greeley Transitional House",
    "phone": "(970) 352-3215",
    "website": "http://www.greeleytransitionalhouse.org/",
    "description": "Mission\nTo provide safety, stability, and opportunity\nfor families in crisis through emergency shelter and comprehensive support services.\n\nServices:\nEmergency residential shelter for families\nCase management and access to basic resources\nChild / Adolescent Programs\nTransitional Housing Programs\n\nEligibility\nAny family, regardless of age, race, religion, sexual orientation, color or creed, who is in need of temporary emergency housing, is eligible. The family must demonstrate that no other housing is available to them and that they are highly motivated to establish independent living as quickly as possible. Additionally, they must be willing to pursue an action plan for establishing self-sufficiency\n\nProgram Details\nFamilies must apply for admittance into the program in person at the shelter. Admittance, after meeting the screening criteria, is on a space available basis.\nThe Program Case Manager will perform an initial eligibility screening and if accepted into the program, will assist the family in preparing a self-sufficiency action plan.\n\nThroughout their maximum 60 day stay at the shelter, the Program Case Manager will continue to work with the family in locating and utilizing community resources for the period of time they are in residence, as well as completing goals related to the familys self-sufficiency plan (primarily to attain housing and employment)"
  },
  {
    "addressLine1": "1442 North 11th Avenue",
    "city": "Greeley",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80631",
    "name": "Guadalupe Community Center - Guadalupe Shelter",
    "organization": "Guadalupe Community Center - Guadalupe Shelter",
    "phone": "(970) 353-3720",
    "website": "https://ccdenver.org/weld-county-services/guadalupe-community-center/",
    "description": "Catholic Charities emergency shelter. Houses 24 men, 6 women and 6 families.\n\nOpen from 7PM to 7AM 365 days a year. There are separate areas for single men, single women, and families with children. The shelter also provides shower facilities, and breakfast and evening meals, job referrals and advocacy are available to shelter residents.\n\n\n120-Day Levels Program Requirements...\n\n    Attend Employment and Life Skills class series\n    Attend Housing and Money Management class series\n    Regularly submit Job Search and Housing Search logs\n    Regularly deposit earnings into a supervised personal housing fund\n    Meet regularly with Case Manager\n\nOur Permanent Shelter Accommodations...\n\n    Mens dormitory with 20 beds (currently reduced to 8 beds due to COVID-19)\n    Womens dormitory with 6 beds (currently reduced to 3 beds due to COVID-19\n    Five independent family rooms with 20+ beds\n    Medical beds to accommodate 4 men and 3 women\n\nSPECIALIZED CASE MANAGERS FOR OLDER ADULTS\n\nWe provide specialized case management to older adults to help them obtain government issued benefits, housing, and a variety of additional senior resources.\n\n"
  },
  {
    "addressLine1": "250 Kimbark St",
    "city": "Longmont",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80501",
    "name": "Inn Between",
    "organization": "Inn Between",
    "phone": "(303) 684-0810",
    "website": "http://theinnbetween.org/",
    "description": "Mission:\nOur mission is to provide supportive housing promoting self-sufficiency and stability to diverse homeless families and individuals through collaboration with community partners, utilization of community resources, case management and life-skills training.\n\nSupportive Housing\nThe Inn Between's goal is to address the needs of a diverse population by providing Time-limited Housing a Self-Sufficiency Program and Case Management to prevent homelessness. Program offers comprehensive services to a diverse population of families and individuals experiencing homelessness.\n\nHousing\nThe Inn Between has created a community of support that offers a safe place for those experiencing a difficult time, facing homelessness or are homeless.\nServices include:\n    Time-limited housing\n    Affordable rent that is based on 1/3 of income\n    Sixty-seven (67) units at four sites\n    18 Single Room Occupancy (SRO's)\n    49 Apartments, 1-2-3 Bedroom units\n"
  },
  {
    "addressLine1": "804 S. Lincoln St",
    "city": "Longmont",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80501",
    "name": "HOPE- Homeless Outreach Providing Encouragement",
    "organization": "HOPE- Homeless Outreach Providing Encouragement",
    "phone": "(720) 494-4673",
    "website": "https://hopeforlongmont.org/",
    "description": ""
  },
  {
    "addressLine1": "82 21st Avenue",
    "city": "Longmont",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80502",
    "name": "Safe Shelter of St. Vrain Valley",
    "organization": "Safe Shelter of St. Vrain Valley",
    "phone": "(303) 772-0432",
    "website": "https://safeshelterofstvrain.org/",
    "description": "24/7 emergency shelter program for victims of relationship abuse at an undisclosed confidential location. Stay average is 4-6 weeks.\nOur Emergency Shelter is just one of seven major programs we offer for victims of domestic and dating violence. We also provide the following:\n\n    24-hour crisis line\n    Individual and group counseling\n    Case management\n    Legal advocacy\n    Community and peer education\n    Information and referrals\n\nAll services are available in English and Spanish.\n"
  },
  {
    "addressLine1": "PO Box 270181",
    "city": "Louisville",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80027",
    "name": "The Little Flower Maternity Home",
    "organization": "The Little Flower Maternity Home",
    "phone": "(720) 609-2934",
    "website": "https://littleflowermaternity.org/",
    "description": ""
  },
  {
    "addressLine1": "PO BOX 351594",
    "city": "Westminster",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80035",
    "name": "Cold Weather Care",
    "organization": "Cold Weather Care",
    "phone": "(303) 847-9072",
    "website": "https://coldweathercare.org/",
    "description": ""
  },
  {
    "addressLine1": "PO BOX 1477",
    "city": "Wheat Ridge",
    "state": "Colorado",
    "stateAbbreviation": "CO",
    "postal": "80304",
    "name": "Shannon's Hope Maternity Home",
    "organization": "Shannon's Hope Maternity Home",
    "phone": "(303) 480-5433",
    "website": "http://www.shannonshope.org/",
    "description": "Shannon's Hope is a home with a mission to provide a residential community for pregnant women age sixteen through childbearing age who have no place to call home. Many times, these women have not been offered (or afforded) the basic decision-making skills and have made difficult choices about their lives. Shannon's Hope continues to offer them a place to call home, an opportunity to rebuild their lives, and a hope for the future.\n\nShannon's Hope not only provides a place to live, but helps guide our residents through troubled times. After a resident enters our facility, they quickly adjust to having a safe place to call home. Our programs are designed to help guide a woman and her child to a safe and stable independent lifestyle.\n\n\nShannon's Hope embraces the mission to provide a loving, life-affirming home to pregnant women. We strive to complete this mission through:\nOffering housing and support through our residential home and/or shepherding homes.\nTo refer our clients to community resources or to adoption agencies which may be helpful to them as a single or relinquishing parent, enabling them re-entry into life.\nTo help our clients initiate a 'plan' for their future to work towards, both during and after their pregnancy.\n\nTo foster a spirit of independence for themselves and also pass on to their children the same spirit, enabling many to break dependent roles.\nTo maintain at all times, through and within the facility of Shannon's Hope, an atmosphere and practice of faith, hope and love."
  }
]