[
  {
    "addressLine1": "1110 Grand Ave",
    "city": "Asbury Park",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07712",
    "name": "Epiphany House Transitional Substance Abuse Women's Recovery",
    "organization": "Epiphany House Transitional Substance Abuse Women's Recovery",
    "phone": "(732) 775-0720",
    "website": "http://www.epiphanyhouse.org/",
    "description": "Epiphany House is committed to promoting sobriety and self-sufficiency in homeless recovering chemically dependent women with children.\n\nEpiphany House provides transitional housing and a continuum of health care and social services. During a stay, lasting from six to twelve months, each resident is assisted to become firmly established in sobriety and to define for herself who she is, where and how she will live, and what she will do to create and maintain a self affirming life.\n\nEligibility\nHomeless or recovering substance abusing women and their children\nNo fees"
  },
  {
    "addressLine1": "1 Bethany Road Building 3",
    "city": "Hazlet",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07730",
    "name": "180 Turning Lives Around Shelter",
    "organization": "180 Turning Lives Around Shelter",
    "phone": "(732) 264-4111",
    "website": "http://180nj.org/",
    "description": ""
  },
  {
    "addressLine1": "2009 Bacharach Blvd",
    "city": "Atlantic City",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08401",
    "name": "Atlantic City Rescue Mission",
    "organization": "Atlantic City Rescue Mission",
    "phone": "(609) 345-5517",
    "website": "https://www.acrescuemission.org/",
    "description": "The Mission has dormitories for 200 men and 50 women, and rooms in the family shelter for 11 mothers with children.\n\nThe Mission provides meals and shelter, but the goal is to guide people to a productive life through practical programs and eternal life through Jesus Christ.The Mission is the largest provider of services for the homeless in southern New Jersey with 320 shelter beds. While a deep commitment to God sets us apart in how we provide services, we do not discriminate on the basis of race, age, religion, sex, handicap, or national origin.\n\nPrograms\nMeals, shelter, and clothing are a homeless person's immediate needs, but they also need services to help them get back on their feet again.\nCounseling and Case Management\n The first step is to sit down with a Chaplain or Counselor and talk about why they became homeless. Together, the individual and counselor put together a case plan to help overcome the obstacles that led to homelessness.  This might include referrals to other social service organizations or enrolling in one of the Mission's programs.\nFamily Life Center Program\n The Family Life Center is a haven for homeless moms and children.  Up to 11 families can stay as long as they need to until they can move back into permanent housing.  Safe shelter, meals, counseling, parenting classes for the moms, and homework help for the children are all available.\nWork Readiness Program\n For those guests who haven't worked in some time, they need a jump-start on getting back into working mode. For 120 days, they work a shift in the Mission 6 days per week doing cooking, cleaning, security, maintenance, or office work.  They also attend daily classes in life skills, money management, or Bible study.  There's a graduation ceremony for those who complete the program, and then they can move on to employment, transitional housing, HOPE Program, or Overcomers.\nOvercomers Program\n Some of our guests have become homeless due to addiction issues. Through the Overcomers Program, they receive one year of residential recovery. They continue to work a shift in the Mission to boost their employability, and they attend intensive group and individual counseling for addiction. After graduating, they move on to employment, transitional housing, or the HOPE Program.\nHOPE Program\n Homelessness Overcome through Programmed Employment (HOPE) helps those who have graduated from the Work Readiness or Overcomers Programs to build a resume, find a job, and save money by continuing to live at the Mission until they have enough to move to their own housing."
  },
  {
    "addressLine1": "929 Atlantic Ave.",
    "city": "Atlantic City",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08401",
    "name": "Covenant House Atlantic City New Jersey",
    "organization": "Covenant House Atlantic City New Jersey",
    "phone": "(609) 348-4070",
    "website": "https://nj.covenanthouse.org/",
    "description": "We are a homeless shelter for the ages of 18-21. We provide other services as well, such as educational and job training, legal services, and behavioral health treatment.\n\nWe open doors of opportunity and hope to homeless youth through three core programs: Outreach, Crisis Centers, and Supportive Housing, each playing a specific role in the journey from homelessness to a bright future. These programs were designed to connect, protect, nourish, heal, and transform lives.\nOutreach\nOur Outreach teams are on-the-street experts in finding and connecting to homeless youth and those can help us reach them, ensuring that local homeless, runaway and trafficked youth know that we're here if they need us.\n\nCrisis Care\nOur Crisis Centers quickly address the immediate needs of those who come through our doors and help them to stabilize the issues that have rendered them homeless.\n\nSupportive Housing\nOur community-based supportive living programs help homeless youth learn how to successfully live on their own.\n\nSupportive Services\nWe know homeless youth need more than a place to stay. Our holistic set of coordinated robust services under our one roof help young people to address the challenges they face and build a happy, healthy and independent adulthood for themselves.\n\nIn 1989, Covenant House began its work in New Jersey by providing basic services to homeless youth on the streets of Newark and Atlantic City. Over the past 25 years, we have grown by creating more services and enhancing the quality of those services. Our focus is always on meeting the needs of our youth, needs which never stop growing.Our outreach program has expanded its reach to Paterson and Cumberland County. While outreach continues to provide the essential services that established our presence in New Jersey two decades ago, we have expanded to forming partnerships with local schools, organizations, and government agencies to make sure all youth in the state are served.Tonight alone, we will give 132 homeless adolescents and 19 of their babies throughout the state a safe and caring place to live in North and South Jersey. Another dozen will be found by our outreach teams on the street or walk through the doors of our Crisis Centers for the first time.Recently, we opened a program especially for mentally ill homeless youth called Nancys Place in Montclair. In response to the special needs of this unique population, the program will be staffed 24 hours a day, and offer the intensive care these young people need to become self-sufficient and independent."
  },
  {
    "addressLine1": "927 North Main Street Building D",
    "city": "Northfield",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08225",
    "name": "AVANZAR Shelters",
    "organization": "AVANZAR Shelters",
    "phone": "(609) 601-9925",
    "website": "https://avanzarnow.org/",
    "description": "Northfield Women's Shelter\nAtlantic County Women's Center\nServices:\n24-Hour Hotline (800)-286-4184 or (609)-646-6767, and for the hearing impaired (609)-569-5437\n\nShelter: 24-hour, temporary, emergency and protective housing, in a confidential location\nCounseling\nFathers Ending Abuse Counseling\nLegal Advocacy\nSexual Assault Response Team/Forensic Nurse Examiner Program (SART/FNE)\nDomestic Violence Response Team (DVRT)\nSexual Assault Volunteer Coordinator\nPrimary Prevention Specialist\nCommunity Education\nThe Clothesline Project\nEmergency Cellular Phone Program re-programmed to automatically dial 911\n\n\n"
  },
  {
    "addressLine1": "1201 New Road",
    "city": "Linwood",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08221",
    "name": "The Women's Center Linwood",
    "organization": "The Women's Center Linwood",
    "phone": "(609) 646-6767",
    "website": "http://www.acwc.org/",
    "description": "24-hour crisis hotline:  800-286-4184 or 609-646-6767.\n\nServices\nViolence Intervention Program\nThe Violence Intervention Program works to reduce the physical, psychological and emotional trauma and recurrence of domestic violence, sexual assault and incest experienced by victims and their families. All VIP services are provided at no cost, excluding the Alternatives To Violence program, which incurs a small cost.\n\nPeace: A Learned Solution\nPeace: A Learned Solution is a therapeutic program for children and their families who have experienced or witnessed domestic violence.\nThe Home to Work Program and Self Sufficiency Program\n\nHome To Work (HTW) empowers displaced homemakers with the personal support, education and job skills assessment necessary to become independent and self-sufficient.\n\nFathers' Care Network\nFather's Care Network is a program designed to assist fathers in strengthening their role in the lives of their children.\n\nDream Catcher Program\nDream Catcher is a holistic program addressing all forms of human trafficking.  Dream Catcher services are provided on a statewide level. \nHuman trafficking is a form of modern-day slavery where people profit from the control and exploitation of others.   Human trafficking is considered to be one of the fastest growing criminal industries in the world.\n\nGrow NJ Kids South Region Technical Assistance Center\n\n The South Region Technical Assistance Center (SR-TAC) provides early childhood education centers with technical assistance through coaching and mentoring to increase the quality of early childhood education. SR-TAC provides technical assistance to Atlantic, Burlington, Camden, Cape May, Cumberland, Gloucester and Salem Counties."
  },
  {
    "addressLine1": "555 Kennedy Blvd",
    "city": "Bayonne",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07002",
    "name": "BEOF Community Action Partnership Emergency Services",
    "organization": "BEOF Community Action Partnership Emergency Services",
    "phone": "(201) 437-7222",
    "website": "http://www.beof.org/",
    "description": "To provide programs geared primarily for low income citizens, senior citizens and the handicapped. Information and referral is given to any citizen of Bayonne who needs our assistance. The B.E.O.F.'s programs range from pre-natal through the \"Golden Years\".\n\nMulti-purpose community service agency providing the following services: weatherization, emergency food and shelter, community outreach, Hispanic affairs program, elderly and disabled transportation program, Head Start, Senior Nutrition Center, Meals on Wheels, Homeless Prevention.\n\nHours: Mon - Fri 8.30am - 4.00pm"
  },
  {
    "addressLine1": "100 Park Avenue",
    "city": "Staten Island",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "10302",
    "name": "Project Hospitality",
    "organization": "Project Hospitality",
    "phone": "(718) 448-1544",
    "website": "http://www.projecthospitality.org/",
    "description": "Emergency Shelter Clothing or Vouchers.\n\nNeed Help?If you are in Staten Island, New York, and you need help, please contact the following programs as appropriate:\nNeed food?\nPlease contact Project Hospitality's Community Services Center, which is located at 514 Bay Street, at (718) 815-0800.\n\nClick here for a list of emergency food resources on Staten Island.\nNeed a place to spend the night?\nPlease contact the Drop-In Center, located at 25 Central Avenue, at (718) 720-0079, ext. 10.\n\nNeed help with recovery from alcohol or drug addiction?\nPlease contact our Recovery Center at (718) 273-0850.\nServices are free and confidential.\n\n\n\nProject Hospitality provides a safety net for Staten Islanders experiencing profound poverty and disconnection from opportunities, empowering them to take responsibility for their lives and achieve self-sufficiency. The signature work of the agency, since its inception over 31 years ago, has been the provision of emergency shelter for the Island's homeless in collaboration with local faith-based congregations. We operate a Street Outreach Program, a Drop-In Center for homeless singles, a 67-bed church based shelter network, and emergency housing programs. This division is designed to move persons living on the streets or other places not meant for human habitation to indoor living and to assist them in acquiring the skills needed to achieve independent living in the community.\n\nAdditionally, Project Hospitality has over 25 years of experience working with runaway and homeless youth. In 2003, PH founded EyeOpeners: Youth Against Violence as a result of bias crimes and racial tension in Staten Island. It is a multi-ethnic, multicultural, anti-discrimination and anti-violence youth rights organization that fosters youth development by improving relations across all social barriers and proactively organizing for social change.\nThe agency has been running Staten Island's only Youth Drop-In Center successfully since 2009 and is the sole provider of street outreach, shelter, case management, treatment, support and housing placement for homeless individuals and families in the borough. It is also the sole provider of a Family Youth Resource Center with a vast array of services."
  },
  {
    "addressLine1": "PO Box 1887",
    "city": "Bloomfield",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07003",
    "name": "Safe House Shelter For Victims of Domestic Violence",
    "organization": "Safe House Shelter For Victims of Domestic Violence",
    "phone": "(973) 759-2154",
    "website": "https://twitter.com/SafeHouseCenter",
    "description": "Victims of domestic violence.\n\nEmergency shelter, medical attention, case management, legal advocacy, court accompaniment, 24-hour hotline & shelter admission, food, clothing, comprehensive children's program, support group & individual counseling, housing advocacy, information & referral, community support group & children's group. Pre-school program, summer day camp, after school program. Parenting classes."
  },
  {
    "addressLine1": "95 Grove Street",
    "city": "Montclair",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07042",
    "name": "REAL House Inc. Juniper House",
    "organization": "REAL House Inc. Juniper House",
    "phone": "(973) 746-2401",
    "website": "http://realhouseinc.com/",
    "description": "Juniper House is the Licensed Shelter operated under the REAL House umbrella of treatment services. Our goal is to provide a setting where residents learn to empower themselves through making positive choices for their future. We encourage women to slow down and take some time in getting to know who they are so they may create a plan for the future where they can be healthy and self-supporting. Juniper House treats WFNJ/SAI clients exclusively and the length of stay is generally 9 MONTHS.\n\nLocated in Montclair, New Jersey near Bloomfield Ave, Juniper House is an ideal treatment setting. Only short bus ride from the welfare offices at 18 Rector Street and 50 South Clinton, our clients have ready access to the services they need. Social security, super market, laundry, and a wide variety of support groups are all within walking distance."
  },
  {
    "addressLine1": "95 Grove Street",
    "city": "Montclair",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07042",
    "name": "Real House Inc Women Shelter in Montclair New Jersey",
    "organization": "Real House Inc Women Shelter in Montclair New Jersey",
    "phone": "(973) 746-2400",
    "website": "http://www.realhouseinc.com/",
    "description": "Real House was established 10 years ago. It is a shelter for women in the process of recovery from substance and domestic abuse. Here we strive to empower women through quality support services. We provide a clean and safe home base environment for our women, where they can do the necessary inner-work required for healing and redesigning their lives."
  },
  {
    "addressLine1": "168 Park Street",
    "city": "East Orange",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07017",
    "name": "LGBT RAIN Foundation",
    "organization": "LGBT RAIN Foundation",
    "phone": "(862) 400-2558",
    "website": "http://essexlgbthousing.org/",
    "description": ""
  },
  {
    "addressLine1": "68 N Fullerton Ave",
    "city": "Montclair",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07042",
    "name": "Salvation Army Cornerstone Shelter",
    "organization": "Salvation Army Cornerstone Shelter",
    "phone": "(973) 744-8666",
    "website": "https://montclair.salvationarmy.org/montclair/cornerstone-house",
    "description": "Emergency shelter for adults and families living in the suburban area of Essex County.\nEligibility: Adults and Families.\nThe Salvation Army operates an emergency shelter in Montclair with a 23 bed capacity. The program offers additional supportive services to facilitate independence and self-sufficiency.  The Montclair facility should be contacted directly for more information."
  },
  {
    "addressLine1": "31 N Pearl St",
    "city": "Bridegeton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08302",
    "name": "Cumberland County Code Blue Coalition - Warming Centers",
    "organization": "Cumberland County Code Blue Coalition - Warming Centers",
    "phone": "(844) 625-4673",
    "website": "http://www.m25initiative.org/code-blue.html",
    "description": "Cumberland County Code Blue Coalition - The M25 Initiative\n\nA Code Blue is initiated when temperatures are 32 degrees with precipitation or 25 degrees without precipitation. Warming Centers are housed by host churches on a rotating basis from 6 PM to 6 AM. The Code Blue Season runs from November through March.\n\n\nThe Cumberland County Code Blue program provides Warming Centers as a way for homeless persons in the community to find shelter from frigid overnight temperatures during the cold winter months."
  },
  {
    "addressLine1": "733 E. Chestnut Avenue",
    "city": "Vineland",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08360",
    "name": "Salvation Army - Human Services Emergency Financial Assistance",
    "organization": "Salvation Army - Human Services Emergency Financial Assistance",
    "phone": "(856) 696-5050",
    "website": "https://www.facebook.com/TheSalvationArmyVinelandCorps",
    "description": "Food Pantry for Community Emergency Financial Assistance\n\nThe Salvation Army offers emergency assistance to any person regardless of age, sex, color, creed or race, who is in need of emergency assistance, provided funding is available. Special needs may also be assisted according to the availability of funding and volunteers.\n\n\nThe Salvation Army Missing Persons program is a unique international social service. Its purpose is to help facilitate successful reunions between family members who have lost contact with each other.\n\nIn the Eastern Territory, searches are conducted utilizing a variety of methods, including government offices, credit institutions, social service agencies and law-enforcement personnel. The Salvation Army is instrumental in re-uniting thousands of families each year. The Northeast Regional Office receives an average of 2,000 inquiries; opens approximately 600 new cases and locates an average of 350 people annually."
  },
  {
    "addressLine1": "49 Brahma Avenue",
    "city": "Bridgewater",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08807",
    "name": "Somerset Home for Temporarily Displaced Children",
    "organization": "Somerset Home for Temporarily Displaced Children",
    "phone": "(908) 526-6605",
    "website": "http://www.somersethome.org/",
    "description": ""
  },
  {
    "addressLine1": "73 E High St",
    "city": "Somerville",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08876",
    "name": "Somerset County Social Services Emergency Assistance",
    "organization": "Somerset County Social Services Emergency Assistance",
    "phone": "(908) 526-8800",
    "website": "",
    "description": "Pays for temporary emergency shelter and food. Also available to TANF and SSI recipients who are victims of domestic violence. Also temporary assistance with rent, security deposits or utilities can be provided for certain homeless persons who are not recipients of above programs.\n\nbusiness hours: Mon - Fri 8:15am - 6:00pm"
  },
  {
    "addressLine1": "87 E High St",
    "city": "Somerville",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08876",
    "name": "Samaritan Homeless Interim Program - Emergency Shelter Rent Assitance",
    "organization": "Samaritan Homeless Interim Program - Emergency Shelter Rent Assitance",
    "phone": "(908) 393-9545",
    "website": "http://www.ship908.com/",
    "description": ""
  },
  {
    "addressLine1": "378 Lakehurst Road",
    "city": "Brown Mills",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08068",
    "name": "Christian Caring Center",
    "organization": "Christian Caring Center",
    "phone": "(609) 893-0700",
    "website": "https://www.christiancaringcenter.net/",
    "description": ""
  },
  {
    "addressLine1": "96 Rancocas Rd.",
    "city": "Mount Holly",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08060",
    "name": "The Affordable Homes Group",
    "organization": "The Affordable Homes Group",
    "phone": "(609) 261-4571",
    "website": "http://www.affordablehomesgroup.com/",
    "description": "Housing Service and assistance to homeless, seniors who need housing and low income residents.\n\nContact during office hours: Mondays through Fridays 8:30am to 5pm.\n\nTo be eligible for services:\n- Homeless Shelter - Must be referred by the Burlington County Board of Social Services\n- Senior Housing Program - Burlington County residents ages 62 years and older. Limited space available to adults ages 55 and older.\n\n- Affordable Housing - Burlington County residents that meet income eligibility requirements. Call for information."
  },
  {
    "addressLine1": "275 Holeman Street",
    "city": "Mount Holly",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08060",
    "name": "The Extended Hand Ministries Shelter",
    "organization": "The Extended Hand Ministries Shelter",
    "phone": "(609) 914-4270",
    "website": "http://www.theextendedhandministry.org/",
    "description": "Shelter\nThe emergency shelter can house up to 8 single men and 3 single women temporarily to allow our clients to seek employment, housing, social services so as to better their lives.\n \nWhen the county declares a state of emergency such as \"extreme weather condition\" (code blue), the shelter provides bedding space in the dining room and church sanctuary. Many winter days, we allow our clients to remain at the shelter even though \"an emergency\" has not been called by the county.\n\n\nThe Extended Hand Ministries, Inc. Shelter was founded in 2001 in response to growing numbers of homeless persons and families in Burlington County and the need for a more comprehensive approach to serving them. At that time The Extended Hand Ministries, Inc. introduced a major innovation in the social service field. Instead of remaining in emergency shelters or transitional housing for extended periods, homeless families should be relocated into permanent, affordable housing as quickly as possible. The Extended Hand Ministries, Inc. provides case management services for up to one full year, to help people transition to stability. The Extended Hand Ministries, Inc. has been providing 24 hours and 7 days a week shelter and assistance to the homeless. At this time we are accepting homeless veterans only."
  },
  {
    "addressLine1": "PO Box 1327",
    "city": "Camden",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08105",
    "name": "A Gift From God Ministries",
    "organization": "A Gift From God Ministries",
    "phone": "(267) 290-5001",
    "website": "mailto:agiftfromgod1@aol.com",
    "description": "A Gift From God Transitional Home is for single women and women with children up to the age of 11. Each women will occupy a fully furnished room and share a bathroom and kitchen (one on each floor). For more information please feel free to contact us at 267-290-5001"
  },
  {
    "addressLine1": "520 Market St, Room 220",
    "city": "Camden",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08101",
    "name": "Bureau of Senior & Emergency Services, Camden City",
    "organization": "Bureau of Senior & Emergency Services, Camden City",
    "phone": "(856) 757-7056",
    "website": "https://www.facebook.com/Camden-County-Sheriffs-Office-180878395428311/",
    "description": "The Bureau of Senior and Emergency Services, (formerly Office on Aging), provides activities and programs for the health and welfare of senior residents of Camden City. They also provide direct assistance and referrals to residents who have met with a catastrophe, are homeless or potentially homeless, or need assistance in dealing with the predicaments of poverty."
  },
  {
    "addressLine1": "816-820 N 5th St",
    "city": "Camden",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08102",
    "name": "Path Homeless Services Day Shelter",
    "organization": "Path Homeless Services Day Shelter",
    "phone": "(856) 365-6597",
    "website": "",
    "description": "DESCRIPTION: Path is a day center for homeless males providing AIDS awareness and testing, case management, showers, laundry, substance abuse counseling, information and referral, outreach, client advocacy, clothing bank and limited transitional housing.\n\nOvernight services available October to April only from 7pm-7am seven days a week providing low demand emergency shelter for single adults.\n\nBusiness Hours\n8:30am-4:30pm Mon-Fri (Overnight shelter services open during winter months only - usually October-April from 7pm-7am)\n\n"
  },
  {
    "addressLine1": "408 Line St",
    "city": "Camden",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08103",
    "name": "Anna Sample Family Shelter - Volunteers of America Delaware Valley",
    "organization": "Anna Sample Family Shelter - Volunteers of America Delaware Valley",
    "phone": "(856) 963-0430",
    "website": "https://www.voadv.org/family-shelters",
    "description": "Emergency housing to women, children, and families experiencing homelessness.\n\nThe Anna M. Sample House has 93 beds and on-site support provided twenty-four hours a day, seven days a week. Volunteers of America Delaware Valley recognizes homelessness is a disruptive and often traumatic event, and that families with children are uniquely impacted. As such, the professional staff at Anna M. Sample House is highly skilled and trained in mobilizing the resources, services, and supports individuals and families need to re-establish stability and wellness.\n\n\nEligibility: Single women and families entering the Anna M. Sample House are typically referred and funded via their local board of social services. However, Anna M. Sample House also provides accommodations to individuals and families who find themselves in emergency situations."
  },
  {
    "addressLine1": "720 washington",
    "city": "Camden",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08103",
    "name": "The Butterfly Program",
    "organization": "The Butterfly Program",
    "phone": "(856) 246-1631",
    "website": "http://thebutterflyprogram.webs.com/",
    "description": "The Butterfly Program Inc, which is a 501(c) (3) nonprofit organization in Camden, NJ, was created to assist citizens living in poverty and hardship to make a positive change in the community. Our mission is to cultivate, develop and empower those who want a better life in society. However, we will ensure a positive impact not only in the individuals, but the community. The assessments of each clients will determine their needs as the following: Shelter, food, identification, education, job development, transportation, health, spiritual, anger management, substance abuse, mental & physical abusive, and family. It is TBP job to work towards re-establishing an individual to be self sufficient so; they can make a positive impact in society. We have many programs to offer ideas and help in many different areas.\nEmpowering Women to stand, Inner City Boys, Inner City Girls, Re-Entry, Community Service, Feeding Program, Life Skills Program, Dress for Success, Healing Poverty, Transportation, Drug Rehabilitation, Anger Management, Job Training, Literacy Program and Spiritual Guidance\n\n\nAll of our services are free of charge and we are asking for donations to help in the fight against poverty. By contributing towards The Butterfly Program you can help save lives immeasurably and restore a community. Also, for your support you will receive free advertising and promotion for your company in our community!"
  },
  {
    "addressLine1": "271 Atlantic Ave",
    "city": "Camden",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08104",
    "name": "Aletha R. Wright Vision of Hope Center",
    "organization": "Aletha R. Wright Vision of Hope Center",
    "phone": "(856) 966-0909",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "321 Willing's Alley",
    "city": "Philadelphia",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "19106",
    "name": "Old St Joe's Homeless Outreach",
    "organization": "Old St Joe's Homeless Outreach",
    "phone": "(215) 923-2381",
    "website": "http://oldstjoseph.org/",
    "description": "Provides a homeless outreach center for those in Philadelphia. This is an outreach ministry.\n\nProgram Services and hours:\nTuesday and Thursday\n11:30 Noon Lunch\n1:30 Life Recovery\n2:30 Free Time\n5:30 Evening Meal (formerly known as Carewalk)\n\nSaturday\n11:30 Noon Lunch\n1:30 Spirituality\n"
  },
  {
    "addressLine1": "3 Wing Drive, Suite 245",
    "city": "Cedar Knolls",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07927",
    "name": "Homeless Solutions, Inc.",
    "organization": "Homeless Solutions, Inc.",
    "phone": "(973) 993-0900",
    "website": "https://homelesssolutions.org/",
    "description": " We provide four separate Shelter Programs, a Transitional Housing Program, and The Mt. Kemble Home, a program for senior women of limited means.\nFamily & Single Womens Program\n\nThe Family Shelter Program for women and their children provides case management, independent living skills training, parenting education, counseling, linkages to medical care, child care, and transportation. Over 50% of those entering the shelter are survivors of domestic violence. Ten families can be sheltered at a time. Approximately 25 30 families, including over 60 children and 47 single women are served each year.\n\n\nSingle Mens Program\n\nHomeless Solutions is able to provide shelter for as many as 25 homeless men at one time with about 100 men served annually. The Mens Shelter Program provides case management services; money management training, and assists with benefits enrollment and placement in permanent housing. This Program serves about 115 men each year.\n\nSafe Haven Program\n\nThe Safe Haven Shelter Program, in partnership with the Mental Health Association, provides shelter and services for homeless people with a mental health diagnosis. This is the only program of its kind in the state, and we can house up to 20 men and women, providing case management and outreach services.  Annually, Safe Haven shelters 50 60 individuals.\n\nTransitional Housing Program (THP)\n\nHomeless Solutions Transitional Housing Program offers support and training to families who are making the move to independence. In order to eradicate the underlying issues associated with recurring homelessness, structured supervision is provided to foster self-sufficiency. The participants are housed in ten self-contained apartments.\n\n \nFamily Supportive Housing Program (Outreach)\n\nWhen participants move out of THP, they are given the opportunity to enroll in HSIs Family Supportive Housing Program, also known as Outreach. This Program provides follow up case management services for two-years following their exit. These families can continue to attend educational workshops and participate in the seasonal item distributions. The goal of this program is to ensure that they remain housed and do not cycle back into homelessness.\n\nThe Mt. Kemble Home in Morristown was founded in 1883 to provide affordable housing for senior women of limited means   The Home is listed on national and state historic registers, in part due to its unique, purpose-built social mission. Unfortunately, due to mounting financial pressures and other organizational challenges, it was in danger of having to close.\n\n\nThe HSI Board and staff knew that if this happened, the 19 residents there would struggle to find safe, decent housing so we worked with the Board of The Mt. Kemble Home and decided that the best outcome would be for HSI to take over The Mount Kemble Home.\n\nEffective May 1, 2013, The Mt. Kemble Home moved under the HSI umbrella, and we are happy to be able to include The Home as one of our programs providing shelter, housing, and supportive services to low-income people.  We hosted a ribbon cutting in January of 2017 on our completed extensive, multi-phased renovation.  Due to our renovation, The Home now houses 22 residents.\n\n"
  },
  {
    "addressLine1": "95 Spring St",
    "city": "Morristown",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07960",
    "name": "The Salvation Army, Childcare Center, Social Services & Church",
    "organization": "The Salvation Army, Childcare Center, Social Services & Church",
    "phone": "(973) 539-2700",
    "website": "https://easternusa.salvationarmy.org/new-jersey/morristown/",
    "description": "Short-term, non-permanent emergency assistance, including food, and utility and rental assistance, first months rent to individuals, families, and groups unable to provide such services for themselves. Participant in NJ Shares. Referrals to service units for those outside of Morristown area. Towns served: Cedar Knolls, East Hanover, Jefferson Twp, Morris Plains, Mount Freedom, Parsippany, Convent Station, Green Village, Ironia, Mendham, Morristown, New Vernon, Whippany.\n\n9 am - 4 pm, Mon; 2 pm - 4 pm, Fri; Food Assistance: 2 pm - 4 pm, Mon, Wed, Fri."
  },
  {
    "addressLine1": "51 Washington St",
    "city": "Morristown",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07960",
    "name": "Our Place Day Shelter",
    "organization": "Our Place Day Shelter",
    "phone": "(973) 539-9920",
    "website": "",
    "description": "A multi-service daytime drop-in-center for the homeless and poor. We provide a legal address for people to use to apply for social services, jobs, register to vote or personal reasons. We also provide free use of the telephone for both outgoing and incoming calls. Our goal is to empower people to become self-sufficient and independent. This is done through counseling, referrals to appropriate agencies, providing emergency clothing, hygiene products, transportation to social services, and most of all welcoming everyone no matter what one's life situation may be at that moment in time. Our Place offers coffee, tea, light refreshments, use of restroom and a safe place to go during the day to rest, and be treated with dignity and respect by all as we are one \"family\".\n\nbusiness hours: 8 am - 11:30 am and 2 pm - 4 pm, Mon - Fri\n"
  },
  {
    "addressLine1": "9 Market Street",
    "city": "Morristown",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07960",
    "name": "Market Street Mission Shelter of Morristown",
    "organization": "Market Street Mission Shelter of Morristown",
    "phone": "(973) 538-0431",
    "website": "https://www.marketstreet.org/",
    "description": ""
  },
  {
    "addressLine1": "89 First Street",
    "city": "Clifton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07011",
    "name": "Hope Through Care",
    "organization": "Hope Through Care",
    "phone": "973-262-5616",
    "website": "https://www.hopethroughcare.org/",
    "description": "Transitional housing. Aimed at homeless families with children transitioning into independent living.\n\nHope through Care, Inc. is an independent, non-profit organization that serves families with children in Passaic County community of Northern New Jersey.\n\nThe objectives are:\n    to work individually with each family\n    to help families to find an affordable, permanent housing\n    to improve parenting skills\n    to provide opportunity for education\n    to move families toward financial independence\n    to encourage parents to play an active role in their children's lives through activities intended to promote family participation\n    to help children with homework through individual tutoring sessions provided by a local library,Tri-County Youth Services, Inc. and our volunteers\n\n    to provide extracurricular activities such as swimming, cooking, arts and crafts; karate, dance and music lessons sponsored by the local Rotary Club of Clifton, the Clifton Boys and Girls Club and private donors\n    to sponsor day trips for whole families to parks, museums, concerts and movies\n    to place children in summer camps through the \"Royal Family Kids' Camp\"and \"Northern Frontier\" boys' camp\"."
  },
  {
    "addressLine1": "41 Myrtle Ave",
    "city": "Passaic",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07055",
    "name": "Community Service Program Assistance",
    "organization": "Community Service Program Assistance",
    "phone": "(973) 472-2478",
    "website": "",
    "description": "Homelessness prevention activities include rental assistance to those who are eligible (funding permitting), vouchers for emergency hotel or rooming house shelter, and the Specialized Shelter Program. There are twenty-eight units for single people and some social services are provided to residents.\n\nIncome must be within the poverty guidelines.\n\nbusiness hours: 9 am - 5 pm, Mon-Fri\n\nPassaic City Residents only"
  },
  {
    "addressLine1": "801 Burlington Ave",
    "city": "Delanco",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08075",
    "name": "Emergency Services of Catholic Charities",
    "organization": "Emergency Services of Catholic Charities",
    "phone": "(856) 764-6940",
    "website": "https://www.facebook.com/catholiccharitiesusa",
    "description": "24 hour, 7 days a week emergency shelter program. After-hours calls taken by CONTACT and referred to caseworker.\n\nEmergency Services is an anti-poverty program providing for basic needs: food,clothing and shelter. Services provided include food pantry, recycled clothing, small household items, emergency motel shelter placement, assistance with delinquent rent/mortgage and utility payments.\n\n\nNJ Shares utility applications, assistance with first month's rent, holiday programs, advocacy, information and referral, financial literacy education for consumers receiving prevention payments.\n\nWalk-in for food, clothing, shelter. Appointment necessary for financial assistance.Service Hours: Walk-ins Mon-Fri 9:30-11:00am 1:30-3:30pm Food Pantry hours; Mon, Wed, Thurs 9:30am-11:00am and 1:00pm-4:00pm; Tues 9:3"
  },
  {
    "addressLine1": "7 Library Way",
    "city": "Levittown",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "19058",
    "name": "Bucks County Emergency Homeless Shelter",
    "organization": "Bucks County Emergency Homeless Shelter",
    "phone": "(215) 949-1727",
    "website": "http://www.fsabc.org/",
    "description": "Emergency shelter for families and individuals; case managers assist with needed services; Provides emergency shelter, food, clothing and general information referrals. The shelter can house up to 85 men, women and children.\n\nHours: 24 hours a day, seven days a week\n\nShelter is Free of Charge.\n\nOn-Site Services\n    Case management\n    Job search and preparation resources\n    Budget planning\n    Health evaluations, screenings and referrals\n    Outpatient counseling\n    Transportation to doctors' appointments, job interviews and summer camp for children"
  },
  {
    "addressLine1": "300 Central Ave",
    "city": "East Orange",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07018",
    "name": "Path - Homeless Case Management",
    "organization": "Path - Homeless Case Management",
    "phone": "(973) 266-4481",
    "website": "https://twitter.com/EOG_Hospital",
    "description": "Agency: East Orange General Hospital.\nHomeless case management services for patients residing in Essex County who suffer from mental illness. Patient advocates and linkages to financial, medical and psychiatric services provided."
  },
  {
    "addressLine1": "50 S Clinton Ave, Suite 5400",
    "city": "East Orange",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07018",
    "name": "Essex County Citizen Service - Emergency Assistance",
    "organization": "Essex County Citizen Service - Emergency Assistance",
    "phone": "(973) 395-8400",
    "website": "",
    "description": "This Division serves as the County's anti-poverty agency and provides a number of valuable emergency assistance and social services to individuals facing crisis situations.\n\nThis Division:\nOffers Emergency and Home Energy Assistance (NJ Shares)\nPromotes Homelessness Prevention\nOffers Basic Social Services\nOffers Tenant Counseling\nProvides Advocacy to Essex County Residents\n\nBusiness Hours\nMon - Fri 9:00am - 3:00pm\n\n"
  },
  {
    "addressLine1": "12 Myrtle Avenue",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07103",
    "name": "Emergency Housing Services/ Urban Renewal Corp Myrtle Avenue",
    "organization": "Emergency Housing Services/ Urban Renewal Corp Myrtle Avenue",
    "phone": "(973) 808-9300",
    "website": "http://www.urbanrenewal.org/",
    "description": "This is a 21 bed facility open to women who are homeless or in the need of housing."
  },
  {
    "addressLine1": "89 Truman Drive",
    "city": "Edison",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08817",
    "name": "Ozanam Family Shelter",
    "organization": "Ozanam Family Shelter",
    "phone": "(732) 985-0327",
    "website": "https://ccdom.org/middlesex-ozanam-family-shelter",
    "description": "Emergency Shelter for Women and Children.\n\n\n\nOzanam Family Shelter in Edison provides emergency shelter for 16 single women and 26 families. The facility has 14 emergency shelter beds and 26 transitional housing beds. While living in the shelter, program residents work with case managers to improve their earning capacity and obtain permanent housing.\n\n\n\nServices: Homeless families and single women, temporary and emergency lodging, meals, physical and mental health assessments, crisis counseling, assistance with housing, employment and children's educational placement, case management and referrals.\n\n\n\n\nEligibility Criteria: Applicants must be homeless in Middlesex County, be willing to answer questions during screening process, agree to refrain from use of alcohol and other drugs, be able to take care of themselves, be willing to abide by shelter rules, and may not be a threat to themselves, staff or other residents. Former shelter residents may be denied subsequent placement if they refused to abide by shelter rules in previous stays, and show no evidence of change.\n\n\n\nWait List: Waiting list is maintained when capacity census is reached. Persons on waiting list are asked to call daily for an update of space availability. Families in need of immediate lodging may be given a motel placement by welfare of the Hotline funds when possible."
  },
  {
    "addressLine1": "22 Abeel Street",
    "city": "New Brunswick",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08901",
    "name": "Ozanam Men's Shelter",
    "organization": "Ozanam Men's Shelter",
    "phone": "(732) 729-0850",
    "website": "http://www.ccdom.org/residential-housing-shelters/shelters-transitional-housing",
    "description": "Emergency Shelter Men only.\n\nServices: Homeless men, temporary and emergency lodging, meals, physical and mental health assessments, crisis counseling, assistance with housing and employment, case management and referrals.\n\nEligibility Criteria: Applicants must be homeless in Middlesex County, be willing to answer questions during screening process, agree to refrain from use of alcohol and other drugs, be able to take care of themselves, be willing to abide by shelter rules, and may not be a threat to themselves, staff or other residents. Former shelter residents may be denied subsequent placement if they refused to abide by shelter rules in previous stays, and show no evidence of change.\n\n\nWait List: Waiting list is maintained when capacity census is reached. Persons on waiting list are asked to call daily for an update of space availability. Families in need of immediate lodging may be given a motel placement by welfare of the Hotline funds when possible."
  },
  {
    "addressLine1": "118 Division St",
    "city": "Elizabeth",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07201",
    "name": "Elizabeth Coalition to House the Homeless",
    "organization": "Elizabeth Coalition to House the Homeless",
    "phone": "(908) 355-2060",
    "website": "http://www.theelizabethcoalition.org/",
    "description": "The mission of the Elizabeth Coalition to House the Homeless is to ensure that homeless individuals and families, and those persons who imminently face homelessness in Union County:\n\nObtain safe, sanitary, and adequate temporary or emergency shelter;\n\n\nAre provided with a full and fair opportunity to secure safe, decent, affordable, permanent housing;\n\nAre treated with dignity and respect by all throughout the process of obtaining shelter and/or permanent housing;\n\nAre advocated for and protected from discrimination as they assert their civil and constitutional rights;\n\nAre assisted in their effort to self-advocate and are empowered to become self-sufficient.\n\nThe homeless advocacy program intercedes on the behalf of the homeless individual or homeless family to ensure all possible entitled benefits or programs that might render assistance are received. If a situation is legal in nature, then the appropriate referral will be given.\n\nTelephone or walk-in for more information.\n\nbusiness hours: Mon - Fri 9:00am - 4:00pm.\n\nOther Services provided at this location:\nThe homeless transitional housing program offers individuals that are between temporary shelter and permanent housing a place to live. The residence provides 16 beds.\n\nEmergency Warm Shelter. An emergency winter shelter open December through March."
  },
  {
    "addressLine1": "144 Madison Ave",
    "city": "Elizabeth",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07201",
    "name": "YMCA of Eastern Union County Shelter",
    "organization": "YMCA of Eastern Union County Shelter",
    "phone": "(908) 355-9622",
    "website": "https://www.facebook.com/ymcaelizabeth/",
    "description": "Shelter for single men age 18 and over and female heads of household families. Services provided are emergency food, housing search, referrals to medical and counseling services.\n\nHomeless female head of household must be referred by the Division of Social Services. Single men over 18 years old.\n\n\nReferrals from Union County Division of Social Services; walk-ins for private pay"
  },
  {
    "addressLine1": "1018 E Grand St",
    "city": "Elizabeth",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07201",
    "name": "Salvation Army Emergency Shelter - Elizabeth Shelter",
    "organization": "Salvation Army Emergency Shelter - Elizabeth Shelter",
    "phone": "(908) 352-2886",
    "website": "http://newjersey.salvationarmy.org/NewJersey/homeless",
    "description": "Emergency shelter for single adults. 45 bed capacity. Also provides additional supportive services to facilitate independence and self sufficiency."
  },
  {
    "addressLine1": "4 Gary Rd",
    "city": "Union",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07083",
    "name": "Salvation Army Emergency Assistance",
    "organization": "Salvation Army Emergency Assistance",
    "phone": "(908) 851-9300",
    "website": "https://twitter.com/salvationarmynj",
    "description": "Short term emergency assistance to individuals, families or groups.\n\nEligibility\nLow income individuals - people in need especially those who fall through the cracks\n\nBusiness Hours\n8:30 am - 4 pm, Mon - Fri. 24 hours emergency access by volunteer not client\n\n"
  },
  {
    "addressLine1": "47 E Main St",
    "city": "Flemington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08822",
    "name": "SAFE in Hunterdon Women's Domestic Violence Shelter",
    "organization": "SAFE in Hunterdon Women's Domestic Violence Shelter",
    "phone": "(908) 788-7666",
    "website": "http://safeinhunterdon.org/",
    "description": "Safe house for women who are victims of domestic violence.\nServing women, men and families in crisis. Programs available:Emergency safe house; legal advocacy, individual counseling & support groups, crisis intervention teams, domestic violence & sex education"
  },
  {
    "addressLine1": "427 Homstead Rd",
    "city": "Hillsborough",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08844",
    "name": "Resource Center of Somerset",
    "organization": "Resource Center of Somerset",
    "phone": "(908) 359-0003",
    "website": "https://www.facebook.com/safesoundsomerset/",
    "description": ""
  },
  {
    "addressLine1": "103 North Main Street",
    "city": "Forked River",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08731",
    "name": "Vetwork - A Program of Vetgroup Inc.",
    "organization": "Vetwork - A Program of Vetgroup Inc.",
    "phone": "(609) 971-7613",
    "website": "",
    "description": "Emergency Shelter"
  },
  {
    "addressLine1": "509 MAIN ST",
    "city": "Lanoka Harbor",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08734",
    "name": "Grace Initiatives/Grace's Place - Maternity Housing",
    "organization": "Grace Initiatives/Grace's Place - Maternity Housing",
    "phone": "(609) 661-9390",
    "website": "http://www.graceinitiatives.org/",
    "description": ""
  },
  {
    "addressLine1": "48 Wyker Rd",
    "city": "Franklin",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07416",
    "name": "Samaritan Inn Emergency Homeless Shelter Program",
    "organization": "Samaritan Inn Emergency Homeless Shelter Program",
    "phone": "(973) 827-8911",
    "website": "",
    "description": "Caller must be homeless in Sussex County and not have access to any other resource)financial or friends who can provide temporary shelter until business hours); must have valid identification; must be over 18 years old; assessed to be psychiatrically, medically and cognitively stable and self sufficient, and does not require supervision or place others at risk. Domestic Violence callers are referred to DV shelters that can provide support and security. *Adults without minors are not sheltered between May-October due to limited funding. All family members must agree to rules of program.\n\nContact office or hotline for a telephone Intake. Caller must be willing to remain at an unblocked telephone number while worker makes arrangements for shelter.\n\n\nM-F (9:00am - 5:00pm) Evenings, Weekends and Holiday contact hotline for service."
  },
  {
    "addressLine1": "83 Spring St",
    "city": "Newton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07860",
    "name": "Sussex County Homelessness Program",
    "organization": "Sussex County Homelessness Program",
    "phone": "(973) 383-3600",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "355 Union St",
    "city": "Glassboro",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08028",
    "name": "Eleanor Corbett House - Safe Haven For Women",
    "organization": "Eleanor Corbett House - Safe Haven For Women",
    "phone": "(856) 881-5550",
    "website": "https://www.voadv.org/family-shelters",
    "description": ""
  },
  {
    "addressLine1": "392 Main Street",
    "city": "Hackensack",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07601",
    "name": "Bergen County Community Action Crisis Services",
    "organization": "Bergen County Community Action Crisis Services",
    "phone": "(201) 968-0200",
    "website": "http://www.greaterbergen.org/",
    "description": "The 1st Stop Program provides a single point of entry for low-income families to access life changing public benefits. Available services include comprehensive needs assessment, benefit screening, information and referral, case management. advocacy, counseling and follow-up.\n\nServices Include:\nHomelessness Prevention\nHome Energy Assistance\nPublic Entitlements\nCredit Union Loans and Banking Services\nFinancial Literacy\nHead Start and Infant, Toddler Child Care\nHealth Care and Health Literacy\nWeatherization\n\nCall for appointment\n\nFor low-income individuals and families"
  },
  {
    "addressLine1": "120 South River Street",
    "city": "Hackensack",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07601",
    "name": "Bergen County Human Services Center",
    "organization": "Bergen County Human Services Center",
    "phone": "(201) 336-6475",
    "website": "http://www.co.bergen.nj.us/index.aspx?NID=525",
    "description": "Services Provided:\nTemporary Shelter\nHousing\nMeals\nLinks to Community Services\nHealth Services\n\nThe center is designed to serve individual men and women who are homeless, individuals and families who are precariously housed, and others who require linkage to community services.\n\nIndividuals and families who are not homeless, but need health and human services are assisted to make direct contact with agencies that can respond to their need.\n\n\nThe center has a 90-bed temporary shelter capacity, 62 of which are in bedrooms that accommodate from two to eight individuals, and 28 are dormitory style. In addition, there is a seasonal (December 15 to March 14) sit-up shelter for 15 individuals.\n\nThe center receives referrals for temporary shelter from community agencies, religious institutions, and law enforcement agencies. Those referred to the center may have a history of substance abuse, physical and mental health problems, and unemployment, in addition to homelessness. Referral forms are required from community-based programs such as hospitals, health centers, mental health centers, and the jail.\n\nBreakfast, lunch, and dinner are provided to guests of the temporary shelter. Lunch and dinner are provided daily for individuals and families at risk of homelessness who live in the community.\nLunch: 11:30 a.m. - 12:30 p.m.\nDinner: 5:00 p.m. - 6:30 p.m.\n\nEfforts to place clients in permanent rental housing begin immediately following client assessment. The center maintains relationships with real estate agents and landlords for placement. When a housing placement is arranged a neighborhood based team provides service coordination and follow-up.\n\nThe center is establishing relationships with health and human service agencies to provide financial resources necessary to support housing placement or emergency financial assistance to individuals and families in proximate danger of becoming homeless."
  },
  {
    "addressLine1": "435 Main Avenue",
    "city": "Paterson",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07501",
    "name": "Passaic County Interfaith Hospitality Network",
    "organization": "Passaic County Interfaith Hospitality Network",
    "phone": "",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "650 Rahway Avenue",
    "city": "Woodbridge",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07095",
    "name": "Trinity Soup Kitchen (Woodbridge) Trinity Episcopal Church",
    "organization": "Trinity Soup Kitchen (Woodbridge) Trinity Episcopal Church",
    "phone": "(732) 634-7422",
    "website": "https://www.trinitywoodbridge.org/",
    "description": "Food"
  },
  {
    "addressLine1": "PO Box U",
    "city": "Hewitt",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07421",
    "name": "Strengthen Our Sisters Emergency Shelter",
    "organization": "Strengthen Our Sisters Emergency Shelter",
    "phone": "(973) 728-0902",
    "website": "http://www.strengthenoursisters.org/",
    "description": "Provides emergency and transitional shelter programs for homeless and/or battered women and children. Transportation (including Freedom Drive to transport TANF recipients to work) and a range of case management services are available, including child care, welfare to work program, positive parenting, Start Ahead program (for pregnant women and new mothers), legal, housing, and welfare advocacy, counseling, drug and alcohol programs, computer training, Cars for Success program, and self-help workshops. Welcomes donations of cars (offers tax write-off) and computers.\n\nEligibility\nHomeless/battered women and their children"
  },
  {
    "addressLine1": "300 Bloomfield Street",
    "city": "Hoboken",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07030",
    "name": "The Hoboken Shelter",
    "organization": "The Hoboken Shelter",
    "phone": "(201) 656-5069",
    "website": "http://hobokenshelter.org/",
    "description": "Overnight shelter and meals.\n\n\nDrug & Alcohol Counseling,\n\nBudget Counseling,\n\nMedication Counseling, and\n\nEmergency Clothes.\n\n\n\nDinner is prepared & served to 100 guests nightly, by 6000 volunteers throughout the year. We always welcome new faces! We know you have lots of other obligations, so we give you the flexibility of coming any night that is convenient for you.\n"
  },
  {
    "addressLine1": "615 Grove Street",
    "city": "Jersey City",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07310",
    "name": "St Lucy's Homeless Shelter",
    "organization": "St Lucy's Homeless Shelter",
    "phone": "(201) 653-3366",
    "website": "",
    "description": "Staff on-site 24 hours a day, 7 days a week.\n\nShelters has beds for 60 men & 20 women, also shelters 25 extras from Outreach program with Port Authority.\n\nSt. Lucy's Emergency Shelter is a supervised 24-hour, 7-day-a-week, year-round emergency shelter facility for single women and men offering emergency housing and food for those in need. Within the first week, clients meet with staff to assess their current situation. Once their needs are determined, clients are referred to one or more of the following services: welfare, SSI, unemployment, job training and job search, education and mental-health/addiction-treatment programs. The shelter provides two meals a day, clothing as well as a shower program and outreach services for the unsheltered homeless."
  },
  {
    "addressLine1": "175 (Munn) Pastor Vann L Lowery Sr Avenue",
    "city": "Irvington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07111",
    "name": "Gospel Services Benevolent Society Inc",
    "organization": "Gospel Services Benevolent Society Inc",
    "phone": "(973) 375-8900",
    "website": "mailto:gospelservices@aol.com",
    "description": "70 bed Men/Women ages 18+ double/triple room occupancy, newly installed handicap accessible elevator,24 hour staff & surveillance system, free laundry service, internet access, etc."
  },
  {
    "addressLine1": "70 Ellis ave",
    "city": "irvington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07111",
    "name": "Village for Humanity Homeless Services",
    "organization": "Village for Humanity Homeless Services",
    "phone": "(973) 399-1393",
    "website": "mailto:km@villageforhumanity.org",
    "description": "A village for humanity provides men whom have in some way lost their footing an opportunity to re-establish and/or find their proper place in society by providing the basic necessity of supportive and stable housing.In our residential facility, we offer comprehensive services in a \"homey\" yet structured environment that fosters the development of social,family and employment skills in an atmosphere of camaraderie,understanding,dignity and respect. A non-profit organization with the over all goal of promoting productive citizenship through self-improvement,personal responsibility and community awareness,village for humanity is a place where real commitment to change is realized."
  },
  {
    "addressLine1": "712 Springfield Ave",
    "city": "newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07103",
    "name": "ANSWERS Moving Forward Inc.",
    "organization": "ANSWERS Moving Forward Inc.",
    "phone": "(973) 416-2679",
    "website": "https://essexcountynj.org/ceas_directory/answers-moving-forward/",
    "description": "ANSWERS Moving Forward (AMF) is a nonprofit corporation formed to serve the male population in need of temporary shelter. Our facility is centrally located in Newark and is close to mass transportation\nWe provide a clean and safe environment for our residents. We specifically focus on the clients need to re-entry society in a forward moving position."
  },
  {
    "addressLine1": "689 South 16th Street",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07103",
    "name": "Emergency Housing Services/ Urban Renewal Corp South 16th Street",
    "organization": "Emergency Housing Services/ Urban Renewal Corp South 16th Street",
    "phone": "(973) 483-2882",
    "website": "http://www.urbanrenewal.org/",
    "description": "Emergency Services\n973-483-2882\n\nCurrently URC maintains over 600 beds in 9 facilities servicing emergency, transitional, and permanent housing needs.\n\nSocial Services\nURC offers a broad-based menu of social service programs. These include prompt intake and evaluation of referred persons, emergency and short-term housing, and the services of trained, qualified case managers who coordinate all community services.\n\nServices Include:\n- Substance Abuse: Referrals to substance abuse assessment; individual/group substance abuse counseling; referrals to detox and rehab programs; and referrals to aftercare. Many of our clients have complex substance abuse and mental health problems. Urban Renewal recognizes the need for specialized training and counseling for these individuals and utilizes its own on-site certified alcohol and drugcounselors to provide customized programs to fit the needs of each client. We are committed to provide the education and therapy needed to manage substanceabuse difficulties of each student.\n- Mental Illnesses: Mental health screening and referrals to appropriate treatment providers; assistance in acquiring necessary medication; transportation to mental health appointments; and monitoring for compliance with treatment protocols.\n\n- Physical Health: Includes a clean, safe living environment and an on-site gym/health club in URCs main emergency housing facility; an in-house medical clinic with referrals and transportation to outside care providers; HIV screening and prevention counseling; protection from harm within the facility by round-the-clock security personnel with security cameras and monitors throughout the building; and training in basic hygiene practices and nutrition to promote healthy habits.\n- Basic Needs: Assistance with nutrition; clothing; and essentials for permanent housing.\n- Case Management Services: Includes client-centered treatment plans and close monitoring of progress toward client-selected milestones. Case management includes assessment; planning; linking; monitoring; and advocacy"
  },
  {
    "addressLine1": "55 Tillinghast Street",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07108",
    "name": "Circle of Life Shelter",
    "organization": "Circle of Life Shelter",
    "phone": "(862) 763-4859",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "89 York Street",
    "city": "Jersey City",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07302",
    "name": "York Street Project",
    "organization": "York Street Project",
    "phone": "(201) 451-8225",
    "website": "https://yorkstreetproject.org/",
    "description": "St. Joseph's Home is far more than a shelter. Here, the women of York Street Project in Jersey City, New Jersey are given the opportunity to take concrete steps towards attaining permanent housing while building independent lives for themselves and their families.\n\nOur Home, a five-story brownstone built and occupied by the Sisters of St. Joseph of Peace in 1891 and once operated as an orphanage, was renovated in 1988 to accommodate a transitional housing program for homeless women (18 years +) and their children (0-18 years of age).\n\nServices Provided\nAt St. Joseph's, each family gets its own private bedroom space -- with a lockable door. Our women share the common living space as well as responsibilities for the maintenance, cooking, and governance of their floor in preparation for the day when they will be living independently.\n\nOur Transitional Life Skills Enrichment program educates our women in parenting, career planning, legal advocacy, health, and financial and household management. Each woman also takes personal responsibility for her family's future by attending school, enrolling in a job-training program, or working.\n\n\nOn-site counseling, in the form of mental health and case management, is available to help our women and our children sort through their complex lives. Upon successful completion of our program, we recommend our women for a Section 8 Housing voucher, which subsidizes up to 70% of their rent. To ensure they keep that voucher for as long as they need, it is imperative that they are as ready as possible to succeed on their own."
  },
  {
    "addressLine1": "246 2nd St",
    "city": "Jersey City",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07302",
    "name": "Hope House Jersey City",
    "organization": "Hope House Jersey City",
    "phone": "(201) 420-1070",
    "website": "http://www.ccannj.com/hope_house.php",
    "description": "Catholic Charities of the Archdiocese of Newark\n\nStaff on-site 24 hours a day, 7 days a week.\n\nHope House, an emergency shelter for homeless women with children, helps families become self-sufficient by giving them an opportunity for decision making and for assuming responsibility for improving their situation under the supervision, support, and guidance of shelter staff. Housing up to 20 mothers and their children, the program offers short-term supervised residence, including three meals a day, assessment/planning, case management, housing, education, food, and clothing.\nLocation"
  },
  {
    "addressLine1": "PO Box 510",
    "city": "Maplewood",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07040",
    "name": "Turning Point Community Services - Support Services",
    "organization": "Turning Point Community Services - Support Services",
    "phone": "(973) 374-7838",
    "website": "https://www.facebook.com/Turning-Point-Community-Services-Inc-460136737353742/",
    "description": "Emergency residence dedicated to the provision of housing and support services to homeless single women and their children.\nWe have NEVER accepted men in our facility. P\n\nOur primary mission commits us to empowering underserved individuals with an initial focus on homeless individuals and children -- especially those who have been victims of domestic violence. Our goal is to develop and implement programs that facilitate a person's ability to become self-sufficient by helping to break the cycles of violence, substance abuse, poverty, and incarceration that have permeated their lives and placed them at increased risk for homelessness"
  },
  {
    "addressLine1": "PO Box 70",
    "city": "Middletown",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07734",
    "name": "Family Promise of Monmouth County Food and Shelter Services",
    "organization": "Family Promise of Monmouth County Food and Shelter Services",
    "phone": "(732) 495-1050",
    "website": "https://familypromisemc.org/",
    "description": "Our mission is to provide food, shelter and comprehensive services to homeless families in Monmouth County in cooperation with a network of interfaith congregations, while advocating innovative solutions to chronic homelessness.\n\nShelter\nOur shelter network consists of 12 host congregations who house the guests for one week at a time on a rotating basis.  The host congregations give our families their own private spaces for sleeping.  Most set up a \"community room\" in which the families can congregate to play, watch movies or just chat.  They are served dinner prepared by a few of the up to 50 volunteers each host congregation uses during a hosting week.  Most host congregations are assisted by support congregations who provide volunteers, food, and financial support.\n\nFood\nEach congregation provides meals to Family Promise of Monmouth County guests.  The guests get dinner in the evening approximately a half hour after they arrive at the congregation.  Breakfast is served in the morning and the congregations provide food for the guests to take with them for lunch.  All of this cooking is done by the many wonderful volunteers who generously give of their time and resources to help our guests feel more at home.\n\nApplication Instructions\nTelephone assessment then in-person interview if necessary."
  },
  {
    "addressLine1": "P.O. Box 1494",
    "city": "Morristown",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07962",
    "name": "Interfaith Council for Homeless Families of Morris County",
    "organization": "Interfaith Council for Homeless Families of Morris County",
    "phone": "(973) 998-0820",
    "website": "https://www.familypromisemorris.org/",
    "description": "Interfaith Council for Homeless Families of Morris County (Interfaith Council) is a non-sectarian, not-for-profit organization dedicated to ending the crisis of homelessness faced by Morris County families by partnering with public and private agencies, religious congregations and community volunteers to provide shelter, case management and mentoring services leading to self-sufficiency."
  },
  {
    "addressLine1": "PO Box 312",
    "city": "New Brunswick",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08901",
    "name": "Women Aware - Domestic Violence Shelter",
    "organization": "Women Aware - Domestic Violence Shelter",
    "phone": "(732) 249-4504",
    "website": "http://www.womenaware.net/",
    "description": "Provides emergency shelter for victims of domestic violence and their children, 24 hour crisis intervention and hotline counseling, legal information and advocacy, public awareness and community education, support groups for battered women in two locations throughout the county.\n\nEligibility\nVictims of domestic violence and their children.\n\nHotline: 24 hours, 7 days Outreach: Mon - Fri 9:00am - 4:00pm"
  },
  {
    "addressLine1": "4 Roosevelt Ave",
    "city": "New Brunswick",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08901",
    "name": "Naomi's Way Transitional Housing",
    "organization": "Naomi's Way Transitional Housing",
    "phone": "(732) 565-7974",
    "website": "http://www.ccdom.org/",
    "description": "Naomi's Way, located in New Brunswick has 16 one or two bedroom units. The program offers support to homeless mothers who are employed or engaged in job training. Stays at Naomi's Way can last up to 24 months. While in residence, the women are provided with case management and life skills training.\n\nServices: Transitional housing for single women with children including case management and life skills training. 18 month limit.\n\n\nEligibility Criteria: Applicants must be homeless and accompanied by at least one child; must be involved in employment, education or vocational training; must be willing to answer questions during screening process; must be able to take care of themselves and their children; must be willing to abide by program rules and may not be a threat to themselves, staff or others. Applicants must exhibit a willingness and readiness to participate in the program, including on-going case management and life skills training.\n\nWait List: Waiting list is maintained when capacity census is reached. Persons on the waiting list are notified by phone when an opening becomes available."
  },
  {
    "addressLine1": "79 University Avenue",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07107",
    "name": "Goodwill Rescue Mission Inc.",
    "organization": "Goodwill Rescue Mission Inc.",
    "phone": "(973) 621-9560",
    "website": "https://www.grmnewark.org/",
    "description": "Here at Goodwill Rescue Mission on 79 University Avenue in Newark, NJ, we currently offer the following services to the poor and homeless:\n\n\n\nCompassionate Care:\n\n- Hot Meals: We are open to serve men, women and children lunch (12:00-12:30) and dinner (5:45-6:30) seven days a week. We also serve breakfast daily to our shelter guests and those participating in our residential programs.\n\n- Emergency Shelter & Showers: We have 43 beds available to shelter men every night for up to 7 seven nights. When the temperature falls below freezing, we make 100 beds available for men and the 7 night limit is temporarily lifted. Check-in every evening is at 6:30 pm.\n\n\n\nComprehensive Life Transformation:\n\n- Gateway: A 30 - 90 day residential discipleship program introducing and enabling access for up to 32 men to the longer term Going D.E.A.P.E.R. Program.\n\n- Going D.E.A.P.E.R. Program: Focused on Digging in, Embracing Accountability, Planning for the future, and Employment Readiness, this 9 - 12 month comprehensive residential life-transformation program is spiritually rich and vocationally focused to help up to 60 men rebuild their lives, their families, and their futures as productive members of the community."
  },
  {
    "addressLine1": "278 South Orange Avenue",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07103",
    "name": "Harmony House Transitional Living Facility",
    "organization": "Harmony House Transitional Living Facility",
    "phone": "(973) 623-8555",
    "website": "http://www.newcommunity.org/",
    "description": "Harmony House is a transitional housing program with the primary goal of helping families move from homelessness to permanent housing and from dependency to self- sufficiency.  With the capacity to house 102 families in individual apartment units and host of on-site social services,  Harmony House provides much more than a shelter.  It offers stability to families facing seemly insurmountable barriers and enables them to restore their lives.\nAs the largest transitional living facility in New Jersey, Harmony House has earned an excellent reputation for the array of effective and comprehensive services it provides to homeless families and children. Residents are encouraged \"and in many cases are required \"to take advantage of the childcare, job training and other resources available to them through the New Community network.\n\nThe length of stay at Harmony House is determined by individual circumstances but the average stay ranges from six to nine months.\n\nHarmony House Services Include:\nHousing and social services for teenage mothers\nAdvocacy\nCommunity resources linkage\nSupport groups\nLife skills workshops\nCounseling for all family members\nDay care and early childhood development\nAfter-school program\nSummer camp program\nRelocation Planning at Harmony House Includes:\nDeveloping a relocation plan\nApartment search\nIdentifying needed support resources\nQualifying for affordable housing\nContinuum of care services\n\n\nHarmony House --mother and baby with Ms. Lopez, Jan. 2013\nHarmony House\n(973) 623-8555\n278 South Orange Avenue\nNewark, NJ 07103\nHarmony House is a transitional housing program with the primary goal of helping families move from homelessness to permanent housing and from dependency to self- sufficiency.  With the capacity to house 102 families in individual apartment units and host of on-site social services,  Harmony House provides much more than a shelter.  It offers stability to families facing seemly insurmountable barriers and enables them to restore their lives.\nAs the largest transitional living facility in New Jersey, Harmony House has earned an excellent reputation for the array of effective and comprehensive services it provides to homeless families and children. Residents are encouraged \"and in many cases are required \"to take advantage of the childcare, job training and other resources available to them through the New Community network.\n\nThe length of stay at Harmony House is determined by individual circumstances but the average stay ranges from six to nine months.\nHarmony House Services Include:\nHousing and social services for teenage mothers\nAdvocacy\nCommunity resources linkage\nSupport groups\nLife skills workshops\nCounseling for all family members\nDay care and early childhood development\nAfter-school program\nSummer camp program\nRelocation Planning at Harmony House Includes:\nDeveloping a relocation plan\nApartment search\nIdentifying needed support resources\nQualifying for affordable housing\nContinuum of care services\n\n\nHarmony House Early Learning Center\nHarmony House Early Learning Center provides care and early education for children ages 3 months to 5 years old.  Many qualify for free care and schooling under the NJ Abbott. For more information, contact us at:"
  },
  {
    "addressLine1": "982 Broad Street",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07102",
    "name": "Newark Emergency Services for Families Inc",
    "organization": "Newark Emergency Services for Families Inc",
    "phone": "(973) 639-2100",
    "website": "http://nesfnj.org/",
    "description": "We provide support to individuals and families through programming in six areas: emergency services, workforce development, housing, prisoner re-entry, health, and family development. With intensive and holistic case management and our referral network, we help resilient individuals and families who face multiple barriers achieve self- sufficiency through earning a livable wage and securing a stable place to live.\n\nEmergency Services\nOur homeless Drop-In Center provides a safe and nurturing environment where homeless guests can take showers, receive light meals, wash clothes, use the telephone, access our food and clothing pantry, as well as linkages to emergency shelters and other supportive services.\nOur agency has an on-site food and clothing pantry where consumers can receive weather appropriate clothing, Food Assistance Program and food vouchers that helps to alleviate nutritional shortfalls in families that are food dependent .\n\nThrough our Rapid Re-Housing program eligible individuals and families experiencing homelessness and are living in transitional housing, emergency shelters, on the street or other places not fit for human habitation, can secure permanent housing.\n\nRe-Entry Services\nWe offer comprehensive re-entry services to the formally incarcerated. Our program includes long-term goal setting, intensive case management, linkages to in-house services and programs, job readiness programs, housing information, referrals to medical care and other counseling services as well as off-site referrals.\nHousing Services\nThrough our initial screening and assessment process, we provide supportive services to individuals and families experiencing financial hardships, such as; Rental Assistance Program, Security Deposit Assistance and utility assistance. NJ Shares Program utility assistance program provides assistance with PSE&G bills for residents throughout the State of New Jersey."
  },
  {
    "addressLine1": "257 Mt. Prospect Avenue",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07104",
    "name": "Peace House Inc.",
    "organization": "Peace House Inc.",
    "phone": "(973) 732-5129",
    "website": "mailto:Duru_ugol@yahoo.com",
    "description": "Peace House Inc. provides a temporary shelter for women who are homeless, released from substance abuse treatment programs or justice system. Women who are ready to make the transition to self-sufficiency and become productive members of society. Peace House Inc. is an eight bedroom home that house up to 12 women in the city of Newark, NJ. These women will be able to take the necessary steps towards enhancing and developing positive lifestyles along with moving towards independence.\n\nA typical stay for a family at the shelter is about 23 days; some stay longer, some leave earlier. About 92% of those women leaving the shelter are able to achieve emotional and economic independence from their perpetrator and begin their lives anew."
  },
  {
    "addressLine1": "269 Mount Prospect Ave",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07104",
    "name": "Helping The homeless III LLC",
    "organization": "Helping The homeless III LLC",
    "phone": "(973) 732-9200",
    "website": "mailto:shelteringpeople@aol.com",
    "description": "Open 24/7 Men & Women 18+ Walk in's accepted"
  },
  {
    "addressLine1": "24 Grant St.",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07104",
    "name": "Apostles' House Emergency Shelter",
    "organization": "Apostles' House Emergency Shelter",
    "phone": "973-482-0625",
    "website": "https://theapostleshouse.org/",
    "description": "42 bed facility that serves 3 meals daily for women & children only. Case management, parenting skills, and budget counseling. Substance abuse counseling and mental health services are available on site.\n\nMon - Fri 9:00am - 5:00pm Program Director 24 hours a day /7 days a week M-F 9:00am-5:00pm\n\nAlso provides a rooming house.\nProvides permanent and temporary residence for single men. 12 rooms are available. Dinner is served daily. Health management and budgeting services provided. Disabled men are welcome. Single men, ages 18 and over\n\nAlso provides an emergency shelter for families.\nEmergency Shelter for Families, Transitional Housing, Rooming House (Single Men), Food Pantry, Emergency Assistance, Family Preservation Services, Substance Abuse Counsel. Provides comprehensive social services for homeless & \"at risk\" families & individuals. Also provides security deposit assistance only. Referrals only (shelter, food pantry); walk-in (all other services). 8am-5pm"
  },
  {
    "addressLine1": "31 Fulton St",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07102",
    "name": "Shelter for Single Adults",
    "organization": "Shelter for Single Adults",
    "phone": "(973) 621-0181",
    "website": "",
    "description": "Thirty day emergency shelter for homeless single men and women. Residents must arrive by 5 pm an leave in the morning by 7 am. No meals provided.\n\nLanguages other than English: Spanish.\n\nEligibility:\nMen or women that are in need of shelter from Essex County with ID.\n\nBusiness Hours: 5pm - 7am, All days"
  },
  {
    "addressLine1": "330 Washington St.",
    "city": "NEWARK",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07102",
    "name": "Covenant House New Jersey Newark",
    "organization": "Covenant House New Jersey Newark",
    "phone": "(973) 621-8705",
    "website": "https://covenanthousenj.org/",
    "description": "In 1989, Covenant House began its work in New Jersey by providing basic services to homeless youth on the streets of Newark and Atlantic City.\n\nOver the past 25 years, we have grown by creating more services and enhancing the quality of those services.\n\n\nOur focus is always on meeting the needs of our youth, needs which never stop growing.\n\nOur outreach program has expanded its reach to Paterson and Cumberland County.\n\nWhile outreach continues to provide the essential services that established our presence in New Jersey two decades ago, we have expanded to forming partnerships with local schools, organizations, and government agencies to make sure all youth in the state are served.\n\n\n\nTonight alone, we will give 132 homeless adolescents and 19 of their babies throughout the state a safe and caring place to live in North and South Jersey.\n\n\nAnother dozen will be found by our outreach teams on the street or walk through the doors of our Crisis Centers for the first time.\n\n\n\nRecently, we opened a program especially for mentally ill homeless youth called Nancys Place in Montclair. In response to the special needs of this unique population, the program will be staffed 24 hours a day, and offer the intensive care these young people need to become self-sufficient and independent."
  },
  {
    "addressLine1": "521 Washington Street",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07102",
    "name": "Emergency Housing Services/ Urban Renewal Corp Washington Street",
    "organization": "Emergency Housing Services/ Urban Renewal Corp Washington Street",
    "phone": "(973) 271-5802",
    "website": "mailto:info@urbanrenewal.org",
    "description": ""
  },
  {
    "addressLine1": "368 South 7th Street",
    "city": "Newark",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07103",
    "name": "St. Rocco's Family Residence Emergency Shelter",
    "organization": "St. Rocco's Family Residence Emergency Shelter",
    "phone": "(973) 286-4175",
    "website": "https://www.ccannj.com/st_rocco.php",
    "description": ""
  },
  {
    "addressLine1": "901 Swartswood Road",
    "city": "Newton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07860",
    "name": "Samaritan Inn",
    "organization": "Samaritan Inn",
    "phone": "973-940-8872",
    "website": "https://samaritaninn.org/",
    "description": "Samaritan Inn provides emergency food and temporary shelter to homeless families in Sussex County as well as a program of counseling and skill building in family maintenance and growth.\n\nFood Pantry Hours:\nMonday, Wednesday & Friday from 2:00pm to 4:00pm\nAdditional Services:\n- 24 hour hotline\n- Prevention of Homelessness\n- Temporary Housing\n- Family shelter apartments\n- Emergency shelter for singles\n- Community case management\n- Holiday dinner and gift program\n- Cooking with Coupons to help families learn how to budget their money\n"
  },
  {
    "addressLine1": "PO Box 267 65A Washington Avenue",
    "city": "Oxford",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07863",
    "name": "Family Promise of Warren County, Inc.",
    "organization": "Family Promise of Warren County, Inc.",
    "phone": "(908) 453-2194",
    "website": "http://www.wcfamilypromise.org/",
    "description": ""
  },
  {
    "addressLine1": "140 Bushkill Drive",
    "city": "Easton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "18042",
    "name": "RoofOver Transitional Shelter",
    "organization": "RoofOver Transitional Shelter",
    "phone": "(610) 253-4253",
    "website": "http://www.eastonareaneighborhoodcenter.org/",
    "description": "Transitional Shelter specializing in young working families. Women and Children only.\n\nOffice hours: Mondays through Fridays 8:30am - 4:30pm.\n\n\nEANC operates a transitional housing shelter in downtown Easton. This shelter is for families (single parent or two-parent) with children.\nRoofOver provides housing as well as case management tailored to each family. The goal of RoofOver is to provide support to these families as they learn to budget, save, and stabilize themselves.\nRoofOver can accept families of one or two parents and up to four children.\nEligibility requirements for RoofOver are:\n    the family must have children\n    the family must have a minimum of $500/mo in income\n    at least one adult must be employed at time of entry\n    at least one adult must maintain employment at all times\n\nA family must consist of at least one adult who maintains custody and/or legal guardianship of the child(ren). Families which include stepparents, unmarried couples, and domestic partnerships are welcome.\n\nEach unit at RoofOver comes furnished with beds for the family, a futon couch, dining table and chairs, and household linens (towels, bedding, etc.). Families can work with staff to address any other immediate needs\n\n"
  },
  {
    "addressLine1": "41 N Third St",
    "city": "Easton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "18042",
    "name": "Third Street Alliance for Women & Children Women and Children's Shelter",
    "organization": "Third Street Alliance for Women & Children Women and Children's Shelter",
    "phone": "(610) 258-6271",
    "website": "https://thirdstreetalliance.org/",
    "description": ""
  },
  {
    "addressLine1": "536 Bushkill Dr",
    "city": "Easton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "18042",
    "name": "Safe Harbor Shelter",
    "organization": "Safe Harbor Shelter",
    "phone": "(610) 258-5540",
    "website": "http://www.caclv.org/",
    "description": ""
  },
  {
    "addressLine1": "Northampton County Government Center, 669 Washington Street",
    "city": "Easton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "18042",
    "name": "NORTHAMPTON Department of Human Services",
    "organization": "NORTHAMPTON Department of Human Services",
    "phone": "(610) 559-3010",
    "website": "https://www.northamptoncounty.org/HS/Pages/default.aspx",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of NORTHAMPTON Department of Human Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "451 Van Houten Street",
    "city": "Paterson",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07501",
    "name": "St. Paul's Community Development Corp - Emergency Men's Shelter",
    "organization": "St. Paul's Community Development Corp - Emergency Men's Shelter",
    "phone": "(973) 278-7900",
    "website": "http://www.stpaulscdcnj.org/",
    "description": "Emergency shelter, clothing, and food are provided to homeless men at a capacity of 40 beds. For men entering the shelter, a comprehensive assessment is done to determine what is needed beyond the immediate night off the street. Referrals are provided for housing, employment, mental health services and rehabilitation services.\n\n\nProof of income, past history, current condition of need. Intakes are done after 3:00 p.m. each day.\nBusiness Hours\n24 hours a day, 7 days a week"
  },
  {
    "addressLine1": "393 Main Street",
    "city": "Paterson",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07501",
    "name": "The Recovery Community Center at Eva's Village",
    "organization": "The Recovery Community Center at Eva's Village",
    "phone": "(973) 523-6220",
    "website": "https://www.evasvillage.org/",
    "description": "Has a men's shelter 40 beds, women's shelter 36 beds and shelter for women with children 18 mothers and up to 42 children.\n\nEva's Village is a uniquely progressive and comprehensive non-profit social service organization dedicated to fighting homelessness and poverty. Our mission is to feed the hungry, shelter the homeless, treat the addicted and provide medical and dental care to the poor with respect for the human dignity of each individual.\n\nOther Services\nRESIDENTIAL HALFWAY HOUSES - Eva's provides Halfway House Treatment for men and women. There are 86 beds available for men and 36 beds for women. Staffed by certified alcohol and drug counselors, Eva's offers a three-phase program for up to 12 months. Services include comprehensive assessment, group and individual counseling, intensive education about addiction, job training, family support, and on-site 12-step programs. After the initial orientation phase, all participants must be employed and establish savings accounts. The treatment supports the transition from addiction to a life of dignity and independence.\n\nKitchen: Eva's Kitchen serves a hot lunch to 350 people 365 days a year. All who come are fed. Guests dining at Eva's Kitchen are not made to stand in a \"chow line,\" but are seated at tables and served with dignity and respect by volunteers. During the extreme cold of winter and the summer months of July and August, the numbers needing a meal increase and another partial seating is added. There are additional seatings on Thanksgiving and Christmas."
  },
  {
    "addressLine1": "262 Main St",
    "city": "Paterson",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07505",
    "name": "Sheltering Arms Affordable Housing For Homeless Families",
    "organization": "Sheltering Arms Affordable Housing For Homeless Families",
    "phone": "(201) 684-5998",
    "website": "",
    "description": "Affordable housing for homeless families. Must be homeless & head of household must be disabled. Residents are chosen based on their expected rate of success in this type of housing program. Medical and dental care for residents, day care services, after school programs, and recreational activities and services. Sheltering Arms also has a \"Sponsor a Child's Education Program\". Looking for adult men who are willing to sponsor a child's education by providing $1 for every earned A grade on a test, as well as additional money for quarterly report cards. This is a \"role model\" type of sponsorship emphasizing the need for education.\n\nEligibility\nFamilies must be homeless & head of household must be disabled. Residents are chosen based on their expected rate of success in this type of housing program"
  },
  {
    "addressLine1": "36 38 Circle Ave",
    "city": "Paterson",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07522",
    "name": "Hill Top Haven Family Shelter",
    "organization": "Hill Top Haven Family Shelter",
    "phone": "(973) 279-2333",
    "website": "",
    "description": "A residential shelter for homeless families (women and their children). Residents receive sleeping accommodations and three meals per day, as well as assistance with finding permanent housing and services. Arrangements are made for residents to receive employment opportunities, mental health treatment, medical treatment, and substance abuse treatment and if needed to help support the family. The residents receive intensive case management. The objective of the program is to help homeless persons stabilize their lives."
  },
  {
    "addressLine1": "100 Dayton Street",
    "city": "Ridgewood",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07450",
    "name": "Family Promise of Bergen County",
    "organization": "Family Promise of Bergen County",
    "phone": "(201) 833-8009",
    "website": "http://www.bergenfamilypromise.org/",
    "description": "Emergency Shelter for homeless working families.\n\n\n\nThe Family Promise Network is a sheltering program for homeless families with dependent children, accommodating up to 14 people at a time. Local congregations host the families overnight on a weekly rotating basis. Volunteers from host congregations, as well as neighboring support congregations, provide meals, discreet sleep areas and needed encouragement. Families have access to a FP run day center from 7 AM until 6 PM to pursue better employment, affordable housing, showers, laundry, etc. Case management to prepare the families for re-entry into the community is a key element of this program.\n\n\nNew Leaf Transitional Housing Program\n\n\nFamily Promise of Bergen County manages and monitors seven apartments in its transitional housing program known as New Leaf. Client families who have consistently followed the guidelines while participating in the Family Promise Program are given the opportunity to live in Family Promise subsidized apartment. Participants typically remain in the program twelve to eighteen months as they make the transition from homelessness to independent living. Families work with a Family Case Manager in areas of financial planning, job training, educational options, employment, childcare, and a mandatory savings plan. Counseling and other support services are available, encouraging individuals to take the measures necessary to reach the goal of permanent housing.\n\n"
  },
  {
    "addressLine1": "PO Box 125",
    "city": "Salem",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08079",
    "name": "Salem County Women's Services",
    "organization": "Salem County Women's Services",
    "phone": "(856) 935-6655",
    "website": "https://twitter.com/salemcountynews",
    "description": "Salem County Domestic Violence and Sexual Assault Program\n\nAll services are CONFIDENTIAL\nAccess to emergency shelter\nCrisis Counseling\nLegal Advocacy\nIndividual, Group and Family Counseling\nAdult Victims\nChild Victims\nBatterers\nInformation and Referral\nSupport Groups\nAdult Victims\nChild Victims\nBatterers\nCourt Preparation\nCourt AccompanimentOpen to residents of Salem County"
  },
  {
    "addressLine1": "110 N Poplar St",
    "city": "Wilmington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "19801",
    "name": "Sunday Breakfast Mission",
    "organization": "Sunday Breakfast Mission",
    "phone": "(302) 652-8314",
    "website": "https://www.sundaybreakfastmission.org/",
    "description": "Men's Shelter\nUp to 130 men who would otherwise be homeless call our shelter \"home\" each night.\n\nCommunity Meal\nA hot, nutritious meal is served to more than 200 men, women and children each night.\n\nMen's Residential Discipleship Ministry\nThe NewLife Program offers a fresh start. While here each person is counseled, educated, trained and equipped to become the productive member of society he was created to be.\n\nWomen and Family Shelter and Discipleship Ministry\nThe NewLife Program offers a fresh start. While here each person is counseled, educated, trained and equipped to become the productive member of society he was created to be."
  },
  {
    "addressLine1": "104 West 5th Street",
    "city": "Wilmington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "19801",
    "name": "Booth Social Services/Emergency Housing Residence",
    "organization": "Booth Social Services/Emergency Housing Residence",
    "phone": "(302) 472-0753",
    "website": "",
    "description": "Emergency Housing Residence\n\nThe William Booth Emergency Housing Residence (EHR) is a Ninety (90) day emergency shelter for single women and women with children mainly from Wilmington and New Castle County. The Emergency Housing Residence consists of 52 beds in 13 rooms on two residential floors. The shelter operates 24/7, 365 days a year. The purpose is to provide emergency shelter services and to work toward preventing the recurrence of episodes of homelessness. The program encourages the development of self-esteem and the attainment of self-sufficiency through its commitment of providing a safe and supportive environment, and through its housing programs, advocacy and empowerment."
  },
  {
    "addressLine1": "720 N Orange St",
    "city": "Wilmington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "19801",
    "name": "Friendship House Wilmington Empowerment Center",
    "organization": "Friendship House Wilmington Empowerment Center",
    "phone": "(302) 652-8033",
    "website": "https://www.friendshiphousede.org/",
    "description": "We are currently located at Saams Church location the entrance are the double red doors.\nMorning Hospitality: Mon-Fri 7:30am 8:30am\nSunday Breakfast: 7am 8am\nFor appointment call (302) 652-8033: Mon-Fri 9am-12pm.\nFriendship House views its empowerment centers as its primary contact with those facing homelessness throughout New Castle County, Delaware. At each open-door drop-in centers, staff and volunteers of Friendship House interface with over 250 people daily. The Centers are not only Ground Zero for the Friendship House Empowerment Strategy Program; it is also the agencys principal guide for the needs of the New Castle County, Delaware community.\n\n\nThe Empowerment Centers serve clients with a way home. Each center is part of the network of homeless ministries housed out of local churches which have a partnership with Friendship House. The principal services include basic hospitality (coffee/ tea, water, bathrooms), the Home Base Program (mailing address, phone service, locker & savings bank), a consultation & referral service, AA and NA meetings and the  Job Readiness Program (Computer lab, Job mentors, I.D., Resume, Bus Tickets,  Work Shoes, Equipment,  Workers Shelter).\n\nServices offered at our Empowerment Centers include:\n    Case Management\n    Access to a phone, a place to receive mail\n    Computer labs\n    A job readiness program where you will receive help on resume writing and job searches\n    Help getting replacement birth certificates and identification\n    Access to clothing\n    Help with food or shelter referrals\n    Bus tickets to verifiable appointments\n    Assistance with medical prescription\n    Hospitality of hot drinks, water, and access to a bathroom\n    Sanctuary from the elements\n\n"
  },
  {
    "addressLine1": "121 N. Jackson Street",
    "city": "Wilmington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "19805",
    "name": "Mary Mother of Hope House II",
    "organization": "Mary Mother of Hope House II",
    "phone": "(302) 652-1935",
    "website": "https://www.ministryofcaring.org/services/emergency-shelters/",
    "description": "Emergency women's shelter for single women with children."
  },
  {
    "addressLine1": "709 North Madison Street",
    "city": "Wilmington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "19801",
    "name": "YWCA Delaware Home-Life Management Center",
    "organization": "YWCA Delaware Home-Life Management Center",
    "phone": "(302) 658-7110",
    "website": "https://www.ywcade.org/",
    "description": "Home Life Management Center (YWCA) is a shelter for homeless families. Their services range from Childcare and job training to Violence Prevention and Leadership Training. There is no limit to the length of stay."
  },
  {
    "addressLine1": "1328 W. Third Street",
    "city": "Wilmington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "19805",
    "name": "House of Joseph I",
    "organization": "House of Joseph I",
    "phone": "(302) 652-0904",
    "website": "https://www.ministryofcaring.org/services/emergency-shelters/",
    "description": "Mens homeless shelter. Capacity: 12 men.\n\nHouse of Joseph I provides emergency shelter and services to homeless employable men. Residents come to the shelter for reasons that include family challenges, substance abuse, mental health disorders, unemployment or underemployment. Case managers initially help the men to resolve immediate crises. Subsequently, they begin the process of identifying barriers to long-term self-sufficiency. The opportunity to learn life management skills has proven especially helpful.\n\nWhen case managers determine which residents need and desire additional supportive services, they may refer them to a transitional residence or long-term housing program of the Ministry of Caring. Throughout every residents stay, House of Joseph I strives to help each man reach his next step on the road to independent living."
  },
  {
    "addressLine1": "515 N. Broom Street",
    "city": "Wilmington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "19805",
    "name": "Mary Mother of Hope House III",
    "organization": "Mary Mother of Hope House III",
    "phone": "(302) 652-0970",
    "website": "https://www.ministryofcaring.org/services/emergency-shelters/",
    "description": ""
  },
  {
    "addressLine1": "300 Bayard Avenue",
    "city": "Wilmington",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "19805",
    "name": "Catholic Charities Bayard House",
    "organization": "Catholic Charities Bayard House",
    "phone": "(302) 654-1184",
    "website": "https://www.ccwilm.org/bayard-house/",
    "description": "The shelter serves 10 homeless, pregnant adolescents and young women, providing residents with food, clothing, counseling and referrals to appropriate services. Residents should be in their first or second trimester of pregnancy."
  },
  {
    "addressLine1": "2455 Windsor Ave",
    "city": "Toms River",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08753",
    "name": "Ocean's Harbor House Youth Shelter",
    "organization": "Ocean's Harbor House Youth Shelter",
    "phone": "(732) 929-0660",
    "website": "http://www.oceansharborhouse.org/",
    "description": "Ocean's Harbor House is a safe haven for youth, ages 10-21 who have run away, are homeless or have been abused, neglected or abandoned. Our organization is committed to providing quality services that respond to the growing and changing needs of youth and HD Fundraiser families in the Jersey Shore region. We are joined in our commitment by a variety of partners and friends who provide financial support through grants and donations, those who volunteer their services and skills, and those who help fill our Wish Lists by donating food, clothing, furnishings, and office supplies. This collaboration throughout the years has enabled Ocean's Harbor House to become a strong voice for the needs of troubled youth and families. This also allows us to provide all our services free and confidential.\n\nThe shelter has twelve (12) beds to house youth up to the age of 19. In addition to providing emergency shelter placement, Harbor House provides home-cooked meals, clothing, counseling, case management, recreation, transportation and medical services. Primary and residential counselors assume proactive roles in stabilizing the children upon admission. Further, the shelter operates a 24-hour hotline, with drop-in services to help identify the most appropriate agency and/or community services that the youth or family needs."
  },
  {
    "addressLine1": "601 N Clinton Ave",
    "city": "Trenton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08638",
    "name": "Cold Weather Oveflow Shelter",
    "organization": "Cold Weather Oveflow Shelter",
    "phone": "(609) 393-8009",
    "website": "",
    "description": "The Center provides sleeping shelter during cold weather months to area homeless individuals who come as overflow from the Trenton Rescue Mission.\n\nReport to Rescue Mission first, will refer to East Trenton Center when Rescue Mission is full.\n\nBusiness Hours: Mon - Fri 11:00pm - 7:00pm\n"
  },
  {
    "addressLine1": "98 Carroll Street",
    "city": "Trenton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08609",
    "name": "Rescue Mission of Trenton - Trenton Rescue Mission",
    "organization": "Rescue Mission of Trenton - Trenton Rescue Mission",
    "phone": "(609) 695-1436",
    "website": "http://www.rescuemissionoftrenton.org/",
    "description": "The Rescue Mission of Trenton provides the only Emergency Shelter in Mercer County, New Jersey, licensed by the Department of Community Affairs (DCA), serving single men and women. While a homeless client is in the shelter, staff members work to link the person to community programs that will address the pressing needs and issues contributing to their homelessness.\n\nThe Emergency Services Program can house 54 men and 23 women nightly for a total of 77 individuals. During the winter emergency period (approximately November 15th to April 15th), the bed capacity more than doubles to 135 men and 29 women nightly for a total of 164 individuals. Clients receive breakfast, dinner, snacks, clothing, winter coats, and personal hygiene necessities.\n\n\nUnder the Emergency Services Program, the Rescue Mission also operates a weekend soup kitchen. Additional services in this area include free clothing and furniture to homeless clients or those referred by other social service programs.\n\nOther Services Provides:\nAddiction Services - Rehab for substance abuse addiction. Location called: Vince's Place. Provides residential addiction treatment to homeless, indigent clients and those with specific legal issues. A full array of services are offered including group and individual counseling, medical supervision, educational and vocational assistance, meals and transportation.\n\nLong-term: a 180-day residential addiction treatment program.\n\nPermanent Supportive Housing\nThe Mission's specialized programs are designed to meet the community's needs while helping each individual client reclaim and rebuild his life.\n\nRobinson Place is permanent supportive housing for single men who receive supportive services to assist them in maintaining independent living, licensed by the State of New Jersey, Department of Community Affairs (DCA).\n\nOutpatient Clinic\nThe Outpatient Clinic is a small but growing program, providing standard outpatient substance abuse treatment, licensed by the Department of Addiction Services (DAS).\n\nAnyone seeking outpatient substance abuse treatment is welcome. Services are provided to men and women from all walks of life and are based on an affordable sliding fee scale."
  },
  {
    "addressLine1": "520 Martin Luther King Boulevard",
    "city": "Trenton",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08618",
    "name": "Amani House - Shelter for Men",
    "organization": "Amani House - Shelter for Men",
    "phone": "(609) 393-3168",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "108 36th St",
    "city": "Union City",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07087",
    "name": "PERC Shelter - Emergency Homeless Housing",
    "organization": "PERC Shelter - Emergency Homeless Housing",
    "phone": "(201) 348-8150",
    "website": "http://www.percshelter.org/",
    "description": "Palisades Emergency Residence Corp\n\nPalisades Emergency Residence Corporation (PERC) exists to defeat the cycle of poverty, understanding that food and shelter are fundamental human rights. PERC believes that with help there is hope. We believe that every person deserves dignity, respect, and opportunity.\n\nPERC achieves our mission by providing emergency shelter for women, men and families, permanent housing for chronically homeless individuals, a soup kitchen and food pantry, a bilingual after-school program for low-income children, advocacy, and educational and community-based support services."
  },
  {
    "addressLine1": "515 43rd St",
    "city": "Union City",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "07087",
    "name": "Salvation Army Union City Emergency Services",
    "organization": "Salvation Army Union City Emergency Services",
    "phone": "(201) 867-4093",
    "website": "https://easternusa.salvationarmy.org/new-jersey/union-city/",
    "description": "Emergency Services, food, clothing, shelter, guidance, Adult rehabilitation services alcohol, social and correctional counseling. Furniture pick-up."
  },
  {
    "addressLine1": "427 W. 52nd St.",
    "city": "New York",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "10019",
    "name": "52nd Street Women's Center",
    "organization": "52nd Street Women's Center",
    "phone": "(212) 366-4459",
    "website": "https://www.careforthehomeless.org/",
    "description": ""
  },
  {
    "addressLine1": "6140 Mays Landing Road",
    "city": "Vineland",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08361",
    "name": "Cumberland Family Shelter",
    "organization": "Cumberland Family Shelter",
    "phone": "856-327-3143",
    "website": "https://ruraldevelopmentcorp.org/",
    "description": "We serve single women, single men, women with children and entire families. Staffed 24 hours per day 7 days per week - screenings are necessary before acceptance"
  },
  {
    "addressLine1": "367 Route 9",
    "city": "Waretown",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08758",
    "name": "The GoodSam House Men's Shelter",
    "organization": "The GoodSam House Men's Shelter",
    "phone": "(609) 698-8561",
    "website": "",
    "description": "Location:\nThis shelter is located and Waretown and houses no more than 4 men at a time. Potential clients must call the church office and ask to be interviewed for entry. There is a 3 month time limit.\n\nThey do not house clients with severe psychological disorders, as they do not have the capability to assist these individuals."
  },
  {
    "addressLine1": "1001 South Main St.",
    "city": "West Creek",
    "state": "New Jersey",
    "stateAbbreviation": "NJ",
    "postal": "08092",
    "name": "Family Promise of Southern Ocean County",
    "organization": "Family Promise of Southern Ocean County",
    "phone": "(609) 994-3317",
    "website": "https://www.familypromisesoc.org/",
    "description": "Provides a family shelter.\nIntake by appointment only. Serving families with children.\nNon-profit, interfaith hospitality network providing temporary shelter, meals, hospitality, and case management for children and families experiencing homelessness. We do this through the participation of local congregations, community organizations, dedicated staff, and hundreds of volunteers.\n"
  }
]