[
  {
    "addressLine1": "218 W Broadway Avenue",
    "city": "Bismarck",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58502",
    "name": "Abused Adult Resource Center - Pam's House",
    "organization": "Abused Adult Resource Center - Pam's House",
    "phone": "(701) 222-8370",
    "website": "https://www.abusedadultresourcecenter.com/",
    "description": "The Abused Adult Resource Center (AARC) is a non-profit organization that helps victims of domestic violence & sexual assault in 7 counties in ND. The AARC was created to provide emergency support, crisis intervention, temporary shelter, food, counseling to individuals in need. The AARC provides free and confidential assistance 24 hours a day/7 days a week to survivors of: domestic violence, dating violence, rape/sexual assault, stalking, human trafficking, and abuse in later life.\nThe AARC Pam's House was created to women and children that are victims of domestic violence. Pam's House provides a 24-hour safe, secure environment and living arrangement for abused women and their children.\n\n\nPam's House Services Provided:\n24-hour support system Case management (budgeting, goal-setting, parenting, nutrition)Assistance with locating permanent housing Legal and medical needsAssistance for education and employment Activities for childrenSupport groups for women and children\n\nAdditional Services Provided:\n24-Hour Crisis LineEmotional support\nSafety planningLegal advocacy within the criminal justice systemWalk-in services during business hours by trained staff and volunteersInformation and assistance for those evaluating their relationshipsReferrals and accompaniment to services such as housing, medical, mental health, financial assistance, child care, skills training, or employmentAssistance with obtaining Domestic Violence Protection Orders and Sexual Assault Restraining Orders\n\nWomen's and children's shelter. Victims of domestic violence.\n\n\nAdditional Telephone Numbers:\n24-Hour Crisis Line (for abuse survivors in North Dakota): 1-866-341-7009Family Safety Center:701-222-1053Seeds of Hope:701-222-8895National Domestic Violence Hotline (for abuse survivors outside North Dakota: 1-800-799-SAFE (7233)"
  },
  {
    "addressLine1": "1800 E Broadway Ave",
    "city": "Bismarck",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58501",
    "name": "Ruth Meirs Hospitality House",
    "organization": "Ruth Meirs Hospitality House",
    "phone": "(701) 222-2108",
    "website": "http://www.ruthmeiers.org/",
    "description": "Ruth Meiers Hospitality House is the 24/7 Single Point of Entry for the Bismarck/Mandan community and those that are homeless or at risk of becoming homeless. Individuals are verified through Single Point of Entry and referred to various partner agencies to save time and eliminate duplication. Our staff works with local law enforcement officials, emergency housing providers, social/human service agencies etc. to proactively move people off the streets and into housing. Single Point of Entry allows individuals to come to one place for all of their needs including but not limited to: rental/deposit assistance, gas money, emergency shelter placement, emergency food, utilities assistance and more. While Ruth Meiers Hospitality House does not actually issue the funds for the needs, we network with the agencies that do, in order to make assistance more easily obtained.\n\nMen's Emergency Shelter\n305 N 23rd St, Bismarck\n(701) 223-8454\n\nThe Men's Emergency Shelter can house up to 120 single male residents from 30 - 60 days. Residents work towards gaining employment and/or income and accessing permanent housing. Our supportive service staff is available to assist the residents in these goals and include a Case Manager, Job Service Representative, Treatment Coordinator and Single Point of Entry Coordinator. In addition to working on employment and housing, residents abide by rules and regulations, including but not limited to: being in by curfew, performing daily chores, receiving nightly breathalyzers as well as random urine analysis, etc. Residents are charged $14 a week for program fees while staying in the Men's Emergency Shelter.\n\nThe shelter also provides help to people who do not want to be sheltered or can't be sheltered and provides a safe place for them to get off the streets at night. Men over the age of 18 can come and havesomething to eat, wash up, and rest. This is available from 9:00 p.m. - 7:00 a.m., seven days a week. Men are required to pass a nightly breathalyzer prior to staying as a guest.\n\nMen's Residential Program\nThe Men's Residential Program is a 30 - 90 day program located at our main office on Broadway Avenue in Bismarck. This location can house up to 24 single male residents. Much like our other shelters, residents are offered guidance from our helpful staff as they work toward gaining employment and/or income and accessing permanent housing. Individuals in the Residential Program are also expected to follow shelter rules and regulations, including but not limited to: being in by curfew, performing daily chores, receiving nightly breathalyzers as well as random urine analysis, etc. Residents are charged $50 a week while in the program.\n\nFamily Emergency Shelter\n(701) 527-7939\n\nThe Mission of Ruth Meiers Hospitality House, Inc. is to provide housing and supportive services to assist homeless and low income people in achieving self-sufficiency.\n\n"
  },
  {
    "addressLine1": "2910 East Broadway Ave. Ste. 40",
    "city": "Bismarck",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58501",
    "name": "Welcome House",
    "organization": "Welcome House",
    "phone": "(701) 751-1218",
    "website": "http://www.welcome-house.net/",
    "description": "Welcome House is a faith-based agency serving homeless individuals and families in the Bismarck/Mandan area. Welcome House provides short-term shelter, assistance in obtaining permanent housing and a variety of supportive services."
  },
  {
    "addressLine1": "700 1st Avenue E",
    "city": "Lemmon",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "57638",
    "name": "Crisis Intervention Shelter",
    "organization": "Crisis Intervention Shelter",
    "phone": "(605) 374-5334",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "3000 S. University Dr",
    "city": "Fargo",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58103",
    "name": "YWCA Cass Clay",
    "organization": "YWCA Cass Clay",
    "phone": "(701) 232-3449",
    "website": "https://twitter.com/ywcacassclay",
    "description": "Emergency shelter for women and children. This is a locked facility open 24 hours a day."
  },
  {
    "addressLine1": "1902 3rd Avenue North",
    "city": "Fargo",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58102",
    "name": "New Life Center",
    "organization": "New Life Center",
    "phone": "(701) 235-4453",
    "website": "https://www.fargonlc.org/",
    "description": "Emergency shelter is available to men, 18 years of age or older. We start screening for beds at 7 AM. Please call 701-235-4453 for more information.\nFor your protection and for those who we serve, we are limiting access to the building. If you are coming for a meal, they are still available. Please come in, ask at the window, and we will see that you get a meal to go.\n\nTimes are listed below:\n\nLunch: 12 - 12:30 PM (Everyday)\nDinner: 5 - 5:30 PM (Everyday)\n"
  },
  {
    "addressLine1": "1519 1st Ave S",
    "city": "Fargo",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58103",
    "name": "Gladys Ray Shelter",
    "organization": "Gladys Ray Shelter",
    "phone": "(701) 364-0116",
    "website": "http://www.cityoffargo.com/homelessness",
    "description": "The Gladys Ray Shelter is a 35 bed shelter serving adult men and women that have no other options for shelter in the Fargo-Moorhead community. Referrals are made to other shelters if the option exists. GRS opens for shelter services at 6:00 PM and closes at 8:00 AM. The Gladys Ray Veterans Drop-in Center is open 7 days a week for all services, 9:00 AM to 3:00 PM. Please call 701-364-0116 for more information.\n\nDay time office hours vary Monday through Friday. Please call ahead to ensure that someone is available before visiting the shelter during these times."
  },
  {
    "addressLine1": "316 S. University Drive",
    "city": "Fargo",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58103",
    "name": "Youthworks",
    "organization": "Youthworks",
    "phone": "(701) 232-8558",
    "website": "http://www.youthworksnd.org/",
    "description": "Youthworks Runaway Centers provide comprehensive emergency services to runaway youth and their families, as well as, youth experiencing significant parent/child conflict and provide one-time drop-in, and crisis line services to youth who may be contemplating running away and require or seek only a minimal level of service (such as information and referral to other services providers). The Youthworks runaway centers are the only programs in their respective communities providing runaway services outside of the juvenile justice, social services and law enforcement systems. Runaway centers can provide an alternative to jail for law enforcement/juvenile justice when they choose to divert and/or deinstitutionalize runaways, status offenders, delinquents and other high-risk youth. Services provided to runaway and homeless youth include individual, family counseling and mediation; group counseling; attendant care; juvenile diversion; transitional housing; support groups; emergency food, clothing and shelter; advocacy; crisis intervention and emancipation preparation.\n\nYouthworks newest program in the Fargo metro area is a youth shelter and short-term care center. The facility opened in the summer of 2010 as a safe shelter for runaway youth who have left their homes for a variety of reasons and also serves as a short-term housing alternative for families and youth facing parent/child conflict and anger management issues.The 4-bed facility is off-site from the main Youthworks office. Full reunification services are available including individual and family counseling, anger management, mediation, mentoring, and personalized aftercare services. For both runaway and short-term care situations parents or guardians retain custody and reunification is intended to happen within 96 hours, or sooner if possible. Professional assessment is available 7 days a week.\n\n\nFamily Counseling is also available through Youthworks' Family Counseling Program."
  },
  {
    "addressLine1": "714 8th Street, S.",
    "city": "Moorhead",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "56560",
    "name": "Dorothy Day House",
    "organization": "Dorothy Day House",
    "phone": "(218) 233-5763",
    "website": "https://www.churches-united.org/",
    "description": "The emergency shelter has the capacity to house 13 men who are homeless. We are unique because we operate out of a house and try to maintain a home-like environment for those who walk through our doors. Recognizing that the people we serve have experienced a tremendous amount of trauma, homelessness is traumatic, and many people are coming to us straight from the streets, we allow our guests time to adjust to the shelter environment and our program. After this time, we ask that they set goals for themselves with a housing plan being one of them. Each guest meets with our leadership staff who does an assessment, called the VI-SPDAT, to determine acuity for housing placement. Barriers are addressed at this time, and we visit with guests about increasing income, social support, issues relating to physical health, mental illness, and chemical dependency, transportation needs, and financial or legal concerns. We offer a holistic approach and try to meet people where they are at by using motivational interviewing techniques and practicing trauma informed care. We hold guests accountable by having them fill out an extension worksheet every other week, where they discuss progress made towards their goals, and this is then reviewed as a staff team. At this time, we provide positive reinforcement, offer suggestions, and address concerns. We do not have a set length of stay; rather, the guest has to be willing to set a housing goal and show overall progress. We have found this approach to be very effective, as the individual is driving his success while we keep that person on track by providing support and resources. In addition, we offer visitor services, where men, women, and children experiencing homelessness can come Monday - Friday and weekends (for showers only) from 10a - 5p to take showers, do laundry, and receive other support services. From 2010 - 2014, the number of visits increased an astounding 541%. Based on the philosophy of Dorothy Day, we believe that everyone has worth and deserves to have their basic needs met."
  },
  {
    "addressLine1": "1901 1st Ave N",
    "city": "Moorhead",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "56560",
    "name": "Churches United for the Homeless - Micah's Mission",
    "organization": "Churches United for the Homeless - Micah's Mission",
    "phone": "(218) 236-0372",
    "website": "http://www.churches-united.org/",
    "description": ""
  },
  {
    "addressLine1": "3300 4th Avenue North #14",
    "city": "Anoka",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "55303",
    "name": "Stepping Stone Emergency Housing",
    "organization": "Stepping Stone Emergency Housing",
    "phone": "(763) 323-7006",
    "website": "https://steppingstoneeh.org/",
    "description": "Stepping Stone Emergency Housing is Anoka County's only youth & adult homeless shelter, and one of Minnesota's most trustworthy non-profit organizations. In a dormitory-style setting, Stepping Stone provides a primary, yet temporary home to 66 men and women, as young as 18 years old.\n\nAll residents, regardless of their time spent at Stepping Stone, have their basic needs met. We provide a bed to sleep, linens, three meals a day, shower, laundry facilities, and clothes and toiletries, when needed.\n\n\nOn average, residents live at Stepping Stone for 90 days. However, some stay less time and some stay more, depending on their need. During their time here, our Shelter Advocates make sure that their day-to-day, shelter needs are met. On the other hand, our Case Manager meets with each resident one-on-one to develop a comprehensive Individual Goal Plan (IGP), ensuring that the resident' needs for leaving Stepping Stone are also met. The IGP determines the ultimate goal of each resident and defines the attainable goals in which to achieve their goal.\n\nEmergency Shelter\nFor individuals who are seeking temporary shelter ONLY\nAll basic needs provided for regardless of their length of stay\nInitial stay is 7 days or less with a maximum stay of 28 days within a 365 day period, which begins the first day the individual enters Emergency Shelter\nMaximum capacity of 6 men and 4 women on any given day\n\nResident must meet with Case Manager, comply with all Rules & Regulations, and complete all assigned chores\n\nBasic Needs\nRegardless of the program or length of stay, all residents of Stepping Stone are supplied their BASIC NEEDS, at all times.\nThese include:\nAccess to the facility 24/7, while an approved resident\nAssigned a room with a bed, linens, pillow, storage locker and closet\nThree meals per day, plus a snack in the evening\nShowers, including towels, soap, shampoo, conditioner, lotion, deodorant, toothbrush and toothpaste\nLaundry facility, including laundry detergent\nClothing provided thanks to community donations\n\nEmergency Housing\nFor individuals who desire and are willing to work on the issues that contributed to their homelessness\nDirectly come from Emergency Shelter program\nAll basic needs provided for regardless of their length of stay\nMaximum planned stay is 90 days, an extension in 30-day increments is allowed\n\nRequired development of Individual Goal Plan (IGP) with Case Manager\nResident must meet with Case Manager, comply with all Rules & Regulations, and complete all assigned chores\nEngage in making progress on IGP\nMeet with Anoka County Financial Assistance Worker\nFunding Structure: MN state funded Group Residential Housing, personal contribution, or combination of both\n\n\n"
  },
  {
    "addressLine1": "420 Division Ave",
    "city": "Grand Forks",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58201",
    "name": "Northlands Rescue Mission",
    "organization": "Northlands Rescue Mission",
    "phone": "(701) 772-6600",
    "website": "http://northlandsrescuemission.org/",
    "description": "Homeless men's and women's shelter.\n\nOur office is open 24 hrs for check-ins, at 414 Division Ave Grand Forks ND. If you have questions about any of our services or requirements, please call our office at 701-772-6600\n\nNorthlands Rescue Mission is a Christian place of hope and transformation. We try to guide everyone who comes through our doors to rescue, rebuild and restore their lives, no matter their needs or challenges. For the homeless living on the streets, we're a hot meal, a warm bed and a second chance. For the mentally ill, we are a safe harbor that offers compassionate care. For an impoverished family in crisis, we are a source of help and hope."
  },
  {
    "addressLine1": "220 East 3rd Street",
    "city": "Crookston",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "56716",
    "name": "Care & Share Center",
    "organization": "Care & Share Center",
    "phone": "(218) 281-2644",
    "website": "https://www.careandsharecrookston.org/",
    "description": "Care and Share of Crookston is an emergency homeless shelter for men, women and families.  Individuals or families who are homeless or at risk of being homeless and needing shelter should contact our facility at 218-281-2644.\n \nPlease do not come to the shelter without first contacting us, as space may not be available for you at this time.\n\n \nOur family shelter is not a domestic violence shelter, and does accept male household members.\n\nCare and Share of Crookston may be able to assist individuals and families with other needs as well.  Depending upon available resources, we may be able to help with clothing, identification, school supplies, winter gear, etc.\n \nOur dedicated social work staff assists residents and other clients with obtaining benefits, housing resources, medical appointments, employment information and other information.\n\nFood Services\nCare and Share of Crookston has a soup kitchen where people in need can come for a prepared lunch and dinner and cereal and toast for breakfast.   These meals are not restricted to residents only, but are open to the public.\nBreakfast is available from 6-8:30.\nLunch is served at noon.\nDinner is served at 6 pm.\nIndividuals and families are welcome, however, we do ask that children must be accompanied by a parent in our facility at all times."
  },
  {
    "addressLine1": "205 3rd Avenue SE",
    "city": "Minot",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58701",
    "name": "YWCA Minot Center of Hope",
    "organization": "YWCA Minot Center of Hope",
    "phone": "(701) 838-1812",
    "website": "http://ywcaminot.org/",
    "description": "Emergency shelter available which houses 14-20 women and children.Permanent supportive apartments available for chronically homeless individuals with a disability."
  },
  {
    "addressLine1": "1112 43rd St SE",
    "city": "Minot",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58701",
    "name": "Minot Men's Winter Refuge",
    "organization": "Minot Men's Winter Refuge",
    "phone": "(701) 837-0218",
    "website": "https://www.menswinterrefuge.com/",
    "description": "Acting on God's love, we provide a safe place for men to sleep in the cold season. We provide space for 12-16 men who are picked up at a local church and brought to the house each evening at 8:00 p.m. to stay for the night. They are then returned to the church at 7:00 a.m.. The shelter is available for 30 days at which time we evaluate their continuing needs. The shelter works closely with each resident to assist them in becoming self sufficient."
  },
  {
    "addressLine1": "205 3rd Ave. South East Suite 302",
    "city": "Minot",
    "state": "North Dakota",
    "stateAbbreviation": "ND",
    "postal": "58701",
    "name": "Project Bee - Emergency Shelter",
    "organization": "Project Bee - Emergency Shelter",
    "phone": "(701) 838-1812",
    "website": "https://projectbeend.org/",
    "description": "Project Bee provides an Emergency Shelter program for homeless individuals and families.\nMost stays are for 30-60 days (rapid-rehousing model).\n\nA case manager will be assign to help the individual or family with the process of obtaining a permanent housing.\nAdditional Services:\nDakota Diaper PantryCareer ClosetBasic Needs PantryShower ProgramRental Assistance\n\n\n\n\n"
  }
]