[
  {
    "addressLine1": "525 2nd St SW",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87102",
    "name": "Albuquerque Rescue Mission - Steelbridge",
    "organization": "Albuquerque Rescue Mission - Steelbridge",
    "phone": "(505) 346-4673",
    "website": "https://www.mysteelbridge.org/",
    "description": "204 Beds (188 beds during the winter season beginning November 15 to March 15 only)\nClientele: Single Males and Single Females; 10 beds for families with children 9 years or younger\nLength of Stay: Overnight\nWomen's center of hope\nThis 12-18 month program developed from the perspective that homelessness is both the problem and the symptom of other problems that can range from chronic substance abuse, financial instability, domestic violence, sexual victimization and more.\n\nContact us at 505.346.4673 x129\n\nMen's New Life program\n\n This men's focused program solves the problem of homelessness by providing for the basic needs for a period of 12 to 18 months while they are in recovery and restoration. These services include shelter, meals, clothing, and support.\n\nContact us at 505.346.4673 x107"
  },
  {
    "addressLine1": "10300 Constitution Ave NE",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87112",
    "name": "Barrett House",
    "organization": "Barrett House",
    "phone": "(505) 243-4887",
    "website": "https://www.barrettfoundation.org/",
    "description": "Women's and Children's emergency shelter. Email for more information - info@BarrettFoundation.org. Provides food, shelter, and case management.\n\nBarrett House Shelter\nEmergency Shelter for women and children.Two meals are served each day in addition to a sack lunch, and clients are provided with toiletries and clothing. Barrett House has a family room, library with computers, laundry facilities and indoor and outdoor play areas for the children. Barrett House is the entry point for our other programs."
  },
  {
    "addressLine1": "218 Iron St. SW",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87102",
    "name": "Good Shepherd Center",
    "organization": "Good Shepherd Center",
    "phone": "(505) 243-2527",
    "website": "https://www.gscnm.org/",
    "description": ""
  },
  {
    "addressLine1": "4025 Isleta Blvd. SW",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87105",
    "name": "Haven of Love",
    "organization": "Haven of Love",
    "phone": "(505) 873-3771",
    "website": "",
    "description": "homeless shelter for men only. hours 6pm - 7am."
  },
  {
    "addressLine1": "1516 San Pedro Drive North East",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87102",
    "name": "Family Promise of Albuquerque Family Shelter",
    "organization": "Family Promise of Albuquerque Family Shelter",
    "phone": "(505) 268-0331",
    "website": "https://www.familypromisealbuquerquenm.org/",
    "description": "Family Shelter. Very small. Shelter up to 4 families at a time. Call before going to shelter.\nWe can provide shelter for up to four families at a time in the Interfaith Hospitality Network. We provide the shelter by partnering with 24 congregations around Albuquerque. These congregations of different faiths convert classrooms into bedrooms for one week at a time. All four families stay at the same congregation and move to a new congregation every Sunday.\n\n\nFamily Promise of Albuquerque provides beds that volunteers move every week. Volunteers at the congregations provide guests with nurturing and a sense of community. They provide homemade meals and sit down with the guests for family-style dinners. They help children with homework and also tutor parents when needed. They provide activities in the evenings and on weekends and they stay overnight to ensure safety.\n\nIn the mornings, they drop all of the children at school and bring parents who do not have jobs to the day center where the parents spend every weekday morning with tutors, attending skill-building classes and applying for jobs. Case management also is provided to help families connect with resources.\n"
  },
  {
    "addressLine1": "4500 2nd Street SW",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87125",
    "name": "Joy Junction",
    "organization": "Joy Junction",
    "phone": "(800) 924-0569",
    "website": "http://www.joyjunction.org/",
    "description": "Shelter for families and women. 24 hour admission, van pick-up also available.\n\nEvery day there are as many as 300 women, men, and children that rely on our Albuquerque homeless shelter, Joy Junction, for food, shelter, clothing, and safety. We are a 501(c)(3) faith-based church ministry that relies solely on the generosity of individuals and corporations in and around the city. We receive no funding from federal, state, or local agencies to assist in our mission ministering to the needs of the homeless."
  },
  {
    "addressLine1": "708 Tijeras Ave NW",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87102",
    "name": "Maria Amadea Shelter",
    "organization": "Maria Amadea Shelter",
    "phone": "(505) 242-1516",
    "website": "",
    "description": "Abortion alternative shelter. Mothers may stay up to 2 weeks after their baby is born. GED programs and housing assistance."
  },
  {
    "addressLine1": "2820 Ridgecrest SE",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87108",
    "name": "New Day",
    "organization": "New Day",
    "phone": "(505) 938-1060",
    "website": "https://www.ndnm.org/",
    "description": "Safe Home\n\n"
  },
  {
    "addressLine1": "2400 Second Street NW",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87105",
    "name": "The Rock at NoonDay (formerly Noon Day Ministries)",
    "organization": "The Rock at NoonDay (formerly Noon Day Ministries)",
    "phone": "(505) 246-8001",
    "website": "http://therockabq.org/",
    "description": "Who We Are: We are a Homeless Day Shelter. Why We Exist: Our founder, Calvin Horn, was challenged by The Storehouse to feed the homeless one day a week. This quickly grew into Noon Day Ministries which has operated continuously since 1982 . In 2014 Noon Day Ministries became The Rock at NoonDay.\n\nFor the full story, see our website.\n\nWhat We Do: Serve breakfast and lunch, offer showers, laundry service, haircuts, clothing, toiletries, food boxes, telephone services, travel aid, assistance to families with children through the Alex Fund, Christian counseling, animal clinics, and other assistance. Our collaborative partnerships with organizations in the community such as Health Care for the Homeless, Christian Legal Aid, Heading Home and Duke City Wheelman just to name a few, provide opportunities to do even more for those we serve. How We're Supported: Private and corporate donations, grants and foundation gifts, prayer and volunteers. People and companies like you! Come BE THE ROCK!\n\nWhen We Operate: Tuesday - Friday 8:00am to 4:00pm and Sundays for worship service and lunch."
  },
  {
    "addressLine1": "2010 Bridge Blvd SW",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87105",
    "name": "Proyecto La Luz Transitional Housing - Catholic Charities",
    "organization": "Proyecto La Luz Transitional Housing - Catholic Charities",
    "phone": "(505) 247-0442",
    "website": "https://www.facebook.com/CCASFNM/",
    "description": ""
  },
  {
    "addressLine1": "400 John NE",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87102",
    "name": "Salvation Army Adult Rehab Center",
    "organization": "Salvation Army Adult Rehab Center",
    "phone": "(505) 242-3112",
    "website": "https://www.salvationarmyalbuquerque.org/",
    "description": ""
  },
  {
    "addressLine1": "PO Box 25363",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87125",
    "name": "Shelter for Victims of Domestic Violence - Women's Community Association",
    "organization": "Shelter for Victims of Domestic Violence - Women's Community Association",
    "phone": "(800) 773-3645",
    "website": "https://www.safehousenm.org/",
    "description": ""
  },
  {
    "addressLine1": "1201 Third NW",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87125",
    "name": "HopeWorks",
    "organization": "HopeWorks",
    "phone": "(505) 843-9405",
    "website": "https://www.hopeworksnm.org/",
    "description": "We provide shelter/food programs, mental health services, job assistance and other critical programs. The services provided byHopeWorks stress flexibility, accessibility, and comprehensive care, the qualities necessary to assist individuals and families out of homelessness. Our non-profit is unique in the community because of the number of different services we have to meet the needs of individuals and families.\n\n\nSusan B. Sager Day Shelter\nOur facility provides a place for individuals experiencing homelessness to rest, receive meals, clothing, showers, storage, and more all while obtaining supportive services and housing (to eventually exit their homeless episode). Compared to the costs of remaining homeless, our shelter services cost only $67 per client per year.\n\nMeal Hours\nMonday-Friday: 7:00am 6:00pm\nCoffee and Donuts: 7:30am 8:30am\nBreakfast: 9am -10am\nLunch: 12pm -1pm\nDinner: 5pm 6pm\n\nSaturday: 4:00pm 6:00pm\nDinner: 5pm 6pm\n\nSunday: 7:00am 11:00am\nCoffee & Donuts: 7:30am -8:30am\nBreakfast: 9am -10am\n\n\n\nClothing Room\n\nMonday-Friday* 1:00pm-2:00pm\n*Not available on Wednesdays\nLong Term Storage\n\nMonday- Friday: 7:30am-8:30am, 10:30am-11:30am, 2pm-3pm\nMail Room\n\nMonday, Wednesday, Friday: 12:30pm-2:00pm\nTuesday and Thursday: 10:30am-11:30am\nShower Station\n\nMonday- Friday: 9:00am-12:30am\n\n\n\nHousing First\nHousing is the only true way to end a homeless episode.\n\nFor years, HopeWorks has used the Housing First Model in each of our programs. According to the National Alliance to End Homelessness, clients report an increase in perceived levels of autonomy, choice, and control in Housing First programs.  98% of homelessness individuals who are placed into some sort of permanent supportive housing remain stably housed.\n\n\nIn addition, clients using supportive services like case management are more likely to participate in job training programs, attend school, discontinue substance use, have fewer instances of domestic violence, and spend fewer days hospitalized than those not participating. For people with mental or behavioral issues, housing (coupled with case management) remains a key component for long term stabilization.\n"
  },
  {
    "addressLine1": "123 Rhode Island SE",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87108",
    "name": "The Shelter",
    "organization": "The Shelter",
    "phone": "(505) 881-5228",
    "website": "",
    "description": "Shelter for runaways, ages 12 - 17 years old. Meals provided. Four shelters in Albuquerque area. Outreach program for first offenders, DUI, Drug and Alcohol counseling. Americorps, tutoring with Rio Grande High School, Family preservation. Volunteers accepted, 21 years or older."
  },
  {
    "addressLine1": "715 Candelaria NE",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87107",
    "name": "AOC Men’s Overnight Emergency Shelter",
    "organization": "AOC Men’s Overnight Emergency Shelter",
    "phone": "(505) 344-4340",
    "website": "https://headinghome.org/programs-overview/albuquerque-opportunity-center-aoc/",
    "description": "The AOC Mens Overnight Emergency Shelter has 71 beds that provide a safe environment for sleeping and daytime storage of belongings for up to 30 nights. The AOC shelter has connected men experiencing homelessness to housing and resources since 2004 and annually services more than 600 unduplicated individuals. The Shelter is co-located at the AOC campus, with access to an outdoor garden, computer lab, storage area, showers, laundry facilities, medical examination rooms, a library and a classroom area.\n71 beds. No walk ins allowed.\n\nTo check for bed availability at the shelter, please call (505) 344-4340 at 8:30 am, Monday through Friday and 9:30 am on weekends. Once a bed is reserved for a resident, that person maintains the bed reservation for 30 days with an opportunity for an extension up to 90 days, depending on circumstance."
  },
  {
    "addressLine1": "1201 3rd St NW",
    "city": "Albuquerque",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87102",
    "name": "Susan B. Sager Day Shelter",
    "organization": "Susan B. Sager Day Shelter",
    "phone": "(505) 843-9405",
    "website": "https://www.hopeworksnm.org/",
    "description": "HopeWorks Susan B. Sager Day Shelter is the main entry way for people experiencing homelessness. At the shelter we offer:\n\n    3 full meals Monday through Friday, dinner on Saturdays and breakfast on Sundays in our facility.\n\n    A  clothing room that is open weekly to allow individuals to shop for items with dignity.\n    Access to short and long term storage daily.\n    A  mail room which is open daily so that clients have a safe and reliable location to receive their mail.\n    Showers are offered daily and all toiletries are provided when showering."
  },
  {
    "addressLine1": "6321 Jaguar Dr",
    "city": "Santa Fe",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87507",
    "name": "Sonrisa Family Supportive Living Program",
    "organization": "Sonrisa Family Supportive Living Program",
    "phone": "(505) 424-6973",
    "website": "https://www.steshelter.org/sonrisa",
    "description": "Services:\n\n8 Apartments for Families\n\nProvides income-based affordable housing, case management, life-skills training, parenting classes, financial counseling, and recreational activities.\n\nSonrisa Family Supportive Living Program provides eight apartments to homeless families with children. Below-market rents are based on income, and families can stay in the two- or three-bedroom apartments for up to two years while they save funds to move into permanent housing of their own. Children are the fastest growing homeless cohort nationwide, and studies have demonstrated the detrimental effects homelessness has on a child's development.\n\n\nAt Sonrisa, a program manager works directly with families and the children to address behavioral, employment, educational, medical and any other issues that may be impairing progress toward self-improvement and reliance. Financial counseling, life-skills training, parenting skills, weekly group discussions, recreational activities and close cooperation with public school counselors are required for all residents."
  },
  {
    "addressLine1": "2801 Cerrillos Rd",
    "city": "Santa Fe",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87505",
    "name": "Interfaith Community Shelter at Pete's Place",
    "organization": "Interfaith Community Shelter at Pete's Place",
    "phone": "(505) 795-7494",
    "website": "https://interfaithsheltersf.org/",
    "description": "overnight shelter available all year long for women & children, winter months for men, women & children\n\n\nOvernight Shelter for Men, Women and Families is available during winter season (women and children only during the summer months) on a first-come, first-serve basis.\n\n\nn addition to short-term survival services, we also offer a range of services through our partnership with local service providers who help with counseling, substance abuse, health care, job hunting, veteran support and legal challenges. These services are available during the day all year long for any low or no-income individual whether he or she is experiencing homelessness or not.\n\n\nGeneral information\n\n    Overnight stay at ICS is on a first-come, first-serve basis during all seasons.\n\n    Secure storage for luggage and limited kennel space are provided.\n    A clean sleeping bag is provided, men-only or women-only bunk beds assigned. A family room is available.\n\n    There is no ID requirement, but check-in includes a photograph to be taken with name and other information.\n    Inebriated individuals check-in: 9:00 pm to 11:00 pm.\n\nHours\n\nWinter Season For Men, Women & Children second Sunday in October to first Saturday in May\n\n    Open 6:00 pm 11:00 pm.\n    Dinner: 6:00 pm to 11:00 pm.\n    Breakfast: 5:45 am to 7:00 am.\n    Check-out time: 7:15 am.\n    Women line up at the front door; men line up at the side door on Harrison Road."
  },
  {
    "addressLine1": "1604 Berry Ave",
    "city": "Santa Fe",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87505",
    "name": "Casa Familia Urgent Transition Center Emergency Shelter for Women and Families",
    "organization": "Casa Familia Urgent Transition Center Emergency Shelter for Women and Families",
    "phone": "(505) 983-2042",
    "website": "https://www.steshelter.org/casa-familia",
    "description": "Casa Familia is St. E's dedicated emergency shelter for single women and families with children. It features six private family dormitories, sixteen beds for single women, a large kitchen, dining room, outdoor patio and common areas. Guests at Casa Familia participate in life-skill training programs, case management, and group exercises to strengthen camaraderie. The facility can house over 30 people, and is a dramatic improvement from the one room for families and six beds for single women previously available.\n \nCasa Familia provides a bright and warm atmosphere for single women and families desiring to regain a hold over their lives. Everyday the women and families at Casa Familia work with case management to restructure their lives and build brighter futures for themselves. By adhering to policies and procedures similar to the Men's Emergency Shelter such as sobriety, guests at Casa Familia are able to live in an environment that promotes peace, hard work, and goal accomplishment. Walking into Casa Familia one will immediately feel the warm, supportive environment that has been established."
  },
  {
    "addressLine1": "804 Alarid St",
    "city": "Santa Fe",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87505",
    "name": "St. Elizabeth Shelter Corporation",
    "organization": "St. Elizabeth Shelter Corporation",
    "phone": "(505) 982-6611",
    "website": "https://www.steshelter.org/",
    "description": "28 Beds for Men\nThe men's emergency shelter provides meals, case management, showers, laundry, mail services, clothing, and supplies.\n\n\nThe Mens Emergency Shelter is a vital part of the St. Elizabeth Shelter Corp. The shelter provides single men a chance to undergo case management, have a hot meal for dinner, and enjoy the camaraderie built between guests and staff. The shelter has two dormitory style rooms, which can accommodate a maximum of 28 individuals with ample space to move around.\n\n\nAside from the sleeping space, the Emergency Mens Shelter has a laundry room, a television room for movies and games, a small library, a communal dining room, and two computer work stations.\n\n\nThe Emergency Mens Shelter is a central hub for the homeless community of Santa Fe, NM. As part of the overall desire to help our homeless friends, the Emergency Mens Shelter provides a large array of hygiene products from toothbrushes to conditioner which anyone in need may obtain. There is also a clothing donation closet with underwear and socks, as well as hat bins that individuals, both male and female, may search through to find items they need to weather the seasons.\n\n"
  },
  {
    "addressLine1": "1314 S Canal St",
    "city": "Carlsbad",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "88220",
    "name": "Carlsbad Community of Hope Center Inc.",
    "organization": "Carlsbad Community of Hope Center Inc.",
    "phone": "(575) 200-1377",
    "website": "https://www.hopecenterwowinc.com/",
    "description": ""
  },
  {
    "addressLine1": "315 W Bronson St",
    "city": "Carlsbad",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "88220",
    "name": "Carlsbad Transitional Housing and Homeless Shelter",
    "organization": "Carlsbad Transitional Housing and Homeless Shelter",
    "phone": "(575) 200-3095",
    "website": "mailto:team@cthhs.org",
    "description": ""
  },
  {
    "addressLine1": "407 L Casillas Blvd",
    "city": "Clovis",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "88101",
    "name": "Lighthouse Mission Clovis",
    "organization": "Lighthouse Mission Clovis",
    "phone": "(575) 769-7775",
    "website": "http://clovislighthousemission.org/",
    "description": "Services:\n\nHOMELESS SHELTER\nEmergency shelter for men, women, and children 365 days a year.\nNo one plans to be homeless. It can happen literally overnight. In hard economic times the homeless rate increases sharply and there is no doubt that a record number of people will find themselves homeless in 2015. Even some people that do work just can't make ends meet and pay the rent. The Lighthouse provides shelter on a transitional or emergency basis making sure people aren't exposed to the weather or living out of a car.\n\nRECOVERY PROGRAM- Men & Women\n6 month residential drug and alcohol recovery program.\nThe Lighthouse Mission Discipleship Program is a 6 month residential recovery program. It is designed to help disadvantaged individuals who are battling life threatening addictions. A clean and sober environment is needed to heal physically, emotionally and spiritually. Each person enrolled will be given the 'tools of life' skills that will enable them to once again be productive members of society.\n\nCLOTHING BANK\nProviding gently-used clothing  Monday-Thursday.\n The Missions clothing bank provides new and used clothing, shoes, books, toys, household items and small kitchen appliances to those that cannot otherwise afford those items. Warm clothing is essential to our well-being. Presentable clothing can make the difference in that 'first impression' at a job interview or whether a child is accepted or ridiculed by their peers at school. Irrespective of being right or wrong this is a reality. Providing a family with decent clothing and shoes can boost opportunities in both employment and education and provide a path to rebuild their lives to become self-sufficient. Providing suitable toys and books for children can also lead to a more normalized life style. Volunteers sort through and categorize and organize these items for local assistance however many items are sent to impoverished countries as well.\n\n\nSOUP KITCHEN\nFighting hunger by providing well-balanced meals 7 days a week.\nIn 2014 The Lighthouse Soup Kitchen, also know as Bonner Hall, served 43,510 balanced meals(not including homeless shelter nighttime meals) to those in need. We anticipate a record year in 2015 as the struggle of our economy increases. Think about how your mind wanders that hour before you go to lunch then try to imagine not knowing where that next meal will come from. Nothing will discourage a person's heart and mind quicker than the pain of hunger. A education of a child suffers when they are hungry. Our bodies become subject to illness when we are weakened by malnutrition. Our hopes of employment and improvement vanish when our entire goal of our day becomes just finding food. Directly addressing this food insecurity is the first step in human recovery. Our minds begin to think more clearly when not being punished by the pain of hunger.\n\n"
  },
  {
    "addressLine1": "7136 West Interstate 40 Suite B",
    "city": "Amarillo",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79101",
    "name": "Family Support Services",
    "organization": "Family Support Services",
    "phone": "(806) 342-2500",
    "website": "https://fss-ama.org/",
    "description": ""
  },
  {
    "addressLine1": "400 S. 12th St.",
    "city": "Deming",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "88030",
    "name": "Deming St. Vincent de Paul Thrift Store and Homeless Shelter",
    "organization": "Deming St. Vincent de Paul Thrift Store and Homeless Shelter",
    "phone": "(575) 546-7763",
    "website": "mailto:rclenhardt@yahoo.com",
    "description": "St. Vincent de Paul Homeless Shelter, Soup Kitchen, Thrift Store is an emergency, 1 night only shelter in Deming, NM. We serve the traveling homeless who pass through our town. They are given a change of clothes, a meal, and one night's lodging."
  },
  {
    "addressLine1": "7 Fast Lane",
    "city": "Silver City",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "88061",
    "name": "Silver City Gospel Mission",
    "organization": "Silver City Gospel Mission",
    "phone": "388-5071",
    "website": "",
    "description": "Silver City Gospel Mission is a food pantry. .\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "309 W Pinon St",
    "city": "Farmington",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87401",
    "name": "PATH (People Assisting Homeless)",
    "organization": "PATH (People Assisting Homeless)",
    "phone": "(505) 327-3104",
    "website": "http://www.pathnm.org/",
    "description": "Intake hours are: M-F, 1pm-6pm; Sat & Sun 8am-6pm.\n\nEmergency Shelter\n36 beds\nAlcohol and drug free environment\nProvides temporary shelter to men, women, and children of San Juan County\nShelter provides breakfast, afternoon snacks and an evening meal for residents.\n\nDaily Bread\nProvides a noontime meal; 11:30am-1:00pm, Sat 11:30a-12:30p. everyday 364 days per year.\n\nPeople Assisting the Homeless, Inc. (PATH) is a non-profit organization that has been in existence since 1983 that provides services to the homeless and disadvantaged individuals of San Juan County.   PATH originally was formed under the name of San Juan Council of Community Agencies in 1983 and became a 501 (c) (3) in 1988.  Subsequently, the name was changed in 1994 to People Assisting the Homeless, Inc.\n\n\nIt is the mission of PATH to temporarily provide for the basic needs (food, shelter and clothing) of homeless individuals, families and others in need; to provide.\n\nIn addition to providing the basics, The Emergency Shelter program offers numerous mini-programs to these individuals that bring hope back into their lives.  Three of these mini-programs are:\n        Temporary Housing - Once the resident has secured employment; the resident is allowed to remain in the shelter for six months while rebuilding their lives and creating a financial base through our savings program and budgeting classes.\n\n        On-site social worker -  Provides a multitude of vital services among which include assisting the resident with understanding what may have caused the homelessness, providing assistance in coping with their current situation; preventing homelessness in the future. The social worker coordinates referrals to other vital service agencies in the community to insure the resident gets the complete and thorough care needed along with assistance in locating affordable housing.\n\n        Resource room - Allows residents to learn basic computer literacy, create resumes and search for jobs.information, guidance and support services designed to help residents regain productive, self-supportive lifestyles.\n\nPATH Food Service provides opportunities for individuals with little or no employable skills the opportunity to gain basic skills for future employment. The program is available for breakfast, lunch and snack style catering for up to 150 persons. Measurable Goals of our organization:To continue to provide food programs, temporary- transitional & permanent supportive housing to homeless persons in a safe and structured environment. Provide case management activities which include: parenting, time management, budgeting, parenting, nutrition and health, and job coaching, etc. Facilitate opportunities for clients to have an active role in the day to day activities."
  },
  {
    "addressLine1": "310 W. Animas",
    "city": "Farmington",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87401",
    "name": "The Roof Shelter",
    "organization": "The Roof Shelter",
    "phone": "(505) 327-5117",
    "website": "",
    "description": "Offers shelter from 7pm, to 7am during the Winter months; accepts intoxicated individuals"
  },
  {
    "addressLine1": "1055 Avenida Del Sol",
    "city": "Durango",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "81301",
    "name": "Durango Community Shelter",
    "organization": "Durango Community Shelter",
    "phone": "(970) 259-1255",
    "website": "https://www.voacolorado.org/gethelp-southernco-durangocommunityshelter",
    "description": "The Durango Community Shelter continues to be the only 24/7/356 shelter service in Southwest Colorado and the only option for families and individuals trying to get back on their feet and regain self-sufficiency. The facility has sleeping quarters for men, women, and families as well as communal living spaces including a kitchen, living room, laundry facilities, and dining room.\n\nServices Provided\n    24/7/365 residential shelter services\n    Telephone crisis information and referral\n    Provision of all basic needs: nutritious meals, shower and laundry facilities, clothing closet and personal hygiene supplies\n    Extensive resource referral and task-oriented counseling for employment, housing and services acquisition\n    Medical respite bed program\nAccess Services\n    Call 24/7 crisis line 970-259-1255 and speak with a Shelter Advocate\n    Shelter guest must be 18 years or older, and children must be accompanied by a parent or guardian"
  },
  {
    "addressLine1": "P.O. Box 1589",
    "city": "Saint Johns",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "85924",
    "name": "New Hope Ranch",
    "organization": "New Hope Ranch",
    "phone": "(928) 337-5060",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "1050 W. Amador",
    "city": "Las Cruces",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "88004",
    "name": "Las Cruces Gospel Rescue Mission",
    "organization": "Las Cruces Gospel Rescue Mission",
    "phone": "(575) 523-7727",
    "website": "http://www.lcgrm.org/",
    "description": "Free meals (breakfast, lunch and supper everyday), clothing, food, and emergency lodging.\n\nMeeting people at their point of need (physically, emotionally, spiritually) by providing hot meals (3 times daily), hot showers, clean beds and shelter, clothing, and the Good News.\n"
  },
  {
    "addressLine1": "3700 Altura Ave",
    "city": "El Paso",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79930",
    "name": "YWCA El Paso For Women - Sara McKnight Transitional Living Center",
    "organization": "YWCA El Paso For Women - Sara McKnight Transitional Living Center",
    "phone": "(915) 566-2762",
    "website": "https://www.ywcaelpaso.org/",
    "description": "The Sara McKnight Transitional Living Center (TLC) provides housing for 39 homeless women at a time with or without children for up to 24 months; however, the average stay is less than one year. YWCA El Paso del Norte Regions Transitional Living Center provides a bridge to successful independence for women who are homeless or at risk of homelessness."
  },
  {
    "addressLine1": "1020 N. Campbell Street",
    "city": "El Paso",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79902",
    "name": "La Posada Home Inc",
    "organization": "La Posada Home Inc",
    "phone": "(915) 544-4595",
    "website": "http://www.laposadahome.org/",
    "description": "Transitional/Permanent long term emergency housing for homeless families victims of domestic violence.\nLa Posada Home serves women with children who are survivors of domestic violence. The average client is a Hispanic female, between the ages of 20 and 35, who is in the \"Extreme Low Income\" bracket; no high school diploma, with an average of two children under the age of 18 and escaping domestic violence.\n"
  },
  {
    "addressLine1": "1220 Myrtle Avenue",
    "city": "El Paso",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79901",
    "name": "Opportunity House Women's Resource Center",
    "organization": "Opportunity House Women's Resource Center",
    "phone": "(915) 577-0069",
    "website": "https://homelessopportunitycenter.org/",
    "description": "The Womens Resource Center (WRC) is an emergency shelter for single homeless women. This is our newest facility, created in response to the growing number of homeless women in our community. Before this facility was created, homeless women were housed in a separate area within the mens emergency shelter. It grew evident that this arrangement was problematic, and that the women could best be protected and supported in pursuing their goals given a separate facility. Now that the women have a safe place of their own, they have truly developed a supportive, community environment. The residents work together to maintain the shelter, advocate for each other, connect each other to resources, and encourage each other to make positive changes in their lives.\nAll residents receive three meals a day, clothing, and basic hygiene items. They are also connected with supportive case management services and have access to all the services the Opportunity Center has to offer.\n"
  },
  {
    "addressLine1": "1208 Myrtle Avenue",
    "city": "El Paso",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79901",
    "name": "Opportunity House El Paso Men's Resource Center",
    "organization": "Opportunity House El Paso Men's Resource Center",
    "phone": "(915) 577-0069",
    "website": "https://homelessopportunitycenter.org/",
    "description": "Men's Resource Center\nHours: 24 hours a day.\n\nEveryone seeking help in our facility receives 3 meals a day, free medical service, and free access to showers, bathrooms, laundry facilities, storage, clothes closet, individual bedding, phone and mail service, and substance abuse counseling among many others.\n\nOur emergency overnight shelter/day resource center is the only barrier-free facility in the Paso del Norte region.\n\n\nOn average, the Mens Resource Center (MRC) provides a safe place for 170 homeless men from all walks of life to sleep."
  },
  {
    "addressLine1": "221 N. Lee Street",
    "city": "El Paso",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79901",
    "name": "Rescue Mission of El Paso",
    "organization": "Rescue Mission of El Paso",
    "phone": "(915) 532-2575",
    "website": "https://rmelp.org/",
    "description": ""
  },
  {
    "addressLine1": "920 S. Oregon St.",
    "city": "El Paso",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79901",
    "name": "El Paso Villa Maria - For Women",
    "organization": "El Paso Villa Maria - For Women",
    "phone": "(915) 544-5500",
    "website": "http://www.villamariaep.org/",
    "description": "Villa Maria is a temporary home where women, homeless & without children, heal to wholeness.\n\nVilla Maria receives referrals from various agencies including: probation officers, social workers, hospitals, the Center Against Family Violence, drug and alcohol treatment programs, other shelters and mental health agencies. And often women in need simply ring the doorbell for help. Within a year's time we receive more than three times the number of requests for shelter than we can realistically handle.\n\nCall for more information."
  },
  {
    "addressLine1": "920 S Oregon St",
    "city": "El Paso",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79901",
    "name": "Villa Maria",
    "organization": "Villa Maria",
    "phone": "(915) 544-5500",
    "website": "https://villamariaep.org/",
    "description": ""
  },
  {
    "addressLine1": "1014 S Virginia St",
    "city": "El Paso",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79901",
    "name": "Dame La Mano Crisis Center",
    "organization": "Dame La Mano Crisis Center",
    "phone": "(915) 546-4040",
    "website": "https://www.facebook.com/dame.lamano.1",
    "description": ""
  },
  {
    "addressLine1": "4300 E. Paisano Dr",
    "city": "El Paso",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79905",
    "name": "Salvation Army of El Paso Emergency Shelter",
    "organization": "Salvation Army of El Paso Emergency Shelter",
    "phone": "(915) 544-9811",
    "website": "https://www.salvationarmytexas.org/elpaso/",
    "description": ""
  },
  {
    "addressLine1": "5300 Paisano",
    "city": "El Paso",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "79905",
    "name": "El Paso Housing Authority HACEP Shelter Program",
    "organization": "El Paso Housing Authority HACEP Shelter Program",
    "phone": "(915) 849-3742",
    "website": "http://www.hacep.org/",
    "description": "Shelter Plus Care Program will help homeless veterans receive housing and supportive services through the collaboration with El Paso Veterans Affairs Healthcare Services and Integrity Asset Management. HUD-VASH program.As of 16NOV09, 40 housing slots vouchers available for homeless veterans.\n\nFor Homeless Civilians\nThe final sub-category of public housing is the Shelter Plus Care Program.  This is a transformative, grant-funded initiative to assist chronically homeless disabled individuals.  HACEP provides 22 units to the residents of Siesta Gardens in the Northeast.  Meanwhile, a partnership with Emergence Health Network provides important onsite counseling and rehabilitative care to the residents.\nThese are but a few of the many programs HACEP offers to the residents of the City of El Paso. If you need any additional information that is not listed on our website, feel free to contact our customer service department at (915) 849-3742."
  },
  {
    "addressLine1": "1000 Mills Avenue",
    "city": "Las Vegas",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87701",
    "name": "Casa de Samaritan",
    "organization": "Casa de Samaritan",
    "phone": "(505) 454-1390",
    "website": "http://lvsamaritan.org/",
    "description": "Dinner starts at 6 P.M."
  },
  {
    "addressLine1": "220 Albright Street",
    "city": "Taos",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87571",
    "name": "Taos Mens Shelter",
    "organization": "Taos Mens Shelter",
    "phone": "(575) 779-9198",
    "website": "http://www.taosmensshelter.org/",
    "description": "Emergency overnight shelter for men 18 years of age or older.\n\nHours of Operation for the Homeless\nWinter Hours: 5:00pm to 8:00am\n"
  },
  {
    "addressLine1": "128 La Posta Rd",
    "city": "Taos",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87571",
    "name": "DREAMTREE PROJECT",
    "organization": "DREAMTREE PROJECT",
    "phone": "(575) 758-9595",
    "website": "https://www.dreamtreeproject.org/",
    "description": "The DreamTree Project operates an Emergency Youth Shelter for ages 12 to 18 and a Transitional Living Program for youth 16 to 24. Emergency Youth ShelterWe accept youth ages 12 to 17 who are homeless, runaways, or fleeing domestic violence. We provide 24-7 supervision and support, along with case management, life skills training, medication management, transportation, and educational support. In addition, we facilitate appointments and services for medical care, behavioral health care, dental care, vision care, and juvenile justice engagement. All residents are enrolled in high school/GED and are required to have a current mental health assessment. We have the capacity for up to 8 youth, who can stay up to 90 days.Transitional Living ProgramWe invite young adults ages 16 to 24 who are homeless, runaways, or fleeing domestic violence to apply to our program. We provide independent housing with 24-7 crisis support, along with case management, life skills training, employment support and educational support. In addition, we facilitate appointments and services for medical care, behavioral health care, dental care, vision care, and juvenile justice engagement. All residents are required to complete high school/GED and maintain employment. We have the capacity for up to 9 young adults, who can reside in the program for up to two years.Our goal is to have every youth experience safety and supportand to achieve a positive placement to re-establish stability."
  },
  {
    "addressLine1": "400 E Bland",
    "city": "Roswell",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "88201",
    "name": "Roswell Homeless Coalition - Rivers of Life",
    "organization": "Roswell Homeless Coalition - Rivers of Life",
    "phone": "(575) 627-0668",
    "website": "https://www.roswellhomelesscoalition.com/",
    "description": ""
  },
  {
    "addressLine1": "610 N SIlver Street",
    "city": "Silver City",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "88061",
    "name": "SPIN (Supporting People In Need) Shelter",
    "organization": "SPIN (Supporting People In Need) Shelter",
    "phone": "(575) 494-1128",
    "website": "https://spinhousingnm.org/",
    "description": ""
  },
  {
    "addressLine1": "519 North California Street",
    "city": "Socorro",
    "state": "New Mexico",
    "stateAbbreviation": "NM",
    "postal": "87801",
    "name": "PSI Safe Harbor",
    "organization": "PSI Safe Harbor",
    "phone": "(575) 835-2895",
    "website": "https://www.psisafeharbor.org/",
    "description": "Day shelter open between 9 a.m. and 2 p.m., that serves between 20 and 40 low income and handicapped people on any given Monday, Wednesday and Friday (closed on the other four days of the week). Hot meals and free clothing are available whenever shelter is open\nHOUSING\nIn times of emergency like eviction, extreme cold, and house fires, clients may require temporary housing in a motel. We provide this service, and we also direct clients to housing agencies.\n\nADDICTION REHABILITATION\nWhen clients need help fighting alcohol and/or drug addiction, PSI Safe Harbor is there. Thanks to generous donations, we are often able to assist clients to enter rehabilitation and gain sobriety.\n\nHOMEMADE MEALS\nWe offer homemade meals for our clients every Monday, Wednesday, and Friday at 11 AM. Thanks to generous donations from local businesses, these lunches are healthy, filling, and fresh.\n\n\nSHOWERS\nTwo showers are available to clients, one for women and one for men. We supply clients clean towels, shampoo, and soap. Cleanliness helps clients to feel happy and confident.\n\nCLOTHING\nLocal churches, businesses, organizations, and individuals donate clothing and household items to us every week. These items are available for free to our clients and their children.\n\n\nEMERGENCY FOOD\nThanks to generous food donations from local businesses like John Brooks Super Mart and individual donors, we offer a wide variety of canned and fresh items from our emergency food supply.\n"
  }
]