[
  {
    "addressLine1": "420 Noble Street",
    "city": "Anniston",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36201",
    "name": "Salvation Army Anniston Emergency Services",
    "organization": "Salvation Army Anniston Emergency Services",
    "phone": "(256) 236-5644",
    "website": "https://www.facebook.com/uss.salvationarmy.org/",
    "description": "Provides emergency services, utilities assistance, rent assistance, prescription medicine assistance, clothes.\nHours: Mon, Tue, Thu, Fri\n8:00 am - 4:00 pm\nWed\n8:00 am - 12 noon.\n"
  },
  {
    "addressLine1": "905 Ashland Highway",
    "city": "Talladega",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35160",
    "name": "Presbyterian Home for Children",
    "organization": "Presbyterian Home for Children",
    "phone": "(256) 362-2114",
    "website": "https://www.phfc.org/",
    "description": "We provide transitional housing for homeless minor children (male and female) and female caregivers as well as a Transition to Adult Living program for 19-24 year old females."
  },
  {
    "addressLine1": "409 21st Street N",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35203",
    "name": "Birmingham PATH Center",
    "organization": "Birmingham PATH Center",
    "phone": "(205) 322-6854",
    "website": "http://www.pathwayshome.org/",
    "description": "We supply emergency services for homeless women and children showers, clean clothes and hot meals. Last year, our Day Center served more than 1,200 women and children.\n\nThe Day Center is open 365 days a year.\nWeekdays 8:15 AM - 5:00 PM\nWeekends and Holidays 9:00 AM - 3:00 PM\n\nWe provide both short-term transitional and long-term transitional housing for women and children.\n\nWe offer a Safe Haven for chronically homeless women with a mental illness. Our Safe Haven is the only program of its kind in Alabama.\n\n\nWe assist with life plans so women can identify their individual paths to self-sufficiency.\n\nWe teach life and employment skills, such as how to handle money, how to use a computer, how to interview, and how to operate in a business environment.\n\nWe assist with transportation, child care, and job searches.\n\nWe teach homeless children about decision-making, anger management, and character education."
  },
  {
    "addressLine1": "1616 2nd Avenue North",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35203",
    "name": "Brother Bryan Mission",
    "organization": "Brother Bryan Mission",
    "phone": "(205) 322-0092",
    "website": "http://bbmission.com/",
    "description": "Homeless Shelter and services for men.\n\nProvides all essentials for daily living, chapel service nightly, NA & AA meetings weekly, programs to improve reading and writing skills.\n\nEligibility: Desire to stay clean and sober and to return to society as a functional person. Serves Birmingham and Jefferson County.\n\n\nIntake procedure: Church, social workers, personal or families.\n\nHours:Breakfast - 5:30am, dinner - 5:30pm. Entrance at 3:00pm, leave at 6:30am, Monday - Friday (7:30am on Saturday). Doors locked at 8:00pm.\n\nFees: There is a small fee. Contact for details.\n\nServices:Homeless Shelter for Men\n\nNew Life Fellowship\nnew-life-programThe New Life Fellowship (NLF) Program is nine-month Christian recovery program which seeks to address the issues that cause homelessness and the barriers that hinder one from returning to a productive life.\nThe NLF Program is divided into four phases. Satisfactory progress has to be made in order to graduate into the next phase. A review committee of senior staff members meets every two months to determine if advancement is warranted and a weekly meeting is held to report on general progress.\n\nThe criteria used in evaluating each mans progress includes:\n    Completion of assigned materials\n    Satisfactory compliance in ones responsibilities\n    Possession of the legal documents required for employment (Birth Certificate; Social Security Card; and an Alabama ID/Drivers License)\n    Appropriate attitudes toward staff and others.\nIn the last phase a client is helped by key volunteers from the local business community to prepare a resume, apply and find placement in a suitable, sustainable-wage job.\nThe goal of BBM is for each client to return to their families, churches, and communities\n    Free from addiction\n    With stable employment and housing\n    With healthy relationships toward God and others"
  },
  {
    "addressLine1": "712 4th Court West",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35204",
    "name": "Catholic Center of Concern",
    "organization": "Catholic Center of Concern",
    "phone": "(205) 786-4388",
    "website": "https://www.catholiccharitiesbhm.org/the-catholic-centers-of-concern.html",
    "description": "Catholic Center of Concern is a food pantry. Written referral, proper identification, social security card, official proof of current address.\n\nFood pantry service hours: Mon - Thurs: 8:30am - 12:30pm (1st come, first served.) Afternoons and Fridays by appointment only. Fourth Wednesday of the month, closed to the public.. .\n\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "1016 19th Street South",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35205",
    "name": "Bridge Ministries - Homeless Families with Children",
    "organization": "Bridge Ministries - Homeless Families with Children",
    "phone": "(205) 930-0309",
    "website": "http://www.bridgeministriesbham.org/",
    "description": "Temporary lodging for families with children when all other shelters are full.\n\n* Referral from family shelter required.\nFinancial assistance from shelter to housing.\nBy appointment only\n\nHomeless families with children should never stay on the streets, even for one night. If a family is referred to a local family shelter but cannot enter the shelter immediately, Bridge Ministries will arrange for short-term emergency lodging and food at a local motel with cooking facilities. Shelter directors or case managers make these referrals after the family completes the intake interview at the shelter. As soon as space is available, the family enters the shelter. When the family situation stabilizes and they are ready to move out of the shelter, we can help with security deposits or first month's rent to help them obtain housing."
  },
  {
    "addressLine1": "5712 1st Avenue North",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35212",
    "name": "Community Kitchens of Birmingham",
    "organization": "Community Kitchens of Birmingham",
    "phone": "(205) 251-3569",
    "website": "http://thecommunitykitchens.org/services/",
    "description": "Those we serve come from a variety of backgrounds. Generally we help children, the unemployed, homeless, the working poor, the disabled, families on welfare, veterans and the elderly whose fixed income is too small. Some of our guests have income. About 25% of our guests are employed part-time or on a temporary basis, but still cannot meet their basic needs. Eating at Community Kitchens allows them to use their money for rent, gas, utilities and other necessities that help keep them from becoming homeless. 30 50% of our guests are homeless. The homeless, who often sleep outside or in shelters, need a nutritious meal at least once a day. For 60% of our guests this is the only hot meal they will get all day and for 30% it is the only meal of any kind! Those who eat with Community Kitchens can also receive referrals to other community agencies that can assist with housing and other needs."
  },
  {
    "addressLine1": "1625 12th Avenue South",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35205",
    "name": "Fellowship House",
    "organization": "Fellowship House",
    "phone": "(205) 933-2430",
    "website": "https://fshbhm.org/",
    "description": "Our Goal\nOur goal is to aid the individual in the personal, social and vocational adjustment necessary for the maintenance of a sober and productive life.\nProvides services to men and women who suffer from alcoholism and/or drug addiction.\n\nRecovery Programs\n\nWe provide a substance abuse recovery program designed to serve the special needs of an individual who suffers from alcoholism, drug addiction and co-occurring disorders.\n\nNon-Profit Agency funded primarily by the United Way, donations, the Alabama Department of Mental Health, and sliding-scale fees. The house provides a substance abuse recovery program designed to serve the special needs of an individual who suffers from alcoholism, drug addiction and co-occurring disorders."
  },
  {
    "addressLine1": "1615 Cullom Street South",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35205",
    "name": "Hannah Bethany Home - Womens Homeless Shelter",
    "organization": "Hannah Bethany Home - Womens Homeless Shelter",
    "phone": "(205) 930-0144",
    "website": "",
    "description": "Adult women. Intake 9:00 AM-5:00 PM. Phone referral okay.\nProvides shelter, clothes, transportation referral, group and individual counseling.\n\n\nEligibility: Women in need may receive shelter if they are willing to participate in setting and attaining goals as well as cooperating with staff and other residents.\n\nIntake procedure: Phone\n\nHours: 24 Hours. 7 Days.\n\nFees:No Fee for Service.\n\nServices: Homeless Shelter for Women\n\n"
  },
  {
    "addressLine1": "1323 7th Avenue North",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35203",
    "name": "Hope House Residential Youth Shelter",
    "organization": "Hope House Residential Youth Shelter",
    "phone": "(252) 467-4673",
    "website": "http://www.familyconnection-inc.org/",
    "description": "Phone: 252.HOPE (4673)\nTeens (13-21). Monday-Friday 10:00 AM-3:00 PM.\nTransportation provided to shelter facility.\n\nResidential Youth Shelter\nOur shelter provides a safe environment and focuses on the needs of youth ages 12 to 17. We provide immediate access 24 hours a day for youth in crisis. Our services are designed to assist youth and their families identify and resolve conflict, strengthen family relationships, avoid family dissolution, and reunite youth with their family, when possible.\n"
  },
  {
    "addressLine1": "5916 1st Ave S",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35212",
    "name": "YWCA Interfaith Hospitality House for Families",
    "organization": "YWCA Interfaith Hospitality House for Families",
    "phone": "(205) 591-4302",
    "website": "https://ywcabham.org/community-housing/interfaith-hospitality-house-ihh/",
    "description": "Interfaith Hospitality House\nThe YWCA operates one of Alabamas only permanent facilities serving two parent families experiencing homelessness in the state of Alabama. Through the Interfaith Hospitality House, located in the Woodlawn neighborhood of Birmingham, the YWCA offers shelter and supportive services for up to seven families at a time and the assistance needed to move them out of homelessness into housing.\n\n\n\nInterfaith Hospitality House is a housing facility that provides furnished two-bedroom suites to families in housing crises and up to three meals a day. Residents share a community kitchen, dining room and living room with other residents in a comfortable facility staffed 24-hours a day. Each family is given responsibilities to share in the upkeep of the facility and must fulfill these duties in order to remain there.\nAlthough the YWCA does not charge any rent, tenancy or fees in order to participate in the Interfaith program, it does expect a commitment on the part of each family to work hard at stabilizing and move into permanent housing.  To this end, all residents are required to either attend school or be employed and all children must attend school as a condition of residency.  Each family is provided with one-on-one case management and access to a range of critical family services including day-care, employment readiness skill-building and transportation assistanceall of which are geared toward equipping families for success in permanent housing.  To view pictures of Interfaith, including a typical bedroom suite, click here.\n\n\nHow do I apply for this program? Families interested in assistance and shelter through the Interfaith Hospitality House must be homeless according to the U.S. Department of Housing and Urban developments definition and must meet one of the following criteria:\n    Two parent family with children\n    Single father with a child/children\n    Single mother with at least one son over the age of 10\n\n\nThe Interfaith Hospitality House has moved to a new state-of-the-art facility just a few blocks away from the original location as part of the YWCAs YWoodlawn initiative."
  },
  {
    "addressLine1": "940 Montclair Road",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35213",
    "name": "Jefferson-Blount-st. Clair Mental Health/Mental Retardation Authority",
    "organization": "Jefferson-Blount-st. Clair Mental Health/Mental Retardation Authority",
    "phone": "(205) 595-4555",
    "website": "http://www.jbsmha.com/",
    "description": "RESIDENTIAL PROGRAMS\nThe Authority operates a residential program for adults with mental illness, which provides treatment and housing for 90 individuals. This program is comprised of four Transitional homes, four Group homes, and a Brief Intensive Treatment Home providing services to ten people each.\nThe residential programs are staffed and operated by the Authority. Individuals in the residential programs participate in Day Treatment activities that emphasize an educational and rehabilitative approach. As individuals leave the residential program, efforts are made to place them in supported housing arrangements, and referrals are made to local mental health centers to ensure continued support and treatment.\n\nINDEPENDENT LIVING\nThe Horizon Apartments, operated by the Authority is a 19 bed apartment complex, with a resident manager available on a 24-hour basis. The Greenwood Apartments also operated by the Authority is an 11 bed apartment complex with a resident manager available on a 24 hour basis. These complexes offer individuals with serious mental illness an opportunity to live independently with support during emergencies. Case management support is also provided to those residents in need of these services. Referrals are received from local community agencies and the community at large.\nThe Authority also owns and operates four, two-bed Townhomes for independent living. Although no resident manager is located on the premises, case management services are provided to all residents. Referrals for the Townhomes are received from local community agencies and the community at large.\n\nIn addition the Authority operates 20 scattered site apartments for homeless mentally ill individuals. Case management support is provided as well as Day Treatment activities."
  },
  {
    "addressLine1": "3420 2nd Avenue North",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35222",
    "name": "Jimmie Hale Mission Shelter - Shepura Men’s Center",
    "organization": "Jimmie Hale Mission Shelter - Shepura Men’s Center",
    "phone": "(205) 324-2271",
    "website": "https://jimmiehalemission.com/",
    "description": "Downtown Jimmie Hale Mission, Inc. is a Christian-based, nonprofit 501(c)(3) organization, which includes a homeless shelter for men, a shelter for women and children, after-school Bible clubs, recovery programs, learning centers, and thrift stores.\n\nPlease bring your online application from our website (https://jimmiehalemission.com)  with you if you want to apply for our program. To schedule an in-take interview, you may call the Shepura Mens Center between 9:00 a.m. and 4:00 p.m., Monday through Friday.\n\n\nThe Shepura Mens Center is the oldest ministry of the Jimmie Hale Mission. At this facility, we offer a 160-bed mens dormitory, a dining hall that serves over 300 meals a day, a clothes closet, chapel services and a learning center.\n\nFor guests, we are a place of last resort for broken lives, the only thing standing between the streets, prison or worse. We provide structure, guidance and the means with which to amend lives. We give men the ability to hope again that can only be found through the true knowledge of Christ. We share this knowledge with them through:\n    Bible-based recovery classes\n    Individual counseling sessions\n    Group and individual Bible studies\n    Work therapy\n    Education remediation and job readiness\n"
  },
  {
    "addressLine1": "2015 26th Avenue North",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35234",
    "name": "Salvation Army of Greater Birmingham Emergency Shelter",
    "organization": "Salvation Army of Greater Birmingham Emergency Shelter",
    "phone": "(205) 328-2420",
    "website": "http://salvationarmyalm.org/birmingham/",
    "description": "Men, women & children. Picture ID required.\nMen Intake 4:00 PM-until full. Women Intake 8:00 AM-until full.\n(After hours intake for emergencies.)\nNo ID required for first night\n\n1. Shelter, Food, Clothing, Counseling for homeless men.\n\n2. Women and Children's Shelter: Shelter, Food, Counseling, Clothing for women and their children.\n\n"
  },
  {
    "addressLine1": "626 2nd Ave N",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35202",
    "name": "The Firehouse Shelter",
    "organization": "The Firehouse Shelter",
    "phone": "(205) 252-9571",
    "website": "https://firehouseshelter.com/",
    "description": "Overnight shelter and day program for adult homeless men.\n\n\nThe Firehouse Shelter serves more homeless men than any agency in the state of Alabama and operates the broadest, most comprehensive continuum of services for Birmingham's homeless. At the heart of our mission are chronic hard-core homeless men, 90% of whom come from the Birmingham metro area.\n\n\nEMERGENCY SHELTER PROGRAMS\n\nTHE EMERGENCY SHELTER OPERATION\n\nSTOP (STREET OUTREACH)\n\nPROFESSIONAL CASE MANAGEMENT\n\nDAY SHELTER\n\nMEALS PROGRAM\n\nCLOTHES CLOSET\n\nTEAM (PRE-TREATMENT ADDICTION PROGRAM)\n\nLITERACY & GED PROGRAMS\n\nCOMMUNITY GARDEN (SMITHFIELD NEIGHBORHOOD)\n\n\n\nHOUSING PROGRAMS\n\n\n(NASHAMAH) TRANSITIONAL HOUSING (59 BEDS @ 2 SITES)\n\n(SAFE HAVEN) PERMANENT SUPPORTIVE HOUSING (24 BEDS)\n\n\n(THE PHOENIX PROJECT) PERMANENT SUPPORTIVE HOUSING (62 BEDS)\n\n(CDM) PERMANENT HOUSING (18-20 BEDS)\n\nAFFORDABLE LOW INCOME HOUSING (9 PROPERTIES)\n\n"
  },
  {
    "addressLine1": "2230 Fourth Avenue North",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35203",
    "name": "First Light Women Childrens Shelter and Services",
    "organization": "First Light Women Childrens Shelter and Services",
    "phone": "(205) 323-4277",
    "website": "https://www.firstlightshelter.org/",
    "description": "Emergency shelter for homeless women and children; permanent housing for women with disabilities; permanent housing for chronically homeless women. Referrals as necessary; life skills training; serves breakfast, and dinner daily.\n\nEligibility: Homeless women and children, homeless women with mental illness, chronically homeless women. Serves metro Birmingham and transient homeless.Hours: 24 hours, 7days. Preferred intake hours: 8:00am to 5:00pm, Mon. - Fri. Will shelter any time as space permits.\n\nIntake procedure:Phone or personal appearance\n\nFees: No Fee for Service.\n\n"
  },
  {
    "addressLine1": "409 Richard Arrington Jr. Blvd. N",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35203",
    "name": "Pathways",
    "organization": "Pathways",
    "phone": "(205) 322-6854",
    "website": "https://www.pathwayshome.org/",
    "description": "    Serving women and children\n    Transitional housing\n    Permanent supported housing for mentally ill women\n    Meals and clothing provided\n    Shower and laundry facilities\n\nPathways' mission is to end homelessness for women and children through hospitality, housing, and hope. We are a private, not for profit, United Way agency that helps homeless women and children put their lives back together.\nHere's how we help:\n\nWe supply emergency services for homeless women and children showers, clean clothes and hot meals. Last year, our Day Center served more than 1,200 women and children.\n\nWe provide both short-term transitional and long-term transitional housing for women and children.\n\n\nWe offer a Safe Haven for chronically homeless women with a mental illness. Our Safe Haven is the only program of its kind in Alabama.\n\nWe assist with life plans so women can identify their individual paths to self-sufficiency.\n\nWe teach life and employment skills, such as how to handle money, how to use a computer, how to interview, and how to operate in a business environment.\n\nWe assist with transportation, child care, and job searches.\n\nWe teach homeless children about decision-making, anger management, and character education."
  },
  {
    "addressLine1": "1308 26th Ave North",
    "city": "Birmingham ",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35204",
    "name": "Changed Lives Christian Center",
    "organization": "Changed Lives Christian Center",
    "phone": "(205) 521-6421",
    "website": "https://cl-cc.org/",
    "description": "Homeless transitional housing ministry. 6-24 month program. Meal assistance, job placement assistance, transportation assistance. Monthly free medical clinic. Homeless meal service 3 nights per week.\n\nDescription from CLCC website: Changed Lives Christian Center (CLCC) is a Christ-centered ministry that offers transitional housing for men who are on their way to recover from homelessness, whether from the economic recession or other personal issues. CLCC aims to do more than manage the homeless by feeding and sheltering them overnight or for a short time. The mission of Changed Lives is to take human beings who are presently homeless and weave them back into the fabric of productive society. The center currently houses men for up to two years, providing a mailing address, getting Social Security cards and/or drivers licenses if needed, offering medical and dental care, teaching life skills and helping them find jobs. Residents have savings accounts, learn personal financial management and pay monthly rent to live at CLCC."
  },
  {
    "addressLine1": "2305 5th Avenue North",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35203",
    "name": "Jessies Place - Homeless Shelter for Women and Children",
    "organization": "Jessies Place - Homeless Shelter for Women and Children",
    "phone": "(205) 323-0170",
    "website": "https://jimmiehalemission.com/",
    "description": "Due to our desire to protect women and children already in the program, women wanting to enter the program should arrive at Jessies Place by 9 a.m., Monday through Friday, to apply and participate in an in-take interview.\n\nJessies Place is the women and childrens shelter of the Jimmie Hale Mission ministries. Established in 1998, Jessies Place is a haven for homeless and hurting women and children seeking shelter while preparing to reach self-sufficiency.\nWhat Do We Do?\nAt Jessies Place, we give women and children the chance for transformation. Within our walls, despair becomes new hope, sorrow becomes joy, and those broken and hurting become strong and whole. As we strive to be Christs vessel of love in the world, we look to nurture the spirit and create independent living with education remediation, job readiness, and most importantly, the boundless healing found in Gods Word.\nThats why at Jessies Place, we offer more than a refuge. For once inside our doors, we can give women and children the way out.\nWhat Do We Offer?\nFor guests, we are a place of refuge from a hostile world or specific danger in their lives, a place where Gods Word gives them the strength and confidence to pursue:\n    Daily life skills training\n    Bible studies\n    Case management and counseling\n    Education remediation and job readiness\n    Childrens programs including play therapy\nFor the community, we provide an invaluable service by not only shielding women and children from a host of sufferings, but also by helping our guests become independent, self-sufficient members of society."
  },
  {
    "addressLine1": "3600 8th Avenue South",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35222",
    "name": "Priority Veteran Birmingham",
    "organization": "Priority Veteran Birmingham",
    "phone": "(866) 460-3827",
    "website": "http://priorityveteran.org/",
    "description": "Priority Veteran serves veterans and their family members throughout Alabama with offices in Birmingham, Huntsville, Tuscaloosa and Tuskegee.Priority Veteran offers can assist low-income, homeless or at-risk veteran families with: Obtaining permanent, stable housing Obtaining VA benefits Obtaining federal and/or state benefits Accessing community-based resources Obtaining/completing employment training Obtaining employment Advocacy in landlord/tenant disputes Advocacy in rent/utility arrearages Temporary Financial Assistance Deposits Rent assistance Moving costs General housing supplies Utility assistance"
  },
  {
    "addressLine1": "2402 Old Springville Road",
    "city": "Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35215",
    "name": "The Lovelady Center",
    "organization": "The Lovelady Center",
    "phone": "(205) 833-7410",
    "website": "https://www.loveladycenter.org/",
    "description": "Transitional housing for women and children9 - 12 month faith based programprison re-entry programs\nEmpowering women, through faith-based initiatives, so they can return to society as well equipped women of God. The program is about empowerment, hope, and a belief in the value of each and every human life. It is our mission to help women rebuild their lives and walk forward with faith-driven hope for a future as a contributing member of our community. TLC ensures each woman is taught how to overcome barriers to success by providing access to needed services. You can give a person shelter, food and clothing, but if they cannot support themselves, the cycle of poverty and incarceration will not be broken.\n"
  },
  {
    "addressLine1": "2230 Fourth Avenue",
    "city": "North Birmingham",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35203",
    "name": "First Light, Inc.",
    "organization": "First Light, Inc.",
    "phone": "(205) 323-4277",
    "website": "https://www.firstlightshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "2124 Old Springville Road",
    "city": "Center Point",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35212",
    "name": "Clay Veterans Center - Three Hots & A Cot",
    "organization": "Clay Veterans Center - Three Hots & A Cot",
    "phone": "(205) 520-2356",
    "website": "http://www.cotsfrovets.org/",
    "description": "For Homeless Veterans\nOperated by Three Hots and A Cot Three Hots and A Cot is a 501c3 organization (TAX ID # 26-4355458) formed by veterans to help veterans. Our primary mission is to assist homeless military veterans transition to a self sustained lifestyle"
  },
  {
    "addressLine1": "15769 Thomas Chapel Road",
    "city": "Cottondale",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35453",
    "name": "Dent Transitional Program",
    "organization": "Dent Transitional Program",
    "phone": "(205) 246-5655",
    "website": "http://tracydentfoundation.pledgepage.org/",
    "description": "Dent Transitional Program is a four step program designed to improve the quality of life of young men between the ages of 19-30. We provide them with food, clothes, shelter, life skills training, GED (if needed), and assistance with gaining independed living at no cost to the participant. There is an application process and criteria that have to be met. We also have a food pantry clothing closet, and a referral program that is offered to the general public at no cost."
  },
  {
    "addressLine1": "2902 Greensboro Avenue",
    "city": "Tuscaloosa",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35403",
    "name": "Salvation Army Tuscaloosa Center of Hope",
    "organization": "Salvation Army Tuscaloosa Center of Hope",
    "phone": "(205) 345-6939",
    "website": "https://salvationarmyalm.org/tuscaloosa/",
    "description": "The Salvation Army Tuscaloosa provides a homeless Drop In Centers, Homeless Shelter for Families, Homeless Shelter for Men, Homeless Shelter for Single Mothers, Homeless Shelter for Women.\n\nFood pantry available Monday through Friday from 9 a.m. until 3 p.m. Individuals can recieve help once every 90 days.\n\nOther Services Provided:\n\nChristmas Programs, Electric Service Payment Assistance, Gas Service Payment Assistance, Rent Payment Assistance, Water Service Payment Assistance.\n\nJob and Search Placement."
  },
  {
    "addressLine1": "1711 23rd Ave",
    "city": "Tuscaloosa",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35401",
    "name": "Community Soup Bowl",
    "organization": "Community Soup Bowl",
    "phone": "(205) 752-2421",
    "website": "http://tuscaloosasoupbowl.com/",
    "description": ""
  },
  {
    "addressLine1": "2117 Old Moulton Heights Road",
    "city": "Decatur",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35602",
    "name": "Tennessee Valley Outreach Mission",
    "organization": "Tennessee Valley Outreach Mission",
    "phone": "(256) 350-5226",
    "website": "https://www.tennesseevalleyoutreach.org/",
    "description": ""
  },
  {
    "addressLine1": "1400 Evangel Drive",
    "city": "Huntsville",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35816",
    "name": "Downtown Rescue Mission",
    "organization": "Downtown Rescue Mission",
    "phone": "(256) 536-2441",
    "website": "https://www.downtownrescuemission.org/",
    "description": "Faith-based organization that provides emergency shelter to homeless individuals and families. Includes a work and social rehabilitation program, as well as counseling, food, lodging, and other aid. Male and female dorms are available, and separate lodging is available for women with children.\n\nFull list of services provided at the Downtown Rescue Mission: Homeless Shelter, Homeless Shelter for Families, Homeless Shelter for Men, Homeless Shelter for Single Fathers, Homeless Shelter for Single Mothers, Homeless Shelter for Women\n\nOffice hours 8:30-4:30 Mon-Fri.\n\n"
  },
  {
    "addressLine1": "216 East Crawford Street",
    "city": "Dothan",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36301",
    "name": "Dothan Rescue Mission - Men's Lodge",
    "organization": "Dothan Rescue Mission - Men's Lodge",
    "phone": "(334) 794-4637",
    "website": "http://dothanrescuemission.com/",
    "description": "Provide men with a clean and safe living environment giving them the personal necessities to seek and obtain employment for their re-entry into the community.\n\nEligibility: Any non-convicted of sexual crimes men.\nHours: Monday - Friday 8am - 4pm\nWe do not have any further contact information on the lodge or hours it is open.\nProvides men with a clean and safe living environment giving them the personal necessities to seek and obtain employment for their re-entry into the community.\n\nFees: No Fee for Service"
  },
  {
    "addressLine1": "209 East Washington Street",
    "city": "Dothan",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36301",
    "name": "Dothan Rescue Mission - Women's Lodge",
    "organization": "Dothan Rescue Mission - Women's Lodge",
    "phone": "(334) 794-4637",
    "website": "http://dothanrescuemission.com/",
    "description": ""
  },
  {
    "addressLine1": "605 N. Alice Street",
    "city": "Dothan",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36303",
    "name": "Momma Tina's Mission House - TOPS",
    "organization": "Momma Tina's Mission House - TOPS",
    "phone": "(334) 699-6886",
    "website": "https://www.facebook.com/pages/Moma-Tinas-Mission-House/132501160134967",
    "description": "Homeless Shelter for Men. Please contact Momma Tina for availability. Also provides a soup kitchen. This program is a feeding ministry for those less fortunate."
  },
  {
    "addressLine1": "182 Martin St",
    "city": "Ozark",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36360",
    "name": "Dale County Rescue Mission",
    "organization": "Dale County Rescue Mission",
    "phone": "(334) 774-6553",
    "website": "https://www.facebook.com/DaleCountyRescueMission/",
    "description": "Providing food, shelter, & hope to residents of Dale County.\nThis agency provides Men's Shelter, 3 Meals non-perishable foods for clients. Burn-out victims (Emergency Clothing, Furniture, and Household Items); Prescription Expense Assistance, Automobile Gas, and Holiday Food Baskets.\n\n\nComplete list of services include: Donation Drop Off Point, Food Pantry, Gas Money, General Clothing Provision, Homeless Shelter for Men, Prescription Expense Assistance, Soup Kitchen.\n\nEligibility: Must provide Picture ID; No Sex Offenders due to proximity of Day Care."
  },
  {
    "addressLine1": "14004 Boros Road",
    "city": "Elberta",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36530",
    "name": "Mary's Shelter Gulf Coast",
    "organization": "Mary's Shelter Gulf Coast",
    "phone": "(251) 986-6200",
    "website": "https://www.maryssheltergulfcoast.org/",
    "description": "Shelter for homeless pregnant women. Can stay up to 6 months following birth of baby. Provide case management, educational opportunities, prenatal and parenting classes, life skills training, individual and group counseling."
  },
  {
    "addressLine1": "620 N. McKenzie",
    "city": "Foley",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36535",
    "name": "Salvation Army Foley Alabama",
    "organization": "Salvation Army Foley Alabama",
    "phone": "459-6125",
    "website": "",
    "description": "Our office hours are Mon-Fri 9 AM to 1PM\n\nWe provide Social Services, Food Pantry, Home Sweet Home Program, Homeless Day Services, School of music for elementary age children as well as disaster response services."
  },
  {
    "addressLine1": "20511 Co Rd 36",
    "city": "Summerdale",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36580",
    "name": "Family Promise of Baldwin County Homeless Services",
    "organization": "Family Promise of Baldwin County Homeless Services",
    "phone": "(251) 947-5641",
    "website": "https://www.familypromisebaldwinal.org/emergency-shelter",
    "description": ""
  },
  {
    "addressLine1": "317 North Main Street",
    "city": "Enterprise",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36330",
    "name": "New Life Recovery Ministry",
    "organization": "New Life Recovery Ministry",
    "phone": "(334) 393-5641",
    "website": "https://www.christmissions.org/new-life-center",
    "description": "Separate shelters for men and women. We provide shelter programs for men over the age of 18 for up to 72 hours. Christian Mission Centers is a non-profit charitable organization whose goal is to express Christ's love by meeting the spiritual, emotional, and physical needs of individuals in our community.\n\n\nIntake procedure:Walk in to fill out Intake Form, talk with House Manager, and take Drug test.\nFees: No Fee for Service.\nHours:8:00 am-5:00 pm (closed 12:00 pm-1:00 pm), Mon-Fri.\nServes Coffee County residents.\nAlso provides a food pantry and soup kitchen."
  },
  {
    "addressLine1": "1601 Huntsville Road",
    "city": "Florence",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35630",
    "name": "Salvation Army Florence",
    "organization": "Salvation Army Florence",
    "phone": "(256) 764-4432",
    "website": "http://salvationarmyalm.org/florence/services/",
    "description": "Assist individuals and families who are in need of shelter due to homelessness.\n\nHomeless Shelter for Families, Homeless Shelter for Men, Homeless Shelter for Single Fathers, Homeless Shelter for Single Mothers, Homeless Shelter for Veterans, Homeless Shelter for Women\n\n\nEligibility: Must Clear NCIC check through police department, have no prior history of sexual crimes, be willing and able to work as job search is required while in residence. Must be eligible for low income housing programs.Hours:Dormitory Check-in Hours: 5:00 pm-9:00 pm Daily\n\nDormitory Check-out Hours: 6:00 am-8:00 am Daily\n\nIntake procedure: Individuals and couples with no children: Shelter will be provided in the Men's and Women's Dormitory based on availability for a maximum of 30 days for the first stay and 1 night every 30 days after that for 12 months from the date of first stay. Maximum capacity is 10 men and 4 women.\n\nSingle Parents and Couples with Children: Shelter can be provided based on availability in one of the family apartments with a maximum stay of 45 days.\n\nNo Fee for any service at the Salvation Army.\n\nServes these counties: Colbert, Franklin, and Lauderdale Counties\n\nHours: 9:00 am-4:00 pm (closed 12:00 pm-1:00 pm), Mon-Fri"
  },
  {
    "addressLine1": "318 S. Court Street",
    "city": "Florence",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35630",
    "name": "Crossroads Community Outreach",
    "organization": "Crossroads Community Outreach",
    "phone": "(256) 284-2218",
    "website": "https://www.crossroadsco.org/",
    "description": ""
  },
  {
    "addressLine1": "2120 West 17th Street",
    "city": "Sheffield",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35660",
    "name": "Sunrise Center",
    "organization": "Sunrise Center",
    "phone": "(256) 762-8092",
    "website": "mailto:sunrisecentersheffield@gmail.com",
    "description": ""
  },
  {
    "addressLine1": "405 South 12th Street",
    "city": "Gadsden",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35901",
    "name": "Thirteenth Place Youth Shelter",
    "organization": "Thirteenth Place Youth Shelter",
    "phone": "(256) 547-8971",
    "website": "http://www.thirteenthplace.com/",
    "description": ""
  },
  {
    "addressLine1": "114 North 11th Street",
    "city": "Gadsden",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35901",
    "name": "The Salvation Army Gadsden Homeless Shelter And Services",
    "organization": "The Salvation Army Gadsden Homeless Shelter And Services",
    "phone": "(256) 546-4673",
    "website": "https://salvationarmyalm.org/gadsden/",
    "description": "The Salvation Army Gadsden accepts 10 women and 10 men, feeds well, and laundry available. They also provide cable tv, smoke breaks, and stats are from 3 days to 2 weeks depending on your issues.\n\nFull Services: Homeless Shelter for Families, Homeless Shelter for Men, Homeless Shelter for Women\n\nIntake procedure:Visit for food and clothing.\nPhone for financial aid appointment such as rent assistance and utility assistance.\nPrescription Drug Discount Cards\nHoliday Assitance\n\nSalvation Army hours:9:00 am-12:00 pm and 1:00 pm-4:00 pm, Mon-Fri\n\nees: Lodging: after the third night $7.00 each night (exceptions based on need)\n\n"
  },
  {
    "addressLine1": "915 S 12th Street",
    "city": "Gadsden",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35901",
    "name": "Love Center Family Shelter",
    "organization": "Love Center Family Shelter",
    "phone": "(256) 546-8831",
    "website": "mailto:brencopel00@gmail.com",
    "description": ""
  },
  {
    "addressLine1": "305 Seminole",
    "city": "Huntsville",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35805",
    "name": "The Salvation Army Huntsville Emergency Shelter and Lodge",
    "organization": "The Salvation Army Huntsville Emergency Shelter and Lodge",
    "phone": "(256) 536-8876",
    "website": "http://salvationarmyalm.org/huntsville/",
    "description": "Emergency shelter for men and women, and temporary shelter for battered women. Shelter opens at 6:30 pm. Last check in at 8:45pm unless prior arrangements made.\n\nComplete list of services at the Salvation Army Huntsvile: Homeless Shelter, Homeless Shelter for Men, Homeless Shelter for Women, Transitional Housing/Shelter for Families, Transitional Housing/Shelter for Men, Transitional Housing/Shelter for Single Fathers, Transitional Housing/Shelter for Single Mothers, Transitional Housing/Shelter for Women.\n\nWalk in to apply.\nFees: Three nights per month free, then $35 per week.\nHours:Admin hours: 8:00 AM-5:00 PM Mon-Fri. For shelter, call after 6:30 PM\n\nAlso provided at the Salvation Army Huntsville:\nSubstance Abuse Services: Six-month, Christian-based treatment program for alcohol and/or drug dependency. Alcohol Dependency Support Groups, Drug Dependency Support Groups.\n\nFood Assistance: Food Assistance comes in the form of a food box capable of providing a family of (4) four with meals for (3) days. All the items in the food box are shelf stable and do not contain any perishablesDistributes food boxes that last 3-4 days to clients who have applied for food stamps . Referrals must be made through DHR or Foodline. .Evening meal for homeless/hungry. Nutritious meal provided for anyone standing in line at the various locations and times specified. Sponsored by Salvation Army, Mental Health Center, community volunteers and various contributors.\n\nHot meals are available daily at the Shelter and through the Mobile Soup Van.\nHot Meals served at the shelter: Breakfast 5:30-6:30 every day. Lunch: 12:00-2:00 Mon-Fri. 2:00-4:00 Sat and Sun. Dinner: 5:30-6:00 Mon-Fri.\n\n"
  },
  {
    "addressLine1": "3419 Verona Ave NW",
    "city": "Huntsville",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35806",
    "name": "New Futures Family Lodge Huntsville",
    "organization": "New Futures Family Lodge Huntsville",
    "phone": "(256) 929-3215",
    "website": "https://newfuturesinc.com/",
    "description": "New Futures operates the Marilyn Mabry Family Lodge which features an eight bedroom facility with bathrooms and a shared kitchen, living room, ect. Food pantry items are available to help families supplement any assistance they receive.\nFamilies are allowed to prepare their own meals and return to a practice of a family meal time together daily.  Other services provided include, daycare, transportation,\n\n\nThe mission of the Marilyn V. Mabry Family Lodge is to provide a lodging alternative for homeless families that cannot use local emergency shelters because of their composition: Intact families with minor children under age 18, single fathers with minor children and single mothers with sons over age 10. By keeping families together, the Lodge will enhance the positive outcomes for all family members and ultimately for the community of Madison County. BEGIN EVERY DAY!We link our clients to GED & other educational opportunities, skills training & job placement in order to help our families become self-sufficient and more confident in their ability to be independent."
  },
  {
    "addressLine1": "1001 Oakwood Avenue",
    "city": "Huntsville",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35801",
    "name": "The Studio Shelter and Services",
    "organization": "The Studio Shelter and Services",
    "phone": "(256) 489-8088",
    "website": "https://hmcpl.org/community/studio-shelter-and-services",
    "description": "Provides services to transient, homeless, or traveling youths aged about 12 to 21. Services include access to shelter, showers, laundry, food, clothing, phone/email, dental/medical referrals, \"street survival\" kits, job training and referral, and tutoring/mentoring to help clients improve living skills and school performance.\n\nFull list of services: Case/Care Management for Youth, Homeless Drop In Centers for Youth, Homeless Shelter for Youth, Runaway/Youth Shelters, Street Outreach Programs for Youth.\n\nHours: M-F,10AM - 8PM\n\nWalk in or call for an appointment."
  },
  {
    "addressLine1": "723 Arcadia Cir NW",
    "city": "Huntsville",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35810",
    "name": "Rose of Sharon Soup Kitchen",
    "organization": "Rose of Sharon Soup Kitchen",
    "phone": "(256) 536-2970",
    "website": "https://roseofsharonsoupkitchen.org/",
    "description": "Monday through Friday:\nBreakfast 9-9:30\nLunch noon-1\nFood pantry: 2-5 PM pantry\n\n\nFOOD BOX PROGRAM\nOur food box program provides supplemental assistance for those in need in our community. Please call to schedule your appointment with us!\n\nWe feed the homeless and unfortunate two meals a day, Monday through Friday. We offer a sack lunch to our patrons as they leave us in the afternoon."
  },
  {
    "addressLine1": "207 20th Street East",
    "city": "Jasper",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35502",
    "name": "Salvation Army Jasper AL",
    "organization": "Salvation Army Jasper AL",
    "phone": "(205) 221-7737",
    "website": "https://salvationarmyalm.org/walker-county/",
    "description": "Provides food bank, thrift store, canteen in times of disaster, assistance with prescription medicine and as vouchers in times of need, Christmas and Back to School programs for children and access to the Salvation Army homeless shelters in B'ham & Tuscaloosa. Assistance is provided with transportation or as for homeless persons to and from the shelter, as needed.\n\nFull list of services provided: Christmas Programs, Disaster Relief/Recovery Organizations, Food Pantries, Gas Money, Homeless Shelter for Men, Homeless Shelter for Women, Mass Feeding Services, Prescription Expense Assistance, School Supplies, Thrift Shops.\n\n\nNo Fee for Service - disaster clients, Christmas and Back to School Programs and homeless clients for the first five nights.\n\nFixed Fee - for thrift store items and homeless clients for shelter beyond five nights.\n\nApply for services by walking in or calling.\n\nOffice hours: 8:00 am-5:00 pm (Closed 12:00 pm-1:00 pm), Mon-Fri"
  },
  {
    "addressLine1": "PO Box 145",
    "city": "Lafayette",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36862",
    "name": "Hosanna Home Lafayette",
    "organization": "Hosanna Home Lafayette",
    "phone": "(334) 864-0890",
    "website": "https://www.harvestevangelism.org/hosanna-home",
    "description": "The purpose of Hosanna Home was to give a place of restoration to women who are 19 years+ that are suffering from life controlling issues. Primarily some form of addiction such as drugs, alcohol, men etc. Hosanna home is a one-year program that allows the women a safe refuge while repairing past mistakes and building a new relationship with our Lord and Savior.  While it is not ideal Hosanna Home will allow the mother to bring her children although they do try to find other resources for the children the first 90 days.\n\nOur one-year residential discipleship ministry incorporates a combination of Bible based teachings along with relapse prevention, life skills, financial literacy and point directed classes on things the ladies struggle with such as self-worth, forgiveness, inner strength etc.  Hosanna Homes desire is to see women transformed into the image of Christ. Hosanna Home prays to send them out as Godly wives, mothers, daughters in the way that they were created by God."
  },
  {
    "addressLine1": "2510 Pepperell Pkwy",
    "city": "Opelika",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36801",
    "name": "Harvest Evangelism",
    "organization": "Harvest Evangelism",
    "phone": "(334) 742-0777",
    "website": "http://harvestevangelism.org/",
    "description": "Ministry to Men\nEmergency shelter, Long-term recovery/rehab program (urban), Long-term recovery/rehab program (rural), Transitional housing, Case management\n\nWomen and Family Ministries\nEmergency shelter, Case management, Extended shelter (not long term), Single women (no children), Single women (with children), Single men (with children), Married couple (no children), Married couple (with children), Long-term recovery/rehab program (90 days or more), Transitional housing (separate facilities)"
  },
  {
    "addressLine1": "273 Azalea Rd, Bldg 3, Suite 110",
    "city": "Mobile",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36607",
    "name": "Housing First The Homeless Coalition",
    "organization": "Housing First The Homeless Coalition",
    "phone": "(251) 450-3345",
    "website": "http://www.hfal.org/",
    "description": "Community Housing Program\nThe Community Housing Program provides Permanent Supportive Housing to individuals and families in Mobile and Baldwin counties who are experiencing homelessness and who have a disabling condition. This program assists participants in transitioning from homelessness to being housed, encourages clients to become self-sufficient, and gives them the tools to live as independently as possible.\nThe program has three basic goals as established by the Department of Housing and Urban Development (HUD):\n\n1. To help program participants obtain and remain in permanent housing.\n2. To help participants increase skills and/or income in order to allow them to secure an income and live as independently as possible.\n3. To help participants achieve a greater level of self-determination and gain the needed confidence to make the transition out of homelessness.\nSupportive services provided to participants include, but are not limited to:\nOutreach\nCase management using Critical Time Intervention Model (CTI), including assessment of needs\nReferrals and assistance with coordinating substance abuse, psychiatric, and healthcare services.\nJob training/placement\nTransportation\nEducation\nLife skills\nBrief counseling and crisis intervention\nHousing search assistance\nThe Community Housing Program is a \"Scattered Site\" program. Scattered Site programs lease individual apartment units in the community so they can places individuals or family participants into these units and charge them a small monthly rental fee based upon their income."
  },
  {
    "addressLine1": "14970 Mission Road",
    "city": "Mobile",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36608",
    "name": "Mission of Hope For Men and Women",
    "organization": "Mission of Hope For Men and Women",
    "phone": "(251) 649-0830",
    "website": "https://www.missionofhopeministries.net/",
    "description": "Mission of Hope Ministries is a three month, in care, Christian program designed to help men and women who are addicted to drugs and alcohol have a NEW LIFE through JESUS CHRIST. This is offered at no cost to the client.\n\nMission of Hope (Men's Program)\nThe initial Mission of Hope men's program is a three month, in-house program.  It is located on forty, beautiful, private acres in west Mobile County. They can house up to 50 men in these dorms.\n\nHaven of Hope\n"
  },
  {
    "addressLine1": "1009 Dauphin Street",
    "city": "Mobile",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "38604",
    "name": "Salvation Army Mobile - Dauphin Way Lodge",
    "organization": "Salvation Army Mobile - Dauphin Way Lodge",
    "phone": "(251) 438-1625",
    "website": "https://salvationarmyalm.org/coastalalabama/programs-and-services/dauphin-way-lodge/",
    "description": "The Salvation Army in Mobile provides numerous services. They include\n\nDauphin Way Lodge\nA treatment center for the chemically dependent. Drug and alcohol addictions are crippling diseases that can destroy lives and devastate families. No matter how intense the addiction, there is hope for anyone with a sincere desire to make a change in their lives.\n\nDauphin Way Lodge is a state certified facility for alcohol and drug rehabilitation. Clients have access to a variety of treatment programs that address the physical, mental, emotional and social needs of each client. Case management is tailored to meet each clients specific needs whether one needs four hours per month of counseling or 28 hours per week of counseling. Dauphin Way Lodge is directed by a team of masters-level counselors with special training in treating drug and alcohol dependencies.\n\nTwo programs are run under Dauphin Way Lodge:\n\nResidential Rehabilitation (RR) is a six-month program for men who have completed a recovery program and who need a drug and alcohol free environment while getting back on their feet.\nIt provides a supportive, home-like atmosphere and continued support for those working to maintain sobriety. The goal of this program is to foster the clients recovery so he can re-enter society as a sober, productive and independent citizen.\n\n\nIntensive Outpatient Program (IOP) provides counseling and treatment for both men and women, while they live at home and maintain regular jobs. Sessions are held during daytime and evening hours. Services are individualized based on client need.\n\nCorps Salvage Rehabilitation Center\nA 180-day residential drug and alcohol treatment program that provides work therapy for homeless men. The program is funded by donations of reusable items that are picked up and repaired for sale in three area thrift stores.\n\nProject Able\nProject Able is a pre-employment training program designed to help homeless men rejoin the workforce as productive members of society.\n\nCenter for Women and Children\nWomen and children who are homeless can turn to our Center for Women and Children for help.\n\nFamily and Emergency Services\nSocial Services: Assistance during a time of crisis for the working poor and those below the poverty level. Aid may include, but not limited to: help with food, utilities or rent to qualifying applicants.\n\nDisaster Services: Relief for victims and emergency personnel during natural or manmade disasters.\n\nChristmas Programs\nAngel Tree: Provides Christmas gifts for children within the community.\nRed Kettles: Annual Christmas fundraiser for The Salvation Army.\n\nNeediest Families: An extended assistance program for families in crisis.\nSpirit of Giving: Holiday toy and food drive\n"
  },
  {
    "addressLine1": "279A North Washington Ave",
    "city": "Mobile",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36603",
    "name": "Waterfront Rescue Mission of Alabama",
    "organization": "Waterfront Rescue Mission of Alabama",
    "phone": "(888) 853-8655",
    "website": "https://mobilerescuemission.org/",
    "description": "Homeless Shelter for Men. Breakfast and Dinner served to clients in the program. Lunch available to all homeless, served daily.\n\nHours: 9am-3pm Lunch at Noon\nWalk In To Apply\nOther services provided at this shelter:\n"
  },
  {
    "addressLine1": "1260 Dauphin Street",
    "city": "Mobile",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36604",
    "name": "Family Promise of Coastal Alabama Mobile",
    "organization": "Family Promise of Coastal Alabama Mobile",
    "phone": "(251) 441-1991",
    "website": "http://www.familypromisemobile.org/",
    "description": "Office Hours:\nEvery day: 8:30am to 4:30pm.\n\nFamily Promise of Coastal Alabama provides shelter and nurturing support for children and their families who are struggling through homelessness. We not only provide shelter but assist families in identifying issues that led to their homelessness. We provide education in budgeting, parenting, anger management, and employment readiness to help families find their way. With a new arsenal of skills and the right support, families secure and maintain safe, stable housing with an 85 % success rate.\n\nServices\nOvernight accommodations at a local congregation\nThree meals a day\nCase management from a holistic perspective\nDay Center with internet, laundry, showers and a postal address\nTransportation to school, work, and vital appointments\nSocial and educational services\nJob retention, budgeting and parenting skills\nSupport, compassion, hope and respect\n\nAffordable Housing\nIn partnership with the City of Mobile, FPCA provides rental units for two families in a renovated duplex.  Families in our affordable housing program receive the same client-focused case management services that our IHN families receive for up to 18 months. The symbiotic relationship between the city and Family Promise promotes the health of an older downtown neighborhood while meeting one of a family's most basic needs, housing at a cost they can manage."
  },
  {
    "addressLine1": "P.O. Box 851418",
    "city": "Mobile",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36685",
    "name": "Mckemie Place - Shelterfor Women",
    "organization": "Mckemie Place - Shelterfor Women",
    "phone": "(251) 287-2225",
    "website": "https://www.mckemieplace.org/",
    "description": ""
  },
  {
    "addressLine1": "2325 Boykin Blvd",
    "city": "Mobile",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36605",
    "name": "The Salvation Army Family Haven",
    "organization": "The Salvation Army Family Haven",
    "phone": "(251) 471-0029",
    "website": "https://salvationarmyalm.org/coastalalabama/the-salvation-army-family-haven/",
    "description": ""
  },
  {
    "addressLine1": "4901 Battleship Parkway",
    "city": "Spanish Fort",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36577",
    "name": "The Shoulder Rehab For Men",
    "organization": "The Shoulder Rehab For Men",
    "phone": "(251) 626-2199",
    "website": "https://theshoulder.org/",
    "description": "The Shoulder is a shelter for rehab for men only.\n\n"
  },
  {
    "addressLine1": "3561 Mobile Highway",
    "city": "Montgomery",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36108",
    "name": "Friendship Mission For Men",
    "organization": "Friendship Mission For Men",
    "phone": "(334) 281-2395",
    "website": "http://www.friendshipmission.org/",
    "description": "Ministry's purpose is to reach out to the homeless, poor, and needy of the Montgomery area by providing the Church facility of Montgomery for food, shelter and the proclamation of God's word. Shelter for men only.\n\nServices available to the homeless and poor of the Montgomery area. Shelter for men only.\n\n\nAdministrative hours: 7:00 am to 7:00 pm. Call office number for information regarding services.\n\nHOUSING AT THE SHELTER:\nThe Mens' Shelter has 50 beds.\n25 are part of the transitional program.\n"
  },
  {
    "addressLine1": "660 Morgan Avenue",
    "city": "Montgomery",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36104",
    "name": "Genesis House - Aid To Inmate Mothers",
    "organization": "Genesis House - Aid To Inmate Mothers",
    "phone": "(334) 262-2245",
    "website": "https://inmatemoms.org/",
    "description": "The GENESIS House is a transitional home that provides women who have just left prison with an independent living environment for at least 12 months. The goal of the center is to help women restore dignity back into their lives, learn skills that will allow them to function well and become healthy productive members of the community by overcoming addictions, setting goals and becoming self-sufficient.\n\nAdmission into the center is for women between the ages of 21 to 59, with the mental capacity sufficient to participate in transitional activities, including a sincere desire to change negative behavior. There will be a mentoring program, drug treatment and counseling, and employment readiness programs. The women will also receive assistance in employment placement within the society. These activities will prepare them for the challenges they will face in the general society."
  },
  {
    "addressLine1": "28 Crenshaw Street",
    "city": "Montgomery",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36104",
    "name": "Family Promise of Montgomery Services",
    "organization": "Family Promise of Montgomery Services",
    "phone": "(334) 265-2010",
    "website": "http://www.familypromisemontgomery.org/",
    "description": ""
  },
  {
    "addressLine1": "17 Mildred Street",
    "city": "Montgomery",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36104",
    "name": "Faith Crusade Montgomery Rescue Mission",
    "organization": "Faith Crusade Montgomery Rescue Mission",
    "phone": "(334) 834-0551",
    "website": "https://www.fcmrm.org/",
    "description": "Faith Crusade Montgomery Rescue Mission is focused on alleviating hunger and homelessness by providing: food, clothes and shelter to those in need. We focus on all poverty stricken communities within Montgomery and surrounding areas."
  },
  {
    "addressLine1": "215 Clayton Street",
    "city": "Montgomery",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36104",
    "name": "Renascence Inc",
    "organization": "Renascence Inc",
    "phone": "(334) 832-1402",
    "website": "https://www.halfway-home.net/",
    "description": "The Renascence community is a residential transitional program for male, non-violent ex-offenders who lack the support of family and have no place or means to live on their own after release or parole from the Alabama state prison system. The program is twelve months in length and is designed to address the issues which often impact an ex-offender's opportunity to make a successful transition to the community.\n\nComplete list of services provided: Ex-Offender Halfway House, Ex-Offender Reentry Program, Homeless Shelter for Ex-Offenders\n\nOur transitional program provides housing for up to 14 residents at a time. They remain for six to 12 months, based on need and progression in the program. This positive home includes structured programs and services that help residents obtain and keep employment and conduct responsible social lives. The program helps them overcome challenges with work skills and habits, chemical dependency, education, and family and community responsibilities.\n"
  },
  {
    "addressLine1": "900 Maxwell Boulevard",
    "city": "Montgomery",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36104",
    "name": "Salvation Army Montgomery",
    "organization": "Salvation Army Montgomery",
    "phone": "(334) 269-2018",
    "website": "http://salvationarmyalm.org/montgomery/",
    "description": "The Salvation Army Montgomery services include transient and homeless services, food, clothing, and shelter for those in need, lunchtime feeding program, and the distribution of FEMA funds for utilities and rent WHEN AVAILABLE. They also give emergency furniture to victims of fire, flood, disaster, etc. Must have a referral letter to receive furniture voucher.\n\n\nEligibility: Homeless services available to anyone in need. For rent assistance, client must be employed.\n\n"
  },
  {
    "addressLine1": "1000 East South Blvd",
    "city": "Montgomery",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36105",
    "name": "Return To Reality - Recovery House For Women",
    "organization": "Return To Reality - Recovery House For Women",
    "phone": "(334) 467-3463",
    "website": "http://www.return2reality.org/",
    "description": "Provides housing for women who want to stay clean and sober from drugs and alcohol. We support AA and NA meetings. Christian based program. Cost for admission $240.00, which pays the first 2 weeks of rent. Call 334-467-3463 for Jolene or 334-324-3491 for Deborah for more information."
  },
  {
    "addressLine1": "2700 Vandy Drive",
    "city": "Montgomery",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36110",
    "name": "Vision of Grace Transition Home",
    "organization": "Vision of Grace Transition Home",
    "phone": "334-669-0600",
    "website": "https://visionofgracetransitionhome.org/",
    "description": "Vision of Grace Transition Home provides shelter for one family at a time in each home.  Homeless families apply for assistance and when qualified are allowed to stay for a period of 3 to 4 months. Vision of Grace Transition Home works with local agencies to identify qualifying families.\n\nBecause Vision of Grace Transition Home is not a social services agency we do not have the availability of social workers or counselors; therefore, we do not provide services for individuals in need of special services."
  },
  {
    "addressLine1": "1226 Clay Street",
    "city": "Montgomery",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "36104",
    "name": "Mary Ellen's Hearth AT Nellie Burge Community Center",
    "organization": "Mary Ellen's Hearth AT Nellie Burge Community Center",
    "phone": "(334) 264-4108",
    "website": "https://www.maryellenshearth.org/",
    "description": "Mary Ellens Hearth at Nellie Burge combats homelessness by providing transitional housing for homeless women with children. More than simply providing a place to live, our programs and services empower families to stabilize their lives, build new skills, decrease their dependency on emergency services and keep their families united and safe.\n\n\nOur Mission: The mission of Mary Ellens Hearth is to offer hope, help and healing to homeless women and their children through Christian love and values.\n\nOffice Hours: Mondays through Fridays 8AM-5PM\n\nTransitional Housing Program/Shelter Operating Hours: The facility is open to families on a 24 hour basis."
  },
  {
    "addressLine1": "2903 Second Avenue",
    "city": "Columbus",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "31902",
    "name": "Valley Rescue Mission",
    "organization": "Valley Rescue Mission",
    "phone": "(706) 322-8267",
    "website": "http://www.valleyrescuemission.org/",
    "description": "Emergency Shelter. Men only. Offers these services:\nHoward Mott Center For Men: The Howard Mott Center for Men (HMC) Transient program offers short - term overnight lodging and basic essentials to men in need. Once a man enters this program he has 90 days within a 12 month period to stay with us. Men can also be assessed at this point and considered for the HMC goal - based addiction recovery programs if they so desire.\n\n\nThe goal-based program is designed to help men that have addiction problems. We believe that successful recovery is based on the knowledge and foundation in Jesus Christ. The goal-based recovery program is divided into three (3) separate phases.\n\nCrossroadsAddiction Recovery Program for Men\n\nDamascus WayHome for Women and Children:\nThe emergency shelter is a temporary shelter providing relief from physical, spiritual and material needs and offering a support system to individuals coming into our facility for temporary shelter.\n\nThe transitional program presents women with the opportunity for the healing of their personal lives, restoration with family members when possible, resolution of past issues and the opportunity to re-enter society with a positive mindset and lifestyle.\n\nVisit their website or call for full details on services.\n\n\nDaily check in is between 3:45pm - 7:00 pm. Since the shelter fills up quickly, it is recommended that an individual check in as early as possible.\n\nResidents must leave the premises by 7:00 am with all of their belongings.\n\nValley Rescue is not responsible for items left behind. Residents are allowed to stay up to 90 days in a 12 month period. Picture identification and police warrant check are required. There is a chapel requirement."
  },
  {
    "addressLine1": "2405 2nd Avenue",
    "city": "Columbus",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "31901",
    "name": "Open Door Community House",
    "organization": "Open Door Community House",
    "phone": "(706) 323-5518",
    "website": "http://opendoorcommunityhouse.org/",
    "description": "Open Door currently has three areas of Homeless Ministries: Community Case Management Program Showering Program for the Homeless Virginia D. Jackson Home for Women For more information on any of these Homeless Ministries please view their pages on this site or contact Andrea Powell, Director of Homeless Ministries.\n\nJackson Home for Women\nOpen Door's Transition Home for Women in Crisis is the oldest transitional housing program in our area. It provides a structured environment for adult homeless women for up to two years. Each resident must be employed, actively seeking employment, or attending school, and participate in the Community Case Management Program. The goal of the program is for each woman to obtain sustainable income, permanent housing and self-sufficiency. For more information about the Transition Home contact Andrea Powell.\n\nShowering Program\nThe Showering Program for the Homeless is a unique ministry in our area offering unsheltered homeless persons a place to shower, a change of clothing, breakfast, hygiene items, and a place to do laundry. This program also offers Bible Study, job search skills, and barber services. The goal of the program is for participants to become employable. Volunteers may assist in the Showering Program with registering participants, distributing hygiene items, cooking breakfast, assisting with computer skills training, or providing health related educational opportunities. Volunteers working more than once in the Showering Program are required to have a background check. Click here for a link to the volunteer application and information packet. This program serves the largest number of people at Open Door up to 600 different participants each year. For more information about the Showering Program contact Valerie Harvey.\n\nCommunity Case Management\nOur Community Case Management Program is a collaborative effort with several agencies in the Columbus area to aid women who are homeless in obtaining sustainable income and permanent housing. Clients receive assistance with rental deposits, first months rent, household necessities, counseling through the Pastoral Institute, job search, medical services, and assistance with the cost of childcare and education.\n"
  },
  {
    "addressLine1": "1718 2nd Avenue",
    "city": "Columbus",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "31901",
    "name": "Salvation Army Shelter Columbus GA",
    "organization": "Salvation Army Shelter Columbus GA",
    "phone": "(706) 327-0275",
    "website": "",
    "description": "Shelter for men only.\nHot meal is served daily at 5:00 pm. Check in is approximately 6:30 pm, depending on weather. Photo ID and a police warrant check are required. The first 3 consecutive nights are free and $8 a night thereafter. Every 30 days you are eligible for the 3 free nights. Fees may be reduced or waived for residents who are making strong efforts to find work, but still have no income.\n\nResidents must leave at 7:30 am in the morning but may leave their belongings if they plan on returning that evening."
  },
  {
    "addressLine1": "1532 Third Avenue",
    "city": "Columbus",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "31901",
    "name": "House of Mercy",
    "organization": "House of Mercy",
    "phone": "(706) 322-6463",
    "website": "http://www.houseofmercycolumbus.com/",
    "description": ""
  },
  {
    "addressLine1": "1214 3rd Avenue",
    "city": "Columbus",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "31902",
    "name": "Valley Interfaith Promise",
    "organization": "Valley Interfaith Promise",
    "phone": "(706) 494-6348",
    "website": "https://valleyinterfaithpromise.com/",
    "description": "VIP provides shelter, meals, and comprehensive support services to homeless families. Families must have at least one child under 18 years of age and in their custodial care who will participate in.\n\nA sheltering program for homeless families with children by providing shelter, meals, and comprehensive support services. A qualified homeless family will participate in the program for an initial 30 days. The family will be seeking employment/housing from the Valley Interfaith Promise Day Center during the day and will stay at a host congregation's facility overnight.\n\n\nIntake procedure: By phone. Application process takes 2-3 business days. Applicants will have to go through a nationwide criminal background check and be drug tested.\n\nFamilies must be willing to stay at the facilities of various religious congregations during the hours of 5:30 PM - 7:00AM. Will be housed at the VIPs Day Center during the day. Must make concerted effort to gain employment and permanent housing. Usual length of stay is 30 days. Must provide document ation of homelessness and police warrant check for all adults.Any applying family member must not be chemically dependent or have any acute mental illnesses."
  },
  {
    "addressLine1": "304 South Andrews St",
    "city": "Scottsboro",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35768",
    "name": "Life Resource Services of Jackson County",
    "organization": "Life Resource Services of Jackson County",
    "phone": "(256) 437-6606",
    "website": "https://liferesourceservic.wixsite.com/liferss",
    "description": "Open daily from 8:00 AM - 4:00 PM Lunch is served from 11:00 - 12:00\n LIFE Resources Services is a safe place where those who are experiencing homelessness can come to escape the elements during the daytime hours. \n\n\nLIFE Resource Service can assist individuals in obtaining resources and skills needed to obtain and maintain adequate housing, Showering, and more. \n\nOur mission is to help those who are struggling with homelessness, by providing resources to help rebuild their lives."
  },
  {
    "addressLine1": "6000 Shelley Drive",
    "city": "Springville",
    "state": "Alabama",
    "stateAbbreviation": "AL",
    "postal": "35147",
    "name": "Big Oak ranch Girls Facility",
    "organization": "Big Oak ranch Girls Facility",
    "phone": "(205) 467-6226",
    "website": "http://www.bigoak.org/",
    "description": "Big Oak Girls' Ranch is located on 325 acres about six miles from Springville, Alabama. The Girls' Ranch includes nine residential homes, a transitional apartment home, gymnasium, equine center, and swimming pool. But mostly, the Girls' Ranch is a place of love, security and safetythree things few of these girls have known before they came to us.\nWe try to create as normal a setting as possible for our girls. Each of our two-story brick houses is home to as many as eight children. In each home, a Christian couple serves as mom and dad to provide the love, discipline, and direction that the children need. Ages vary in each home so the younger girls will have big sisters and likewise, the older girls can develop a caring and responsible attitude toward their younger siblings.\n\nWork is an important part of daily life, so our children have assigned chores in the homes, and each home is assigned a Ranch chore. In addition, there is an organized summer work program for those residents who do not have off-Ranch jobs. Through this structure, we're able to teach and instill a godly work ethic in our children.\nEach family works together, plays together and attends a local church as a family unit each week. We know children listen with their eyes, and our spiritual emphasis is on witnessing by example in all we say and do.\nFor questions regarding admissions, please phone (205) 467-6226, and ask to speak to a Social Worker."
  }
]