[
  {
    "addressLine1": "355 Hamilton St",
    "city": "Allentown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18105",
    "name": "Allentown Rescue Mission - Gateway Center",
    "organization": "Allentown Rescue Mission - Gateway Center",
    "phone": "(610) 740-5500",
    "website": "http://www.allentownrescuemission.org/",
    "description": "Allentown Rescue Missions Emergency Shelter\nDescription: Not Just a Bed and a Meal... A Chance for a New Beginning.\n\nOur Gateway Center (emergency shelter) is the most\nbasic of our programs and is often the entry-point into our long-term\nprograms. Emergency Shelter receives clients - literally - off the\n\nstreet, who have exhausted all support and typically\nhave multiple and long-term problems.\n\nDUE TO THE CURRENT PANDEMIC COVID-19/CORONAVIRUS,\nTHE EMERGENCY SHELTER IS OPEN 24/7. TO RECEIVE SERVICES FROM THE\nALLENTOWN RESCUE MISSION, CONTACT THE EMERGENCY SHELTER HOTLINE BY\nDIALING 211 FROM ANY PHONE.\n\n\nWHEN YOU HAVE RECEIVED APPROVAL OF YOUR REFERRAL,\nCOME TO THE ALLENTOWN RESCUE MISSION/EMERGENCY SHELTER TO RECEIVE OUR\nSERVICES. YOU MUST PROVIDE SHELTER STAFF WITH VALID IDENTIFICATION.\n\nThe men are encouraged to join a long-term recovery\n\nprogram to resolve the root causes of their homelessness so they can\n\nend it permanently. They can join one of our long-term programs or be\nreferred to another agency if needed.\n\n\n\n\nFree services include nutritious meals, personal care items, beds, clothing, shower facilities, and chapel services."
  },
  {
    "addressLine1": "344 N. 7th St.",
    "city": "Allentown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18102",
    "name": "The Beall and Linny Fowler Hospitality House For Women And Children",
    "organization": "The Beall and Linny Fowler Hospitality House For Women And Children",
    "phone": "(610) 432-0128",
    "website": "",
    "description": "Emergency homeless shelter for women and children. Also provides transitional housing for women and children. Services provided by the Salvation Army.\n\nFull Information:\nProvides shelter on an emergency basis to women and women with children. The HHESP, a 24-hour secure facility, addresses the needs of its residents by providing emergency shelter, nutritious meals (three meals ans snacks per day), and the necessary tools to become more self-sufficient. These tools include encouragement, classes, a required savings plan, and daily intensive case management. Since the HHESP is an emergency shelter, the length of stay is from one to forty-five days. Residents are required to attend weekly classes while at the HHESP. These classes include: Lifeskills, Parenting, Budgeting, Shelter Group, GED, and Employability. With assistance from the caseworker, residents are required to establish goals, e.g. obtaining employment or training, obtaining a more permanent residence, attending classes, and saving money. In turn, working with the caseworker, residents are required to meet goals within a specified time by partnering with other community agencies. The HHESP works closely with area agencies to make certain its residents are knowledgeable of the resources available to them."
  },
  {
    "addressLine1": "902 Philadelphia Rd",
    "city": "Allentown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18042",
    "name": "Roof Over For Women And Children",
    "organization": "Roof Over For Women And Children",
    "phone": "(610) 253-4253",
    "website": "",
    "description": "Easton Area Neighborhood Center (Roof Over)\nWomen's and children shelter provided by Easton Area Neighborhood Center.\nOffice hours: Mondays through Fridays 8:30am - 4:30pm.\n\n\nMust be a Northampton County resident and be over the age of 18."
  },
  {
    "addressLine1": "219 N. 6th St",
    "city": "Allentown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18102",
    "name": "Sixth Street Family Shelter",
    "organization": "Sixth Street Family Shelter",
    "phone": "(610) 435-1490",
    "website": "https://sixthstreetshelter.caclv.org/",
    "description": "Shelter (non-emergency) for homeless families. Transitional Housing Program up to 2 years for families pursuing educational/vocational goals: Turner Street Apartments.\n\nThe Sixth Street Shelter in Allentown, the largest family shelter in the region, has been providing housing and casework services to homeless families with children since 1984. It is a program of the Community Action Committee of the Lehigh Valley, which, for over 45 years, has been in the vanguard of community-based solutions to the challenges of the regions low-income people.\n\nThe shelter has 25 units and provides intensive programming for up to 60 days. Families work with staff to set and achieve specific goals. During their stay, family members work with the Shelters caseworkers to design a goal plan, which includes a search for permanent housing, life skills education, and a budget plan. Our guiding principle is to help families set and reach their goals through intensive and effective case management, in-house programming, and referrals to appropriate services."
  },
  {
    "addressLine1": "144 North Eighth Street",
    "city": "Allentown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18101",
    "name": "Salvation Army of Allentown",
    "organization": "Salvation Army of Allentown",
    "phone": "(610) 432-8949",
    "website": "",
    "description": "The Salvation Army, an international evangelical organization, provides services to residents of Lehigh County.\n\nServices Include:\nADDICTION SERVICES\nIntake and transportation to the Salvation Army Rehabilitation Center for drug/alcohol addictions. Individuals must be substance free for 72 hours. Income guidelines. No fees.\n\nFOOD\nFood Pantry distributes food to any Lehigh Valley resident. Must sign a declaration of need. Open Mon, Tue, Thu and Fri, 8:30am -12pm and 1pm-4pm. Open Wed 8:30am-12pm. Appointments preferred.\n\nHEALTHCARE\nPrescription assistance can be provided once a year for life sustaining medication. $50 maximum. Must meet income guidelines.\n\nHOLIDAY ASSISTANCE\nAccepts gift/toy donations from Toys for Tots, Angel Trees and individual donors. Distributes items to families at Christmas. Must meet income guidelines. Apply for program in October - call office for dates.\n\nHOUSING ASSISTANCE\nTransitional Housing program is a 2 year program for women with children who are furthering their education. Call the office for application.\n\nUTILITIES\nAdministers UGI's CAP and Operation Share programs. Applicants must meet income guidelines and are not eligible if they are already disconnected.\n\nOLDER ADULT SERVICES\nSenior program distributes monthly supplemental food packages to low income adults over 60. On pick-up day, a hot meal and program is provided. All seniors, regardless of income, can come in for the monthly meal and program."
  },
  {
    "addressLine1": "714 West Broad Street",
    "city": "Bethlehem",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18018",
    "name": "Cay Galgon Shelter",
    "organization": "Cay Galgon Shelter",
    "phone": "(610) 867-9546",
    "website": "https://marysshelter.org/",
    "description": "Mary's Shelter recognizes that the established programs might not be appropriate for all applicants. Each Applicant will be evaluated on a case-by-case basis. The case managers will make every effort to work collaboratively with community agencies to assist pregnant and parenting young women find the program(s) that will best meet the individual's needs. Referring Agencies can call to determine vacancies. Applicants should follow the following procedure.\n\nProcedure\nTelephone Interview: Call 610-867-9546\n1. Initial assessment\n2. Determine vacancies\n3. Schedule interview\n4. Make appropriate referrals\n\nFace-to-Face Interview\n1. Completion of application and/or admission forms\n2. Review program guidelines and expectations, so applicant can make an informed decision regarding voluntary participation in the program. (approximately 1.5 hours)"
  },
  {
    "addressLine1": "337 Wyandotte St",
    "city": "Bethlehem",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18015",
    "name": "New Bethany Ministries Non Emergency Housing",
    "organization": "New Bethany Ministries Non Emergency Housing",
    "phone": "(610) 691-5602",
    "website": "http://www.newbethanyministries.org/",
    "description": "Our office hours are 8:00 am to 4:00 pm, Monday through Friday.\n\nTransitional shelter (non-emergency) for homeless women and children. Transitional shelter (non-emergency) for homeless adults. Supportive housing program for men (Single Room Occupancy), located in Coplay. 610-691-2955. Transitional housing program for women and children: Restoration House.\n\n\nOur main location is at the corner of West 4th and Wyandotte Streets in South Bethlehem. These buildings contain the Mollard Hospitality Center, Transitional Housing Program, 15 units of our Single Room Occupancy Program and our Administrative Offices."
  },
  {
    "addressLine1": "75 E Market St",
    "city": "Bethlehem",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18018",
    "name": "Bethlehem Emergency Sheltering",
    "organization": "Bethlehem Emergency Sheltering",
    "phone": "​(484) 379-6694",
    "website": "http://www.bethlehememergencysheltering.org/",
    "description": ""
  },
  {
    "addressLine1": "314 Filmore St.",
    "city": "Bethlehem",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18015",
    "name": "Victory House of Lehigh Valley",
    "organization": "Victory House of Lehigh Valley",
    "phone": "(610) 691-3373",
    "website": "https://www.victoryhouselv.org/",
    "description": "Who We Serve (profile of our clients):\nMen, ages 18-65, who voluntarily enter the program with the aim of transitioning to independent living in the community\n    May have been recently incarcerated and released\n    May be in recovery for drug or alcohol abuse\n    In need of temporary housing\n    Suffering from treatable medical or mental health issues\n    Referred to Victory House through The Veterans Administration or county drug and\n\n    Alcohol agencies and other local referring partners.\n\n\nObjectives:\n\n    Insure residential stability through medical and psychiatric services to help residents  remain drug and alcohol free\n    Increase residents personal skills (through continuing education) to secure employment\n    Increase residents abilities to secure independent living through greater self-determination.\n\n\nTo achieve these objectives Victory House utilizes a clinical team approach comprised of health professionals, addiction and mental health counselors, and life skills instructors.\nFAQs\n\nDoes Victory House accept clothing donations?\nVictory House will gladly accept mens clothing. However, due to limited storage space, we ask that you first call to inquire if we can accept your donation at that time. Please contact Brian Smith at 610-691-3373, X314\n\nDoes Victory House need volunteers?\nVolunteer are always needed. Please see our volunteers page regarding our needs by clicking here.\n\nHow do homeless men come to Victory House?\nReferrals are typically made by the U.S. Department of Veterans Affairs, or Lehigh County and Northampton County Division of Drugs and Alcohol.\n\nHow long may a resident remain at Victory House?\nInitially a resident may stay at Victory House up to 45 days, provided they follow their case management plan and all the rules of the facility. If that is completed successfully, a continued stay is decided on a case-by-case basis.\n\nHow many residents can stay at Victory House?\nThere are beds for 40 residents, containing four bathrooms, three commons rooms, two kitchens and dining rooms, as well as a computer lab, a library, and a health center.\n\nAs a homeless veteran, how can apply to Victory House?\n\nContact the Allentown Veterans Affairs Outpatient Clinic at 610-776-4304 and ask for Thomas Gonzales, Homeless Veterans Social Worker.\n\nWhat is the best way to donate to Victory House?\nDonate on the Make a Donation button.  Any questions, contact Brian Smith at 610-691-3373, X314\n\nWhat types of funding does Victory House receive?\nVictory House is a major recipient of funding from the U.S. Department of Veterans Affairs, The Lehigh County and Northampton County Divisions of Drugs and Alcohol, grants from cities, private foundations, churches, businesses (in-kind), private grants, and from generous individuals throughout the community.\n"
  },
  {
    "addressLine1": "2700 8th Ave",
    "city": "Altoona",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16602",
    "name": "Family Services, Inc - Blair County Family Shelter Services",
    "organization": "Family Services, Inc - Blair County Family Shelter Services",
    "phone": "(814) 949-3778",
    "website": "http://www.familyservicesinc.net/",
    "description": "The shelter is open and staffed 24 hours, 7 days a week, 365 days a year. There are NO fees to use this service.\n\nEligibility\nMust be 18 or older unless accompanied by parent or guardian\nMust be homeless or near homeless\nMust not be intoxicated or under the influence at the time of intake\nMust be medically stable\nMust be able to comply with the program requirement\nMust be voluntarily seeking services with an expressed desire for services and willing to comply with program recommendations\n\nMust not be a threat to self, staff or other residents\nMust be willing to comply with house requirements and manage own daily living skills\nMust be willing to live cooperatively in a communal setting\nMental/emotional state must be sufficiently stable for participation in program\n\nMust undergo a background check and have no crimes of violence or sexual crimes\nMust prove Blair County or adjacent county resident for a minimum of 90 days\n"
  },
  {
    "addressLine1": "2100 6th Ave",
    "city": "Altoona",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16602",
    "name": "Community Service Center",
    "organization": "Community Service Center",
    "phone": "(814) 946-3651",
    "website": "https://www.blaircap.org/",
    "description": "We provide transitional assistance and supportive services for homeless individuals and families.More Services:\nCase management\nLife skills training\nEmployment assistance\n\nJourney Housing Program\nPhone: (814) 946-3651 ext:115\nWe provide transitional housing assistance and supportive services for homeless 18-25 year old adults with disabilities who are able to live independently."
  },
  {
    "addressLine1": "10241 Lincoln Highway",
    "city": "Everett",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15537",
    "name": "BEDFORD Human Services Administrator",
    "organization": "BEDFORD Human Services Administrator",
    "phone": "(814) 623-2002",
    "website": "",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of BEDFORD Human Services Administrator, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "100 South Fraser Street",
    "city": "State College",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16801",
    "name": "Hearts for the Homeless",
    "organization": "Hearts for the Homeless",
    "phone": "(814) 325-9471",
    "website": "http://www.h4hstatecollege.org/",
    "description": "Daytime Drop-In Center\nCurrently open 5 days a week from 9 am until 6 pm weekend hours vary. Call to confirm we are open.\n\nOur mission is to provide a warm, safe space for the local homeless to come in from the elements. To create a sense of belonging and community and bring awareness to the community.\n\n\nHearts for the Homeless meets real physical needs by giving away necessities such as clothing, medical supplies, food and toiletries to the area homeless. Supplying basic needs such as these help make people's lives just a little better\n\nTransitional Apartment Program - T.A.P.\nHearts for Homeless Transitional Apartment Program (TAP) was established in May 2015 as a response to the rapidly growing number of homeless families with small children in Centre County.\n    TAP consists of seven H4H leased apartments housing 15 people ranging in ages from 1 to 64, and serving very small children, single mothers, cancer patients, veterans, recovering addicts, current addicts and the other disadvantaged.\n    With support from you and our community, Hearts For Homeless is able to secure leases, provide security deposits, and first month's rent which is often a barring factor for our Centre County Homeless during their search for affordable housing. Case managers work with TAP participants and are able make an effort to impart the faculties and experience needed to maintain an apartment, and push towards a work ethic that is financially suitable for our housing market. Clients who graduate from TAP will not only have the confidence to successfully maintain an apartment but they'll have the skills and support to transition into an apartment of their own.\n\n    There is currently a waiting list for placement, but with broader funding, we hope to bring our apartment total to 10 and increase TAP's capacity to 20 participants by January 2015.\n\nHearts For Homeless Emergency Winter Overflow Shelter\n\nOperational only October- May (During Intense Overcrowding)"
  },
  {
    "addressLine1": "location varies",
    "city": "State College",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16801",
    "name": "Out of the Cold: Centre County",
    "organization": "Out of the Cold: Centre County",
    "phone": "(814) 852-8864",
    "website": "http://www.ootc3.org/",
    "description": "HOURS OF OPERATION:\n"
  },
  {
    "addressLine1": "217 East Nittany Avenue",
    "city": "State College",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "00000",
    "name": "Housing Transitions",
    "organization": "Housing Transitions",
    "phone": "(814) 237-5508",
    "website": "http://housingtransitions.org/",
    "description": "Emergency Shelter 24/7 for men, women and children with their parent or guardian\nCall (814) 237-5508 day or night\n\nCentre House provides shelter and food to clients who are experiencing homelessness or in crisis, but also guidance to reach a more stable housing future. Residents must be over the age of 18 unless accompanied by a parent or legal guardian, or legally emancipated. The Centre House shelter is open 7 days a week, 24 hours a day and is staffed 24 hours a day. There is no charge to stay at Centre House.\n\nWhile staying at the shelter:\n    Residents have access to a full kitchen and cooked meals; any allergies or other dietary needs can be accommodated\n    Residents are provided with all necessary toiletries, including towels, bedding, and personal items upon request.\n\n    Residents have 24/7 access to Housing Case Managers who help identify needs and meet goals through clear plans and concrete steps.\n    Residents are responsible for daily housekeeping chores to help keep the shelter running efficiently.\n    Residents have their own mailbox during their stay at Centre House.\n    Residents may clean clothing in the in house washer and dryer.\n    All adult clients complete an interview process prior to determination of eligibility. Individuals convicted of or charged with a violent crime, a crime of a sexual nature, or a crime involving the sale or distribution of drugs are not deemed eligible for residential services.\n    The shelter focuses on accommodating Centre County residents.\n    The shelter does not provide financial assistance. However, the Case Manager assists residents with calls to other agencies, churches, etc. to put together a package for first month rent and/or security deposit, medication, or other substantial needs.\n\nWhile staying at the shelter:\n    Residents have access to a full kitchen and cooked meals; any allergies or other dietary needs can be accommodated\n    Residents are provided with all necessary toiletries, including towels, bedding, and personal items upon request.\n\n    Residents have 24/7 access to Housing Case Managers who help identify needs and meet goals through clear plans and concrete steps.\n    Residents are responsible for daily housekeeping chores to help keep the shelter running efficiently.\n\n    Residents have their own mailbox during their stay at Centre House.\n    Residents may clean clothing in the in house washer and dryer.\n    All adult clients complete an interview process prior to determination of eligibility. Individuals convicted of or charged with a violent crime, a crime of a sexual nature, or a crime involving the sale or distribution of drugs are not deemed eligible for residential services.\n    The shelter focuses on accommodating Centre County residents.\n    The shelter does not provide financial assistance. However, the Case Manager assists residents with calls to other agencies, churches, etc. to put together a package for first month rent and/or security deposit, medication, or other substantial needs."
  },
  {
    "addressLine1": "207 E. Cherry St.",
    "city": "Clearfield",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16830",
    "name": "Central PA Community Action, Clearfield",
    "organization": "Central PA Community Action, Clearfield",
    "phone": "(814) 765-1551",
    "website": "http://www.cpcaa.net/",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of CLEARFIELD Central PA, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "1013 8th Avenue",
    "city": "Beaver Falls",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15010",
    "name": "Beaver County Community Development Program",
    "organization": "Beaver County Community Development Program",
    "phone": "(724) 847-3889",
    "website": "http://www.beavercountypa.gov/community-development-home",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of BEAVER Beaver County Community Development Program, call them for help regarding their Homeless Assistance Programs.\n\nHomeless Helpline:\n    724-846-6400  M-F; 9:00am 4:00pm\n    724-480-6667   M-F; 4:00pm 9:00pm\n    Sat Sun:  24 hours to Monday @ 9:00am"
  },
  {
    "addressLine1": "PO Box 362",
    "city": "Beaver Falls",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15010",
    "name": "Crossroads Shelter For Homeless Men",
    "organization": "Crossroads Shelter For Homeless Men",
    "phone": "(724) 714-6203",
    "website": "mailto:cs.shelter.aa.2016@gmail.com",
    "description": "Crossroads Shelter of Beaver County\nShelter entrance is located on the FOURTH AVENUE side of 11th St and 4th Avenue.\nProviding homeless men a safe haven for the night.\n\n\nCrossroads Shelter Emergency Shelter houses men seven nights per week from 7 p.m. to 8 a.m. These hours of operation represent our traditional time frames, but we are working toward expanding these, and most days are actually open much later. Our goal is to create a 24-7 facility. Assistance with finding transitional to permanent housing is available, along with referrals for other issues that may need addressed.\nDescription\nShowers, laundry, and meals available. Homeless men may stay a minimum of 7 nights, and must work with shelter personnel to secure transitional or permanent housing---generally, if a guest is doing the necessary footwork, that 7 night limit does not apply. No alcohol, drugs or weapons permitted on the premises. We are unable to house anyone who is on Megan's List. Admission to the shelter solely at the discretion of the shelter worker on duty and/or the shelter administrator."
  },
  {
    "addressLine1": "101 Brighton Avenue",
    "city": "Rochester",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15074",
    "name": "Phoenix Drop In Center",
    "organization": "Phoenix Drop In Center",
    "phone": "(724) 775-9507",
    "website": "http://www.bc-systemofcare.org/phoenix.php",
    "description": "Drop in center for homeless."
  },
  {
    "addressLine1": "420 Holmes Street",
    "city": "Bellefonte",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "00000",
    "name": "CENTRE Human Services Planning Office",
    "organization": "CENTRE Human Services Planning Office",
    "phone": "(814) 355-6768",
    "website": "https://twitter.com/pahealthdept",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of CENTRE Human Services Planning Office, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "127 Grant Street",
    "city": "Blacklick",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15716",
    "name": "Pathway Homeless Shelter",
    "organization": "Pathway Homeless Shelter",
    "phone": "(724) 248-1030",
    "website": "http://www.iccap.net/",
    "description": ""
  },
  {
    "addressLine1": "300 Indian Springs Road, Suite 203,",
    "city": "Indiana",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15701",
    "name": "Indiana Indiana County Human Services",
    "organization": "Indiana Indiana County Human Services",
    "phone": "(724) 463-8200",
    "website": "https://humanservices-countyofindiana.org/",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of INDIANA Indiana County Human Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "27 East 7th St",
    "city": "Bloomsburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17815",
    "name": "Columbia County Assistance Office",
    "organization": "Columbia County Assistance Office",
    "phone": "(570) 389-5700",
    "website": "",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of COLUMBIA Columbia County Human Services Department, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "1 Gatehouse",
    "city": "Danville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17821",
    "name": "The Gate House - Homeless Shelter",
    "organization": "The Gate House - Homeless Shelter",
    "phone": "(570) 275-6766",
    "website": "http://thegatehouseshelter.com/",
    "description": ""
  },
  {
    "addressLine1": "Human Service Building, 112 Woodbine Lane, Suite 3",
    "city": "Danville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17821",
    "name": "MONTOUR Director of Human Services",
    "organization": "MONTOUR Director of Human Services",
    "phone": "(570) 271-3028",
    "website": "",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of MONTOUR Director of Human Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "206 E Burd St",
    "city": "Boiling Springs",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17007",
    "name": "Community CARES Family Shelter - Boiling Springs",
    "organization": "Community CARES Family Shelter - Boiling Springs",
    "phone": "(717) 249-1009",
    "website": "http://www.morethanshelter.org/",
    "description": "Provide emergency shelter, resources, and supportive services to individuals and families experiencing or at risk of homelessness."
  },
  {
    "addressLine1": "20 East Pomfret Street",
    "city": "Carlisle",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17013",
    "name": "Genesis House - Men's Shelter Program",
    "organization": "Genesis House - Men's Shelter Program",
    "phone": "(717) 249-1411",
    "website": "",
    "description": "Genesis House - Men's Shelter Program provided by the Salvation Army. Provides Transitional housing for homeless single men for a period of up to 6 months.\n\nOffice Hours: Mondays through Fridays 8am - 4pm."
  },
  {
    "addressLine1": "20 North Hanover Street, Suite 300",
    "city": "Carlisle",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17013",
    "name": "Homeless Assistance Program",
    "organization": "Homeless Assistance Program",
    "phone": "(717) 240-6117",
    "website": "https://www.ccpa.net/aging",
    "description": "Hours\nMonday - Friday\n8:00 a.m. - 4:30 p.m.\n\n Homeless Assistance Program\n\nProgram Objectives:\n\n    Provide homelessness prevention services that assist clients to maintain affordable housing.\n    Help people experiencing homelessness find refuge and care.\n\n    Assist people experiencing homelessness or near homelessness in attaining economic self-sufficiency."
  },
  {
    "addressLine1": "102 West High Street",
    "city": "Carlisle",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17013",
    "name": "Safe Harbour - Homeless Housing Services",
    "organization": "Safe Harbour - Homeless Housing Services",
    "phone": "(717) 249-2200",
    "website": "https://safeharbour.org/",
    "description": "Safe Harbour is a not-for-profit organization that provides a continuum of housing services for the homeless of Cumberland County. Safe Harbour is governed by an independent Board of Directors and derives its financial support from individuals, organizations, churches, fees paid by residents, commercial rents, investments, foundations, federal and state grants, as well as the United Way.\n\nOur services include operating an emergency shelter for families and single females who are in desperate need of a secure place to live and an environment to begin getting their lives under control. The bridge housing program helps individuals and families in need of longer-term assistance continue to acquire the skills necessary for independent living and a productive life style. Single individuals that need additional life support , but are ready for independent living, may be offered the opportunity to reside in one of our single-room-occupancy (SRO) permanent housing facilities."
  },
  {
    "addressLine1": "50 West Penn Street",
    "city": "Carlisle",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17013",
    "name": "Community CARES Men & Women's Homeless Shelter - Carlisle",
    "organization": "Community CARES Men & Women's Homeless Shelter - Carlisle",
    "phone": "(717) 249-1009",
    "website": "https://www.morethanshelter.org/",
    "description": "Men & Women's Homeless Shelter year round .\nSevere Weather Shelter open November through March in Cumberland County.\nCoordinated Entry Site, Street Outreach Services ,Homeless Prevention (avoid eviction), resources, and supportive services to individuals and families."
  },
  {
    "addressLine1": "14530 Rt. 28",
    "city": "Brockway",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15824",
    "name": "Just for Jesus Homeless Challenge Homeless Outreach",
    "organization": "Just for Jesus Homeless Challenge Homeless Outreach",
    "phone": "(814) 265-0243",
    "website": "http://www.justforjesushomeless.bravehost.com/",
    "description": "Just for Jesus provides shelter,food,clothes,trade opportunities and much more.We accept all people and turn no one away. Main contact facility, Brookville is a satellite facility."
  },
  {
    "addressLine1": "120 W. New Castle St",
    "city": "Butler",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16001",
    "name": "Catholic Charities Butler County Outreach",
    "organization": "Catholic Charities Butler County Outreach",
    "phone": "(724) 287-4011",
    "website": "https://www.ccpgh.org/pages/services/services_county_butler",
    "description": ""
  },
  {
    "addressLine1": "401 East Pearl Street",
    "city": "Butler",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16001",
    "name": "Robin's Home, Inc. - Supportive Housing Women Veterans",
    "organization": "Robin's Home, Inc. - Supportive Housing Women Veterans",
    "phone": "(724) 453-4644",
    "website": "https://robinshome.us/",
    "description": ""
  },
  {
    "addressLine1": "116 Browns Hill Road",
    "city": "Valencia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16059",
    "name": "The Lighthouse Foundation",
    "organization": "The Lighthouse Foundation",
    "phone": "(724) 586-5554",
    "website": "mailto:info@thelighthousefoundation.com",
    "description": "Office Hours:\nMonday-Thursday 9am-4pm\n"
  },
  {
    "addressLine1": "8391 Spring Road",
    "city": "New Bloomfield",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17068",
    "name": "Perry County Human Service",
    "organization": "Perry County Human Service",
    "phone": "(717) 582-8703",
    "website": "https://perryhumanservices.org/",
    "description": ""
  },
  {
    "addressLine1": "425 Franklin Farm Lane",
    "city": "Chambersburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17202",
    "name": "Franklin Franklin County Human Services",
    "organization": "Franklin Franklin County Human Services",
    "phone": "(717) 261-3893",
    "website": "https://www.franklincountypa.gov/index.php?section=government_human-resources",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of FRANKLIN Franklin County Human Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "223 South Main Street",
    "city": "Chambersburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17201",
    "name": "Franklin County Shelter",
    "organization": "Franklin County Shelter",
    "phone": "(717) 267-3669",
    "website": "https://www.sccap.org/",
    "description": "Emergency shelter for single men, women, and families.\nThe shelter is a component program of SCCAP and consists of programming that is intended to help the shelter clients work towards self-sufficiency. Including: intensive case management, a comprehensive life skills program, budgeting, and parent/child enrichment. Clients are required to actively participate, work with staff, and achieve their goals.\n"
  },
  {
    "addressLine1": "634 Sproul Street",
    "city": "Chester",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19013",
    "name": "CityTeam Ministries Philadelphia",
    "organization": "CityTeam Ministries Philadelphia",
    "phone": "(610) 872-6865",
    "website": "http://www.cityteam.org/philadelphia/",
    "description": "Office hours: From 8:00 AM to 4:45 PM\n\nShelter hours: The shelter doors open at 7:45 PM each evening and close at 8:10 PM.\n\nOvernight facility-based shelter for men. Shelter guests arrive in the evening and must exit the following morning. Capacity is 36 beds.\n\n\nCityTeam Ministries is involved throughout the Delaware Valley in real life situations with the people that walk through our doors. Dedicated and caring staff and volunteers reach out to those in need of a hot meal, a safe shelter, and decent clothing. We also offer a recovery program for those men that are on the road of destruction from drugs and alcohol.\n\n\nWe connect with low-income families that are in need of an emergency food box to help stretch their income at the end of the month. Mothers with at-risk young children stop by every Wednesday afternoon to receive diapers, formula, and other baby items. You can make a difference by volunteering, donating or financially supporting this special ministry to the poor and homeless.\n\nMust be 18 years of age and able bodied - (must be able to climb the steps to the second floor shelter). Shelter guests will not be permitted to enter the facility if they are under the influence of alcohol and/or drugs. Identification is also needed.\n\nMeals\nBreakfast: Sundays at 8 AM\nLunch: Saturdays at 11:30 AM\nDinner: Monday through Saturday - 5:00 PM\nSunday - 5:00 PM\n"
  },
  {
    "addressLine1": "701 Madison Street",
    "city": "Chester",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19013",
    "name": "Wesley House Emergency Shelter",
    "organization": "Wesley House Emergency Shelter",
    "phone": "(610) 872-2611",
    "website": "http://www.caadc.org/",
    "description": "The shelter has 17 rooms for families or single women. It is typically at full capacity of 70 people on any given day and serves an average of 240 individuals (75 households) per year.\n\nWesley House has a state-of-the-art computer training room for clients to improve their computer skills, search for employment, and secure permanent housing.\n\n\nFinancial literacy (Money Smarts) classes are offered here as well as the Catholic Social Services  Out of Poverty Program, enrichment classes, nutrition classes, medical assessments through Horizon House, respite care for needy children, toys during the holiday season, and Planned Parenthood classes."
  },
  {
    "addressLine1": "229 Norris Street",
    "city": "Chester",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19013",
    "name": "The Family Management Center",
    "organization": "The Family Management Center",
    "phone": "(610) 872-4070",
    "website": "http://www.caadc.org/",
    "description": "Shelter for families. 10 rooms. FMC offers numerous additional programs including the After School Program, medical assessments through ChesPenn, mental health assessments through Horizon House, toys during the holiday season, play therapy and a karate program for children."
  },
  {
    "addressLine1": "6901 Woodland Ave",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19142",
    "name": "Outley House Shelter",
    "organization": "Outley House Shelter",
    "phone": "(215) 724-8355",
    "website": "https://www.selfincorp.org/",
    "description": ""
  },
  {
    "addressLine1": "214 South 7th Street",
    "city": "Clarion",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16214",
    "name": "Clarion County Human Services Building",
    "organization": "Clarion County Human Services Building",
    "phone": "",
    "website": "https://twitter.com/clarionu",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of Clarion County Human Services Building, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "1 Dale Ave",
    "city": "Franklin",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16323",
    "name": "Venango County Office of Economic Opportunity",
    "organization": "Venango County Office of Economic Opportunity",
    "phone": "(814) 432-9767",
    "website": "https://www.co.venango.pa.us/151/Human-Services",
    "description": ""
  },
  {
    "addressLine1": "705 Butler Rd Suite 211",
    "city": "Kittanning",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16201",
    "name": "Armstrong County Emergency Food and Shelter Program - Community Action Program",
    "organization": "Armstrong County Emergency Food and Shelter Program - Community Action Program",
    "phone": "(724) 548-3408",
    "website": "http://www.armstrongcap.com/",
    "description": "Emergency Food and Shelter Program (EFS) This program provides emergency shelter to those who are facing an emergency housing situation. Limited funds and time limits do apply. This program is 150% of the Federal Poverty Income Guidelines or less.\n\nTransitional Housing Program (TH) This program is for participants who are homeless by the federal definition of homelessness. Proof must be provided. Clients must participate in a housing plan to assist them in becoming self-sufficient and connect them to mainstream resources. Clients must seek employment to become self-sufficient and increase their income. Assistance is short term.\n\n\nPermanent Supportive Housing Program (PSH) This program is for participants who are homeless by the federal definition of homelessness. Proof must be provided by a doctor confirming that the participant is permanently disabled. Clients are encouraged to seek employment and secure mainstream resources to aid them in improving their health. Rental assistance is on-going provided the client is following the rules of the program. A housing plan is developed with the case manager to assist the client in meeting their goals.\n\n\nEmergency Solutions Grant (ESG) This program assists people who are homeless or near homeless. There are income guidelines and limits of service. To qualify you must have income of 30% of the Area Median Income or below. The goal of the program is for participants to become self-sufficient after ESG assistance.\n\nContinuum of Care Program Housing assistance is based on HUDs Fair Market Rent amount which includes all utilities, therefore a rental must include utilities. The number of bedrooms determines the fair market rent. This applies to the TH, PSH and SSO Programs below.\n\n\n"
  },
  {
    "addressLine1": "822 East Chestnut Street",
    "city": "Coatesville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19320",
    "name": "W.C. Atkinson Shelter and Atkinson Project",
    "organization": "W.C. Atkinson Shelter and Atkinson Project",
    "phone": "(610) 380-6193",
    "website": "http://www.wcatkinson.org/",
    "description": "22 bed emergency and temporary shelter for men. The emergency shelter is a source of food, shelter, referral and supportive services for those who have lost most or all of their support systems. More than 200 men are sheltered annually.\n\nThe residents are provided an address and telephone number, and a stable and caring environment which enhances their ability to gain employment. This process begins with case management (including, but not limited to, individual goal setting) provided by Building Bridges of Chester County. Case management is loosely defined as participation in any structured environment that addresses the causative factors of the individual's homelessness. The residence sometimes also receive case management services from the VAMC treatment programs, Riverside's out patient program, and Open Arms steps program.\n\nTransitional Housing\n\nTwo homes adjacent to the 'Atkinson Center' have been rehabilitated into transitional housing. Three men (one man per bedroom) share each of the homes. Men that are moving toward self-sufficiency, yet need additional support (like time to build up their credit) are invited to transfer from the shelter to the transitional homes. The men work, pay a rental fee and usually continue their meals at the shelter.\n\nPermanent Housing\n\nThree townhouses built by AMSCI and located one block from the Atkinson Center are supportive homes to eight men. These men either work or on long term disability. They continue supportive services with an assigned case manager and an on-site facilities manager. Although these homes are 'permanent housing' we desire to see the men live completely independent and attain home ownership or an independent living house or apartment."
  },
  {
    "addressLine1": "17 North 7th Avenue",
    "city": "Coatesville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19320",
    "name": "City Gate Shelter",
    "organization": "City Gate Shelter",
    "phone": "(610) 383-6934",
    "website": "http://fbchapel.org/Missionaries/City_Gate_Shelter/",
    "description": "Emergency shelter is provided for men who must be in shelter by 5 p.m. Religious services are conducted."
  },
  {
    "addressLine1": "423 East Lincoln Highway",
    "city": "Coatesville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19320",
    "name": "CYWA Gateway Shelter",
    "organization": "CYWA Gateway Shelter",
    "phone": "(610) 384-9591",
    "website": "http://www.cywa.org/",
    "description": "The CYWA Gateway Shelter provides temporary shelter and refuge to homeless women and their children, 24 hours a day, 7 days a week. Women and their children, and single women, seeking help because of poverty, abandonment, abuse, mental health and addiction challenges, receive intensive case management services to move them into self-sufficiency and independence. Safe shelter, access to bath and kitchen facilities, food, clothing, employment assistance, childcare, and a plan for their future are offered to all Gateway residents. The majority of Gateway residents include the most vulnerable of the homeless population, children under the age of 5."
  },
  {
    "addressLine1": "233 West Gay Street",
    "city": "West Chester",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19380",
    "name": "Dorothy Day Center - Saint Agnes",
    "organization": "Dorothy Day Center - Saint Agnes",
    "phone": "(610) 692-2990",
    "website": "https://saintagnesparish.org/st-agnes-day-room-1",
    "description": "Hours: Mondays through Fridays 9am to 3pm.\n\nDay Room Services\n\n    Light breakfast and hot lunch served daily\n    Groceries provided for families in need\n    Clothing for men, women, and children\n    Diapers and formula\n    Basic nursing services\n    Health and wellness support, education and referrals\n    Outreach visits for those who can't make it to the Day Room\n    Bilingual outreach services\n    Life skills for families\n    Children's programs\n    Job search assistance\n    Holiday programs for families at Thanksgiving, Christmas and Easter"
  },
  {
    "addressLine1": "342 Birch St",
    "city": "Kennett Square",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19348",
    "name": "His Mission, Inc",
    "organization": "His Mission, Inc",
    "phone": "(610) 444-2559",
    "website": "https://www.facebook.com/His-Mission-Inc-918586101539867/",
    "description": "Provides shelter for men, women, and children. Family shelter."
  },
  {
    "addressLine1": "101 E Market St",
    "city": "West Chester",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19382",
    "name": "Salvation Army Railton House",
    "organization": "Salvation Army Railton House",
    "phone": "(610) 696-8746",
    "website": "https://pa.salvationarmy.org/westchester/",
    "description": ""
  },
  {
    "addressLine1": "20 North Matlack Street",
    "city": "West Chester",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19380",
    "name": "Safe Harbor of Greater West Chester",
    "organization": "Safe Harbor of Greater West Chester",
    "phone": "(610) 692-6550",
    "website": "https://safeharborofgwc.org/",
    "description": "Safe Harbor of Chester County is an independent, nonprofit organization providing food, shelter, friendship, counseling and recovery opportunities to help homeless men and women in Chester County, Pennsylvania.\n\n\n\nAnyone looking for shelter at Safe Harbor will need to go through ConnectPoints at 1-800-935-3181\n\n\n\nThe shelter is designed to support 20 homeless men and now our new program for 20 homeless single women. Our womens program opened on March 13, 2010 in a rain storm that was the worst of the year. However, they were very thankful and full of joy to see their new home.\n\n\n\nThe shelters is arranged in a dormitory style with separate bathrooms, shower faculties, new washers and dryers and now even a new kitchenette for the women living on the second floor.\n\n\n\n\nIn addition to all these new facilities the men and women are provided, free of charge, clothing, personal needs and other items to help them maintain or even regain their self-esteem."
  },
  {
    "addressLine1": "Administration Office, 100 Doyle Street",
    "city": "Doylestown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18901",
    "name": "BUCKS Bucks County Opportunity Council",
    "organization": "BUCKS Bucks County Opportunity Council",
    "phone": "",
    "website": "https://www.facebook.com/bcopportunity/",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of BUCKS Bucks County Opportunity Council, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "470 Old Dublin Pike",
    "city": "Doylestown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18901",
    "name": "Bucks County Housing Group",
    "organization": "Bucks County Housing Group",
    "phone": "(215) 345-1492",
    "website": "http://www.bchg.org/",
    "description": "This is not a homeless shelter. It is housing services. Bucks County Housing Group (BCHG) works to advance the interests of people with low moderate income and people in crisis through the provision of affordable housing and related social services.\n\nHours:\nWednesday 5:30pm - 8:00pm\n     Thursday 10:30am - 1:30pm\n     Sunday 10:30am - 1:00pm\n\nServices:\nSupportive Housing Program\nThe aim of this program is to provide housing for families while at the same time offering supportive services to help families plan and then implement a course of action to move from homelessness to permanent housing.\nWhen a family moves into one of our shelters they sign an agreement with BCHG to design and then implement a plan that moves them towards permanent housing. The Supportive Housing Program (SHP) staff and client families work together as a team to set and accomplish the goals each family needs to meet in order to live independently. This plan may include additional schooling or job trainings. It may be a plan which is focused on saving money while employed. Whatever the case may be, the client family drives the planning, and our staff is simply present to support the family as needed.\n\nBridge & Home Stabilization Programs\nWhen families complete a stay at a BCHG Supportive Housing Program site, they may need more time to accomplish the goals they hope to meet. At that point, families may be referred to the Bridge and Home Stabilization Program.\nThe Bridge and Home Stabilization programs are intended to provide subsidized rental assistance and social services to homeless families with at least one child under the age of 18.  Both programs provide housing in scattered-site rental properties. The program accommodates approximately 50 families at a time.  Rental subsidy and social services are provided and families may choose to maintain those apartments independently when they complete the program.\n\n\nWhile families are in the Bridge and Home Stabilization Programs,  we continue to support each family by providing access to food pantries and other funding assistance they may need. Our goal is to continue our strong support in order that the families are successful and reach the goal of independent housing.\n"
  },
  {
    "addressLine1": "7661 Easton Rd",
    "city": "Ottsville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18942",
    "name": "Coalition to Shelter and Support the Homeless",
    "organization": "Coalition to Shelter and Support the Homeless",
    "phone": "(866) 390-0291",
    "website": "http://www.co2ssh.org/",
    "description": "Emergency Shelter During Extreme Cold Only.\n\nThe Central Bucks Code Blue Homeless Shelter opens at a different location each month from December 1st through March 31st. The shelter opens based on temperature, windchill and severe weather. Free transportation is available from dedicated pick up locations listed on the website.\n\nCall 1-866-390-0291 Monday - Friday 9am - 5pm,\n Saturday - Sunday 10am - 4pm\n\nThe Coalition to Shelter And Support the Homeless is a faith based alliance in Central Bucks County offering shelter and support to homeless individuals on Code Blue nights when the temperature drops below 20 degrees."
  },
  {
    "addressLine1": "905 Watson Street",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15219",
    "name": "Bethlehem Haven Women's Shelter",
    "organization": "Bethlehem Haven Women's Shelter",
    "phone": "(412) 391-1348",
    "website": "https://bethlehemhaven.org/",
    "description": "Food and Clothing (600 Women Only). Bethlehem Haven is a primary care shelter which provides D&A counseling, legal guidance, and other services. It is bus accessible and has both laundry and bathing facilities.\n\n25 bed shelter.\nHours: 7:30pm to 8:00am\nMeals Provided: dinner and breakfast"
  },
  {
    "addressLine1": "6140 Station Street",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15206",
    "name": "East End Cooperative Ministry - Community Connections Center",
    "organization": "East End Cooperative Ministry - Community Connections Center",
    "phone": "(412) 361-5549",
    "website": "https://www.eecm.org/",
    "description": "Calls are preferred, or walk in to inquire about vacancies. No Guarantee walk in's will obtain a bed. Mondays through Fridays 9am to 3pm.\n\nHousing Programs:\nEMERGENCY SHELTER provides a refuge for the night, case management, breakfast and dinner, and a shower and laundry services for men and women older than 18. Individuals can stay in the Emergency Shelter for up to 60 days. Clients may work on goals to focus on finding more suitable housing.\n\nSHORT-STAY PROGRAM offers transitional housing for up to 6 months for men and women. Our case managers work with participants to develop a plan for moving toward self-sufficiency.\n\nBRIDGE HOUSING\n is a one-year residential program for men who are transitioning from short-term sheltering to independent living. The program includes one-on-one and group counseling, and case management.\n\nFAITH (Families Achieving Independence Through Housing) is a scattered-site permanent supportive housing program for families who have a family member with a physical or mental disability. Our case managers work with participants to develop a plan for moving towards self-sufficiency.\n\nPENNFREE HOUSING\n provides individual or group counseling, case management for men and women who are recovering from drug/alcohol addiction, and rent support.\n\nSAFE HAVEN / SAFE HAVEN ACCESSIBLE\n offers permanent housing and support for ten chronically homeless men who have mental health problems. Two of the residences are accessible to, and meant specifically for, men who also have a physical disability. Residents enjoy a stable environment where they can work toward a new and better lifestyle.\n\nORR COMPASSIONATE CARE CENTER\n The William and Mildred Orr Compassionate Care Center provides 24-hour shelter and non-medical respite care for adults who are unable to return to their prior housing situation, and are in need of a supportive place to recuperate after being discharged from the hospital."
  },
  {
    "addressLine1": "10 E. North Avenue",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15212",
    "name": "Light of Life Rescue Mission (Pittsburgh)",
    "organization": "Light of Life Rescue Mission (Pittsburgh)",
    "phone": "(412) 258-6100",
    "website": "https://www.lightoflife.org/",
    "description": ""
  },
  {
    "addressLine1": "1 Smithfield Street - United Way Building, 4th floor",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15222",
    "name": "Allegheny Allegheny County Housing and Homeless Assistance",
    "organization": "Allegheny Allegheny County Housing and Homeless Assistance",
    "phone": "(412) 350-4354",
    "website": "https://www.alleghenycounty.us/Human-Services/Programs-Services/Basic-Needs/Housing-and-Homeless.asp",
    "description": ""
  },
  {
    "addressLine1": "2000 Fifth Ave",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15219",
    "name": "Womanspace East",
    "organization": "Womanspace East",
    "phone": "(412) 765-2661",
    "website": "https://twitter.com/wseinc",
    "description": "Womanspace East Inc. is a nonprofit shelter assisting homeless women and children in crisis. We serve the greater pittsburgh area as a Safe Haven located in an urban setting. Our programs of child development, individual case management and community refferal assist residents in relocation and overcoming homelessness/"
  },
  {
    "addressLine1": "P.O. Box 101093",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15237",
    "name": "Crisis Center North Domestic Violence Help",
    "organization": "Crisis Center North Domestic Violence Help",
    "phone": "(412) 364-6728",
    "website": "http://www.crisiscenternorth.org/",
    "description": "Domestic violence counseling, resource and referral center.\n\nCrisis Center North is a counseling center, offering a wide range of counseling programs that provide support for victims of domestic violence. Counseling and support services are also available to significant others or friends, families, and acquaintances of those impacted by domestic violence.\n\n\nDealing with abuse issues, either currently or from the past, can be challenging and take away energy needed for moving on with our lives. Any individual attempting to manage these issues may feel alone and may struggle in current relationships. CCN offers individual counseling to address the effects of abuse and to assist in achieving personal goals."
  },
  {
    "addressLine1": "424 Third Avenue",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15219",
    "name": "Salvation Army Family Crisis Shelter",
    "organization": "Salvation Army Family Crisis Shelter",
    "phone": "(412) 362-0891",
    "website": "https://www.facebook.com/SalvationArmyUSA",
    "description": "Single Women, Women & Men w/ Children, Youths 18-21 years old. 40 beds. Provides meals.\nAlso provides referrals. Has laundry and bathing facilities.\n\nServices for women:\nfood, shelter, clothing\ncounseling\nhealth referrals\ntransportation assistance\ntutoring for GED\nparenting skills training\nguidance and support\n"
  },
  {
    "addressLine1": "301 Third Avenue",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15222",
    "name": "CHS Wood Street Commons",
    "organization": "CHS Wood Street Commons",
    "phone": "(412) 765-2532",
    "website": "https://chscorp.org/service-area/program/shelter-program-wood-street-commons",
    "description": "The Shelter Program provides services for people experiencing a housing crisis.\n\n\nThe Shelter Program provides housing for people in need of temporary housing in order to get on their feet and transition back to permanent housing. The shelter program has a unique revolving 32-bed program for men and women. Most shelters have rooms where many people stay for a portion of the day. Our shelter program provides individuals their own locking room in a high rise building Downtown. A typical stay for shelter is 30 days with possible 15-day extension. Residents receive service coordination, free meals, and transportation assistance as well as counseling for mental health and drug and alcohol counseling.\n"
  },
  {
    "addressLine1": "6023 Harvard Street",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15206",
    "name": "Orr Compassionate Care Center",
    "organization": "Orr Compassionate Care Center",
    "phone": "(412) 345-7135",
    "website": "https://www.eecm.org/eecm-services/impacts-housing-services/",
    "description": ""
  },
  {
    "addressLine1": "PO Box 9024",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15224",
    "name": "Women's Center and Shelter of Greater Pittsburgh",
    "organization": "Women's Center and Shelter of Greater Pittsburgh",
    "phone": "(412) 687-8005",
    "website": "http://www.wcspittsburgh.org/",
    "description": "This is a domestic violence shelter only and provides counseling and services to victims of domestic violence. The Center offers individual crisis counseling, referrals, laundry and bathing facilities, and many other services.\n\n\n36 family shelter. Provides dinner and breakfast."
  },
  {
    "addressLine1": "1601 Brighton Rd.",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15212",
    "name": "Pleasant Valley Shelter For Men",
    "organization": "Pleasant Valley Shelter For Men",
    "phone": "(412) 321-4272",
    "website": "http://www.ncmin.org/pleasant-valley-mens-shelter",
    "description": "Call to hold bed 10:00 am to 11:00 am, Intake 3:00 pm to 4:30 pm to complete intake.\n\nThe Pleasant Valley Mens Shelter accommodates the needs of 25 men who are homeless every night of the year.  The Shelter opens daily at 4:30 p.m. and provides residents with safe, secure sleeping quarters, a hot shower, and a warm evening meal.  In addition, the NCM staff Case Manager, Program Director, and Shelter Monitors assist the men as they work toward stability and independence by providing various services and supports, including:\n\n    Respect and Dignity\n    Donated Clothes and toiletries\n    Referrals to counseling for substance abuse and mental health support\n    Weekly medical clinic\n    Counseling from the Veterans Administration\n    Spiritual nurturing, counseling and support from volunteer clergy and laypersons"
  },
  {
    "addressLine1": "13 Pride Street",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15213",
    "name": "Shepherd's Heart Veterans Home",
    "organization": "Shepherd's Heart Veterans Home",
    "phone": "(412) 281-1305",
    "website": "https://twitter.com/shepheartpgh",
    "description": "Shepherd's Heart Veteran's Home (SHVH) is a transitional housing for homeless Veterans. The Veteran's Home is a collaboration between Pittsburgh Veterans Affair's Health Care for Homeless Veterans (HCHV), Comprehensive Homeless Center (CHC) and Shepherd's Heart Fellowship, a parish of the Episcopal Diocese of Pittsburgh. The collaboration aims to achieve a continuum of care for homeless Veterans. There are approximately 1500 homeless veterans on any given night in Allegheny County. In 2006, Shepherd's Heart Fellowship was awarded a grant from the VA to renovate the second floor of the church and turn it into an \" Engagement Center\". The program aims to service male and female veterans who are homeless and may have posttraumatic stress disorder (PTSD), substance abuse problems, mental illness, dual diagnosis, and those who are disabled.\n\nShepherd's Heart is located on the second floor of Shepherd's Heart Fellowship at 13 Pride Street in the Uptown area of Pittsburgh. The first floor contains offices, and the third floor is a large worship center. Previously, the second floor had been a medical center; 10 former examination rooms have been converted into bedrooms. Five beds serve as shelter beds for those moving from the streets into the CHC, and other five beds will be transitional beds for those who have finished the CHC program. In addition to the bedrooms, there is a kitchen, a great room (dining and social room), a laundry facility, and 2 restrooms with showers. The facility is handicap accessible. Bus stops are located close by for easy access to transportation. Three meals a day are provided by SHVH."
  },
  {
    "addressLine1": "905 Watson St",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15219",
    "name": "Housing Services",
    "organization": "Housing Services",
    "phone": "(412) 213-8531",
    "website": "https://www.facebook.com/actionhousingpgh/",
    "description": "Our Intake line is 24 hours a day, If lines are busy, essential calls can be switched over to voicemail leave detail message and an Intake worker will return your call with in 24 hours.\n\nEach year, hundreds of women seek safety and shelter at Bethlehem Haven.They are young women who have been kicked out of their homes. Older women who have been abused by their adult children. They are working women who lost their job when the company downsized.One missed paycheck, one medical emergency, one bad decision, one blind corner and the house of cards comes tumbling down. They are left homeless, hungry and hurting.But you were there for them. Every gift you gave - whether it was your time, talents or treasure reminded them that someone cared."
  },
  {
    "addressLine1": "731 Excelsior St",
    "city": "Pittsburgh",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15210",
    "name": "Abiding Missions Team Warming Center",
    "organization": "Abiding Missions Team Warming Center",
    "phone": "(412) 481-1161",
    "website": "mailto:Abiding731@gmail.com",
    "description": "When daytime high temperatures are forecasted to remain under 25 degrees. Hours of operation: 7am-3pmSetting: warm, safe, low-drama, hospitality, opportunities for rest and to help out. Provisions: hot breakfast and lunch. "
  },
  {
    "addressLine1": "523 Sinclair Street",
    "city": "McKeesport",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15132",
    "name": "YMCA of McKeesport Winter Transitional Shelter",
    "organization": "YMCA of McKeesport Winter Transitional Shelter",
    "phone": "(412) 664-9168",
    "website": "https://www.facebook.com/actionhousingpgh/",
    "description": "Men's and Women's shelter. 84 bed capacity. No meals are provided.\n\nThe YMCA offers transitional shelter during the winter months of the year. It offers many programs including recreation, literacy, and parent-child courses. It is bus accessible (61C and 56C)."
  },
  {
    "addressLine1": "523 Sinclair Street",
    "city": "McKeesport",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15132",
    "name": "McKeesport Downtown Housing",
    "organization": "McKeesport Downtown Housing",
    "phone": "(412) 664-9168",
    "website": "http://thoughtfulbalance.com/projects/mckeesporthousing",
    "description": ""
  },
  {
    "addressLine1": "742 Ross Avenue",
    "city": "Wilkinsburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15221",
    "name": "YMCA Women's Homeless Services",
    "organization": "YMCA Women's Homeless Services",
    "phone": "(412) 371-2723",
    "website": "",
    "description": "The Wilkinsburg YWCA offers employment training, referrals, and basic life skills training for homeless women in the area. The Facility is bus accessible (67A Monroeville and 67F Trafford), and has both laundry and bathing facilities.\n\nThere are 16 beds at this shelter. Dinner is also served."
  },
  {
    "addressLine1": "130 N 1st Street, Suite 102",
    "city": "Stroudsburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18360",
    "name": "Street2Feet Outreach Center",
    "organization": "Street2Feet Outreach Center",
    "phone": "(570) 369-1299",
    "website": "http://www.rhd.org/Program.aspx?pid=2254",
    "description": "Street2Feet Outreach Center is a homeless day center open Monday-Friday 10a-2p & Saturdays 9a-12p. Services range from showers & laundry to Case Management and much more in between. Stop in for an intake if you are homeless or pending homelessness.\n\n\n\nDaytime resource center to serve the homeless population of Monroe county created as a Division of Resources for Human Development Inc. partnered with MCHI"
  },
  {
    "addressLine1": "901 Swartswood Road",
    "city": "Newton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "07860",
    "name": "Samaritan Inn",
    "organization": "Samaritan Inn",
    "phone": "973-940-8872",
    "website": "https://samaritaninn.org/",
    "description": "Samaritan Inn provides emergency food and temporary shelter to homeless families in Sussex County as well as a program of counseling and skill building in family maintenance and growth.\n\nFood Pantry Hours:\nMonday, Wednesday & Friday from 2:00pm to 4:00pm\nAdditional Services:\n- 24 hour hotline\n- Prevention of Homelessness\n- Temporary Housing\n- Family shelter apartments\n- Emergency shelter for singles\n- Community case management\n- Holiday dinner and gift program\n- Cooking with Coupons to help families learn how to budget their money\n"
  },
  {
    "addressLine1": "Northampton County Government Center, 669 Washington Street",
    "city": "Easton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18042",
    "name": "NORTHAMPTON Department of Human Services",
    "organization": "NORTHAMPTON Department of Human Services",
    "phone": "(610) 559-3010",
    "website": "https://www.northamptoncounty.org/HS/Pages/default.aspx",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of NORTHAMPTON Department of Human Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "536 Bushkill Dr",
    "city": "Easton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18042",
    "name": "Safe Harbor Shelter",
    "organization": "Safe Harbor Shelter",
    "phone": "(610) 258-5540",
    "website": "http://www.caclv.org/",
    "description": ""
  },
  {
    "addressLine1": "41 N Third St",
    "city": "Easton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18042",
    "name": "Third Street Alliance for Women & Children Women and Children's Shelter",
    "organization": "Third Street Alliance for Women & Children Women and Children's Shelter",
    "phone": "(610) 258-6271",
    "website": "https://thirdstreetalliance.org/",
    "description": ""
  },
  {
    "addressLine1": "140 Bushkill Drive",
    "city": "Easton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18042",
    "name": "RoofOver Transitional Shelter",
    "organization": "RoofOver Transitional Shelter",
    "phone": "(610) 253-4253",
    "website": "http://www.eastonareaneighborhoodcenter.org/",
    "description": "Transitional Shelter specializing in young working families. Women and Children only.\n\nOffice hours: Mondays through Fridays 8:30am - 4:30pm.\n\n\nEANC operates a transitional housing shelter in downtown Easton. This shelter is for families (single parent or two-parent) with children.\nRoofOver provides housing as well as case management tailored to each family. The goal of RoofOver is to provide support to these families as they learn to budget, save, and stabilize themselves.\nRoofOver can accept families of one or two parents and up to four children.\nEligibility requirements for RoofOver are:\n    the family must have children\n    the family must have a minimum of $500/mo in income\n    at least one adult must be employed at time of entry\n\n    at least one adult must maintain employment at all times\n\nA family must consist of at least one adult who maintains custody and/or legal guardianship of the child(ren). Families which include stepparents, unmarried couples, and domestic partnerships are welcome.\n\nEach unit at RoofOver comes furnished with beds for the family, a futon couch, dining table and chairs, and household linens (towels, bedding, etc.). Families can work with staff to address any other immediate needs\n\n"
  },
  {
    "addressLine1": "P.O. Box 389",
    "city": "Emporium",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15834",
    "name": "Cameron Northern Tier Community Action Corp.",
    "organization": "Cameron Northern Tier Community Action Corp.",
    "phone": "(814) 486-1161",
    "website": "https://business.facebook.com/NTCACHeadStart/",
    "description": ""
  },
  {
    "addressLine1": "62 North St",
    "city": "North Street Roulette",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16746",
    "name": "Potter County Human Services",
    "organization": "Potter County Human Services",
    "phone": "(814) 544-7315",
    "website": "https://pottercountyhumansvcs.org/",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of POTTER Potter County Human Services, call them for help regarding their Homeless Assistance Programs.\nOur mission is to serve and strengthen the families and children of Potter County through an accessible social services system that is based upon both the needs and resources of our communities.\nTransitional Housing\n\nThe Potter County Transitional Housing program is designed to assist Potter County residents make the move from homelessness to permanent housing.\n\nEligibility requirements include written verification of homelessness, low-income, and a willingness to follow a housing plan.\n\n\nCase management and other supports (food, utility assistance, emergency shelter and medical transportation) will be provided to participants through existing PCHS programs.\n"
  },
  {
    "addressLine1": "25 W. Locust St.",
    "city": "Ephrata",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17522",
    "name": "Good Samaritan Services Lancaster County Shelters",
    "organization": "Good Samaritan Services Lancaster County Shelters",
    "phone": "(717) 733-3395",
    "website": "https://www.goodsamservices.org/",
    "description": "Women's Shelter: PO Box 756, Ephrata, PA 17522T 717-733-3395 F 610-917-9815\nGood Samaritan Services provides safe, comfortable housing for men, women, and women with children experiencing homelessness in Lancaster & Chester Counties.\n\nOur work is based on Christian principles and though we gladly accept people of all faiths, we ascribe Gods power to help our residents through their struggles and to allow us to help them as best as we can.\n\nThe parable of the Good Samaritan teaches us to love our neighbors by taking care of their physical and emotional needs. We believe that God loves the poor and those experiencing homelessness and we strive to serve them by helping them get back on their feet."
  },
  {
    "addressLine1": "210 South Prince Street",
    "city": "Lancaster",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17603",
    "name": "Water Street Mission Shelter",
    "organization": "Water Street Mission Shelter",
    "phone": "(717) 393-7709",
    "website": "https://wsm.org/",
    "description": "Shelter Hours\nMonday through Friday: 9:00am to 10:00pm\nSaturday through Sunday: 9:00am to 9:00pm\n\nHomeless Help Line\nHomeless and need help?\nCall (717) 358-2030.\n\nMuch more than a shelter.\nWhen a person comes to our Access Center and is seeking help, we connect them with a Case Manager who will talk with them to assess the next best step while with us.  A Life Coach teams up with the person as an accountability partner in reaching individual goals.  He or she embarks on a personalized Shelter Track or Residential Track.  Both tracks give access to all services at Water Street and with our community partners. We provide :\n    Counseling and case management\n    Referrals to community services for financial, job, and housing needs.\n    Recovery groups and parenting classes\n    Devotions, chapel services and group prayer sessions\n    Free dental care at Water Street Health Services\n    Free medical and behavioral health support\n \nOur Access Center is located at the corner of South Prince Street and Conestoga Street in Kuhns Hall this is the brick building with two steeples."
  },
  {
    "addressLine1": "669 West Chesnut St",
    "city": "Lancaster",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17603",
    "name": "Milagro House - For Homeless Women and Children",
    "organization": "Milagro House - For Homeless Women and Children",
    "phone": "(717) 509-1401",
    "website": "https://www.milagrohouse.org/",
    "description": "Shelter for women and children. Boys over 12 year old are not allowed. Milagro House is not an emergency shelter.\n\nIn order to be accepted into the Milagro House program, a woman must:\nBe currently experiencing homelessness\nHave the desire to further her education and establish a career for herself\nAgree to follow ALL the rules of Milagro House, including those related to chores and cleaning, education, curfew, and volunteer work"
  },
  {
    "addressLine1": "1017 French St",
    "city": "Erie",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16512",
    "name": "City Mission New Life Center",
    "organization": "City Mission New Life Center",
    "phone": "(814) 452-4421",
    "website": "http://www.eriecitymission.org/",
    "description": "New Life Program\nLong-term comprehensive residential recovery program for men committed to making a true change in their lives.\n\nSamaritan Care Program\nOur Samaritan Care Program provides emergency shelter for men (18 years and older) needing a safe, clean place to sleep.\n\nWomen's Ministries\nGrace House\nLong-term, therapeutic transitional living facility for single women, without children, committed to life transformation.\n\n\n"
  },
  {
    "addressLine1": "1027 E. 26th St.",
    "city": "Erie",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16502",
    "name": "The Refuge",
    "organization": "The Refuge",
    "phone": "(814) 454-6088",
    "website": "http://euma-erie.org/mission-programs/the-refuge111/",
    "description": ""
  },
  {
    "addressLine1": "655 W. 17th St.",
    "city": "Erie",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16502",
    "name": "Community Shelter Services",
    "organization": "Community Shelter Services",
    "phone": "(814) 453-5937",
    "website": "https://communityshelter.org/",
    "description": "CSS is Erie county's largest homeless shelter. Our mission is to preserve the dignity and support the development of those who are homeless by providing temporary, transitional and permanent shelter, as well as support services, referrals and advocacy.\nHours: Open 24 hours a day.\n"
  },
  {
    "addressLine1": "245 E. 8th St.",
    "city": "Erie",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16503",
    "name": "Community of Caring",
    "organization": "Community of Caring",
    "phone": "(814) 456-6661",
    "website": "https://www.cocerie.com/",
    "description": "Provides food, clothing and shelter for those in need in Erie County and throughout the world.\n\nEmergency Shelter\nCOC provides emergency and transitional shelter to homeless individuals (single adults). Unfortunately we do not have facilities for families and children.\nResidents receive a safe bed with bedding, bathroom and laundry facilities. They also receive 3 meals and a snack daily. We provide links to other services which will help them reach their goals (These goals are usually permanent housing and a stable income.)\n\nResidents must follow simple standards of behavior and are expected to participate in the life of the community by doing chores. If they have income, they are expected to contribute $110/month in shared expense. People with food stamps share a portion of their monthly allocation to help defray the cost of meals and coffee. If someone does not have income we dont kick them out! We help them try to move forward.\n\nHot Meals\nA hot meal is served at noon each to the community at large. The only requirement to receive a meal is that you be hungry! If you ever have some free time during the day, feel free to come for a free lunch.\nFinally Home Shelter + Care\nThis program provides permanent subsidized housing and support services to up to 10 chronically homeless disabled persons.\nParticipants must meet specific eligibility guidelines to qualify for this program, and are usually referred by someone in Homeless Case Management. For more information or to apply call John Yungwirth or Glinda Atkinson, program coordinator, at 814-456-6661.\n\nFood Pantry\nThe COC Food Pantry distributes food 3 times a week. On Tuesday we offer the areas only pantry specifically for diabetics.\nFood is distributed on Wednesday to the first half of the alphabet from A to L, on Friday to the other half from M to Z.\n\nTo receive services people must meet income guidelines and live within our service area as determined by Second Harvest Food Bank of Northwest Pennsylvania.\n\nDayenu House\nIntergenerational Family Support Center\nDayenu\" (Dye-yay-noo) is a Hebrew word meaning \"enough\". Its an expression of gratitude. Its a way of appreciating all that God has done for us.\nThis community center on the corner of 21st and German is located near the geographical center of the city of Erie. It serves as a location for meals, activities, and events.\n\nEvery Sunday a Sunday Family Dinner is served free of charge to anyone who comes. Dinner starts at 3 p.m. and includes some scripture, praise and meditations.\nIn the summer Dayenu House is the location for the Summer Launch Program, which provides food to children and job training to teens."
  },
  {
    "addressLine1": "239 East 12th Street",
    "city": "Erie",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16503",
    "name": "St. Patrick’s Haven - Temporary Shelter For Men",
    "organization": "St. Patrick’s Haven - Temporary Shelter For Men",
    "phone": "(814) 836-4153",
    "website": "https://stpatrickshaven.org/",
    "description": ""
  },
  {
    "addressLine1": "550 W. 7th St",
    "city": "Erie",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16502",
    "name": "Erie United Methodist Alliance - Liberty House",
    "organization": "Erie United Methodist Alliance - Liberty House",
    "phone": "(814) 874-3687",
    "website": "https://euma-erie.org/programs/liberty-house.html",
    "description": ""
  },
  {
    "addressLine1": "Office of Mental Health & Mental Retardation, 154 West Ninth Street",
    "city": "Erie",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16501",
    "name": "ERIE Erie County Department of Human Services",
    "organization": "ERIE Erie County Department of Human Services",
    "phone": "(814) 451-6800",
    "website": "https://www.facebook.com/eriecountydhs/",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of ERIE Erie County Department of Human Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "632632628 Arch Street, Suite B, 101",
    "city": "Meadville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16335",
    "name": "Crawford Crawford County Human Services",
    "organization": "Crawford Crawford County Human Services",
    "phone": "(814) 373-2613 or 336-4352",
    "website": "https://twitter.com/crawfordcasa",
    "description": ""
  },
  {
    "addressLine1": "205 Baltimore Avenue",
    "city": "Cumberland",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "21502",
    "name": "Central YMCA",
    "organization": "Central YMCA",
    "phone": "(301) 724-5445",
    "website": "https://www.cumberlandymca.org/housing.html",
    "description": "Emergency shelter\nTransitional housing\nChild care program\nPermanent housing for single men\nCase management\nInformation & referrals\nEmployment training"
  },
  {
    "addressLine1": "146 Bedford Street",
    "city": "Cumberland",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "21502",
    "name": "Family Crisis Resources Center",
    "organization": "Family Crisis Resources Center",
    "phone": "(301) 759-9246",
    "website": "http://www.familycrisisresourcecenter.org/",
    "description": "24/7 Crisis Support Hotline: 301.759.9244\n*NEW* Text Message (SMS) Support Line: 301.970.4242\nFamily Crisis Resource Center, Inc., offers a variety of services to victims/survivors of domestic violence and sexual assault, including a 24 hour hotline, shelter, counseling, advocacy, accompaniment, and referrals.\n\n\nVictims of domestic violencerape/sexual assault assistance\nTemporary safe shelter\nMeals, counseling\nProgram for male (including counseling)\nTransitional housing for women"
  },
  {
    "addressLine1": "16 Gulf Memorial Drive",
    "city": "Cumberland",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "21502",
    "name": "Union Rescue Mission of Western Maryland",
    "organization": "Union Rescue Mission of Western Maryland",
    "phone": "(301) 724-1585",
    "website": "https://urmcumberland.org/",
    "description": "Emergency shelter. Meals, Counseling. Serves handicapped individuals. This is a religious organization."
  },
  {
    "addressLine1": "19 Frederick St",
    "city": "Cumberland",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "21502",
    "name": "Allegany County Human Resources Women's Transitional Housing",
    "organization": "Allegany County Human Resources Women's Transitional Housing",
    "phone": "(301) 777-8286",
    "website": "",
    "description": "Provides transitional housing for women and women with children. Other services provided: Case management, Information, Assistance applying for benefits, Utility Assistance, 1 month's rent and security deposit assistance (rent assistance)."
  },
  {
    "addressLine1": "1 Frederick Street",
    "city": "Cumberland",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "21501",
    "name": "Allegany County Department of Social Services",
    "organization": "Allegany County Department of Social Services",
    "phone": "(301) 784-7020",
    "website": "https://www.facebook.com/ACDSSCumberland/",
    "description": "The department of Social Services provides homeless assistance with emergencies. This includes motel placement along with assistance applying for benefits including cash assistance for women with children.\n\nThis service is for everyone in emergency situations."
  },
  {
    "addressLine1": "PO Box 184",
    "city": "Fairless Hills",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19030",
    "name": "AHTN Code Blue Shelter - Extreme Weather Shelter",
    "organization": "AHTN Code Blue Shelter - Extreme Weather Shelter",
    "phone": "(215) 550-3868",
    "website": "http://www.advocates4homeless.org/",
    "description": "Interfaith organization providing seasonal shelter December - March during periods of extreme weather."
  },
  {
    "addressLine1": "7 Library Way",
    "city": "Levittown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19058",
    "name": "Bucks County Emergency Homeless Shelter",
    "organization": "Bucks County Emergency Homeless Shelter",
    "phone": "(215) 949-1727",
    "website": "http://www.fsabc.org/",
    "description": "Emergency shelter for families and individuals; case managers assist with needed services; Provides emergency shelter, food, clothing and general information referrals. The shelter can house up to 85 men, women and children.\n\nHours: 24 hours a day, seven days a week\n\nShelter is Free of Charge.\n\nOn-Site Services\n    Case management\n    Job search and preparation resources\n    Budget planning\n    Health evaluations, screenings and referrals\n    Outpatient counseling\n    Transportation to doctors' appointments, job interviews and summer camp for children"
  },
  {
    "addressLine1": "601 Indiana Avenue",
    "city": "Farrell",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16121",
    "name": "Shenango Valley Urban League",
    "organization": "Shenango Valley Urban League",
    "phone": "(724) 981-5310",
    "website": "https://www.svurbanleague.org/",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of MERCER Shenango Valley Urban League, call them for help regarding their Homeless Assistance Programs.\n\nThe Shenango Valley Urban League is certified by the U.S. Department of Housing and Urban Development (HUD) to provide comprehensive housing counseling in Western Pennsylvania.\n\n\nFunded by HUD, the Urban League provides services at no cost.\n\nThe Homeless Assistance Program (HAP) provides one months rent to individuals facing eviction due to non-payment. The Housing department also provides discrimination services through the Shenango Valley Community Resource Board (CHRB). The purpose is to implement and monitor fair housing activities in the City of Sharon.\n\n\nThe Urban League is certified by the Pennsylvania Housing Finance Agency to serve as a consumer credit counseling agency under the states mortgage assistance program.\n\nIn partnership with the Salvation Army, the Emergency Shelter Program assists individuals in need of emergency shelter due to being displaced by a fire or other unforeseen circumstances.\n\n\nIf you are in need of housing assistance, contact the Urban League at (724) 981-5310\n"
  },
  {
    "addressLine1": "1230 Stambaugh Ave",
    "city": "Sharon",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16146",
    "name": "Joshuas Haven",
    "organization": "Joshuas Haven",
    "phone": "(724) 983-0304",
    "website": "http://www.joshuashaven.org/",
    "description": "Shelter Men on site up to 14 beds; open everyday at 1:00pm7 days a week; Free Bread program Sat & Sun 2-4pm.\n\nHours of Operation\nAdministration Offices:\nMonday - Friday: 1-5pm\nShelter Program:\n7 days a week,\n365 days a year\n5pm-8am\n\nMen's Shelter Program\n\nWe offer temporary/emergency shelter for 8 homeless men on site.  We are open from 6pm-8am, 7 days a week, 365 days a year. Men are accepted on a first come first serve basis. After clearances and screening each man receives:\n\nA warm meal\nShower\nA place to sleep in a safe, clean environment\nSupportive services\n\nSpiritual programs are available for all men who stay at the Mission.\n\nResident Assistants on site during hours of operation.\n\nExodus Program\n\nThe Exodus program is designed to work with residents to conduct a structured job search, using Job Readiness services offered by agencies such as\nCareer Link and Mercer County Community Action Partnership."
  },
  {
    "addressLine1": "456 Nimick Street",
    "city": "Sharon",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16146",
    "name": "St Nicholas Center Men's Outreach",
    "organization": "St Nicholas Center Men's Outreach",
    "phone": "(724) 308-6218",
    "website": "mailto:stnicholasscenter@gmail.com",
    "description": "We are a nonprofit homeless shelter for men. We can house up to 10 men.\n\nWe have an application process that the person must go through and once it's turned in then it will take up to 48 hours for it to be approved.\n\n\nIndividuals that have an income will be asked to pay a small percentage of it to the community here to help defray the costs of taking care of of that person.\n\nIndividuals that don't have a job, will have some daily chores each day in turn for their room and board. We are not funded by the state or government. We run by donations and what the clergy contribute each month from their income.\n\nWe are a long term outreach center, the length of stay is determined by the individual here. Their is spiritual counseling offered by the clergy.\n\n\nSome of the residents here may accompany the clergy on outings if the offer is made to them.\n\nThis is a good place to get your life back on track, and have the guidance and help you need."
  },
  {
    "addressLine1": "84 W. Wheeling Street",
    "city": "Washington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15301",
    "name": "Washington City Mission",
    "organization": "Washington City Mission",
    "phone": "(724) 222-8530",
    "website": "http://www.citymission.org/",
    "description": "Shelter for men: Ext. 210\nShelter for women with children: Ext. 214\nDonation Pick-up Service: Ext. 211\n\nDaily Meal Schedule (Sunday through Friday): Ext. 222Meals are served daily out of our new Feed My Sheep Kitchen and Dining Hall, located at:\n56 West Strawberry Avenue\nWashington, PA 15301Mondays through Fridays\nBreakfast: 8am to 8:30amLunch: 1pm to 1:30pmDinner: 5pm to 5:30pm\nSaturdaysBrunch 10am to 10:30amDinner 4pm to 4:30pm\n\n\n(enter through Missions rear doors on Strawberry Avenue across from the Washington Police Department).\n\n\nClothing & Grocery Items: Call Main Line (724) 222-8530Samaritan Care hours for Food Distribution and for Furniture and Clothing Vouchers are:\nMondays 10:00 a.m. Noon\nWednesdays Noon 2:00 p.m.\n\nCity Mission has shelter for men, women, women with children, and a\nseparate veterans facility.\n\nWe are an emergency shelter\nas well as a campus with homeless residents working towards their\nindependence.\nThe City Mission offers two branches of service: Compassionate Care and our Life Recovery Program. Compassionate Care reaches out to those most in need by offering basic services such as meals, shelter, and medical care. The Life Recovery Program assists men, women, and children who are in crisis and looking for life transformation. Our philosophy is to meet people where they are and to lead them towards their God given purpose.\n"
  },
  {
    "addressLine1": "100 West Beau Street, Suite 703",
    "city": "Washington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15301",
    "name": "WASHINGTON Washington County Homeless Services",
    "organization": "WASHINGTON Washington County Homeless Services",
    "phone": "(724) 228-6995",
    "website": "https://www.facebook.com/washcohomelessproject/",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of WASHINGTON Washington County Homeless Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "297 E. Beau Street",
    "city": "Washington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15301",
    "name": "Family Promise of Soutwestern Pennsylvania",
    "organization": "Family Promise of Soutwestern Pennsylvania",
    "phone": "(724) 229-1129",
    "website": "http://www.familypromiseswpa.org/",
    "description": "Family Promise of Southwestern Pennsylvania connects families displaced from their homes with a network of local congregations and dedicated staff, all focused on providing them with shelter, meals, hospitality, and support until they are able to return to sustainable independent lives in their own homes."
  },
  {
    "addressLine1": "101 E. Chelten Avenue",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19144",
    "name": "Whosoever Gospel Mission",
    "organization": "Whosoever Gospel Mission",
    "phone": "(215) 438-3094",
    "website": "http://www.whosoevergospel.org/",
    "description": "Emergency Shelter for males over 21 years old. Must have 2 forms of ID and be in good physical health.\nMust be able to work with no restrictions and no income. This is a program and the resident must remain until they graduate.\n\nHours: Monday - Friday, 9:30am - 4pm.\nThe Whosoever Gospel Mission is a Christian nonprofit organization whose purpose is to provide shelter, food, clothing, education, counseling, rehabilitation and other assistance to homeless and/or needy men, women and children in the Philadelphia Metropolitan Area. As the lighted sign on our rooftop proclaims each night, we seek to offer the love of Jesus and the hope of the Gospel in both word and deed to those who are hurting."
  },
  {
    "addressLine1": "31 E. Armat Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19144",
    "name": "Covenant House For Youths",
    "organization": "Covenant House For Youths",
    "phone": "(215) 951-5411",
    "website": "http://covenanthousepa.org/",
    "description": "Offers emergency shelter for youth 18 to 21 years old. Services include an on-site health clinic, case management and education and vocational services. Walk-ins accepted. No ID required. Open 24/7.\n\nCall us at (215) 951-5411 or (888) 829-1249 and press 0 to speak to the Manager on Duty\n\nIf you do not have a way to call us but need shelter, come to our building at 31 E. Armat Street, Philadelphia, PA 19144\nIf you are in another state and in crisis, call our NINELINE at (800) 999-9999"
  },
  {
    "addressLine1": "102 North Stratton St",
    "city": "Gettysburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17325",
    "name": "Adams County Shelter For The Homeless",
    "organization": "Adams County Shelter For The Homeless",
    "phone": "(717) 337-2413",
    "website": "",
    "description": "Shelter for the homeless in Gettysburg PA. Contact at the phone number provided for hours and details."
  },
  {
    "addressLine1": "136 Carlisle Street",
    "city": "Hanover",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17331",
    "name": "Changing Lives Shelter",
    "organization": "Changing Lives Shelter",
    "phone": "(717) 633-6353",
    "website": "http://www.hanoverareacouncilofchurches.org/",
    "description": "Year round emergency shelter providing for the needs of singles and families in desperate situations, while seeking to provide a successful lifestyle change by addressing the root cause of individual situations."
  },
  {
    "addressLine1": "218 South Maple Avenue",
    "city": "Greensburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15601",
    "name": "Welcome Home Shelter",
    "organization": "Welcome Home Shelter",
    "phone": "(724) 838-9133",
    "website": "http://www.welcomehomeshelter.org/",
    "description": "Welcome Home is a temporary emergency shelter located in the heart of Westmoreland County, Pennsylvania.  We offer a clean, safe place to stay for families and single women experiencing homelessness.\n\nWelcome Home offers 30-60 days of emergency shelter and provides temporary respite for homeless families and single women.  Located in downtown Greensburg, Welcome Home can accommodate four families and ten single women at any time. In addition to providing basic needs, Welcome Home also offers life skills classes from other community providers on various topics like cooking skills, budgeting and home management.\n\n \nThe shelter is staffed 24 hours a day, and offer case management services to our guests Monday through Friday.  In addition, we also offer on-site behavioral health counseling services for all interested individuals. While we offer house food for individuals without the ability to acquire their own, individuals that are able through SNAP and Foodbank assistance are encouraged to secure their own food and prepare their own meals on-site.\n \nEach year Welcome Home assists an average of 250 women, children and men who find themselves homeless in Westmoreland County.  Annually we provide approximately 7,000 shelter nights annually.\n \nCold Weather Shelter\nIn January of 2016, Welcome Home partnered with the United Way of Westmoreland County and the Union Mission of Latrobe to provide Cold Weather Shelter to individuals displaced in cold weather in Westmoreland County when the weather drops below 25 degrees. For more information please contact Colen Brown at 724-838-9133."
  },
  {
    "addressLine1": "2217 Harrison Ave",
    "city": "Latrobe",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15650",
    "name": "The Union Mission",
    "organization": "The Union Mission",
    "phone": "724-539-3550",
    "website": "https://www.theunionmission.org/",
    "description": "We are open 24/7. If we don't have beds available we can get you on a waiting list and/or connect you with other shelter services. We have 24 program beds, and during winter months 3 cold weather shelter cots.\n\n\nPrograms\nEMERGENCY MEN'S SHELTER PROGRAM\n\nAs the only shelter for men in all of Westmoreland County, the Union Mission recognizes the significant role it plays as both an intermediary in time of crises and as a solution for men who find themselves without shelter.  Our main goal is to help our men transition through this difficult period of time while maintaining the dignity and respect they deserve.\n\nPERMANENT SUPPORTIVE HOUSING PROGRAM\n\nWithin our community and the men we serve there are pervasive issues which impact s person's ability to maintain stable housing and self-sufficiency.  Left unaddressed these issues lend themselves to chronic homelessness.  In an effort to meet these unique needs, the Union Mission operates a Permanent Supportive Housing (PSH) program consisting of 6 apartments.  This stable, supportive housing environment not only allows the time necessary for our clients to seek the treatment and assistance needed but also affords them an opportunity to hone their new skills, coping strategies, and self-management techniques.  While there is no limit on residency length in this program, we coordinate with the tenants to establish a time-line for accomplishment of goals, personal growth, and, when appropriate, transition to traditional housing environments.\n\n\n"
  },
  {
    "addressLine1": "611 Reilly Street",
    "city": "Harrisburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17102",
    "name": "Bethesda Mission Men's Shelter",
    "organization": "Bethesda Mission Men's Shelter",
    "phone": "(717) 257-4440",
    "website": "http://www.bethesdamission.org/",
    "description": "Emergency shelter for transient males\nRecovery residential and spiritual development program.\nMedical clinic (limited and by appointment only)\nServed meals and community soup kitchen\nMobile food and clothing mission\n\n\nIn addition to emergency shelter and daily soupline, our comprehensive programming includes:\n\nThe New Beginnings Program is a 12 -16 week introductory course in recovery issues and the basics of Christianity. This program challenges a guest to evaluate the core issues of their dysfunctions and answer the questions concerning their spiritual lives.\n\n\nThe Helmsman Program helps restore lives that have been nearly destroyed by alcohol and drug addiction. Over 70% of Bethesda's guests have a substance abuse problem and accompanying dysfunctional attitudes and behaviors. By providing a Christian framework for change, hearts are being touched and lives are being freed from the bondage of addiction. Sharing, praying and showing God's love are parts of the spiritual emphasis of this program. There is a prerequisite to the Helmsmen program and that is you must have completed the New Beginning's program.\n\n\nA Social Services Program meets many needs helping those with mental/emotional problems find placement and treatment in sheltered environments and group home settings. In addition to our free health care, we offer eye, dental, and prescription referral/assistance, which is offered for guests registered at the Mission. Bethesda also offers help with applications for benefits to which our guests are legitimately entitled - e.g. veteran's, disability, welfare, unemployment, SSI, etc. We partner with the VA to assist them in placing men into their programs. Finally, we help our guests secure birth certificates and photo ID's, along with free tax filing assistance. Social Services also assists in finding housing for guests who are working or have a fixed income.\n\n"
  },
  {
    "addressLine1": "611 Reily Street",
    "city": "Harrisburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17102",
    "name": "Bethesda Mission Women and Children's Shelter",
    "organization": "Bethesda Mission Women and Children's Shelter",
    "phone": "(717) 257-4447",
    "website": "https://www.bethesdamission.org/our-ministries/womens-mission/",
    "description": ""
  },
  {
    "addressLine1": "1101 Market Street",
    "city": "Harrisburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17104",
    "name": "YWCA Domestic Violence Shelter",
    "organization": "YWCA Domestic Violence Shelter",
    "phone": "(717) 238-2851",
    "website": "http://www.ywcahbg.org/programs",
    "description": "Shelter for women and their children who are immediately homeless because of fleeing an immediate domestic violence situation.\n30 day homeless shelter stay with Domestic violence counseling and case manager.\nFood and clothing bank available.\n\n24-hour Crisis Hotline\nLatin American outreach\nPolice, court and hospital accompaniments\nVictim Witness accompaniments\nDomestic Violence Legal Clinic\nEmployment services\nDomestic Violence Shelter for Women and Children\nSupport groups\nIndividual counseling\nReferral information"
  },
  {
    "addressLine1": "1735 State Street",
    "city": "Harrisburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17103",
    "name": "Amiracle4sure",
    "organization": "Amiracle4sure",
    "phone": "(717) 232-0100",
    "website": "https://www.amiracle4sure.com/",
    "description": "Transformation During Reentry\n\nby equipping individuals with skills to improve their lives after incarceration and other life-changing experiences.\n\nOur wide variety of programs offer services to returning citizens, those in recovery, and children who may have been affected.\n\n"
  },
  {
    "addressLine1": "100 Chestnut Street",
    "city": "Harrisburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17101",
    "name": "DAUPHIN Dauphin County Mental Health & Mental Retardation",
    "organization": "DAUPHIN Dauphin County Mental Health & Mental Retardation",
    "phone": "(717) 780-7050",
    "website": "",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of DAUPHIN Dauphin County Mental Health & Mental Retardation, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "120 Willow Road, Suite C",
    "city": "Harrisburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17109",
    "name": "Catholic Charities Emergency Shelter for Homeless Families",
    "organization": "Catholic Charities Emergency Shelter for Homeless Families",
    "phone": "(717) 652-8740",
    "website": "http://www.cchbg.org/get-help/emergency-shelter-homeless-families/",
    "description": ""
  },
  {
    "addressLine1": "413 S. 19th Street",
    "city": "Harrisburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17104",
    "name": "HELP Ministries",
    "organization": "HELP Ministries",
    "phone": "(717) 238-2851",
    "website": "https://www.ccuhbg.org/",
    "description": ""
  },
  {
    "addressLine1": "9 South 15th Street",
    "city": "Harrisburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17104",
    "name": "Shalom House",
    "organization": "Shalom House",
    "phone": "(717) 232-3482",
    "website": "https://shalomhouse.net/",
    "description": "Emergency Sheltering\n\nShalom House is committed to emergency sheltering for homeless women and children, transitional housing for homeless women veterans and their children, and permanent housing for disabled, chronically homeless low-income women.\n\nShalom House provides temporary shelter for women and children who have nowhere else to go. We provide for their basic needs: a bed, food, clothing, health and hygiene supplies, and a temporary address and telephone number"
  },
  {
    "addressLine1": "1101 Market Street",
    "city": "Harrisburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17104",
    "name": "YWCA Emergency Shelter - Harrisburg",
    "organization": "YWCA Emergency Shelter - Harrisburg",
    "phone": "(717) 234-7931",
    "website": "http://www.ywcahbg.org/programs/housing-and-homelessness-programs",
    "description": "Programs Offered\n\nBridge Housing\n\n    Goal-oriented housing program for women and women with children who are homeless for any reason\n    Offers support to participants with the following goals in mind: secure employment and permanent housing\n\n    Trained staff help participants eliminate potential barriers to self-sufficiency, such as a poor credit rating, lack of high school diploma or formal training, or a criminal record\n    Click here for FAQs and additional information\n\nEmergency Shelter\n\n    Provides housing to single women and women with children for up to 30 days\n    Services are focused on securing housing and employment\n    Shelter representatives assist in developing service plans, provide referrals and monitor progress weekly\n    Services are free and confidential\n    Referrals are accepted through the HELP office at (717) 238-2851. After business hours, contact Crisis Intervention at (717) 232-7511.\n\nPermanent Housing Disabilities\n\n    Program provides rental assistance and weekly case management\n    Single homeless women and men, homeless women and men with families with permanent disabilities\n\n    Following an interview if an individual is accepted, theyre placed in an apartment in the community\n    Individual pays a portion of rent based on income, program pays the difference\n    Program covers security deposit and utilities\n    Goal plans are development and individuals meet with case managers weekly to monitor progress\n    Goals focus on maintaining housing, improving finance situations, maintaining health, obtaining part-time employment, pursuing higher education, etc.\n    Participants are assisted financially until they receive Section 8 voucher, public housing, or have a change in income that allows for self-sufficiency\n\nSection 8 or Single Room Occupancy\n\n    Program for single, homeless women\n    Considered permanent housing\n    Residents have a private, single room with a shared kitchen and bath\n    For additional information and FAQs, click here\n\n Transitional Housing\n\n    Goal oriented housing program for women and women with children who are homeless\n    Housing offered in two and three bedroom apartments\n\n    Program goals include employment and permanent housing\n\n Winter Overnight Shelter - Operates December 1 through March 31\n\n    Unfunded, lifesaving service offered to homeless women who cannot or will not utilize existing homeless programs during cold winter months\n\n    Guests enter the YWCA lobby from 8:00 9:30 p.m. though guests needed shelter after 9:30 may be escorted by the police\n    Guests received supplies to take a shower and spend the night: blankets, pillows, towels, hygiene packets, light snacks\n    Guests must leave by 7:00 a.m. the following morning though guest exist times may be extended due to extreme weather conditions"
  },
  {
    "addressLine1": "2012 N 4th St",
    "city": "Harrisburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17102",
    "name": "Capitol Pavilion Reentry Center",
    "organization": "Capitol Pavilion Reentry Center",
    "phone": "(717) 236-0132",
    "website": "https://www.firetree.com/",
    "description": "All eligible referrals will be males and females age 18 and older who have an association with the criminal justice system. Referrals into the program are directed through the Pennsylvania Department of Corrections, Pennsylvania Board of Probation and Parole, the Federal Court System, and the Federal Bureau of Prisons.\n"
  },
  {
    "addressLine1": "214 West Walnut Street",
    "city": "Hazleton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18201",
    "name": "Divine Providence Homeless Shelter",
    "organization": "Divine Providence Homeless Shelter",
    "phone": "(570) 455-1521",
    "website": "https://www.dioceseofscranton.org/",
    "description": ""
  },
  {
    "addressLine1": "140 West Mill Street",
    "city": "Nesquehoning",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18240",
    "name": "Family Promise of Carbon County",
    "organization": "Family Promise of Carbon County",
    "phone": "(610) 379-4757",
    "website": "https://www.familypromisecarboncounty.org/",
    "description": "Family Promise of Carbon County is a nonprofit 501c (3) organization serving homeless and low income families in the county and surrounding area. We utilize existing resources in our churches to form a network of 12 host congregations who are willing to house homeless families in their buildings for 7 consecutive nights, 4 times per year. We also have 11 support congregations that help with preparing meals, providing fellowship, and sleeping over with guests.\n\nSUMMARY: Family Promise of Carbon County opened our doors in 2011 and since then have changed the lives of so many people in Carbon county.\n\n\nOur average length of stay is 90 days. We are a sober program and all adults must pass random drug tests and a background check.We are one of over 180 networks across the United States. There are over 4500 congregations and 110,000 volunteers making up these networks. Based on the support of volunteers and Host congregations, Family Promise programs are funded by donations, grants, and fundraising opportunities.\n\nHow we support families in need:Families referred to the program are interviewed by a social worker or program director. If there is space available and the director feels the family is appropriate for the program, they will enter as guests.\n\n\nCommunity churches provide hospitality and fellowship to guests. This includes meals, some supplies and a place to sleep in the evening. During the day, guests are housed at our center in Lehighton. This is where the Director or other staff help families connect with community resources. Each family has a unique set of goals customized to meet their current needs and work toward being self-sufficient.A van and driver is used to help families get to and from the Day Center. While the host congregations change every week, the day center remains the same. This allows the family to have a stable mailing address to use in job and housing searches.\n\n\nVolunteers are what really make this program a reality. They help in providing meals and other items to guests, assist in fundraising, but most importantly take time to sit and talk with guests. Having the ability to connect with others can give you great strength and encouragement. If you were observing this program in action, you may not know who is a guest and who is a volunteer."
  },
  {
    "addressLine1": "Grace Episcopal Church, 827 Church Street",
    "city": "Honesdale",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18431",
    "name": "Warmth in the Night",
    "organization": "Warmth in the Night",
    "phone": "(570) 253-2760",
    "website": "mailto:rector@gracechurchhonesdale.org",
    "description": "Warmth in the Night is open only on those nights when the temperature and/or wind-chill factor is below zero degrees. We are also open during major storms such as Hurrican Irene and Sandy. Modest accomodations for men and women and families on a temporary basis. Soup supper and light breakfast offered. Open 7:00pm - 7:00am. No exceptions. Handicap accessible."
  },
  {
    "addressLine1": "430 Pittston Ave",
    "city": "Scranton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18510",
    "name": "Catherine McAuley Center - Women's Services",
    "organization": "Catherine McAuley Center - Women's Services",
    "phone": "(570) 342-1342",
    "website": "https://www.catherinemcauleycenter.org/",
    "description": "The Mission of the Catherine McAuley Center is to directly minister to women and to the economically poor. The Catherine McAuley Center commits itself to meeting the housing needs of women by providing temporary shelter for women and children who are in crisis which leaves them homeless or without substantial resources; by providing programs and supportive services that assist women in obtaining permanent housing which is safe, decent, and affordable; by providing a support system for the women and a bridge to self reliance; and by assessing those who need assistance in accessing medical and community resources.\n\nServices:\nEmergency Shelter / 30 Day Residence\nTutoring\nHousing counseling\nLinkages to community agencies\nApartment searching\nEmergency help with food, diapers, and transportation, etc.\n\n"
  },
  {
    "addressLine1": "409 Olive Street",
    "city": "Scranton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18509",
    "name": "St. Anthony's Haven - Catholic Social Services Reside",
    "organization": "St. Anthony's Haven - Catholic Social Services Reside",
    "phone": "(570) 342-1295",
    "website": "https://www.dioceseofscranton.org/",
    "description": "Emergency Shelter.\nCapacity: 20 men and 4 women\nThree levels of intense case-management programs\nRent assistance program\nProvides two meals a day to guests and 3 meals a day to case management clients\nShowers and laundry facilities"
  },
  {
    "addressLine1": "1155 River Street",
    "city": "Scranton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18505",
    "name": "Scranton Adult Rehabilitation Center Salvation Army",
    "organization": "Scranton Adult Rehabilitation Center Salvation Army",
    "phone": "(570) 346-0711",
    "website": "https://www.twitter.com/salvationarmyus",
    "description": "Adult Rehab Center. Contact for full details."
  },
  {
    "addressLine1": "135 Jefferson Avenue, 3rd floor",
    "city": "Scranton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18503",
    "name": "LACKAWANNA Lackawanna County Department of Human Services",
    "organization": "LACKAWANNA Lackawanna County Department of Human Services",
    "phone": "(570) 963-6836",
    "website": "https://www.lackawannacounty.org/index.php/departmentsagencies/human-services/human-services",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of LACKAWANNA Lackawanna County, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "445 North 6th Ave",
    "city": "Scranton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18503",
    "name": "Community Intervention Center",
    "organization": "Community Intervention Center",
    "phone": "(570) 342-4298",
    "website": "http://www.communityinterventioncenter.net/",
    "description": "CIC serves as a day shelter for displaced and / or homeless individuals providing telephone contact, mail privileges, daily storage and late afternoon nourishments as well as vital continual community contact in a non threatening sober environment. Maintains Supportive Housing Program.\nDistributes sleeping bags and food.\n\nOther Services:\n\nDrug and Alcohol Services\n\nDaily Educational Video\nWeekly 12 Step Self-help meeting.\nCrisis intervention, information and referral.\nDetox and inpatient treatment referral.\n\nOutreach:\n\nDisaffiliated individuals in need of situational advisement and medical, mental health, drug and alcohol, housing and appropriate social service referrals are provided professional interventions utilizing a non threatening and gingerly approach.\nInpatient referral to dually diagnosed (MISA**) treatment facilities and follow up case-managment services are provided to individuals in mental health/chemical dependency crisis.\n\nHIV education and confidential testing available on site."
  },
  {
    "addressLine1": "827 Water St",
    "city": "Indiana",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15701",
    "name": "Indiana County Community Action Program Inc.",
    "organization": "Indiana County Community Action Program Inc.",
    "phone": "465-2657",
    "website": "http://www.iccap.net/",
    "description": ""
  },
  {
    "addressLine1": "2501 Milltown Rd",
    "city": "Wilmington ",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19808",
    "name": "Hospitality Center of Northern New Castle County",
    "organization": "Hospitality Center of Northern New Castle County",
    "phone": "(302) 998-2222",
    "website": "https://www.familypromisede.org/",
    "description": "We are an emergency hosting program. We provide emergency shelter for children and their families. We also provide case management, housing assistance and job search assistance.\n\nOur Hospitality Center provides needed temporary shelter to up to 6 families (or 20 individuals) at a time. This additional facility is helping us create twice the promise were now able to prevent & end homelessness for twice as many families annually. The Hospitality Center opened at the end of November 2018, and within 24 hours, it was already at capacity.\n"
  },
  {
    "addressLine1": "300 Bayard Avenue",
    "city": "Wilmington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19805",
    "name": "Catholic Charities Bayard House",
    "organization": "Catholic Charities Bayard House",
    "phone": "(302) 654-1184",
    "website": "https://www.ccwilm.org/bayard-house/",
    "description": "The shelter serves 10 homeless, pregnant adolescents and young women, providing residents with food, clothing, counseling and referrals to appropriate services. Residents should be in their first or second trimester of pregnancy."
  },
  {
    "addressLine1": "515 N. Broom Street",
    "city": "Wilmington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19805",
    "name": "Mary Mother of Hope House III",
    "organization": "Mary Mother of Hope House III",
    "phone": "(302) 652-0970",
    "website": "https://www.ministryofcaring.org/services/emergency-shelters/",
    "description": ""
  },
  {
    "addressLine1": "1328 W. Third Street",
    "city": "Wilmington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19805",
    "name": "House of Joseph I",
    "organization": "House of Joseph I",
    "phone": "(302) 652-0904",
    "website": "https://www.ministryofcaring.org/services/emergency-shelters/",
    "description": "Mens homeless shelter. Capacity: 12 men.\n\nHouse of Joseph I provides emergency shelter and services to homeless employable men. Residents come to the shelter for reasons that include family challenges, substance abuse, mental health disorders, unemployment or underemployment. Case managers initially help the men to resolve immediate crises. Subsequently, they begin the process of identifying barriers to long-term self-sufficiency. The opportunity to learn life management skills has proven especially helpful.\n\nWhen case managers determine which residents need and desire additional supportive services, they may refer them to a transitional residence or long-term housing program of the Ministry of Caring. Throughout every residents stay, House of Joseph I strives to help each man reach his next step on the road to independent living."
  },
  {
    "addressLine1": "121 N. Jackson Street",
    "city": "Wilmington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19805",
    "name": "Mary Mother of Hope House II",
    "organization": "Mary Mother of Hope House II",
    "phone": "(302) 652-1935",
    "website": "https://www.ministryofcaring.org/services/emergency-shelters/",
    "description": "Emergency women's shelter for single women with children."
  },
  {
    "addressLine1": "709 North Madison Street",
    "city": "Wilmington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19801",
    "name": "YWCA Delaware Home-Life Management Center",
    "organization": "YWCA Delaware Home-Life Management Center",
    "phone": "(302) 658-7110",
    "website": "https://www.ywcade.org/",
    "description": "Home Life Management Center (YWCA) is a shelter for homeless families. Their services range from Childcare and job training to Violence Prevention and Leadership Training. There is no limit to the length of stay."
  },
  {
    "addressLine1": "720 N Orange St",
    "city": "Wilmington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19801",
    "name": "Friendship House Wilmington Empowerment Center",
    "organization": "Friendship House Wilmington Empowerment Center",
    "phone": "(302) 652-8033",
    "website": "https://www.friendshiphousede.org/",
    "description": "We are currently located at Saams Church location the entrance are the double red doors.\nMorning Hospitality: Mon-Fri 7:30am 8:30am\nSunday Breakfast: 7am 8am\nFor appointment call (302) 652-8033: Mon-Fri 9am-12pm.\nFriendship House views its empowerment centers as its primary contact with those facing homelessness throughout New Castle County, Delaware. At each open-door drop-in centers, staff and volunteers of Friendship House interface with over 250 people daily. The Centers are not only Ground Zero for the Friendship House Empowerment Strategy Program; it is also the agencys principal guide for the needs of the New Castle County, Delaware community.\n\n\nThe Empowerment Centers serve clients with a way home. Each center is part of the network of homeless ministries housed out of local churches which have a partnership with Friendship House. The principal services include basic hospitality (coffee/ tea, water, bathrooms), the Home Base Program (mailing address, phone service, locker & savings bank), a consultation & referral service, AA and NA meetings and the  Job Readiness Program (Computer lab, Job mentors, I.D., Resume, Bus Tickets,  Work Shoes, Equipment,  Workers Shelter).\n\nServices offered at our Empowerment Centers include:\n    Case Management\n    Access to a phone, a place to receive mail\n    Computer labs\n    A job readiness program where you will receive help on resume writing and job searches\n    Help getting replacement birth certificates and identification\n    Access to clothing\n    Help with food or shelter referrals\n    Bus tickets to verifiable appointments\n    Assistance with medical prescription\n    Hospitality of hot drinks, water, and access to a bathroom\n    Sanctuary from the elements\n\n"
  },
  {
    "addressLine1": "104 West 5th Street",
    "city": "Wilmington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19801",
    "name": "Booth Social Services/Emergency Housing Residence",
    "organization": "Booth Social Services/Emergency Housing Residence",
    "phone": "(302) 472-0753",
    "website": "",
    "description": "Emergency Housing Residence\n\nThe William Booth Emergency Housing Residence (EHR) is a Ninety (90) day emergency shelter for single women and women with children mainly from Wilmington and New Castle County. The Emergency Housing Residence consists of 52 beds in 13 rooms on two residential floors. The shelter operates 24/7, 365 days a year. The purpose is to provide emergency shelter services and to work toward preventing the recurrence of episodes of homelessness. The program encourages the development of self-esteem and the attainment of self-sufficiency through its commitment of providing a safe and supportive environment, and through its housing programs, advocacy and empowerment."
  },
  {
    "addressLine1": "110 N Poplar St",
    "city": "Wilmington",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19801",
    "name": "Sunday Breakfast Mission",
    "organization": "Sunday Breakfast Mission",
    "phone": "(302) 652-8314",
    "website": "https://www.sundaybreakfastmission.org/",
    "description": "Men's Shelter\nUp to 130 men who would otherwise be homeless call our shelter \"home\" each night.\n\nCommunity Meal\nA hot, nutritious meal is served to more than 200 men, women and children each night.\n\nMen's Residential Discipleship Ministry\nThe NewLife Program offers a fresh start. While here each person is counseled, educated, trained and equipped to become the productive member of society he was created to be.\n\nWomen and Family Shelter and Discipleship Ministry\nThe NewLife Program offers a fresh start. While here each person is counseled, educated, trained and equipped to become the productive member of society he was created to be."
  },
  {
    "addressLine1": "1913 Freeport Road",
    "city": "Natrona Heights",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15065",
    "name": "Allegheny Valley Association of Churches",
    "organization": "Allegheny Valley Association of Churches",
    "phone": "(724) 226-0606",
    "website": "http://avaoc.org/",
    "description": "Day space for homeless families and sleeping accommodations at various church facilities; up to five families may stay until housing is found.\n\nInterfaith Hospitality Network\nAVAC Interfaith Hospitality Network provides shelter, meals and assistance for homeless families and helps to alleviate homelessness by increasing the number of people from the religious community who are actively involved in providing support and advocacy.\nSince February 1993, the program has housed more than 800 people (80 percent from the local area). Upon leaving our care, approximately 85 percent of the families in the network move into a home of their own.\n5 Basic Componenets of the Program\n1. Host Churches\nHosting rotates weekly among 9 host congregations. Each Network congregation furnishes overnight lodging and meals for up to three families (up to 14 people) for one week every two or three months on a rotating schedule.\n2. Day Center\nGuests use a local day center from 8:00 AM to 5:00 PM, where the IHN director, a professional social worker, provides case management services. There, guests pursue employment, tend to pre-school children, shower, and do laundry. The day center provides guests with a mailing address and a base for housing and employment\nsearches. Many guests are employed during the day, while older children attend school.\n3. Volunteers\nVolunteers provide various services: cooking and serving meals, playing with children or helping them with\nhomework, interacting with guests with respect and compassion\n4. Social Service Agencies\nLocal social service agencies refer families to the Network. The agencies may also help guests find housing, jobs, and benefits.\n5. Transportation\nAn IHN van transports guests to and from the day center. The van also carries bedding and luggage to\nthe next host congregation."
  },
  {
    "addressLine1": "503 Oak Street",
    "city": "Lebanon",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17042",
    "name": "LEBANON Lebanon County Community Action Partnership",
    "organization": "LEBANON Lebanon County Community Action Partnership",
    "phone": "(717) 273-9328",
    "website": "http://www.lebcounty.org/depts/CAP/Pages/default.aspx",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of LEBANON Lebanon County Community Action Partnership, call them for help regarding their Homeless Assistance Programs.\nServices include child care assistance, transportation, case management, rental assistance, shelter assistance, bridge housing and permanent affordable housing, shelter housing, tax preparation, and barrier remediation.\n"
  },
  {
    "addressLine1": "235 South 12th Street",
    "city": "Lebanon",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17042",
    "name": "Hope Homeless Resource CEnter",
    "organization": "Hope Homeless Resource CEnter",
    "phone": "(717) 274-7528",
    "website": "http://www.jub.org/ministries/hopes-resource-center.html",
    "description": "HOPES (Helping Others by Providing Emergency Shelter) Homeless Resource Center is a place to go when there is nowhere else to go. HOPES serves as a home-base for those who need a place to stay and assistance to get back into housing. It is not a place to just hang out, but truly a resource center to assist those who want to become self-sufficient. Every guest is assigned a case manager who works with them to establish goals, weekly action steps, and connect them with the appropriate services to help. Additionally, HOPES provides things like food, computer access, phone, laundry, shower facilities, and overnight shelter in the winter months.\n\nAt HOPES, we are in constant need of volunteers. If you or someone you know may be interested in helping, please stop by the Lebanon office to fill out an application. You can also help by donating laundry detergent (HE certified), deodorant, sugar, or canned meals or soups. Items cans be dropped off at the Lebanon office or the resource center at 12 N 9th Street, Lebanon."
  },
  {
    "addressLine1": "139 S. 9th Street",
    "city": "Lebanon",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17042",
    "name": "Agape Family Shelter in Lebanon County PA",
    "organization": "Agape Family Shelter in Lebanon County PA",
    "phone": "(717) 272-6573",
    "website": "https://www.lebanonrescuemission.org/what-we-do/agape-family-shelter/",
    "description": ""
  },
  {
    "addressLine1": "1223 Bittner Blvd.",
    "city": "Lebanon",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17046",
    "name": "Lebanon Rescue Mission - Men's Shelter",
    "organization": "Lebanon Rescue Mission - Men's Shelter",
    "phone": "(717) 273-2301",
    "website": "https://www.lebanonrescuemission.org/",
    "description": "Emergency Shelter men only. Men's discipleship program, Provides meal and safe environment.\n\nServices: the Men's Shelter, the Agape Family Shelter, the Lazarus House and the Lebanon Free Clinic. All ministries serve the whosoever through shelter, nourishment, clothing, education and healthcare.\n\n\nMen's Shelter - Main building includes: Chapel, all administrative offices, kitchen, pantry, education/recreation room, dormatory and laundry room. In addition, we have an education building for classes, and Lazarus House which provides step-away housing for 11 men."
  },
  {
    "addressLine1": "185 Penn Drive",
    "city": "Lehighton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18235",
    "name": "Peaceful Knights",
    "organization": "Peaceful Knights",
    "phone": "(610) 340-4786",
    "website": "http://www.peacefulknights.org/",
    "description": "We currently assist qualified single adult homeless individuals with shelter, food, clothing and referral services. Clients must work or look for work 30 hrs per week and volunteer 10 hrs per week until they become employed. We are a Christian organization and weekly church attendance is mandatory.\n\nWhat we do:\n1)  We offer temporary housing to those that qualify.\n2)  We have a 90 day program that grows from temporary housing to a long term arrangement in an apartment.\n3)  We help adults that are homeless.\n4)  We assist with necessities such as food, clothing and personal items.\n5)  We are not for the chronic homeless.\n6)  We work with other organizations that provide other services.\n7)  We have a 3 strikes policy with our clients.\n8)  We offer peer counseling which encourages wise spending habits, job search skills, and a more structured lifestyle.\n9)  We require our clients that are out of work to spend time applying for jobs and volunteering.\n\n10) We are a Christian Organization that strives to reflect God in all that we do and say."
  },
  {
    "addressLine1": "401 Delaware Avenue, 3rd Floor",
    "city": "Palmerton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18071",
    "name": "Carbon Carbon County Area on Aging",
    "organization": "Carbon Carbon County Area on Aging",
    "phone": "(610) 824-7830",
    "website": "https://www.facebook.com/CarbonCountyAAA/",
    "description": ""
  },
  {
    "addressLine1": "50 S Clinton Ave, Suite 5400",
    "city": "East Orange",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "07018",
    "name": "Essex County Citizen Service - Emergency Assistance",
    "organization": "Essex County Citizen Service - Emergency Assistance",
    "phone": "(973) 395-8400",
    "website": "",
    "description": "This Division serves as the County's anti-poverty agency and provides a number of valuable emergency assistance and social services to individuals facing crisis situations.\n\nThis Division:\nOffers Emergency and Home Energy Assistance (NJ Shares)\nPromotes Homelessness Prevention\nOffers Basic Social Services\nOffers Tenant Counseling\nProvides Advocacy to Essex County Residents\n\nBusiness Hours\nMon - Fri 9:00am - 3:00pm\n\n"
  },
  {
    "addressLine1": "98 Carroll Street",
    "city": "Trenton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "08609",
    "name": "Rescue Mission of Trenton - Trenton Rescue Mission",
    "organization": "Rescue Mission of Trenton - Trenton Rescue Mission",
    "phone": "(609) 695-1436",
    "website": "http://www.rescuemissionoftrenton.org/",
    "description": "The Rescue Mission of Trenton provides the only Emergency Shelter in Mercer County, New Jersey, licensed by the Department of Community Affairs (DCA), serving single men and women. While a homeless client is in the shelter, staff members work to link the person to community programs that will address the pressing needs and issues contributing to their homelessness.\n\nThe Emergency Services Program can house 54 men and 23 women nightly for a total of 77 individuals. During the winter emergency period (approximately November 15th to April 15th), the bed capacity more than doubles to 135 men and 29 women nightly for a total of 164 individuals. Clients receive breakfast, dinner, snacks, clothing, winter coats, and personal hygiene necessities.\n\n\nUnder the Emergency Services Program, the Rescue Mission also operates a weekend soup kitchen. Additional services in this area include free clothing and furniture to homeless clients or those referred by other social service programs.\n\nOther Services Provides:\nAddiction Services - Rehab for substance abuse addiction. Location called: Vince's Place. Provides residential addiction treatment to homeless, indigent clients and those with specific legal issues. A full array of services are offered including group and individual counseling, medical supervision, educational and vocational assistance, meals and transportation.\n\nLong-term: a 180-day residential addiction treatment program.\n\nPermanent Supportive Housing\nThe Mission's specialized programs are designed to meet the community's needs while helping each individual client reclaim and rebuild his life.\n\nRobinson Place is permanent supportive housing for single men who receive supportive services to assist them in maintaining independent living, licensed by the State of New Jersey, Department of Community Affairs (DCA).\n\nOutpatient Clinic\nThe Outpatient Clinic is a small but growing program, providing standard outpatient substance abuse treatment, licensed by the Department of Addiction Services (DAS).\n\nAnyone seeking outpatient substance abuse treatment is welcome. Services are provided to men and women from all walks of life and are based on an affordable sliding fee scale."
  },
  {
    "addressLine1": "520 Martin Luther King Boulevard",
    "city": "Trenton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "08618",
    "name": "Amani House - Shelter for Men",
    "organization": "Amani House - Shelter for Men",
    "phone": "(609) 393-3168",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "13 Depot Street",
    "city": "Lewistown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17044",
    "name": "Shelter Service of Mifflin and Juniata Co.",
    "organization": "Shelter Service of Mifflin and Juniata Co.",
    "phone": "(717) 248-0102",
    "website": "https://www.facebook.com/shelterservicemifflinjuniatacounty/about/?ref=page_internal",
    "description": ""
  },
  {
    "addressLine1": "20 North Wayne Street, Courthouse",
    "city": "Lewistown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17044",
    "name": "MIFFLIN Mifflin County Department of Human Services",
    "organization": "MIFFLIN Mifflin County Department of Human Services",
    "phone": "(717) 248-6733",
    "website": "",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of MIFFLIN Mifflin County Department of Human Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "232 East Main Street",
    "city": "Lock Haven",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17745",
    "name": "CLINTON Clinton County Planning Commission",
    "organization": "CLINTON Clinton County Planning Commission",
    "phone": "(570) 893-4080",
    "website": "",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of CLINTON Clinton County Planning Commission, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "900 W 3rd St",
    "city": "Williamsport",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17701",
    "name": "Transitional Living Center For Women",
    "organization": "Transitional Living Center For Women",
    "phone": "(570) 326-7220",
    "website": "https://www.facebook.com/Transitional-Living-Centers-Inc-370897806312099/",
    "description": ""
  },
  {
    "addressLine1": "324 Campbell Street",
    "city": "Williamsport",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17701",
    "name": "Saving Grace Shelter",
    "organization": "Saving Grace Shelter",
    "phone": "(570) 323-4130",
    "website": "http://www.arwwilliamsport.org/",
    "description": ""
  },
  {
    "addressLine1": "643 Elmira St",
    "city": "Williamsport",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17701",
    "name": "American Rescue Workers Men's Shelter",
    "organization": "American Rescue Workers Men's Shelter",
    "phone": "(570) 323-8401 ext 18",
    "website": "http://www.arwwilliamsport.org/",
    "description": ""
  },
  {
    "addressLine1": "635 Hepburn Street",
    "city": "Williamsport",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17701",
    "name": "Family Promise Day Center",
    "organization": "Family Promise Day Center",
    "phone": "(570) 567-7103",
    "website": "https://www.familypromiselycoming.org/",
    "description": ""
  },
  {
    "addressLine1": "416 Olive Street",
    "city": "McKeesport",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15132",
    "name": "Whale's Tale McKeesport Outreach for Homeless Youth",
    "organization": "Whale's Tale McKeesport Outreach for Homeless Youth",
    "phone": "(412) 672-8632",
    "website": "",
    "description": "Shelter and outreach for homeless youth aged 18 and younger.\n\nThis facility offers crisis counseling, life skills training, and health care screening. It is bus accessible (56C), and has both laundry and bathing facilities.\n\n12 beds. All meals provided at shelter."
  },
  {
    "addressLine1": "506 Broad Street",
    "city": "Milford",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18337",
    "name": "PIKE Pike County Administration Building",
    "organization": "PIKE Pike County Administration Building",
    "phone": "(570) 296-3439",
    "website": "https://twitter.com/pikepagov",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of PIKE Pike County Administration Building, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "31 w Main Street",
    "city": "Port Jervis",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "12771",
    "name": "Tri State Warming Station",
    "organization": "Tri State Warming Station",
    "phone": "(570) 618-1208",
    "website": "mailto:tamara.chant@gmail.com",
    "description": "Warming station during winter months.\nDecember to April, 7 days a week, 9 pm -7 am, shower and a hot meal, clean bedding, cots, towels, and donations of all kinds of clothes, and knapsack."
  },
  {
    "addressLine1": "319 S Croton Avenue",
    "city": "New Castle",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16103",
    "name": "City Rescue Mission For Men",
    "organization": "City Rescue Mission For Men",
    "phone": "(724) 652-4321",
    "website": "https://cityrescuemission.org/",
    "description": "Emergency Shelter Meals Clothing. Open 24 hours per day, 7 days per week. Provides temporary, emergency shelter for homeless men. This program provides men with food, shelter, spiritual counseling, casework, and networking.\n\nAs the City Rescue Mission is a Christian ministry, all shelter guests are required to participate in spiritual counseling as well as attend daily devotions and traditional evening Church services.\n\n\nCrossroads Emergency Shelter: Provides temporary, emergency shelter for men experiencing homelessness.  This program provides men with food, shelter, spiritual counsel, casework, and networking.\n\nMen's Recovery Program: Admittance to program is after successful evaluation as a Crossroads Shelter guest.  A structured, residential program for men with addictions or other life issues.  This program focuses on biblical discipleship and ministers for life change through Bible-based recovery.\n"
  },
  {
    "addressLine1": "1018 Rebecca Street",
    "city": "New Castle",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16101",
    "name": "City Rescue Mission Women's Ministry",
    "organization": "City Rescue Mission Women's Ministry",
    "phone": "(724) 652-4349",
    "website": "https://cityrescuemission.org/",
    "description": "Providing Temporary, Emergency Shelter for HomelessWomen and Children.\n\nProvides temporary, emergency shelter for homeless women and children. Those in need of shelter or referring agencies should contact the Covenant House staff prior to arrival.\n\n\nAs the City Rescue Mission is a Christian ministry, all shelter guests are required to participate in daily devotions, bible studies and spiritual counseling."
  },
  {
    "addressLine1": "1218 W. State Street",
    "city": "New Castle",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16101",
    "name": "The Crisis Shelter of Lawrence County",
    "organization": "The Crisis Shelter of Lawrence County",
    "phone": "(724) 652-9036",
    "website": "https://www.crisisshelter.org/",
    "description": "Temporary emergency shelter for up to 36 individuals fleeing abuse.\n\nEmergency Shelter\n\nThe agency provides temporary shelter to women and children who are in need of emergency housing as a result of abuse or threats of abuse.\n\n\nEmergency shelter is available to residents of Lawrence County as well as outside the county. Preference is given to Lawrence County residents if space is limited.\n\n\nThe facility maintains 11 bedrooms that can accommodate up to 36 individuals. Cribs and trundle beds are available as needed. The units are designed to accommodate family needs depending on size and special circumstances. There is one completely handicapped assessable unit.\n\nArrangements for male victims of domestic violence who need emergency shelter may be provided, including referrals to community resources, utilizing legal options, and counseling services.\n\nThree play areas for children are available too outside areas and one inside playroom. Childcare, supervised by part time staff, is offered to allow individuals to attend groups, meet with a counselor or case manager, or attend appointments outside the agency. Tutoring is offered on site to adults and children.\n\n\nService plans are designed to address individual needs focusing on life skills including finances, housing, education, employment, and self esteem. Counseling and groups are available on site. Referrals to community services are provided and every attempt is made to provide food, toiletries, linens and emergency clothing.\n\nIf a family needs to relocate from the area, staff will assist in making the transition.\n\nStays are funded for 30 days with extensions available depending on individual needs.\n\nEmergency shelter operates on a 24 hour basis, 7 days a week. All staff members have received 80 hours of domestic violence, sexual assault and crime victim training.\n\n\n\n\n\nFull list of Services:\n\n24 hour hotline answered by trained staff and volunteers who offer counseling and information about options and services available\n\nTemporary emergency shelter for up to 36 individuals fleeing abuse\n\n\nFour transitional housing apartments with residency for up to two years\n\nProtection From Abuse (PFA) screenings and accompaniment\n\n\nIndividual and group counseling and workshops for victims of domestic violence and sexual assault\n\n24-hour medical and legal advocacy and accompaniment\n\nSystem and individual advocacy\n\nAssistance to victims of juvenile offenders\n\nAssistance to victims of other serious crimes with emphasis on the elderly\n\nCommunity education including a speakers bureau for groups, churches, civic organizations and others\n\nPrevention education in all nine county schools\n\nTraining for professionals (social service agencies, hospital personnel, courthouse staff, and others) includes intervention practices\n\nFood pantry and personal products for shelter residents\n\n"
  },
  {
    "addressLine1": "25 West Rayen Avenue",
    "city": "Youngstown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "44503",
    "name": "YWCA Barbara Wick Transitional House",
    "organization": "YWCA Barbara Wick Transitional House",
    "phone": "(330) 746-6361",
    "website": "https://www.emeraldjennyfoundation.org/listing/ywca-barbara-wick-transitional-house/",
    "description": "Services for women and women with children. Transitional housing, permanent supportive housing. Must be Mahoning County resident.\n\nComplete description\nA  8 month program designed to meet the needs of low- or no-income homeless women, 18 years and older, with or without children.  This program provides communal  and apartment style housing (single room occupancy) with supportive services.\n\nEmergency items such as food, bus fare coupons, and personal items as needed\n\nAssistance in locating child care services, permanent housing, and health services\n\nCase management services including information and referrals to legal, substance abuse, mental health services, vocational training, and support groups\nEnrichment activities for children\nHousehold management skills training\nRelationship and parenting skills training\nAccess to Ohio Benefits Bank"
  },
  {
    "addressLine1": "238 Tod Lane",
    "city": "Youngstown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "44504",
    "name": "Beatitude House",
    "organization": "Beatitude House",
    "phone": "(330) 744-3147",
    "website": "http://www.beatitudehouse.com/",
    "description": "Serves: Women and children, homeless and formerly homeless, low income; mental health; families; low-income; domestic violence.\n\nTransitional Housing\nOur transitional housing program, A House of Blessing, provides a family with a fully-furnished apartment while mothers work on their educational goals and employment. A woman's length of stay is dependent on her needs and progress toward goals. To be eligible, a woman must be homeless according to HUD definition.\n\nPermanent Supportive Housing\nIn addition to the transitional housing program, Beatitude House also offers a permanent supportive housing program. To be eligible, a woman must be homeless with a documented disability."
  },
  {
    "addressLine1": "962 M. L. King Blvd",
    "city": "Youngstown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "44501",
    "name": "Rescue Mission of Mahoning Valley",
    "organization": "Rescue Mission of Mahoning Valley",
    "phone": "(330) 744-5485",
    "website": "https://rescuemissionmv.org/",
    "description": "Emergency Shelter Food Pantry for Community.\nA PLACE TO SLEEP\nRESCUE MISSION OF THE MAHONING VALLEY IS THE ONLY EMERGENCY SHELTER IN MAHONING COUNTY AND WE ARE BLESSED TO BE ABLE TO HELP YOU!\n\nIf you find yourself in need of a place to sleep, the best thing to do is call 330-744-5485. Men should ask to speak with Mens Services and Women and Families should ask for Family Services.\n\n\nA staff member will be able to answer your questions and let you know if there are any open beds.\n\nThe Mission provides shelter for men (Mens Services) and also has beds for families, single women, single women with children and single men with children (Family Services).\n\nThree full meals daily are offered to everyone who stays at the Mission.\n\nTransitional Program\nClients in our Transitional Program are permitted a fixed number of overnight stays at The Mission per month.\nBasic services provided include food, shelter, clothing, overnight provisions, limited social service casework, personal information entered in Homeless Management Information System (HMIS).\nFood\nTwo full meals are served daily to the public at our Emergency Shelter located at 962 Martin Luther King Jr. Blvd. in Youngstown\n    Breakfast: 6:15 a.m.-7:15 a.m.\n    Dinner: 6:00 p.m.-7:00 p.m.\nShelter\nThe Mission turns no one away who is need of a warm bed for the night. During our severe Ohio winters, The Mission has literally been a lifeline for those with nowhere to seek shelter. We provide three full meals to everyone staying at the shelter.\nIndividuals and families who stay at The Mission, whether just for a night or for longer periods, find that life there is orderly and filled with purpose. The Mission has firmly established rules and regulations concerning on-site provisions for our clients.\n\nThe Mission is a drug-, alcohol- and tobacco-free environment. Residents and Staff are subject to random testing for all three. Further, everyone staying at The Mission has a daily work assignment, with designated areas of responsibility and accountability throughout the facility. Privileges and penalties are applied without bias.\nThe Rescue Mission of Mahoning Valley  provides non-denominational chapel services and Bible studies. Residents are encouraged to learn more about Jesus Christ and His teachings on love, compassion and mercy.\nIf you are in need of emergency shelter or know of someone who is, please call 330-744-5485 and ask for a Client Advisor."
  },
  {
    "addressLine1": "1555 Belmont Ave",
    "city": "Youngstown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "44504",
    "name": "Helping Hands Ministry Day Shelter",
    "organization": "Helping Hands Ministry Day Shelter",
    "phone": "(330) 480-0810",
    "website": "https://hhmin.org/",
    "description": "Provides a homeless day shelter and food pantry. Call for more details."
  },
  {
    "addressLine1": "1630 South St",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19146",
    "name": "Bethesda Project - Philadelphia PA",
    "organization": "Bethesda Project - Philadelphia PA",
    "phone": "(215) 985-1600",
    "website": "https://www.bethesdaproject.org/",
    "description": "Bethesda Project operates 14 sites throughout Center City Philadelphia for individual adults experiencing homelessness. These sites range from emergency shelter to safe haven provisions to supportive housing to independent living spaces.\nBethesda North BroadPermanent Supportive Housing - Men & Women720-722 North Broad Street\n\nOur Brothers' PlaceRun in conjunction with the City of PhiladelphiaEmergency Shelter - Men907 Hamilton Street\nOld First Reformed Church ShelterWinter Shelter - Men151 North 4th Street\nBethesda Project at Connelly HouseRun in partnership with Project HOMEPermanent Supportive Housing - Men1212 Ludlow Street\nTrinity Memorial Church ShelterWinter Shelter - Men2212 Spruce Street\nSt. Mary's Chapel ShelterWinter Shelter - Men1831 Bainbridge Street\nBethesda BainbridgePermanent Supportive Housing - Men700 South 15th Street\n\nBethesda SprucePermanent Supportive Housing - Women1110 Spruce Street\nMy Brother's HouseSafe Haven - Men609 South 15th Street\n\nBethesda SanctuaryPermanent Supportive Housing - Men816 South 20th Street\nMary HouseIndependent Housing - Men707 South Hicks Street\nDomenic HouseIndependent Housing - Men & Women1628 - 1630 South Street\nBethesda SerenityRun in partnership with the City of Philadelphia's Office of Homeless ServicesPermanent Supportive Housing - WomenWolf Street, South Philadelphia\nThe WellRun in partnership with The Welcome Church & Trinity Memorial ChurchWinter Shelter - WomenSouth Philadelphia\n\n\n"
  },
  {
    "addressLine1": "935 N. 42nd Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19104",
    "name": "Victory Shelter Programs Inc.",
    "organization": "Victory Shelter Programs Inc.",
    "phone": "(215) 382-2938",
    "website": "http://www.victorysupportservices.com/",
    "description": "DISABLED AND HOMELESS- WE CAN HELP-\nWe help People that are homeless or living in crisis that live with severe physical or developmental disabilities that need housing and assistance with managing their care.\n\nFunctional Eligibility for the Physically Disabled:\nAge 18 and older\nSevere physical disability which is likely to continue indefinitely; resultsin substantial functional limitations in three or more major lifeactivities\nEligible for nursing facility services\nPrimary diagnosis not mental health or mental retardation unless over the age of 60.Functional Eligibility for the Developmentally Disabled:\nDevelopmentally disabled.\nDisability manifests itself before age 22\nDisability is likely to continue indefinitely; results in substantial functionallimitations in three or more major life activities Primary diagnosis not mental health or mental retardation\nApplicant meets the ICF/ORC level of care limitations in three or more major life activities\nApplicant meets the ICF/ORC level of care\nNOTE: The disability must result in substantial functional limitations in three or more of the following major life activities: mobility, communication, self-care, self-direction, capacity for independent living, and learning.Victory Shelter Programs, A 501 (c) (3) non-profit Provides:\n Well-appointed handicapped accessible residence.Services Include: quiet home like setting, Internet access, and assistance with securing services for helping you with your activities of daily living. With rates as low as $15 per night.\n\n Small private residence offering a shared housing arrangement for the physically or developmentally disabled with private and semi-private (2 bed) rooms. 18 and older.\n\nOur Ministry provides a Soup Kitchen Program. If you are 18 or older living with a physical or developmental disability, Victory can provide assistance with personal care and other related services in your home or community. Transportation services are services offered in order to enable individuals served on the waiver to gain access to waiver and other community activities and resources, specified by the plan of care/service plan.\n\nCALL TODAY TO SEE IF YOU QUALIFY Victory Support Services, Inc. 935 North 42nd Street, Philadelphia, PA 19104 FAX: 215-382-2938 Email: victoryshelter@aol.com Website: victorysupportservices.comChanging Peoples life of homelessness to a life of Victories"
  },
  {
    "addressLine1": "1360 Ridge Avenue",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19107",
    "name": "Philadelphia Emergency Shelter and Services",
    "organization": "Philadelphia Emergency Shelter and Services",
    "phone": "(215) 686-7104",
    "website": "https://www.facebook.com/PeoplesEmergencyCenter/",
    "description": "This is not a homeless shelter, This is an area homeless resource.\nMission\nThe Office of Emergency Shelter and Services (OESS) mission is to assist/prepare adults and families for self-sufficiency and independent living.OESS offers a network of shelters, boarding homes, and refers families, couples and single individuals to available housing resources. Services available to OESS clients include: Intake Services, Mental Health Services, Outreach Services, Emergency Shelter Services, Case Management Services, Adult Protective Services, State Emergency Food Distribution Program, Referrals to Housing Services, Emergency Response Services, Eviction Prevention Services, Transitional Housing Services, Shelter Plus Care, Permanent Housing Services.\n\nIntake and Social Services for MenHours: 24-Hour Receptio\nRidge Avenue Center\n1360 Ridge Avenue\n(215) 236-0909\n\nIntake and Social Services for Women, Families and Couples\nHours: Weekdays 8:00 a.m. to 4:00 p.m.\nOffice of Services to the Homeless and Adults\n141 N. Juniper Street\n(215) 686-7150/52\n\nIntake and Social Services for Women, Families and Couples\nHours: Weekends and Nights\nSalvation Army\nEliza Shirley House\n1320 Arch Street\n(215) 568-5113"
  },
  {
    "addressLine1": "302 N. 13th Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19107",
    "name": "Sunday Breakfast Rescue Mission",
    "organization": "Sunday Breakfast Rescue Mission",
    "phone": "(215) 922-6400",
    "website": "http://www.sundaybreakfast.org/",
    "description": "*Three meals served every day for men, women and children*Overnight emergency shelter for men*Long-term residential recovery program for men*Transitional housing program for women (and children) at separate location.\n\nSunday Breakfast Rescue Mission is the third oldest Rescue Mission in the country. Founded in 1878, we have reached out to the homeless in Philadelphia for more than 130 years. Originally named the Sunday Breakfast Association, our name was changed a few years ago to reflect our expanded services as a Rescue Mission.\n\n\nSunday Breakfast Rescue Mission serves the homeless through two locations in Philadelphia: a shelter in Center City and a transitional home for women in the Germantown neighborhood of Philadelphia. The Center City shelter also houses a long-term recovery program for men.The Mission does not receive government funding and relies on the generous contributions of caring individuals, families, churches and businesses. Donations are supplemented with income from two thrift stores."
  },
  {
    "addressLine1": "1221 Race St",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19107",
    "name": "Saint John's Hospice",
    "organization": "Saint John's Hospice",
    "phone": "(215) 563-7763",
    "website": "http://www.saintjohnshospice.org/",
    "description": ""
  },
  {
    "addressLine1": "1850 North Croskey Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19121",
    "name": "St Elizabeth's Recovery Residence",
    "organization": "St Elizabeth's Recovery Residence",
    "phone": "(215) 763-1820",
    "website": "https://www.projecthome.org/st-elizabeths-recovery-residence",
    "description": "Project HOME's supportive housing programs offer permanent, subsidized housing for individuals and families who had been homeless. Most residents come to Project HOME from a safe haven, a shelter or from the streets.\nSt. Elizabeths Recovery Residence is a recovery residence for men, providing 24 fully-furnished, subsidized, single-room occupancy units, 12 of which are designated for veterans. Accessible units are available. \n\nResidents are offered service coordination, personal recovery services, health care, education, social enterprise and employment opportunities. Residents are encouraged to participate in recovery-oriented activities that lead to personal growth, well-being and self-sufficiency.\n\n\nEligibilitySingle Room Occupancy (SRO) | 24 rooms (12 designated for veterans)\nDocumented Current HomelessnessDocumented diagnosis of substance abuseMust be a male over the age of 18Committed to recovery:Willingness to live a clean and sober lifestyleSubmission to random drug testsEngagement with appropriate supports (TCM services, OP/IOP programs, NA/AA, Peer Services)\n\nAmenities24-hour staffingMeals are providedFitness room\nApplication ProcessContact the Program Manager at 215-763-1820 to inquire about eligibility and openings. \n\nRent InfoSingle Room Occupancy (SRO) | 24 rooms (12 designated for veterans)\n30 percent of Income Monthly $110 meal fee (SNAP accepted)\n"
  },
  {
    "addressLine1": "715 North Broad Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19123",
    "name": "Salvation Army Red Shield Family Residence",
    "organization": "Salvation Army Red Shield Family Residence",
    "phone": "(215) 787-2887",
    "website": "http://pa.salvationarmy.org/greater-philadelphia/6533738B6ED9A47E852573A900788FDC",
    "description": "Intake: Daily, Holidays & Weekends: After 5pm\nThe Salvation Army Red Shield Family Residence is a safe and welcoming emergency housing shelter offering loving, respectful, compassionate, and non-judgmental services in order to empower residents to strive towards self-sufficiency. All family configurations including families with teenage children and single men with children are accepted. However the majority of our families are young mothers with infants.. Many of these women have aged out of the DHS system and are now entering the shelter system as homeless adults. They enter the shelter lacking basic life skills and parenting skills, having little to no actual work experience. The majority of these young mothers have self identified as victims of traumatic childhoods; physical, emotional, and sexual abuse; and neglect. In fact, seventy five percent of our residents have openly reported trauma histories.\nThe Salvation Army Red Shield Residence is a clean and sober facility. Clean and sober services are now handled jointly by the case mangers and RHD's Connections program. Current drug an alcohol use seems to reflect that of the general population. Programs, such as Drexel's Caring Together, combining drug and alcohol treatment with mental heath treatment, seem to be most effective with this population.\n\nCentralized IntakeThe City of Philadelphia provides emergency and temporary housing to persons experiencing homelessness. Homeless Services administers contracts with various human service organizations to provide short-term emergency housing accommodations, based on an assessment of need, to resolve an immediate housing crisis for persons and families. Case management assistance is also provided to assist households with obtaining appropriate long-term housing. Emergency housing services include:\n\n    Temporary shelter\n    Ongoing case management services\n    Assistance with obtaining transitional and/or permanent housing\n    Supportive housing for special populations\n    An optional savings program which allows households to save a part of their income for future housing expenses\n    Philadelphia Homeless Outreach Hotline 215-232-1984\n\nCentralized Homeless Intake Services\n\nCentralized Homeless Intake Services includes an assessment of eligibility and service needs of persons and families presenting for placement into emergency housing.  If eligible, persons and families are placed in appropriate emergency housing, boarding homes, or other alternative housing.  Mental health assessments and referrals to drug/alcohol treatment, health services, children and youth services, legal services and veterans services, etc., are provided as needed.\n\nIf you are currently experiencing homelessness, please report to one of the central intake centers listed. You must go through central intake for an initial assessment of your housing needs before placement into the homeless housing system.\n\nAfter 5 PM Daily, Weekends and Holidays\n\n    Families: Salvation Army Red Shield Family Residence, 715 N. Broad Street\n\n\n\n\n"
  },
  {
    "addressLine1": "907 Hamilton Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19123",
    "name": "Bethesda Project's Our Brothers' Place",
    "organization": "Bethesda Project's Our Brothers' Place",
    "phone": "215-985-1600",
    "website": "https://www.bethesdaproject.org/",
    "description": "Men's Day Shelter. 8am - 8pm. 7 days a week.\nMeals, showers, clothes, counseling assistance.\nDoctor provided on Tuesdays, Thursdays and Thursday nights.\nBack on My Feet members are individuals currently experiencing homelessness or at risk of becoming homeless. To join the program, members must be referred by one of our facility or referral partners. Members range in age from 18 to over 65. 35% of our members are veterans. 53% are African American, 31% Caucasian and 14% Hispanic. Some members have a college education, while others are working on their GED. Most of our members have families over 60% have children and we watch, time and time again, as Back on My Feet reunites them around something positive.\n\nBack on My Feet looks beyond backgrounds and focuses on our shared human experiencesthe innate desire to feel recognized and supported, the need for goals and a way to accomplish them. No matter our circumstances, Back on My Feet shows that something as seemingly simple as running can strengthen individuals, build communities and transform lives.\n\nBack on My Feet recruits members at homeless and residential facilities around the country and begins with a commitment to run three days a week in the early morning. After 30 days in the program, members with 90% attendance earn the opportunity to move into the second phase of the program called Next Steps, which provides educational support, job training programs, employment partnership referrals and housing resources. Over 80% of individuals who start our program move into the Next Steps phase.\nIn Next Steps, members work with BoMF program staff to develop a personal road map to independence. Each member attends financial literacy classes and job skills training provided through partnerships with our corporate partners. Members can earn financial assistance to remove barriers to employment and housing such as work supplies, transportation and security deposits. Members who achieve employment and housing become Alumni Members. Within six months of becoming a Back on My Feet Alumnus, 90% of members maintain their employment, 60% receive a wage increase and 20% achieve a promotion."
  },
  {
    "addressLine1": "3902 Spring Garden Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19104",
    "name": "People's Emergency Center For Women And Children",
    "organization": "People's Emergency Center For Women And Children",
    "phone": "(267) 777-5867",
    "website": "https://www.pec-cares.org/",
    "description": "Shelter for women and children.\n\nAll of our residents come to us through the referral process of the City of Philadelphia Office of Homeless Services.\nPEC emergency and transitional housing offers families and youth a safe, secure place to live while searching for permanent or permanent supportive housing.  All households receive assessments, case management, and access to on-site counseling, employment services and other programs.  PEC manages its own permanent housing, including both affordable and supportive housing rentals.  We are also dedicated to building mixed income rentals and homeownership projects as part of our neighborhood's strategic plan.\nThe Households We Serve\nFamilies and youth experiencing homelessness turn to PEC in order to secure housing and the income and resources to support it.  Often they have experienced ongoing trauma throughout their lives - child abuse and neglect, domestic violence, community violence, and the cycle of inter-generational poverty.  They lack stability in housing, education and social connections, as well as basic necessities.  They may also come to us with recent trauma, legal issues, security complications and medical issues in addition to housing instability and financial insecurity.\n\nPeople's Emergency Center (PEC) is located in West Philadelphia. PEC's mission is to nurture families, strengthen neighborhoods and drive change.  For families, children, and youth experiencing homelessness, PEC offers more than 235 affordable housing units, job training, parenting and early childhood education, financial education and planning, life skills and technology classes. PEC seeks to change the life trajectory for the families who seek its services and inspire them to achieve housing security and financial stability.\n"
  },
  {
    "addressLine1": "111 N. 49 Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19139",
    "name": "Traveler's Aid Society - Families Forward Philadelphia",
    "organization": "Traveler's Aid Society - Families Forward Philadelphia",
    "phone": "(215) 240-4800",
    "website": "http://familiesforwardphilly.org/",
    "description": "For the new homeless in Philadelphia. Less than 3 weeks in Philadelphia and homeless."
  },
  {
    "addressLine1": "1320 Arch St",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19107",
    "name": "Eliza Shirley House - Shelter For Women",
    "organization": "Eliza Shirley House - Shelter For Women",
    "phone": "(215) 568-5111",
    "website": "",
    "description": "Salvation Army shelter for women and women with children only. Open 24 hours a day."
  },
  {
    "addressLine1": "321 Willing's Alley",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19106",
    "name": "Old St Joe's Homeless Outreach",
    "organization": "Old St Joe's Homeless Outreach",
    "phone": "(215) 923-2381",
    "website": "http://oldstjoseph.org/",
    "description": "Provides a homeless outreach center for those in Philadelphia. This is an outreach ministry.\n\nProgram Services and hours:\nTuesday and Thursday\n11:30 Noon Lunch\n1:30 Life Recovery\n2:30 Free Time\n5:30 Evening Meal (formerly known as Carewalk)\n\nSaturday\n11:30 Noon Lunch\n1:30 Spirituality\n"
  },
  {
    "addressLine1": "334 S. 13th St",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19107",
    "name": "Mercy Hospice For Women and Children",
    "organization": "Mercy Hospice For Women and Children",
    "phone": "(215) 545-5153",
    "website": "http://www.mercyhospicephilly.org/",
    "description": "HOURS\n7 days a week, 24 hours a day\n\n\nResidential Support for Women\nA 48 bed residence for single women and mothers with young children who are in recovery. In addition to shelter, residents receive three meals a day, and have access to secure mail service. With the goal of continued recovery and transition to more independent living situations, the women meet weekly with skilled case managers to identify and address the root causes of their homelessness. Residents are referred to appropriate off-site treatment programs and support groups, while receiving on-site life skills classes, parenting support and they attend drug and alcohol classes.\n\nDay Services for Women\nA nutritious and hot noon meal is provided, on average, for 50 to 70 day clients each weekday. Day clients are not residents. They are the homeless community currently residing on the street. These women are also offered case management services, as well as the opportunity to use a restroom, take a shower, obtain new clothing, and use the telephone.\n"
  },
  {
    "addressLine1": "1430 Cherry St",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19107",
    "name": "Appletree Family Shelter - Women Centralized Homeless Intake Services",
    "organization": "Appletree Family Shelter - Women Centralized Homeless Intake Services",
    "phone": "(215) 686-7150",
    "website": "http://philadelphiaofficeofhomelessservices.org/find-a-place-to-stay/emergency-housing/",
    "description": ""
  },
  {
    "addressLine1": "1526 Fairmont Ave",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19130",
    "name": "Youth Emergency Services",
    "organization": "Youth Emergency Services",
    "phone": "(215) 787-0633",
    "website": "https://twitter.com/ysiphilly",
    "description": "This is a shelter for adolescents."
  },
  {
    "addressLine1": "111 N. 49th Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19139",
    "name": "Families Forward Philadelphia (formerly Travelers Aid Family Services of Phila)",
    "organization": "Families Forward Philadelphia (formerly Travelers Aid Family Services of Phila)",
    "phone": "(215) 240-4828",
    "website": "http://www.familiesforwardphilly.org/",
    "description": "Our emergency shelter for homeless families has 75 separate, private rooms for each family. It offers a warm, safe environment, nutritious food, and high quality childcare. All families are referred to our shelter through the City of Philadelphia's Office of Supportive Housing."
  },
  {
    "addressLine1": "4108 Baltimore Ave",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19104",
    "name": "Philadelphia Veterans House",
    "organization": "Philadelphia Veterans House",
    "phone": "(267) 292-2052",
    "website": "http://philadelphiaveteranshouse.org/",
    "description": "Philadelphia Veterans House is a transitional shelter for homeless\nveterans while they secure permanent housing. We provide room and board,\n\nthree meals a day, case management, laundry amenities and advocacy in\npursuing education, benefits, medical coverage, and mental health goals.\n"
  },
  {
    "addressLine1": "111 N. 49th Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19139",
    "name": "Gaudenzia House of Passage",
    "organization": "Gaudenzia House of Passage",
    "phone": "(267) 713-7778",
    "website": "http://www.gaudenzia.org/",
    "description": "Evening and Weekend Intake for Women.\n\nGaudenzia House of Passage is a 100 bed facility for single women. House of passage provides supportive services including a computer lab, educational and vocational services as well as community building events.\nThe City of Philadelphia provides emergency and temporary housing to persons experiencing homelessness. Homeless Services administers contracts with various human service organizations to provide short-term emergency housing accommodations, based on an assessment of need, to resolve an immediate housing crisis for persons and families. Case management assistance is also provided to assist households with obtaining appropriate long-term housing. Emergency housing services include:\n\nTemporary shelter\nOngoing case management services\nAssistance with obtaining transitional and/or permanent housing\nSupportive housing for special populations\nAn optional savings program which allows households to save a part of their income for future housing expenses\nPhiladelphia Homeless Outreach Hotline 215-232-1984\n\nCentralized Homeless Intake Services\n\nCentralized Homeless Intake Services includes an assessment of eligibility and service needs of persons and families presenting for placement into emergency housing. If eligible, persons and families are placed in appropriate emergency housing, boarding homes, or other alternative housing. Mental health assessments and referrals to drug/alcohol treatment, health services, children and youth services, legal services and veterans services, etc., are provided as needed.\n\nIf you are currently experiencing homelessness, please report to one of the central intake centers listed. You must go through central intake for an initial assessment of your housing needs before placement into the homeless housing system.\n\nAfter 5 PM Daily, Weekends and Holidays\n\nSingle Women: House of Passage, 49th & Haverford Avenue\n\nDrug and Alcohol Treatment Services\n\n\n\nA leader in the addiction treatment and recovery services field since 1968, Gaudenzia offers programs to best serve the needs of our diverse and ever-changing client population.\n\n\n\n\n\nAdult Residential Services\n\nShort, intermediate, and long-term substance abuse and mental health services are available for adults, women with children, homeless individuals, and HIV symptomatic substance abusers.\n\n\n\nOutpatient Services\n\nTraditional counseling is provided in outpatient settings including Intensive Outpatient Programs (IOP), Partial Hospitalization, and diversified prevention programs.\n\n\n\nWomen with Children Services\n\nGaudenzia provides preferential treatment services to pregnant women and women with young children.\n\nAdolescent Services\n\nGaudenzia offers outpatient programs for teens seeking recovery from chemical dependency.\n\nMental Health Residential Services\n\nSpecialized services to treat individuals whose chemical dependency co-occurs with mental disorders.\n\nPrison Services\n\nSpecialized programs for individuals involved in the criminal justice system including services for substance abuse and co-occurring disorders.\n\n\n\nTransitional and Permanent Housing\n\nGaudenzia operates affordable, drug-free, housing to help clients stabilize their recovery following treatment.\n\n\n"
  },
  {
    "addressLine1": "802 N. Broad Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19130",
    "name": "R. Darby Center - For Single Men",
    "organization": "R. Darby Center - For Single Men",
    "phone": "(215) 685-3700",
    "website": "http://philadelphiaofficeofhomelessservices.org/find-a-place-to-stay/emergency-housing/",
    "description": "The City of Philadelphia provides emergency and temporary housing to persons experiencing homelessness. Homeless Services administers contracts with various human service organizations to provide short-term emergency housing accommodations, based on an assessment of need, to resolve an immediate housing crisis for persons and families. Case management assistance is also provided to assist households with obtaining appropriate long-term housing. Emergency housing services include:\n\n    Temporary shelter\n    Ongoing case management services\n    Assistance with obtaining transitional and/or permanent housing\n    Supportive housing for special populations\n    An optional savings program which allows households to save a part of their income for future housing expenses\n    Philadelphia Homeless Outreach Hotline 215-232-1984\n\nCentralized Homeless Intake Services\n\nCentralized Homeless Intake Services includes an assessment of eligibility and service needs of persons and families presenting for placement into emergency housing.  If eligible, persons and families are placed in appropriate emergency housing, boarding homes, or other alternative housing.  Mental health assessments and referrals to drug/alcohol treatment, health services, children and youth services, legal services and veterans services, etc., are provided as needed.\n\nIf you are currently experiencing homelessness, please report to one of the central intake centers listed. You must go through central intake for an initial assessment of your housing needs before placement into the homeless housing system.\nIntake by hours:\n\n\nMonday through Friday 7 am 5 pm\n\n    Single Men: Roosevelt Darby Center, 802 N. Broad Street\n"
  },
  {
    "addressLine1": "2601 N. Broad Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19132",
    "name": "Station House",
    "organization": "Station House",
    "phone": "(215) 225-9230",
    "website": "",
    "description": "Emergency shelter and after hour intake site providing client service case management, a computer lab, and residential services for 99 men in North Philadelphia"
  },
  {
    "addressLine1": "1307 W Susquehanna Ave",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19122",
    "name": "Susquehanna House Shelter",
    "organization": "Susquehanna House Shelter",
    "phone": "(215) 769-0500",
    "website": "http://www.selfincorp.org/",
    "description": "Emergency shelter with client service case management and residential services for 22 single women."
  },
  {
    "addressLine1": "4 South Centre Street",
    "city": "Pottsville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17901",
    "name": "My Father's House - Servants to All",
    "organization": "My Father's House - Servants to All",
    "phone": "(570) 900-1161",
    "website": "http://www.servantstoall.org/",
    "description": "INTAKE INTERVIEWS: Mon - Fri (9am to 1pm)\nMy Fathers House is a safe and caring environment that serves Schuylkill County by providing housing, material goods, and supportive services to homeless men and women striving to obtain sustainable independence.\n\nWe operate a Day Center at 4 South Centre Street in Pottsville that operates as the main hub of the program. We also operate an overnight facility at the United Presbyterian Church which provides 13 beds for men. Women guests are provided rooms in a local rooming house free of charge while they work to complete their goals with our Case Managers at the Day Center."
  },
  {
    "addressLine1": "1001 Sterigere Street Building 9",
    "city": "Norristown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19401",
    "name": "Coordinated Homeless Outreach Center (CHOC)",
    "organization": "Coordinated Homeless Outreach Center (CHOC)",
    "phone": "(610) 292-9244",
    "website": "https://www.rhd.org/choc/",
    "description": ""
  },
  {
    "addressLine1": "533 Swede Street",
    "city": "Norristown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19404",
    "name": "Salvation Army Shelter Norristown",
    "organization": "Salvation Army Shelter Norristown",
    "phone": "(610) 275-4183",
    "website": "http://pendel.salvationarmy.org/easternpa/norristown",
    "description": "The Salvation Army offers an emergency shelter for families with children under 18.\n\nOffice Hours:\nMonday-Thursday\n9:00 a.m. - 4:00 p.m.\nFriday\n9:00 a.m. - 3:00 p.m.\n\nEligibility\nOpen to any individual or family in need of shelter. Call in advance."
  },
  {
    "addressLine1": "201 Starr St",
    "city": "Phoenixville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19460",
    "name": "The House - Phoenixville Women's Outreach",
    "organization": "The House - Phoenixville Women's Outreach",
    "phone": "(484) 302-8151",
    "website": "https://phxvillewomensoutreach.org/",
    "description": "Shelter and Support for Single Women Experiencing Homelessness in Phoenixville, PA\n"
  },
  {
    "addressLine1": "104 High Street",
    "city": "Phoenixville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19460",
    "name": "Good Samaritan Services",
    "organization": "Good Samaritan Services",
    "phone": "(610) 933-9305",
    "website": "https://www.goodsamservices.org/",
    "description": "Good Samaritan Services provides a full continuum of care to individuals and families experiencing homelessness. We offer Emergency Shelters, Residential Housing, and Housing Support Services across Lancaster and Chester Counties. We serve around 400 men, women, and children every year.\n\nWe also offer many financial stability and personal development resources that holistically and effectively address the needs of participants who are enrolled at Good Sam.\n\n\nWe have locations in Phoenixville, Coatesville, Ephrata, and Lancaster City\n\n\nArthur Perry Emergency ShelterOur Arthur Perry Emergency Shelter is a eight-bed facility that welcomes men experiencing homelessness. Participants are allowed a 60-day stay. During that time, participants are offered three meals a day, clothing, toiletries, linens, and towels. Admission to the shelter begins with a comprehensive interview.\nTransitional Housing\n\nOur transitional housing program can accommodate up to fourteen men. Participants are allowed to reside in the home for up to 12 months. This longer-term residency allows the men to continue to improve their circumstances and prepare for the move into independent living situations. Participants who have completed a successful stay in the Arthur Perry Emergency Shelter may be eligible to reside in the transitional housing. Participants must be employed and/or have another source of regular monthly income. Participants who meet these requirements, complied with the house rules, demonstrated sobriety throughout their stay, and expressed a desire to continue on to independent living are welcomed into our transitional housing.\n\n\nAffordable Housing Breitegam House\nPaul and Helen Breitegam donated their 12-room home to Good Sam in January 2016. This property allows us to provide affordable housing to men who have progressed through our program. Breitegam House allows us to offer a full continuum of services to men experiencing homelessness in Chester County. With the cost of housing making it sometimes impossible for our clients to find independent housing, Breitegam House will be able to provide an affordable housing solution to many men in need."
  },
  {
    "addressLine1": "1327 W McFerran Street",
    "city": "Philadelphia",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19140",
    "name": "Transitional Housing",
    "organization": "Transitional Housing",
    "phone": "2673284350",
    "website": "http://www.thinkspeakbe.net/",
    "description": "We are a transitional, independent, and shared housing unit. We serve 18-24 homeless and aged-out youth, DV, Veterans, and student housing in our various homes."
  },
  {
    "addressLine1": "121 Chuch Street",
    "city": "Plymouth",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18651",
    "name": "McAuley House Shelter",
    "organization": "McAuley House Shelter",
    "phone": "(570) 779-2801",
    "website": "http://www.catherinemcauleycenter.org/",
    "description": ""
  },
  {
    "addressLine1": "60 Hill Street",
    "city": "Wilkes-Barre",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18702",
    "name": "The Salvation Army ARC (Adult Rehab Center)",
    "organization": "The Salvation Army ARC (Adult Rehab Center)",
    "phone": "(570) 822-4248",
    "website": "https://pa.salvationarmy.org/wilkes-barre/adult-rehabilitation-centers",
    "description": ""
  },
  {
    "addressLine1": "33 East Northampton Street",
    "city": "Wilkes-Barre",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18701",
    "name": "Gabriel Shelter For Youths",
    "organization": "Gabriel Shelter For Youths",
    "phone": "(570) 824-5766",
    "website": "",
    "description": "Gabriel Shelter is a 16 bed, coed, non-secure adolescent residential facility. The primary goal of the program is to provide a safe and stable living environment for youth while a plan is developed regarding their future living arrangements. These plans focus on the best interest of the youth and are formulated in conjunction with the youth, their family, shelter staff, their children and youth caseworker and any other significant individuals. While residing at the shelter all youth (families when applicable) are offered supportive services which include: individual, group and family counseling, life skills education, recreation, tutoring, advocacy and referral. The facility is licensed by Pa. DPW and adheres to all Pa. State Chapter 3800 regulations for adolescent residential facilities.\n\nYouth ages 12 to 18 in the custody of or active with a (contracted) Children and Youth Agency. The Program operates 24 hours a day, 365 days a year."
  },
  {
    "addressLine1": "111 N Pennsylvania Ave",
    "city": "Wilkes Barre",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18701",
    "name": "Luzerne County Office of Human Services",
    "organization": "Luzerne County Office of Human Services",
    "phone": "(570) 826-8800",
    "website": "https://www.luzernecounty.org/316/Human-Services",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of LUZERNE, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "39 East Jackson Street",
    "city": "Wilkes Barre",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18701",
    "name": "Mother Teresa Haven",
    "organization": "Mother Teresa Haven",
    "phone": "(570) 825-9948",
    "website": "https://www.dioceseofscranton.org/css/housing/emergency-shelters/",
    "description": "Mother Teresa Haven provides emergency shelter and supportive services to homeless adult males within Luzerne County. The program utilizes churches and temples throughout Luzerne County on a weekly rotating schedule to provide overnight shelter to this population. Transportation for clients to and from the designated shelter site is provided 7 days a week. Supportive services such as intake and assessment, job search and employment, referrals for transitional and permanent housing and counseling are available."
  },
  {
    "addressLine1": "256 South Hanover Street",
    "city": "Pottstown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19465",
    "name": "MAIN St Shelter",
    "organization": "MAIN St Shelter",
    "phone": "(610) 455-5333",
    "website": "http://www.ministriesatmainstreet.org/",
    "description": "Religious based ministry that provides seasonal (fall/winter) shelter. Dinner is normally nightly at 9:00 pm and breakfast at 6:30 am. Due to COVID-19 we are only providing single rooms in nearby motels for a week at a time for individuals who are working a viable plan for housing."
  },
  {
    "addressLine1": "645 N 6th St",
    "city": "Reading",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19601",
    "name": "Hope Rescue Mission",
    "organization": "Hope Rescue Mission",
    "phone": "(610) 375-4224",
    "website": "https://www.hopeforreading.org/",
    "description": "SAFE HAVEN\n\nYear round emergency shelter program that offers food, clothing and shelter for up to 85 men daily. Men are provided a single bed and lockable wardrobe in a dormitory setting. Program participants attend nightly evening chapels led by local church partners, immediately followed by dinner. Men in Safe Haven also have daily access to Wi-Fi enabled laptops, gym, laundry services, and showers.\n\nOperates daily from 4 p.m. 9 a.m.\nChapel: 5:45 p.m. 6:30 p.m.\nDinner: 6:30 p.m. 7 p.m.\nFree Time: 7 p.m. 10 p.m.\nLights Outs: 10 p.m. weekdays, 11 p.m. weekends\nVolunteer Duties: 9 a.m. 4 p.m.\n\n\nCODE BLUE\n\nCold weather emergency shelter program that operates throughout the winter months. It provides emergency shelter for an additional 80-100 men nightly. Men sleep on bunkbeds in Mission gym. They have access to meals and facilities listed under Safe Haven.\n\nOperates the same as Safe Haven, but from November through March\n\nDISCIPLESHIP\n\nTwelve-month in-house work program that gives men the opportunity to contribute to the Mission directly. Program participants reside in individual rooms on our 2nd floor. Disciples help with Mission operations, have regular work assignments, and attend prayer meetings and Bible studies.\n\nDiscipleship Work Requirements: In order to apply for this program, a man must first stay in one of our overnight relief programs for a minimum of two weeks without incident. Applicants must volunteer in a work assignment alongside current disciples for a probationary period and pass a drug screening test.\n\n\nTRANSITIONAL HOUSING\n\nThrough any one of three sub-programs (Work Transition, Back to School, Fixed Income), men accepted into our THP can receive six-month housing contracts that will allow them to save money, learn how to budget their finances, and work with our Case Management Team to assist in procuring permanent independent housing appropriate to each mans income and situation.\n\nProgram fees vary depending on the sub-program and income level of each applicant.  For more information or to apply please stop at our Welcome Center during normal business hours, Monday through Friday."
  },
  {
    "addressLine1": "430 North 2nd Street",
    "city": "Reading",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19601",
    "name": "Opportunity House Homeless Shelter",
    "organization": "Opportunity House Homeless Shelter",
    "phone": "(610) 374-4696",
    "website": "http://www.opphouse.org/",
    "description": "Homeless Shelter is provided for 40 men and 35 women and children. The length of stay is assessed on a case by case basis. Each person is assigned a case manager and together they develop a self sufficiency contract. During the course of their stay if it is determined that mental health and or drug and alcohol services are needed these services can be provided at Opportunity House through Berks Counseling Services. Assistance is provided with securing Social Security and other possible appropriate forms of financial benefits.\n\nOthers Services Provided\n\nCounseling - one on one interaction with clients to help set goals and break them down into manageable steps. Some assistance is offered with resume writing and job interviewing skills.\n\nMoney Management - all clients are required to save a portion of their income in a client savings account to allow case managers the opportunity to teach needed budgeting skills, clear old debt and prepare for independent living.\n\n\nTransportation - provided to and from medical appointments when needed Limited assistance is provided with job search.\n\nAlcohol and Drug Treatment - mental health and drug and alcohol services offered on premises\n\nLearning Center - 24 hour a day 7 day a week daycare services are offered to ensure that clients are able to work any shift\n\n\nAftercare - For those who move back into the community, continued counseling and money management services give them the ability to stay in contact with their case manager, offering assistance when it is needed so that long-term self sufficiency is encouraged."
  },
  {
    "addressLine1": "736 Upland Avenue",
    "city": "Reading",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19607",
    "name": "Mary's Shelter",
    "organization": "Mary's Shelter",
    "phone": "(610) 603-8010",
    "website": "http://www.marysshelter.org/",
    "description": "Our goal is to provide temporary housing, while assisting the young women to coordinate counseling, education and quality prenatal care. The ultimate outcome is having a healthy infant born to a healthy, well-informed mother. The resident and counselor develop a plan of action with attainable goals, focusing specifically on achieving independent living skills.\n\nTemporary housing\nIndividual and group counseling\nAssist the young women with coordinating:\n    Prenatal care\n    Formal education\n    Future housing\n    Budget counseling\nOn-site classes to help develop:\n    Parenting skills\n    Interpersonal relationship skills\n    Housekeeping skills\n\nAdmission\nMary's Shelter recognizes that the established programs might not be appropriate for all applicants. Each Applicant will be evaluated on a case-by-case basis. The case managers will make every effort to work collaboratively with community agencies to assist pregnant and parenting young women find the program(s) that will best meet the individual's needs. Referring Agencies can call to determine vacancies. Applicants should follow the following procedure.\n\nProcedure\nTelephone Interview: Call 610-603-8010\n1. Initial assessment\n2. Determine vacancies\n3. Schedule interview\n4. Make appropriate referrals\nFace-to-Face Interview\n1. Completion of application and/or admission forms\n2. Review program guidelines and expectations, so applicant can make an informed decision regarding voluntary participation in the program. (approximately 1.5 hours)"
  },
  {
    "addressLine1": "112 1/2 S 2nd St",
    "city": "Olean",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "14760",
    "name": "Genesis House of Olean Inc.",
    "organization": "Genesis House of Olean Inc.",
    "phone": "(716) 373-3354",
    "website": "http://www.genesishouseofolean.org/",
    "description": "The Genesis House is a faith based organization that welcomes and serves those in need of a home. We offer temporary shelter and nutritious meals and snacks free of charge to families and individuals. We are a homeless shelter that serves approximately 40 families per year for an average of four weeks per stay.\n\nServices\nSafe, temporary housing to the homeless (Participants)\nInformation and referrals to outside agencies\nMentoring for guests through their stays\nHelp residents to discover what brought them to Genesis House and move them towards the steps they must take to regain their independence\nTogether the residents and staff provide nutritious meals\n\nContacts and support for past residents through our Aftercare Programs after the family leaves the residence\nA volunteer physician who provides medical support for those who do not have insurance\nCase management even after residents leave Genesis House\n\nEncouragement for residents to explore the various faith resources available to them within our community\nAn advocate for doctor visits, county appointments, etc.\n100% of all participants who complete our program obtain safe affordable housing, mental health counselling, medical care, addiction assessment, children placed back in school, assistance furnishing their new home and so much more             "
  },
  {
    "addressLine1": "713 Bridge Street, Suite 10",
    "city": "Selinsgrove",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17870",
    "name": "UNION / SNYDER Union-Snyder Community Action Agency",
    "organization": "UNION / SNYDER Union-Snyder Community Action Agency",
    "phone": "(570) 374-8938",
    "website": "https://www.facebook.com/unionsnydercaa/",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of UNION / SNYDER Union-Snyder Community Action Agency, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "Sunbury Office Park Building B - 322, Second Floor",
    "city": "Sunbury",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17801",
    "name": "NORTHUMBERLAND Northumberland County Adult Services",
    "organization": "NORTHUMBERLAND Northumberland County Adult Services",
    "phone": "(570) 495-2201",
    "website": "https://www.facebook.com/NorthumberlandCountyAAA/",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of NORTHUMBERLAND Northumberland County Adult Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "406 Stoystown",
    "city": "Somerset",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15501",
    "name": "Next Step Center Inc.",
    "organization": "Next Step Center Inc.",
    "phone": "(814) 444-8588",
    "website": "http://www.nextstepcenter.org/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 67",
    "city": "Tarentum",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15084",
    "name": "Alle Kiski Area Hope Center For Domestic Violence",
    "organization": "Alle Kiski Area Hope Center For Domestic Violence",
    "phone": "(724) 224-1100",
    "website": "http://www.akhopecenter.org/",
    "description": "Services provided at this domestic violence shelter:\n\nEmergency 30 Day Shelter - providing safety to victims fleeing violence in their homes.\n\nIndividual Counseling in our outreach offices.\n\nLegal Advocacy - accompaniment and advocacy during Protection From Abuse hearings in Westmoreland and Allegheny Counties, as well as during criminal proceedings at the District Justice level.\n\nEmergency Transportation to court proceedings.\n\nSystems Advocacy - working with the justice, mental health and other systems to advocate for victims.\n\nSupport Groups - providing a safe place for victims to discuss and be educated on domestic violence.\n\n\nInformation and Referral - providing other options."
  },
  {
    "addressLine1": "220 Main Street, Unit One",
    "city": "Towanda",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "18848",
    "name": "BRADFORD Bradford County Human Services",
    "organization": "BRADFORD Bradford County Human Services",
    "phone": "(570) 265-1760",
    "website": "https://bradfordcountypa.org/department/human-services-administrator/",
    "description": ""
  },
  {
    "addressLine1": "380 S. Main St.",
    "city": "Elmira",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "14901",
    "name": "Second Place East Homeless Shelter",
    "organization": "Second Place East Homeless Shelter",
    "phone": "(607) 734-4898",
    "website": "https://cs-cc.org/programs-services/emergency-shelter/",
    "description": "Hours: Monday Friday: 8:30am 4:30pm (closed for lunch from noon 1pm)Location: Second Place East Homeless Services, 380 S. Main St. Elmira, NY 14904Contact: 607.734.4898\n\nEmergency Shelter after 4:30 PM: 607.732.5954"
  },
  {
    "addressLine1": "226 East Fayette Street",
    "city": "Uniontown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15401",
    "name": "City Mission Men's Shelter",
    "organization": "City Mission Men's Shelter",
    "phone": "(412) 439-1355",
    "website": "https://citymissionfayette.org/",
    "description": ""
  },
  {
    "addressLine1": "217 Lenox Street",
    "city": "Uniontown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15401",
    "name": "City Mission's Women's Shelter",
    "organization": "City Mission's Women's Shelter",
    "phone": "(724) 439-0485",
    "website": "https://citymissionfayette.org/",
    "description": ""
  },
  {
    "addressLine1": "1110 University Ave",
    "city": "Morgantown",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "26505",
    "name": "Bartlett House",
    "organization": "Bartlett House",
    "phone": "(304) 292-0101",
    "website": "http://www.bartletthouse.org/",
    "description": "Provides for emergency food, shelter and medical referrals first, then one-to-one comprehensive case management to break the cycle of homelessness.\n\nBartlett House is providing our Programs and Eligibility Reference Sheet:\n\n1. The emergency shelter located on University Avenue.\n2. Nitor Transitional Housing Suites located at West Run.\n\n3. Nitor Permanent Supportive Housing Aparments located at West Run.\n4. Nitor Affordable Housing Apartments located at West Run.\n5. Rapid Rehousing program\n\nHomeless clients of the Resident Shelter Program receive comprehensive case management and set up a Service Plan with an individual case manager to address pertinent issues of joblessness, parenting, domestic violence, health, low income housing, financial dependency and other impediments to independent living.\n\nWe frequently assist people in connecting them with resources to obtain Supplemental Security Income, Temporary Assistance to Individuals and Families (TANF), Food Stamps, Emergency Assistance, Veterans Benefits, Job Training, Vocational Rehabilitation, Alcohol and Drug Abuse Treatment, Marriage and Family Counseling, HUD Subsidized Housing, Clothing and Transportation. Clients in the Resident Shelter Program are required to save 80% of their income, seek employment (if able) or apply for benefits and remain drug and alcohol free. The goal of the Resident Shelter Program is to provide transitional housing (up to 6 months) for clients experiencing difficulties while promoting self-sufficiency."
  },
  {
    "addressLine1": "20 S 69th St 4th floor",
    "city": "Upper Darby",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19082",
    "name": "Delaware County DHS",
    "organization": "Delaware County DHS",
    "phone": "(610) 713-2365",
    "website": "http://www.delcohsa.org/about.html",
    "description": ""
  },
  {
    "addressLine1": "7200 Chestnut Street",
    "city": "Upper Darby",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19082",
    "name": "Connect BY Night Homeless (CBN)",
    "organization": "Connect BY Night Homeless (CBN)",
    "phone": "(267) 507-3875",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "6310 Market Street",
    "city": "Upper Darby",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "19082",
    "name": "Life Center of Eastern Delaware County",
    "organization": "Life Center of Eastern Delaware County",
    "phone": "(610) 734-5770",
    "website": "https://www.instagram.com/explore/locations/43975040/life-center-of-eastern-delaware-county",
    "description": "50 bed facility based shelter for single adult men and women.\n\nThe Life Center houses 50 individuals at any given time and serves over 160 residents per year.\n\n\nAll guests must complete and intake screening. If there are no beds available, you will be placed on a waiting list. Waiting list guests should contact the Life Center every two to three days to check on the status.\n\nEvening meal program (open to the public):  Daily from 6:30 p.m. to 8:00 p.m.\n\n\nA community shower program is also available every Monday, Wednesday, and Friday from 10 am to 2 pm. Shelter residents receive multiple services, including:\nAids Coalition: testing and counseling every first and third Mondays from 6 - 8 pm\nA.A Meetings: Thursdays 4-6 pm & Saturdays 12 - 1:30 pm\nN.A. Meetings: Sundays 10:30 to 12:30 pm\nLife Skills classes on Tuesdays from 2-3:30 each week.\n"
  },
  {
    "addressLine1": "1880 Princeton Avenue",
    "city": "Lawrenceville",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "08648",
    "name": "Home Front Family Campus",
    "organization": "Home Front Family Campus",
    "phone": "(609) 989-9417",
    "website": "https://www.homefrontnj.org/family-campus/",
    "description": ""
  },
  {
    "addressLine1": "601 N Clinton Ave",
    "city": "Trenton",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "08638",
    "name": "Cold Weather Oveflow Shelter",
    "organization": "Cold Weather Oveflow Shelter",
    "phone": "(609) 393-8009",
    "website": "",
    "description": "The Center provides sleeping shelter during cold weather months to area homeless individuals who come as overflow from the Trenton Rescue Mission.\n\nReport to Rescue Mission first, will refer to East Trenton Center when Rescue Mission is full.\n\nBusiness Hours: Mon - Fri 11:00pm - 7:00pm\n"
  },
  {
    "addressLine1": "1209 Pennsylvania Ave W",
    "city": "Warren",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16365",
    "name": "Warren Economic Opportunity Council",
    "organization": "Warren Economic Opportunity Council",
    "phone": "(814) 726-2400",
    "website": "https://www.wfeoc.org/",
    "description": "The Warren-Forest Counties EOC Housing Department provides facilities and services to meet the needs of homeless individuals through emergency, transitional, and permanent housing programs as well as housing assistance options. Facilities and services are made available for individuals and families who are currently homeless or facing homelessness. We have highly trained case managers and partner with multiple community agencies to ensure that clients have access to all the services and resources available to them. Our goal is to assist client in obtaining a permanent, affordable, and safe housing solution that meets the needs of the family."
  },
  {
    "addressLine1": "16 w 6th street",
    "city": "Jamestown ",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "14701",
    "name": "Safe House of Chautauqua County",
    "organization": "Safe House of Chautauqua County",
    "phone": "(866) 877-9647",
    "website": "http://www.chautauquaopportunities.com/",
    "description": "24 hours a day, 365 days a year - Call 1-866-877-9647\n\n12-17 years old for the Safe House and 16-21 for the Transitional Independent Living Program.\n\n\nRunaway and Homeless Youth Shelter; emergency school services and Transitional apartments in various programs. Provides basic needs, advocacy, mediation, as well as community service opportunities, asset development and leadership opportunities."
  },
  {
    "addressLine1": "19 S. Washington Street, Ft. Jackson Bldg. 3rd Floor",
    "city": "Waynesburg",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "15370",
    "name": "GREENE Greene County Human Services",
    "organization": "GREENE Greene County Human Services",
    "phone": "(724) 852-5276",
    "website": "https://www.co.greene.pa.us/department-human-services",
    "description": ""
  },
  {
    "addressLine1": "118 Main Street",
    "city": "Wellsboro",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "16901",
    "name": "Tioga County Human Services",
    "organization": "Tioga County Human Services",
    "phone": "(570) 723-8191",
    "website": "http://www.tiogacountypa.us/humans_services/pages/humanservices.aspx",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of Tioga County Human Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "363 W. Market St.",
    "city": "York",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17405",
    "name": "Men's Shelter - LifePath Christian Ministries",
    "organization": "Men's Shelter - LifePath Christian Ministries",
    "phone": "(717) 845-7662",
    "website": "https://lifepathyork.org/",
    "description": "LifePath Christian Ministries aims to love, honor, and serve every person who walks through our doors. The ultimate goal is transformation from the inside out. We start by meeting their immediate needs for food, shelter, clothing, and/or medical care, and then encourage guests to take in our life-changing programs and services.\n\n \nMens' Services\n\nColes drug addiction was out of control. When he lost his job, he hit rock bottom.\n\n\"I was living on the streets, and I literally gave up on life,\" he says. \"I didnt want to end up like that. You dont grow up thinking youre going to be homeless by the age of 30. Its not something you aspire to be. So I wanted to find a way to get back on track.\"\n\n\nThanks to the support of friends like you, Cole is now \"back on track.\"\n\nOur mens services include:\n\n    a shelter offering meals, beds, clothing, chapel, and supportive guidance. Medical and mental health services are also available.\n    classes for those who want to improve themselves and be engaged in their own transformation. These classes may include life skills, job preparation, Bible study and more.\n\n\nIt adds up to a holistic approach aiming for spiritual, emotional, vocational, and physical health, with the ultimate goal of equipping men to flourish personally and in the community."
  },
  {
    "addressLine1": "100 West Market Street, Suite 401",
    "city": "York",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17401",
    "name": "YORK Department of Human Services",
    "organization": "YORK Department of Human Services",
    "phone": "(717) 771-9347",
    "website": "https://twitter.com/yorkcountypa",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of YORK Department of Human Services, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "17 Jefferson Avenue",
    "city": "York",
    "state": "Pennsylvania",
    "stateAbbreviation": "PA",
    "postal": "17405",
    "name": "LifePath Christian Ministries Single Women and Children's Shelter",
    "organization": "LifePath Christian Ministries Single Women and Children's Shelter",
    "phone": "(717) 845-5947",
    "website": "https://lifepathyork.org/single-women-childrens-shelter/",
    "description": "Our primary goal is to shelter, feed, and clothe women and children. We also provide strong programs designed to help women grow spiritually, develop life skills, and more . Everything they need to flourish personally and in the community."
  }
]