[
  {
    "addressLine1": "405 East Heron",
    "city": "Aberdeen",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98520",
    "name": "Union Gospel Mission of Grays Harbor",
    "organization": "Union Gospel Mission of Grays Harbor",
    "phone": "(360) 533-1064",
    "website": "http://ugmgraysharbor.org/",
    "description": "Emergency Shelter for men and for women/children.\n\nMen's shelter: At the Heron Street Facility at 405 East Heron in Aberdeen, more than 35 men each night can receive shelter, a shower and clean clothing, as well as a staff member to talk or pray with them.\n\nFriendship House provides hope and help for the Grays Harbor's rapidly growing number of homeless single women and mothers with children."
  },
  {
    "addressLine1": "111 E. 4th Street",
    "city": "Aberdeen",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98520",
    "name": "Grays Harbor Youth Center",
    "organization": "Grays Harbor Youth Center",
    "phone": "(360) 589-3259",
    "website": "http://www.ccsww.org/",
    "description": "The Grays Harbor Youth Center is a DSHS-licensed emergency overnight youth shelter. The Youth Center is a nationally registered SafePlace, and a great resource for any youth that needs time to cool-off away from family, has been kicked-out, or just needs a place to spend the night away from home. We can house up to six youth overnight in our fully furnished, themed bedrooms, and provide dinner, snacks, breakfast, and sack lunches to anyone staying overnight. The Youth Center also provides laundry service, shower facilities, and any other services they might need. Case management is provided to teens that spend the night to make sure they have access to all their resources. In addition, youth receive educational support and access to medical and dental care, mental health services, and other services aimed at assisting them in long-term stabilization."
  },
  {
    "addressLine1": "211 East Wishkah",
    "city": "Aberdeen",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98550",
    "name": "Faithhouse Ministries",
    "organization": "Faithhouse Ministries",
    "phone": "(360) 533-4802",
    "website": "https://www.facebook.com/FaithhouseMinistries/",
    "description": "Faith House is a christian faith based ministry that offers a 1 year in house commitment christ centered experience that is guaranteed to help those with a desire for change and new direction in their lives."
  },
  {
    "addressLine1": "807 W 1st St",
    "city": "Aberdeen",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98520",
    "name": "Esther Women's Shelter",
    "organization": "Esther Women's Shelter",
    "phone": "(360) 581-7826",
    "website": "http://www.savingthenations.org/",
    "description": "This is a life changing experience for any woman that is been struggling,discouraged and needs a new start in their life. If you are ready to change your life then give us a call or just walk-in. We believe in the power of the word of God and Know that God will change the life of anyone that is willing and ready."
  },
  {
    "addressLine1": "71 Sargison Loop",
    "city": "Shelton",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98584",
    "name": "Crossroads Housing",
    "organization": "Crossroads Housing",
    "phone": "(360) 427-6919",
    "website": "http://www.crossroads-housing.net/",
    "description": "Emergency family homeless shelter where families stay for up to 90 days while working with case managers to overcome their obstacles, which is preventing them from obtaining permanent affordable housing.\n\nServices\nLow Income Apartments\nEmergency Family Shelter\nRental Assistance\n\nOur mission is to help move homeless families forward in life by helping them achieve greater self-sufficiency and stability through permanent affordable housing. We provide guidance, safe temporary housing, and comprehensive case management, as well as referrals to other agencies providing related specialized care.\nOur clients are families and individuals who are experiencing setbacks possibly due to job loss, loss of income, catastrophic medical bills, or family break-ups.\n\nOur services include housing, case management, guidance, referrals, education in life and parenting skills, employment counseling, and medical advice."
  },
  {
    "addressLine1": "212 N 1st St.",
    "city": "Shelton",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98584",
    "name": "Mason County Homeless Shelter",
    "organization": "Mason County Homeless Shelter",
    "phone": "(304) 675-1124",
    "website": "http://www.scacwv.org/mason-county-homeless-shelter",
    "description": "The Mason County Homeless Shelter is an emergency shelter for individuals and families who are homeless.  The focus is on housing.  The temporary, emergency shelter provides residents with a safe place to sleep, meals, clothing, treatment planning, assessment, transportation, basic living skills, parenting and assistance securing housing.\n \nAn individualized treatment plan is based on each resident's strengths, concerns and needs with an emphasis on housing.  Residents are linked with other supportive services including mental health and medical providers based on their needs.\n\n \nThe shelter is open 24 hours a day and in addition to residential services provides food baskets, cleaning supplies and soup kitchen services to non-residents."
  },
  {
    "addressLine1": "1011 27th St, P. O. Box 681",
    "city": "Anacortes",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98221",
    "name": "Anacortes Family Center",
    "organization": "Anacortes Family Center",
    "phone": "(360) 293-2993",
    "website": "http://www.anacortesfamily.org/",
    "description": "Our Mission is to: Provide shelter for single women and families with children who seek emergency shelter due to crisis conditions in their lives. Bring together the efforts of churches, government, civic organizations and individuals in providing emergency shelter for women and homeless families in Anacortes. Create an alliance with the area's network of social service agencies so we can assist and support our clients in finding a path to self-sufficiency and a permanent end to their homelessness."
  },
  {
    "addressLine1": "822 Burwell St",
    "city": "Bremerton",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98337",
    "name": "The Coffee Oasis - Youth Drop-In Center - Bremerton",
    "organization": "The Coffee Oasis - Youth Drop-In Center - Bremerton",
    "phone": "(360) 479-5123",
    "website": "https://thecoffeeoasis.com/",
    "description": "We are a fully licensed overnight shelter for homeless, runaway, and at risk teens, 13 - 17 years old. We assist youth in finding stable and permanent housing. Youth can access meals, hygiene, laundry, and needed resources with us."
  },
  {
    "addressLine1": "1008 S. Third Street",
    "city": "Mount Vernon",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98273",
    "name": "Friendship House",
    "organization": "Friendship House",
    "phone": "(360) 336-2135",
    "website": "http://www.skagitfriendshiphouse.org/",
    "description": "Friendship House reflects the heart of God by feeding, sheltering, clothing, and healing those in need. It provides emergency shelter for up to 90 days with case management. Residents must be clean and sober during their stay and be seeking permanent housing and employment. Our core values are compassion and hospitality. We serve meals three times daily to residents and nonresidents. We serve over 4,000 meals each month. We run two transitional houses where former Friendship House residents may be invited to stay for up to two years if they are employed and appropriate for community living."
  },
  {
    "addressLine1": "1791 NE 1st Ave",
    "city": "Oak Harbor",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98277",
    "name": "Opportunity Council",
    "organization": "Opportunity Council",
    "phone": "(360) 679-6577",
    "website": "http://www.pioneernet.net/oppco/",
    "description": ""
  },
  {
    "addressLine1": "275 SE Pioneer Way # 102",
    "city": "Oak Harbor",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98277",
    "name": "CADA - Domestic Violence Shelter and Services",
    "organization": "CADA - Domestic Violence Shelter and Services",
    "phone": "(360) 675-2232",
    "website": "http://www.cadacanhelp.org/",
    "description": "Crisis Line 360-675-CADA (2232) or 1-800-215-5669Office hours: Mon - Fri: 9:00 am - 5:00 pmOur mission is to advocate with compassion for victims of domestic and sexual abuse, educate the public about such forms of abuse, develop programs to help prevent abuse in the future, and provide leadership in the community on issues of concern to women, men and children.Available 24 hours a day for victims who are in crisis to talk to an advocate about domestic violence or sexual abuse.Crisis Intervention and SupportAdvocates work in partnership with clients to identify and address a wide variety of client needs and to provide crisis assistance, including emotional support, safety planning, shelter options, and community referrals. Advocates also provide personal support through medical exams following an incident of rape, sexual abuse, or domestic violence. Advocacy-Based CounselingAdvocates provide support and education about issues of domestic violence and sexual abuse. The primary focus is the client's safety and developing tools for empowerment and autonomy. Advocates also work with clients to identify their needs and provide them with information about and referrals to local service agencies, court and social service agencies. Advocacy based-counseling is not therapy; referrals to therapy services may be available to sexual assault survivors.Emergency ShelterIn collaboration with Island County Housing Authority, CADA operates an emergency shelter, Marjie's House, for women and children who have experienced intimate partner domestic violence. CADA participates in a nation-wide network of shelters, which provides victims multiple shelter options throughout the country.Legal Advocacy & Court SupportTrained legal advocates help victims understand their legal rights and options, assist with protective orders and police reports, and support them through the criminal justice system. CADA's legal advocates can accompany victims as they interface with law enforcement, prosecutors, and attorneys. They may also accompany victims to court hearings related to domestic violence and/or sexual assault. Legal advocates are not attorneys and cannot give legal advice. Sexual Assault Therapy ReferralLimited funding is available for therapy services for clients who are adult and/or child victims of sexual assault/abuse. These services are available to clients who are participating in our advocacy services."
  },
  {
    "addressLine1": "702 10th St Ne",
    "city": "Auburn",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98002",
    "name": "Arcadia Shelter",
    "organization": "Arcadia Shelter",
    "phone": "(253) 293-2328",
    "website": "http://nexus4kids.org/",
    "description": "Arcadia Shelter is open to young adults ages 12 - 24 years old.Our extended morning shelter is open to all overnight clients weekdays, 8:00AM to 9:00AM. Breakfast is served to all clients, and case managers are on site to help clients access services.We are closed from 10:00AM to 5:00PM.Our Drop In shelter is open week days from 6:30 - 10:00. During this time clients may have a group dinner, use shower facilities, and do laundry on Tuesdays and Thursdays. Our overnight shelter is open every day to clients 18 - 24, from 10:00PM to 8:00AM. During this time clients are given a sleeping pad, fresh bedding, and have the opportunity to sleep and relax in a safe environment.If a clients needs differ from the services outlined above, shelter staff are on hand to assist."
  },
  {
    "addressLine1": "33505 13th Ave S #D",
    "city": "Federal Way",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98093",
    "name": "Federal Way Day Center",
    "organization": "Federal Way Day Center",
    "phone": "(253) 893-7895",
    "website": "https://ccsww.org/get-help/shelter-homeless-services/federal-way-day-center/",
    "description": "The Federal Way Day Center opened in December 2016. It provides a welcoming space to adults who are homeless and vulnerably housed.  The Day Center offers showers, laundry, computers, phones, mail reception services, space for meal preparation, and access to health care and social services.  Case Management services are on-site Mondays, Wednesdays, and Fridays.  Active partnerships with Healthpoint, Mobile Medical Van, Valley Cities and Sound Mental Health provide services on a monthly basis.\n\nA new addition for 2018, the Federal Way Day Center is now serving families two nights a week.\n\nAll-Age hours: Monday Friday, 10am 3pm\n\nHygiene items, limited clothing items, and snacks are generally available to guests visiting the day center.\n\nFamily-Only hours: Tuesdays and Thursdays, 4pm 7pm\n\nFamilies are welcome to visit during these hours to use the shower, laundry and kitchen facilities.\n\nSpecial programs for youth are also provided during these times.\n\n\nThe Day Center enlists the support of volunteers. If interested, please call 253-893-7895.\n\nThe goals of the Day Center include:\n\n    To provide social and emotional connection.\n    To meet basic human needs of cleanliness.\n    To connect people to resources that will enable them to meet their full potential.\n"
  },
  {
    "addressLine1": "1200 S 336th St.",
    "city": "Federal Way",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98003",
    "name": "Multi-Service Center & Shelter",
    "organization": "Multi-Service Center & Shelter",
    "phone": "(253) 838-6810",
    "website": "https://mschelps.org/",
    "description": ""
  },
  {
    "addressLine1": "515 116th Ave NE #150",
    "city": "Bellevue",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98004",
    "name": "Congregations for the Homeless",
    "organization": "Congregations for the Homeless",
    "phone": "(425) 502-9958",
    "website": "https://www.cfhomeless.org/winter-shelter/",
    "description": "The Eastside Mens Shelter (EMS) operates year round and is an emergency overnight shelter providing men safety. Men in the shelter are provided with a hot meal and a safe place to sleep. The trained staff connect the men to necessary resources, helping them move toward security, stability, and independence.\n\nLocation: 515B 116th Ave NE (at Lincoln Center).  \n\nHours: Overnight services will be from 7:30 pm to 7:30 am. Men are allowed on site beginning at 7:00 pm.\n\nThe closest bus route is the 271 bus, which stops at 116 Ave NE and NE 2nd Pl. Walk back North, and the Center is on the left.\n\n"
  },
  {
    "addressLine1": "515B 116th Ave NE",
    "city": "Bellevue",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98004",
    "name": "Men's Eastside Winter Shelter",
    "organization": "Men's Eastside Winter Shelter",
    "phone": "(425) 296-3797",
    "website": "http://www.cfhomeless.org/winter-shelter/",
    "description": "Winter Shelter\nHours of Operation\nOvernight services will be from 7:30 pm to 7:30 am. Men are allowed on site beginning at 7:00 pm\n\nBus Route: 271 bus, which stops at 116 Ave NE and NE 2nd Pl. Walk back South, and the Center is on the left.\n\n\nEastside winter conditions endanger the lives of people in our community. Space is provided on a first-come, first-served basis, with priority going to men who spent the previous night there. The EWS is the only low-barrier shelter for men on the Eastside. The mens shelter is staffed by professional, experienced employees and volunteers managed by CFH.\n\nThe Eastside WEWS Shelter (EWS) is an emergency overnight shelter providing men safety from the cold elements. Men who visit are provided with a hot meal and a safe place to sleep. The trained staff also help connect the homeless to necessary resources, which will help them move toward security, stability, and independence.Photo.2\n\nThe EWS accommodates up to 80 people each night and is the only low-barrier shelter for men on the Eastside.\nLast season, the shelter opened on November 15, 2014 and ran through the end of April. The men's shelter is staffed by professional, experienced employees and volunteers managed by CFH. Staff are on-site between 8:00 p.m. to 8:00 a.m."
  },
  {
    "addressLine1": "3032 Bellevue Way NE",
    "city": "Bellevue",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98004",
    "name": "Sophia's Place",
    "organization": "Sophia's Place",
    "phone": "425-896-7385",
    "website": "https://sophiaway.org/",
    "description": "Offers immediate needs and services\n\nWHEN: Every day, 8:00 a.m. to 3:00 p.m.BUS ROUTE: 249\n\nFACILITIES: Showers and laundry; nourishing prepared meals (breakfast and lunch); access to computers and phones\n\n\nWe provide immediate needs and supportive services at our shelters.\n\nNight Shelter Program\nSophias Place, behind St. Lukes Lutheran Church, 3032 Bellevue Way NE Bellevue, WA 98004\nEvery night, 6:45 p.m. to 7:45 a.m.\nResource referrals and service providers including counseling, health checkups, legal assistance, resume help and job opportunities\n\nEach woman is given a cubicle her personal place where she can leave all her things securely and return to in the evenings. The cubicle is furnished with a single bed (covered by a hand-sewn quilt), a bedside table, and a cupboard and hooks to hang things, a mirror, as well as a bedside lamp.\n\n\nSERVICES: Resource referrals and service providers including counseling, health checkups, legal assistance, resume help and job opportunities"
  },
  {
    "addressLine1": "11920 Ne 80th St, Suite 100",
    "city": "Kirkland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98033",
    "name": "The New Bethlehem Day Center",
    "organization": "The New Bethlehem Day Center",
    "phone": "(425) 679-0350",
    "website": "http://www.nbpshelter.org/",
    "description": "Hours of operation: 2:00 PM - 8:00 PM, Sundays through Thursdays.\n\nThe New Bethlehem Day Center provides families (adults with children under 18) experiencing homelessness with essential services including: showers, laundry, computers, Social Services, Snack and Dinner."
  },
  {
    "addressLine1": "701 1st Street",
    "city": "Kirkland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98033",
    "name": "Eastside Emergency Shelter - The Sophia Way",
    "organization": "Eastside Emergency Shelter - The Sophia Way",
    "phone": "(425) 463-6254",
    "website": "https://sophiaway.org/",
    "description": ""
  },
  {
    "addressLine1": "620 18th Avenue East",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98112",
    "name": "Jubilee Women's Center",
    "organization": "Jubilee Women's Center",
    "phone": "(206) 324-1244",
    "website": "http://jwcenter.org/",
    "description": ""
  },
  {
    "addressLine1": "901 Rainier Ave S",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98144",
    "name": "Compass Housing Alliance’s Jan & Peter’s Place Women’s Shelter",
    "organization": "Compass Housing Alliance’s Jan & Peter’s Place Women’s Shelter",
    "phone": "(206) 474-1000",
    "website": "https://www.compasshousingalliance.org/",
    "description": "Jan & Peters Place is a 24-hour enhanced shelter program that provides on-site housing navigation support, case management services, and skill set development opportunities for 50 women. Guests are served dinner and breakfast at this program.\n\nApplication instructions: Access to Jan & Peters Place is by referral only through the Womens Referral Center, 2030 3rd Ave., which is open daily from 6pm-9 pm."
  },
  {
    "addressLine1": "1265 S. Main St.",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98144",
    "name": "Seattle Indian Center",
    "organization": "Seattle Indian Center",
    "phone": "(206) 329-8700",
    "website": "http://seattleindian.org/",
    "description": ""
  },
  {
    "addressLine1": "910 West Holly Street",
    "city": "Bellingham",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98225",
    "name": "Lighthouse Mission",
    "organization": "Lighthouse Mission",
    "phone": "(360) 733-5120 ext 0",
    "website": "http://www.thelighthousemission.org/",
    "description": "Lighthouse Mission Ministries is a privately operated, non-denominational Christian ministry that has been open 24 hours a day since 1923; it is Bellingham and Whatcom County's only walk-in crisis homeless shelter for men, women with children.\n\n\n\nServices we provide\n\nMeals\n\nShelter\n\nMedical respite\n\nMental health counseling\n\nWork and housing referrals\n\nTutoring\n\n12-step program\n\nChapel services\n\nStorage lockers, laundry, and shower passes\n\nClothing and diaper distribution\n\nWTA bus passes\n\nComputer access\n\nThe Mission's main building at the corner of Holly and F streets is the point of entry for most services.\nOpen 24 hours a day 7 days a week, needy men and women can attain the following services:\nMeals, counseling, shelter\nExtended stay housing for men\nDorm for men with mental health problems\nMedical respite (for men referred by PeaceHealth St. Joseph Medical Center)\nSpecial circumstances housing (men with children, women with teenage sons, families)\n\n"
  },
  {
    "addressLine1": "1020 N State St",
    "city": "Bellingham",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98225",
    "name": "Whatcom Housing Programs - For Youths",
    "organization": "Whatcom Housing Programs - For Youths",
    "phone": "(360) 734-9862",
    "website": "http://www.nwys.org/whatcom-housing/",
    "description": "Transitional Housing\nThe Transitional Living Program (TLP) is an independent living program for homeless single or parenting individuals, ages 18-21 and 16-17 emancipated youth. Northwest Youth Services provides homeless youth with an apartment, case management, life skills classes and supportive services.\nYou may share an apartment or house with someone of the same gender.\n\n30% of your monthly income is held in a NWYS savings account for you.\nNo drugs or alcohol are allowed in the apartment.\nYou work with a case manager to set goals and make progress towards your goals.\nYou will receive a mental health assessment, see a medical doctor, conduct a UA and engage in community services activities.\nPermanent Housing\nThe Permanent Housing Program is for homeless single or parenting individuals ages 18-24. NWYS assists homeless youth in finding an affordable place to live while providing case management and supportive services.\nYou sign your own lease.\nWe help you find a place in your price range or can find one on your own.\nYou work with a case manager to help you understand your lease and housing options.\nCan be with a roommate or by yourself.\nCan be a studio, one bedroom, two bedroom, etc. It's up to you and your budget."
  },
  {
    "addressLine1": "1020 N. State St.",
    "city": "Bellingham",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98225",
    "name": "The PAD - Northwest Youth Services For Youth Ages 13 - 17",
    "organization": "The PAD - Northwest Youth Services For Youth Ages 13 - 17",
    "phone": "(360) 734-9862",
    "website": "https://www.nwys.org/",
    "description": "The PAD is an emergency housing program providing housing for 13-17 year olds. In this program, you work with a case manager to create a plan for obtaining stable housing before you exit. This program provides shelter, food, fun activities and school enrollment services.\nYou share a room.\nNo drugs or alcohol are allowed inside.\nYou work with a case manager to set goals and make progress towards your goals.\nNO APPLICATION REQUIRED\n\nStaff are on-site 24 hours a day to talk to you and help you work on your goals."
  },
  {
    "addressLine1": "1026 N. Forest St.",
    "city": "Bellingham",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98225",
    "name": "YWCA Transitional Housing",
    "organization": "YWCA Transitional Housing",
    "phone": "(360) 734-4820",
    "website": "http://www.ywcabellingham.org/",
    "description": ""
  },
  {
    "addressLine1": "910 W Holly St Bellingham",
    "city": "Bellingham",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98225",
    "name": "LightHouse Mission Shelter",
    "organization": "LightHouse Mission Shelter",
    "phone": "(360) 733-5120",
    "website": "https://www.thelighthousemission.org/",
    "description": "24 hour a day shelter. 80 beds.\n\nThis used to be the drop in center. Now they are open 24 hours a day.\n"
  },
  {
    "addressLine1": "205 S. B C Ave. Suite 117",
    "city": "Lynden",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98264",
    "name": "New Way Ministries - Transitional Housing For Women",
    "organization": "New Way Ministries - Transitional Housing For Women",
    "phone": "(360) 354-9930",
    "website": "http://www.christianhopeassociation.org/new-way-ministries/",
    "description": ""
  },
  {
    "addressLine1": "1774 South East Vale Road",
    "city": "Port Orchard",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98366",
    "name": "Prison Mission Association",
    "organization": "Prison Mission Association",
    "phone": "(206) 876-0489",
    "website": "https://twitter.com/prisonmission",
    "description": "Family shelter"
  },
  {
    "addressLine1": "22608 Marine View Drive So., suite 100",
    "city": "Des Moines",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98198",
    "name": "Damascus Home Community Center",
    "organization": "Damascus Home Community Center",
    "phone": "(206) 651-7698",
    "website": "https://www.thedhcc.org/",
    "description": ""
  },
  {
    "addressLine1": "1229 W Smith St",
    "city": "Kent",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98032",
    "name": "ARISE Shelter Kent",
    "organization": "ARISE Shelter Kent",
    "phone": "(253) 854-0077",
    "website": "http://ccsww.org/",
    "description": "By Appointment\nCall (253) 854-0077 x5104\n\n\nLocation: CCS - Kent Family Center.\n\nMonday and Wednesday, 1:00 p.m. - 3:00 p.m. and 5:00 p.m. - 7:00 p.m.\nTuesday and Thursday 3:00 p.m. to 5:00 p.m.\n\nA dedicated CCS case manager works with each individual enrolled in the ARISE program. Shelter residents meet with the case manager to complete a needs assessment and develop individualized action plans. Based on the individual's need, men are connected to community resources such as housing, education, employment, medical and mental health services, veteran's services, chemical dependency and life skills services, such as basic budgeting and coping.\n\nWith healing and growth, an individual is better prepared to hold steady employment, successfully maintain housing and restore healthy relationships. In order to achieve this level of stability, connecting to positive community supports is encouraged. Family, community, faith-based programs, mentor ships, peer groups and cultural communities all serve as support systems for these men. Also runs the HOME program from this location.\n\n\nThe HOME program is a year-round overnight shelter for single adult men ages 18 and older.The HOME shelter directly address the issues of homelessness in South King County by providing a safe place for homeless men to sleep and receive a hot meal, as well as giving them the opportunity to stabilize and work on self-sufficiency through case management. Men who stay at the shelter are provided with case management services which focus on addressing employment goals, mental health and CD issues, Veterans services, securing permanent affordable housing and health care for each individual."
  },
  {
    "addressLine1": "1229 W Smith St",
    "city": "Kent",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98032",
    "name": "REACH OUT Homeless Winter Shelter Program",
    "organization": "REACH OUT Homeless Winter Shelter Program",
    "phone": "(253) 854-0077",
    "website": "https://ccsww.org/get-help/shelter-homeless-services/reach-out/",
    "description": "REACH OUT Homeless Winter Shelter Programs provide shelter, daily meals and case management services to homeless adults in South King County. The program is operated during the winter months and relies on partnerships with area congregations, community organizations, businesses, and public and private contributors, as well as many caring individuals and families. The programs goal is to serve those in need by providing support to assist them in achieving self-sufficiency, in turn strengthening our community. Each winter season, homeless men and women receive three meals a day and a safe, warm place to spend each night, thanks to the hard work and contributions of many.\n\nWe welcome your support in any way that you are able and willing to give: time and energy, resources, monetary donations and prayer.\n\n\nREACH OUT Mens and Womens Shelters are winter shelter programs and are open from October 1st to March 31st.\n\nIntake Location for the REACH OUT program:\nCCS-Kent Family Center\n1229 W Smith St, Kent WA\nMonday Friday, 1-2 pm\nor by appointment, call (253) 854-0077\n\nFederal Way intakes\nFederal Way Day Center\n33505 14th Place South, Suite D\nFederal Way, WA\nMonday Friday, 10 am 3 pm\n\nIntake Information: Questions contact SKC Shelter Services Catholic Community Services at (253) 854-0077.\n\nReach Out provides the following essential services during the Winter Shelter Season:\n\n\n    Each person is screened for a history of violent or predatory behavior to ensure a safe environment at the shelter\n    Overnight supervision at the host facility\n    Case management support, tailored to each individuals needs and strengths, is offered to assist in obtaining employment, housing, education, counseling, health care for medical and mental health needs\n    Housing options explored for each client with the goal of stable housing\n    Contact with Veterans Services\n    Referrals to community resources such as Department of Social and Health Services and Social Security Administration\n    Employment Assistance: job counseling, placement and referrals\n    Drug and Alcohol recovery support: education and counseling groups\n    Referrals to individual counseling"
  },
  {
    "addressLine1": "1229 W Smith St",
    "city": "Kent",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98032",
    "name": "Home Program Kent WA",
    "organization": "Home Program Kent WA",
    "phone": "(253) 854-0077",
    "website": "http://www.ccsww.org/",
    "description": "Intake Location for the HOME program:\nCCS-Kent Family Center\n1229 W Smith St, Kent WA\n\nIntake hours: Mondays through Fridays 1pm to 2pm.\n\nThe HOME program is a year-round overnight shelter for single adult men ages 18 and older. The HOME shelter directly address the issues of homelessness in South King County by providing a safe place for homeless men to sleep and receive a hot meal, as well as giving them the opportunity to stabilize and work on self-sufficiency through case management. Men who stay at the shelter are provided with case management services which focus on addressing employment goals, mental health and CD issues, Veterans services, securing permanent affordable housing and health care for each individual.\nThe HOME shelter has been in operation in South King County for 12 years.\n\nThe program has relied on the partnership and support from area churches, the city of Kent, King County, United Way of King County, and 1,440 volunteers from organizations throughout South King County. The shelter rotates monthly among 17 local churches/organizations. The volunteer support keeps men connected to the community and spreads awareness of homelessness throughout the community.\n"
  },
  {
    "addressLine1": "225 State Ave. SE",
    "city": "Olympia",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98501",
    "name": "Providence Community Care Center",
    "organization": "Providence Community Care Center",
    "phone": "(360) 915-7306",
    "website": "https://washington.providence.org/locations-directory/p/providence-community-care-center",
    "description": "Providence Community Care Center hours of operation are 10am to 2pm Monday thru Thursday.  If you are referring someone, please have them come to our office to begin the process of intake and to complete coordinated entry paperwork.  If you have questions call 360-915-7306 during business hours to speak with an Intake Specialist.  Appointments are made on site, in person.\n\nPlease note that Providence Community Care Center serves homeless childless adults. People who are staying with friends/family or who are pending release from institutions are not eligible for our services unless they have been literally (on the streets, in a car, or in a shelter) homeless in the last 30 days.\n\nProvidence Community Care Center prides itself on community partnerships, and has placement agreements with most of the shelters and transitional housing programs in the area. With an eye on finding permanent solutions for as many people as possible, Providence Community Care Center aims to maximize the efficiency of the local shelter and housing systems.\n\nShelter Placement\n"
  },
  {
    "addressLine1": "604 Devoe St. SE",
    "city": "Olympia",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98501",
    "name": "Drexel House",
    "organization": "Drexel House",
    "phone": "360-753-3340",
    "website": "https://ccsww.org/get-help/shelter-homeless-services/drexel-house/",
    "description": "To be added to the waitlist for SHELTER, please call SideWalk at (360) 515-5587\n\nTo be added to the waitlist for HOUSING, please call SideWalk at (360) 515-5587\n\nQualifications\n    18 years and older\n    Currently homeless\n    minimum of 2 positive character references\n\n\n\nPrograms\nEmergency Shelter\nDrexel House provides a 16 bed emergency shelter for men who are currently homeless in Thurston County. The Shelter program is 90 days and is free of charge. It is more than a warm bed; it is a program which includes promoting residential stability and increasing self-determination. Clients are required to meet with the Case Manager on staff once a week.  They are also required to take part in self-bettering activities, classes, meetings, and sessions as they are available.\n\nTransitional Housing\nDrexel House provides 300 square foot, furnished, studio apartments for men and women in Thurston County. The program is for men and women who are currently homeless and capable of living independently. The program is 1 to 2 years in length and costs residents 30% of their verified income. Residents are required to meet with the Case Manager on staff monthly. They are also required to take part in self-bettering activities, classes, meetings, and sessions as they are available.\n\nPermanent Housing\nThe Permanent Housing Program is for disabled men and women who have a history of being chronically homeless and are in need of a more intensive and specialized program. This program is a minimum of 1 year in length and costs residents 30% of their verified income.  Residents are required to meet with the Case Manager on staff monthly. They are also required to take part in self-bettering activities, classes, meetings, and sessions as they are available."
  },
  {
    "addressLine1": "6832 Pacific Avenue",
    "city": "Tacoma",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "00000",
    "name": "Family Renewal Shelter",
    "organization": "Family Renewal Shelter",
    "phone": "(253) 475-9010",
    "website": "http://domesticviolencehelp.org/",
    "description": "Family Renewal Shelter offers a wide variety of services, some of them quite unique:\n    National 24-hour domestic violence crisis line 1-888-550-3915\n\n    Case Management and legal referrals provided to help families with legal issues, housing, educational and employment searches, relocation and change of identity.\n    Emergency advocacy and transportation from hospitals, police stations, churches, motels and neighbors, as well as transportation for residents scheduled medical, legal and personal appointments.\n\n    On-site animal kennel allows families to not have to abandon their beloved family pets. There are also shelter pets that provide an informal 'pet therapy' that has proven very successful.\n    Donated cars in good condition and when available are given to residents who come to the shelter without transportation. This practical service increases the likelihood that a woman will be able to remain independent and violent free. Also on-site is an auto repair shop where volunteer mechanics repair residents' vehicles."
  },
  {
    "addressLine1": "202 South Franklin Ave",
    "city": "Wenatchee",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98801",
    "name": "Haven Of Hope Women's Shelter",
    "organization": "Haven Of Hope Women's Shelter",
    "phone": "(509) 664-6866",
    "website": "http://www.hospitalityhouseofwenatchee.org/",
    "description": "Women's homeless shelter"
  },
  {
    "addressLine1": "206 Palouse Street",
    "city": "Wenatchee",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98801",
    "name": "Bruce Housing Program Transitional Housing",
    "organization": "Bruce Housing Program Transitional Housing",
    "phone": "(509) 662-2485",
    "website": "http://www.wrc-ncw.org/",
    "description": "Bruce Transitional Housing\nThe Bruce Hotel in downtown Wenatchee, is home to families and individuals transitioning out of homelessness. Households are eligible for services up to 24-months, however, we start working with families right away to get them on track to exit to stable housing as soon as possible. Households must earn 30 percent or less of the Area Median Income (AMI). Residents are required to attend resident meetings, participate in self-sufficiency planning with case managers, abstain from using drugs and alcohol and perform chores. Residents are subject to drug and alcohol testing. There is a monthly program fee."
  },
  {
    "addressLine1": "1450 So. Wenatchee Avenue",
    "city": "Wenatchee",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98807",
    "name": "Wenatchee Hospitality House",
    "organization": "Wenatchee Hospitality House",
    "phone": "(509) 663-4289",
    "website": "http://www.hospitalityhouseofwenatchee.org/",
    "description": "Men's Emergency Shelter.Meals for Residents.Transportation or Vouchers."
  },
  {
    "addressLine1": "212 First St",
    "city": "Wenatchee",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98801",
    "name": "YWCA North Central Washington",
    "organization": "YWCA North Central Washington",
    "phone": "509-662-3531",
    "website": "https://www.ywcancw.org/",
    "description": "Emogene's is the YWCA's emergency homeless shelter for women. This provides a safe, secure place to live while women work towards self sufficiency through the support, education, and empowerment of women. Women can stay up to 90 days in Emogene's Emergency Shelter."
  },
  {
    "addressLine1": "1707 Stella Ave",
    "city": "Wenatchee",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98801",
    "name": "Mid-Point Place Men's Shelter",
    "organization": "Mid-Point Place Men's Shelter",
    "phone": "(509) 387-0373",
    "website": "https://www.facebook.com/Lake-Wenatchee-Info-210042849006240/posts",
    "description": "Men only shelter. Contact 6am - 10pm."
  },
  {
    "addressLine1": "221 E Martin Luther King Jr. Blvd.",
    "city": "Yakima",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98901",
    "name": "Sunrise Outreach Center",
    "organization": "Sunrise Outreach Center",
    "phone": "(509) 901-6680",
    "website": "http://www.sunriseoutreachcenter.com/",
    "description": "Transitional Hostel for families\nShelter Referral\nHomeless Prevention"
  },
  {
    "addressLine1": "204 S Naches Avenue",
    "city": "Yakima",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98901",
    "name": "Rod's House - Drop In Youth Shelter",
    "organization": "Rod's House - Drop In Youth Shelter",
    "phone": "(509) 895-2665",
    "website": "https://rodshouse.org/",
    "description": "Homeless or at risk youth ages 14-18\nA multi-service house open to homeless and underserved youth ages 14-18. Includes drop in center with showers, laundry, meals, school supplies, and clothing. A safe house where youth can obtain referrals for case management, medical, dental, mental health, legal, financial, counseling services, career development skills services and assistance with academic needs.\n\nMonday - Friday 3 - 6pm."
  },
  {
    "addressLine1": "818 West Yakima Ave",
    "city": "Yakima",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98902",
    "name": "YWCA Family Crisis Program",
    "organization": "YWCA Family Crisis Program",
    "phone": "(509) 248-7796",
    "website": "http://www.ywcayakima.org/",
    "description": "We do not have a homeless shelter we have a shelter for domestic violence victims and their children.\n\nToday, the Yakima YWCA focuses on three areas: empowering womenand girls, building self-sufficient women and eliminating familyviolence. From providing emergency shelter to a battered womanand her children, to helping a young girl discover the excitingworld of science, the Yakima YWCA provides a supportive venueto encourage women and help them grow. Underlying its eff ortsis a commitment to collaborate with other community partnersand to embrace and celebrate diversity."
  },
  {
    "addressLine1": "Department 3000 Rockefeller Ave. M/S 305",
    "city": "Everett",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98201",
    "name": "Snohomish County Human Services",
    "organization": "Snohomish County Human Services",
    "phone": "(425) 388-7416",
    "website": "https://twitter.com/snocounty/",
    "description": "Days only Families only"
  },
  {
    "addressLine1": "2929 Pine St",
    "city": "Everett",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98201",
    "name": "Cocoon House For Teens",
    "organization": "Cocoon House For Teens",
    "phone": "(425) 259-3342",
    "website": "https://www.cocoonhouse.org/",
    "description": "Cocoon House provides services to at-risk and homeless teens in Snohomish County, WA. We have two emergency shelters located in Everett and Monroe, WA; a maternity group home in Arlington and transitional living in Everett."
  },
  {
    "addressLine1": "5830 Evergreen Way",
    "city": "Everett",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98203",
    "name": "Housing Hope",
    "organization": "Housing Hope",
    "phone": "(425) 347-6556",
    "website": "http://www.housinghope.org/",
    "description": "We only serve families in Snohomish County in Washington State\n\nHomeless families come to Housing Hope at times of desperation, and shelter allows them safety and some time to regroup so that they can begin to think about their future. Housing Hope has two locations that offer emergency shelter, Windermere Crossroads Shelter in Everett and at Lervick Family Village in Stanwood where residents can stay for up to 90 days. Emergency shelter helps families cope with their immediate housing crisis. As part of our response to homelessness, residents of our emergency shelters receive wrap-around services that include intensive case management services and special assistance to make sure they have the basics to begin a household. Some families re-enter regular community housing after a brief stay. Many others move on to Housing Hope's Service Supported Homeless Housing."
  },
  {
    "addressLine1": "3711 Smith Ave",
    "city": "Everett",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98201",
    "name": "Everett Gospel Mission Men's Shelter",
    "organization": "Everett Gospel Mission Men's Shelter",
    "phone": "(425) 740-2550",
    "website": "https://egmission.org/",
    "description": ""
  },
  {
    "addressLine1": "5126 S 2nd Ave",
    "city": "Everett",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98203",
    "name": "Everett Gospel Mission Women and Children's Shelter",
    "organization": "Everett Gospel Mission Women and Children's Shelter",
    "phone": "(425) 740-2501",
    "website": "https://egmission.org/",
    "description": "We have space for up to 100 women and children. Each person in our residential program receives personalized care and is given access to nutritious meals, beds, clean clothing, spiritual support, addiction recovery, life-skills training, employment help and more."
  },
  {
    "addressLine1": "10924 Mukilteo Speedway, 230",
    "city": "Mukilteo",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98275",
    "name": "Fresh Start Housing of Washington",
    "organization": "Fresh Start Housing of Washington",
    "phone": "(206) 486-4493",
    "website": "http://www.freshstarthousingwa.org/",
    "description": "Housing and Homeless Shelter, Halfway House\nSupportive transitional housing for for men and women in various stages of life recovery from Addiction, Mental Health, Homelessness, and Jail Re-entry.\n\nWe provide transitional housing with programs to help the residents acquire the skills necessary to live independently. We also provide team-building skills to help each resident learn to work together with the other residents to maintain the home. Services may include budgeting, housekeeping, yard maintenance and minor home repairs training."
  },
  {
    "addressLine1": "PO Box 1262",
    "city": "Fall City",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98027",
    "name": "Mamma's Hands Shelter",
    "organization": "Mamma's Hands Shelter",
    "phone": "(206) 915-2073",
    "website": "https://mammashands.org/",
    "description": "Mamma's Hands House of Hope provides a 24/7 safe and compassionate living environment where mothers and children in crisis can reside. The main focus is to provide training, counseling and education to all its residents.\nServices Provided:\nGroup and individual counseling, as well as family counseling for the women and their childrenEducational, personal development and life skills training, which also include budgeting income and an assessment of their individual talentsSafe and conducive environment for teaching family values, classes of parenting and family life, as well as aid in structuring their new living situationEducational and social development to children of preschool ageNutritionally balanced mealsInstill an appreciation for and the development of constant practice of cleanliness and hygieneAfter leaving the shelter there will be follow up services to former residents to ensure their successful independent livingPlease contact the office for additional information.\n"
  },
  {
    "addressLine1": "16101 NE 87th St Suite 110",
    "city": "Redmond",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98052",
    "name": "Friends of Youth and Young Adult Shelters",
    "organization": "Friends of Youth and Young Adult Shelters",
    "phone": "(425) 449-3868",
    "website": "https://www.friendsofyouth.org/services",
    "description": ""
  },
  {
    "addressLine1": "515 3rd Ave S",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98104",
    "name": "Downtown Emergency Service Center - DESC Seatle",
    "organization": "Downtown Emergency Service Center - DESC Seatle",
    "phone": "(206) 464-1570",
    "website": "http://www.desc.org/",
    "description": "Walk in daily.\nHours: 8am to 4:45pm.\n\nFor Men: Serves men 60+ or any adult vulnerable due to mental illness, developmental disabilities, chemical dependency and/or medical condition.\nFor Women: Visit at 8am to the shelter registration desk. Assignments made at 10am. Additional slots assigned as space allows. Serves anyone that is a female.\n\n\nDESC is a non-profit organization dedicated to helping people who are most marginalized find homes, health and community. Founded in 1979 as an emergency shelter for vulnerable homeless men and women living with mental illness, substance-use disorders, and other disabilities. Today, DESC is the Puget Sound Region's most comprehensive provider of services, including housing, for chronically homeless adults. DESC's services include emergency shelter and outreach, supportive housing, mental health care, addiction treatment, crisis intervention, employment services and vocational training. At DESC, uncommon efforts produce uncommon results that help eliminate homelessness, one person at a time.\n"
  },
  {
    "addressLine1": "18403 Ballinger Way Ne",
    "city": "Lake Forest Park",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98155",
    "name": "Welcome Home Society",
    "organization": "Welcome Home Society",
    "phone": "(206) 365-1400",
    "website": "http://www.welcomehomesociety.org/",
    "description": ""
  },
  {
    "addressLine1": "1107 Broadway",
    "city": "Longview",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98632",
    "name": "Community House on Broadway",
    "organization": "Community House on Broadway",
    "phone": "(360) 425-8679",
    "website": "https://www.facebook.com/choblv/",
    "description": "homeless shelter. Food and clothing donations."
  },
  {
    "addressLine1": "62 W. Bond",
    "city": "Astoria",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97103",
    "name": "Astoria Rescue Mission",
    "organization": "Astoria Rescue Mission",
    "phone": "(503) 325-6243",
    "website": "http://www.astoriarescuemission.com/",
    "description": ""
  },
  {
    "addressLine1": "1417 South G Street",
    "city": "Tucson",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98405",
    "name": "Guadalupe House - Tacoma Catholic Worker",
    "organization": "Guadalupe House - Tacoma Catholic Worker",
    "phone": "(740) 954-0776",
    "website": "http://tacomacatholicworker.weebly.com/",
    "description": "Provides clean and sober transitional housing for single adults experiencing homelessness on an interview and invitation basis. Open house ever Tuesday night with liturgy. Also offers weekday services for the homeless.\n\nAt Guadalupe House, we provide clean and sober  transitional housing for single adults experiencing homelessness on an interview and invitation basis.\n\nGuests are provided with room and board and Catholic Workers walk with them as they pursue goals that will lead to stable housing and jobs. Donations of food and household supplies are always welcome and make our work possible.\n\nTo Apply for our transitional housing program, print and fill out our application. Once completed, please bring it by the house and we will get back to you about openings and a potential interview."
  },
  {
    "addressLine1": "19777 SR 20",
    "city": "Coupeville",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98239",
    "name": "Ryan's House For Youth",
    "organization": "Ryan's House For Youth",
    "phone": "(360) 331-4575",
    "website": "https://www.ryanshouseforyouth.org/",
    "description": ""
  },
  {
    "addressLine1": "720 W Court Street",
    "city": "Pasco",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99301",
    "name": "Benton Franklin Community Action Committee",
    "organization": "Benton Franklin Community Action Committee",
    "phone": "(509) 545-4042",
    "website": "http://www.bfcac.org/",
    "description": "Emergency Shelter, financial and emergency assistance is available.\n"
  },
  {
    "addressLine1": "112 N. 2nd Avenue",
    "city": "Pasco",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99301",
    "name": "Tri-City Union Gospel Mission",
    "organization": "Tri-City Union Gospel Mission",
    "phone": "509-380-0991",
    "website": "https://grace.kitchen/",
    "description": "Emergency Shelter.Separate shelter programs for men and for women/families."
  },
  {
    "addressLine1": "202 W. Birch St",
    "city": "Walla Walla",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99362",
    "name": "Walla Walla Rescue Mission",
    "organization": "Walla Walla Rescue Mission",
    "phone": "(509) 525-7153",
    "website": "http://www.christianaidcenter.org/",
    "description": "Also known as the Christian Aid Center.\nServices for Men\nProvides nightly shelter when needed, men's homeless services, spiritual assistance, addiction treatment, employment assistance, housing assistance. Maximum capacity: 23 men. Laundry services.\n\nCall to see if they have room and availability to assist you.\n\nFamily Services\nFamily Services currently has nine apartments which provide emergency shelter for homeless couples and families with children under the age of eighteen. In addition to our emergency shelter, Family Services has three houses which provide transitional housing for families working toward employment and educational goals who have demonstrated positive life change."
  },
  {
    "addressLine1": "2321 W. 18th",
    "city": "Port Angeles",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98363",
    "name": "Serenity House of Clallam County",
    "organization": "Serenity House of Clallam County",
    "phone": "(360) 452-7221",
    "website": "http://www.serenityhouseclallam.org/",
    "description": "Emergency Shelter Day Shelter only Transitional Housing - Family"
  },
  {
    "addressLine1": "823 Commerce Loop",
    "city": "Port Townsend",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98368",
    "name": "Olympic Community Action Programs",
    "organization": "Olympic Community Action Programs",
    "phone": "(360) 385-2571",
    "website": "https://twitter.com/olympicch",
    "description": "Advocacy"
  },
  {
    "addressLine1": "350 SE Fairmont Road",
    "city": "Pullman",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99163",
    "name": "Community Action Center",
    "organization": "Community Action Center",
    "phone": "(509) 334-9147",
    "website": "https://www.cacwhitman.org/",
    "description": ""
  },
  {
    "addressLine1": "627 N Van Buren St",
    "city": "Moscow",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "83843",
    "name": "Sojourners' Alliance",
    "organization": "Sojourners' Alliance",
    "phone": "(208) 883-3438",
    "website": "http://sojournersalliance.org/",
    "description": "Sojourners' Alliance operates a transitional housing facility for homeless men, women and families. Our program offers\nlong-term housing, supplemental food assistance, on-site case management, counseling services, and referrals to other area agencies in an effort to help our clients become self-sufficient and get back on their feet.\n\nHow to Apply\n1. Call the office at 208-883-3438 to speak with a\nstaff member for a pre-intake interview over the phone.\n2. Following this interview, staff may meet to discuss whether this program is appropriate for the potential client.\n\n3. If all requirements and criteria are met, an appointment will be made to come in for the intake with the case manager.\n\n4. At this point, policies will be reviewed with the client, all necessary paperwork will be signed, and the client will be ready to move in to the facility.\n\nIntake appointments are only scheduled on Tuesdays\nMissing a scheduled appointment results in the individual being ineligible for the program for 90 days;\ncall to cancel or reschedule if necessary"
  },
  {
    "addressLine1": "1229 West Smith St,",
    "city": "Renton",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98057",
    "name": "ARISE Shelter Renton",
    "organization": "ARISE Shelter Renton",
    "phone": "(253) 854-0077",
    "website": "https://ccsww.org/get-help/shelter-homeless-services/arise/",
    "description": "Location: St Anthony's Parish Ministry Center. Intake location for the ARISE Shelter. Tuesday and Thursday, 1:00 p.m. - 3:00 p.m.\n\nARISE Program\nA dedicated CCS case manager works with each individual enrolled in the ARISE program. Shelter residents meet with the case manager to complete a needs assessment and develop individualized action plans. Based on the individual's need, men are connected to community resources such as housing, education, employment, medical and mental health services, veteran's services, chemical dependency and life skills services, such as basic budgeting and coping.\n\nWith healing and growth, an individual is better prepared to hold steady employment, successfully maintain housing and restore healthy relationships. In order to achieve this level of stability, connecting to positive community supports is encouraged. Family, community, faith-based programs, mentor-ships, peer groups and cultural communities all serve as support systems for these.men.\n\nAlso runs the HOME program from this location.\n\nThe HOME program is a year-round overnight shelter for single adult men ages 18 and older.The HOME shelter directly address the issues of homelessness in South King County by providing a safe place for homeless men to sleep and receive a hot meal, as well as giving them the opportunity to stabilize and work on self-sufficiency through case management. Men who stay at the shelter are provided with case management services which focus on addressing employment goals, mental health and CD issues, Veterans services, securing permanent affordable housing and health care for each individual."
  },
  {
    "addressLine1": "1055 S Grady Way, Level P2",
    "city": "Renton",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98057",
    "name": "REACH Center of Hope",
    "organization": "REACH Center of Hope",
    "phone": "(425) 277-7594",
    "website": "http://www.reachrenton.org/reach-center-of-hope.html",
    "description": "The REACH Center of Hope is a day center and night shelter for homeless women and children including boys over 12. The Center of Hope partners with a number of agencies to ensure that our clients are accessing every avenue possible as they make their journey from homelessness to stability.\n\nPlease call 425 277 7594 for intake.\n\nDAY CENTER\nRenton City Hall, P2\n1055 S. Grady Way\nRenton, WA 98057\n425-277-7594\n7.30am-4pm\nMonday - Friday (except holidays)\nDAY CENTER SERVICES\n    Two hot meals (breakfast and lunch)\n    Companionship\n    Hygiene, showers and laundry services\n    Case management\n    Clothing distribution and referral\n    Housing and employment resources\n    Mail, phone services and computer access\n    Support groups\n    Resource, medical service and shelter referrals\n    Tutoring and youth and children services\n    Library\n\n\nNIGHT SHELTER\nHosted nightly at\nvarious churches\nthroughout the\nCity of Renton\n7pm-8am\nEvery day of the week (holidays included)\n\nNIGHT SHELTER SERVICES\n    A safe, warm and welcoming place to be between 7pm and 8am seven nights/week for up to 75 individuals.\n    Volunteers are on hand to answer questions and to provide assistance.\n\n    \"Lights out\" is at 10pm. Both guests and volunteers/staff sleep at the Night Shelter.\n    In the morning, children are picked up for school directly from the Night Shelter, moms go to the Day Center, and the shelter closes at 8am.\n\n"
  },
  {
    "addressLine1": "77 S Washington St",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98104",
    "name": "Compass Center - Compass Housing Alliance",
    "organization": "Compass Center - Compass Housing Alliance",
    "phone": "(206) 474-1000",
    "website": "http://www.compasshousingalliance.org/",
    "description": "The Compass Center building hosts three different emergency services programs that are all open and free to any in the community who need to connect to resources. The Compass Center building is located in Pioneer Square and is open Monday-Friday, hours vary by program type.\n\n \nCLIENT SERVICES OFFICE: The Client Services Office (CSO) provides free mail and banking services for individuals experiencing homelessness. For those who are homeless, a mailing address provides stability and the opportunity to apply for benefits, seek employment, access resources, and exercise the right to vote. One of our most basic services access to the CSO is available on a drop-in basis for all Monday-Friday, 9am-4pm.\n\n\n \n\nHYGIENE CENTER: The Compass Center Hygiene Center offers a place for those experiencing homelessness and housing instability a place to use the restroom, shower and do laundry. This program is open Monday-Friday, 7am-2pm.\n\n \n\nNAVIGATION CENTER & DAY PROGRAM: The Day Program at Compass Center provides people a place to seek refuge, meals, and basic services as well as connect with housing navigation support, case management, entitlements and other benefits, mental health counseling, and nursing services. Services are available on a drop-in basis and are free, though guests are asked to register and agree to basic behavioral guidelines. This program is open Monday-Friday, 9am-4pm."
  },
  {
    "addressLine1": "2030 3rd Ave",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98101",
    "name": "Noel House Women's Referral Center",
    "organization": "Noel House Women's Referral Center",
    "phone": "(206) 441-3210",
    "website": "http://www.ccsww.org/",
    "description": "(206)441-3210 - 24 hour phone number.\n\nNoel House Programs provides safe, comfortable shelter to a diverse community of homeless women, particularly those most vulnerable. We strive to create an environment of dignity, respect and compassion. We recognize the intrinsic value of each person and honor her unique experience.\n\nWomen's Referral Center\n(shelter placement)\nDaily 6:00 - 9:00 p.m.\n\nFor existing clients,\ncall (206) 770-0156\nafter 6:00 p.m."
  },
  {
    "addressLine1": "232 Warren Ave N.",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98109",
    "name": "Sacred Heart Shelter",
    "organization": "Sacred Heart Shelter",
    "phone": "(206) 285-7489",
    "website": "http://www.ccsww.org/",
    "description": "Shelter for families. Families (single-parent or 2-parent) with children 13 and under. (Single fathers with children OK.)\n\nThe Sacred Heart Shelter is located on lower Queen Anne and is a temporary shelter that offers a safe, home-like refuge to homeless families in Seattle. Sacred Heart functions under the premise that every person is entitled to a safe place to sleep. We believe that the transition from homeless to housed is one that takes time, effort and perseverance. Sacred Heart Shelter operates as a support network for people as they go through that process. The staff works with residents to develop goals, obtain health and dental care, job and parent training, childcare and ongoing support and assistance towards the ultimate goal of locating stable, permanent housing"
  },
  {
    "addressLine1": "1561 Alaskan Way S.",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98134",
    "name": "Saint Martin dePorres Shelter",
    "organization": "Saint Martin dePorres Shelter",
    "phone": "(206) 323-6341",
    "website": "http://www.ccsww.org/",
    "description": "Shelter for older homeless men (age 50+).\n\nWalk in daily 6:30pm. Men are bussed from Lazarus Center to shelter. ID required.\n\nSt. Martin de Porres Shelter provides safe and dignified night shelter for homeless men age 50 and older. The shelter opened in October 1984 in response to the growing need for an emergency shelter for this special population of elderly men who are vulnerable to the weather, street predators, and illness.\n\n\nWe currently operate at our full capacity of 212 men a night. The shelter is open 365 nights a year from 6:30 p.m. to 7:30 a.m. and during the day for medical convalescent care. During the winter months, we have arrangements with eight local churches to provide space for an additional 34 men a night.\n\nOur Services\nTo the best of our knowledge, St. Martins is the only night shelter that offers and targets such a multitude of services to the elderly homeless community year-round. We provide:\n    Night Shelter\n    Hot Meals\n    Clothing\n    Day Respite: 24-hour care for the ill or injured; includes transportation to and from medical appointments\n    Medical Care: a nurse is provided by Health Care for the homeless,\n    five days a week, without cost to St. Martin's\n    Restroom and Shower Facilities\n    Laundry Room\n    Library\n   \nChapel\nHousing Case Management: our case managers assist residents in securing permanent housing and offer help in dealing with community resources and governmental agencies.\nDrug and Alcohol Counseling\nCounseling from VA outreach worker\nAA Meetings (optional)\nMemorial Services: St. Martins hosts memorial services for men who have stayed at the Shelter\n"
  },
  {
    "addressLine1": "1101 Pike",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98101",
    "name": "Salvation Army Women's Shelter",
    "organization": "Salvation Army Women's Shelter",
    "phone": "(206) 442-8369",
    "website": "https://seattle.salvationarmy.org/seattle_services/womens-shelter/",
    "description": "Shelter for single women age 18+.\n The Salvation Army Womens Shelter, located in Seattle on Capitol Hill, is a low-barrier, housing-first shelter program that has been a safe haven for countless women over the past 20 years. The women we serve have been displaced for a variety of reasons - the reasons for their homeless status are as diverse as the women themselves. Our shelter provides a safe place for these women to live temporarily, and also assists them with placement into permanent housing. While in our program, the women receive other necessities, such as clothing, toiletries, food, access to laundry and showers, and ongoing support with case management and housing resources.\n\nOur goals for each of these women is to develop a sense of stability, regain a sense of self-worth, and strive toward self- sufficiency.\n\n\nWe are also working with the community and other service providers to house clients who are participating in outside programs. We are strong believers in working with the extended social service community, and attempt to coordinate with other organizations, to best serve our clients' needs.     "
  },
  {
    "addressLine1": "97 South Main St",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98194",
    "name": "Bread of Life Mission",
    "organization": "Bread of Life Mission",
    "phone": "(206) 682-3579",
    "website": "https://www.breadoflifemission.org/",
    "description": "Provides and Overnight Shelter and a Day Shelter\n\nWalk in to register. Mondays through Fridays 9:30am to 3pm. Chapel attendance required. First 2 nights free.\n\nOvernight Shelter\nEach evening, Bread of Life provides a warm and compassionate environment in which men (18+ years of age) can eat, relax, shower, and sleep. We have a total of 141 beds (72 for emergency guests, 22 for LifeChange residents, 17 for Resident Volunteers, and 2 for staff). We work in conjunction with Operation Night Watch to sleep 28 additional men in the chapel. We strive to keep a family atmosphere for the men who come through our doors.\n    Chapel 6:30-7:10 pm (Tue.-Sat.)\n    Dinner Mon.-Sat. 7:15 pm\n    Overnight bed sign-up from 5:30-6:15 pm and 8:00-8:15 pm\n        $5 fee + valid ID required, men age 18+ only\n    Doors close at 8:15 pm.\n\nDay Shelter\nBread of Life welcomes homeless men, women and children into our Day Shelter every Monday thru Friday from 9:30 a.m. to 3:00 p.m. The goal is to restore dignity, help build supportive relationships, and assist homeless individuals as they navigate their way out of homelessness.\n\nCoffee and pastries\nTelevision\nComputer use (with valid photo ID)\nMetro bus passes\nMail Services (with valid photo ID)\nLockers ($15 deposit, $20/month)\nHot lunch (Monday through Friday, 12:15-1:00 p.m.)\nWomens clothing distribution\n    (Tuesday, 1:00-2:00 p.m.)\nMens clothing distribution\n    (Friday, 1:00-2:00 p.m.)\n    Individuals must come earlier in the day to retrieve a clothing ticket.  A limited number of tickets are distributed, so it is best to show up early.\nSocial services/referrals upon request\n"
  },
  {
    "addressLine1": "318 - 2nd Avenue Extension South",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98104",
    "name": "Seattle's Union Gospel Mission - Shelter for Men",
    "organization": "Seattle's Union Gospel Mission - Shelter for Men",
    "phone": "(206) 622-5177",
    "website": "http://www.ugm.org/",
    "description": "Shelter facilities for men.\n\nEmergency meals\nWe serve men at our downtown shelter by providing 3 daily meals:\n    Breakfast: 7:30am, 8:15am and 9:00am\n    Lunch: 11:30am\n    Dinner: 5:30pm\n\nEmergency shelter\n    Showers\n    Clean clothing\n    Personal hygiene items\n    Overnight shelter\n\n"
  },
  {
    "addressLine1": "3802 South Othello Street",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98104",
    "name": "Seattle's Union Gospel Mission - Hope Place Shelter",
    "organization": "Seattle's Union Gospel Mission - Hope Place Shelter",
    "phone": "(206) 628-2008",
    "website": "http://www.ugm.org/",
    "description": "Women and Children's Shelter\n\nCall for a telephone screening. Mondays through Fridays 8:30am to 9am. Call as close to 8:30am as possible.\n\nOnly serves women or women with children who are in recovery or who have experienced domestic violence but are not being actively pursued."
  },
  {
    "addressLine1": "811 Maynard Ave. S.",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98134",
    "name": "Salvation Army William Booth Center",
    "organization": "Salvation Army William Booth Center",
    "phone": "(206) 621-0145",
    "website": "http://williamboothcenternw.salvationarmy.org/",
    "description": "Provides housing for homeless men through a variety of programs, including but not limited to Veterans, students in Fare Start (non-profit culinary school for homeless), walk-ins not accepted)\n\nEmergency Shelter\nFood & Nutrition Programs\nSeasonal Services\nTransitional Housing\n"
  },
  {
    "addressLine1": "1118 Fifth Ave.",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98101",
    "name": "YWCA YWCA Seattle | King | Snohomish Emergency Shelter",
    "organization": "YWCA YWCA Seattle | King | Snohomish Emergency Shelter",
    "phone": "(206) 461-4888",
    "website": "https://www.ywcaworks.org/",
    "description": ""
  },
  {
    "addressLine1": "314 Bell Street",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98121",
    "name": "Emergency Family Shelter",
    "organization": "Emergency Family Shelter",
    "phone": "(206) 621-8474",
    "website": "http://www.ugm.org/",
    "description": "Seattle Union Gospel Mission Emergency Family Shelter."
  },
  {
    "addressLine1": "1911 Aurora Avenue North",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98109",
    "name": "The Inn Enhanced Shelter - CCSWW Program",
    "organization": "The Inn Enhanced Shelter - CCSWW Program",
    "phone": "(206) 283-6070",
    "website": "https://ccsww.org/get-help/shelter-homeless-services/the-inn/",
    "description": "Referral only, harm reduction shelter.\nThey have housing case managers, and there is no food bank food distribution.\nAll potential guests must go through Coordinated Entry for All at 206-328-5900.\n\nIf you need additional information, please call The Inn at 206-283-6070.\nAdditional Services:\n Housing Counseling\n Personal Counseling\n Drug and Alcohol recovery support\n Computer Lab\n\n"
  },
  {
    "addressLine1": "500 4th Avenue",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98104",
    "name": "King County Men’s Winter Shelter - 500 4th Avenue",
    "organization": "King County Men’s Winter Shelter - 500 4th Avenue",
    "phone": "",
    "website": "",
    "description": "Location:  King County Administration Building 500 4th Avenue Downtown Seattle (Between Jefferson and James)\nOperator:  The Salvation Army\nCapacity:  100 men\nHours:  7:00 PM to 6:00 AM\nAccess:  Line up for the shelter in front of the loading dock garage door at the corner of 4th and Jefferson."
  },
  {
    "addressLine1": "420 4th Avenue",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98104",
    "name": "King County Men’s Winter Shelter – 420 4th Avenue (Pets Welcomed)",
    "organization": "King County Men’s Winter Shelter – 420 4th Avenue (Pets Welcomed)",
    "phone": "(206) 263-9010",
    "website": "http://www.kingcounty.gov/",
    "description": "Open Every Night In The Winter\n    Location:        420 4th Avenue, Seattle (Between Jefferson and James)\n    Operator:       The Salvation Army\n    Capacity:        50 Men\n    Hours:            7:00 PM to 6:00 AM\n    Access:           Line up for the shelter in front of the loading dock garage door at the corner of 4th and Jefferson.\n\nEmergency Shelter\nEmergency shelter is temporary housing for homeless individuals living outside or in places not meant for human habitation. In general, emergency shelters address the basic health, food, clothing and personal hygiene needs of the households and refer them to supportive services and permanent housing. Emergency shelters are indoors and may range from mats on the floor in a common space to beds in individual units.\n\nTransitional Housing\nTransitional housing is short-term or temporary housing for families needing intensive or deeper levels of support services to attain permanent housing. Length of stay in transitional housing is flexible and tailored to the unique needs of each household. Transitional housing comes in a variety of facility-types, ranging from congregate- style living to scattered site apartments.\n\nRapid Rehousing\nRapid rehousing is designed to help households to quickly exit homelessness and return to permanent housing. Core components of rapid rehousing include housing identification, rent and move-in assistance, and case management services. Rapid rehousing assistance is offered without preconditions and services are tailored to the unique needs of the household."
  },
  {
    "addressLine1": "600 4th Ave",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98104",
    "name": "Seattle City Hall Shelter",
    "organization": "Seattle City Hall Shelter",
    "phone": "",
    "website": "https://twitter.com/seattlehsd/status/1266938253849980931",
    "description": "Enter through the clear doors near Cherry St. \nIn person intake only. Line up no earlier than 7pm. Intake: 7pm-7am or until full.\n\nProvides shelter for 75 men and women, staffed by Salvation Army - William Booth Center. Men and women are sheltered in separate areas of the building, with mats and blankets.\n\nClient sleeps on mats with blankets."
  },
  {
    "addressLine1": "1830 9th Ave",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98101",
    "name": "Mary's Place Seattle",
    "organization": "Mary's Place Seattle",
    "phone": "(206) 621-8474",
    "website": "http://www.marysplaceseattle.org/",
    "description": ""
  },
  {
    "addressLine1": "1415 NE 43rd St",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98105",
    "name": "Roots Young Adult Shelter",
    "organization": "Roots Young Adult Shelter",
    "phone": "(206) 632-1635",
    "website": "http://www.rootsinfo.org/",
    "description": "ROOTS provides safe emergency overnight shelter for young adults ages 18-25.\n\nTo Access Shelter:\nPeople seeking shelter can call 206-632-1635 or come to our door between 8:00PM and 8:30PM and ask to be put on the list.\nIf more than 45 people are trying to access shelter, then a random drawing is done at 8:30PM to determine who will be turned away.  The doors open for sign-in at 9:00PM.\nID Requirements\nROOTS requires a government-issued photo ID within 5 stays OR a note from a case manager saying you are in the process of getting an ID.\nChildren\nROOTS cannot accept any person under the age of 18.\nServices Provided\n    - Safe overnight emergency shelter\n    - Clean bedding\n    - Dinner and breakfast\n    - Showers\n    - Clothing\n    - Toiletries\n    - On-site case management (Monday Thursday) and referral to other support and transitional services\n    - Supportive and nurturing relationships between staff, volunteers, and guests\n\nLocation\nThe shelter is located in the basement of the University Temple United Methodist Church at 1415 NE 43rd Street.  The entrance is in the alley at the southwest corner of the building.  Go down the alley between the church and the post office and ROOTS is the set of double blue doors on the left hand side.\n\nBus Information\nROOTS is located in the University District, which is accessible on the following Metro bus routes:\n25, 30, 31, 32, 43, 44, 48, 49, 65, 66, 67, 68, 70, 71, 72, 73, 74, 75, 76, 83, 167, 197, 271, 277, 301, 316, 372, 373, 510, 511, 540, 542, 556, 586, 810, 821, 855, 860, 871, 880, 885"
  },
  {
    "addressLine1": "154 Denny Way",
    "city": "Seattle",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98109",
    "name": "Compass Housing Alliance’s Blaine Center Men’s Shelter",
    "organization": "Compass Housing Alliance’s Blaine Center Men’s Shelter",
    "phone": "(206) 474-1000",
    "website": "https://www.compasshousingalliance.org/",
    "description": ""
  },
  {
    "addressLine1": "1224 E Trent Ave.",
    "city": "Spokane",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99202",
    "name": "Union Gospel Mission (Spokane)",
    "organization": "Union Gospel Mission (Spokane)",
    "phone": "(509) 535-8510",
    "website": "https://www.uniongospelmission.org/",
    "description": "Shelter for men.Outreach Shelter & Food.\n\n\nThree shelters in Spokane, WA: Men's Shelter; Crisis Shelter for Women & Children; and Women's Recovery at Anna Ogden Hall. One shelter for women and children in Coeur d'Alene, Idaho. Also offer free medical, eye, legal and vet clinics.\n\nMen's Shelter\nAll services are provided free-of-charge by the caring people of Spokane. Open 365 days a year.\nEmergency Shelter Guests typically stay for less than three months while they receive assistance during a time of crisis. If they have specific physical or mental challenges, our staff works to connect them with the appropriate resources.\n\nCrisis Shelter for Women and Children\n1515 E Illinois Ave, Spokane, WA 99207\n509-535-0486\nThe Crisis Shelter for Women and Children exists to provide a safe, healthy, short-term refuge for women and children in crisis.\n\nWomens Recovery at Anna Ogden Hall\n2828 W. Mallon Ave, Spokane, WA 99201\n509-327-7737\nWomens Recovery provides a safe, welcoming refuge and long-term treatment for women of all ages who are seeking to turn their lives in a new direction."
  },
  {
    "addressLine1": "525 West Second Avenue",
    "city": "Spokane",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99201",
    "name": "Volunteers of America Spokane - Crosswalk Youth Shelter",
    "organization": "Volunteers of America Spokane - Crosswalk Youth Shelter",
    "phone": "(509) 838-6596",
    "website": "http://www.voaspokane.org/Crosswalk",
    "description": "Emergency Shelter Teens only.\nCrosswalk restores hope and encourages personal responsibility among homeless youth, including those who eventually return to their families, by providing:\n* family reconciliation services\n* clothing, showers and personal hygiene products\n* employment-readiness program and job-placement assistance\n* independent living training including life-skills and self-sufficiency classes\n\n* attachment and bonding classes for young mother and fathers\n* onsite Head Start program\n* medical and mental-health care\n* school drop-out prevention program\n* substance-abuse treatment and prevention\n* tutoring and enrichment activities * college scholarship opportunities (donor funded)\n* transportation\n* access to our transitional housing programs\n\nRun by a small professional staff, Crosswalk relies heavily on the generosity of churches, service clubs, families and businesses who provide daily meals as well as community volunteers who provide tutoring and enrichment activities and donors who provide financial support, in-kind services and scholarship funds."
  },
  {
    "addressLine1": "32 W Pacific",
    "city": "Spokane",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99201",
    "name": "House of Charity - Catholic Charities",
    "organization": "House of Charity - Catholic Charities",
    "phone": "(509) 624-7821",
    "website": "https://www.cceasternwa.org/",
    "description": "MEN'S SLEEPING PROGRAM\n\nSince 1979, the Men's Sleeping Program has allowed men from all walks of life in the Spokane Area to take refuge in a bed rather than being out on the streets at night.  \n    Signups until full\n    Clients can start checking in at 7:00 pm but no later than 8:00 pm\n    Wake up at 5:30 am\n\nOVERFLOW SLEEPING FOR WOMEN\nSince 2017, the main floor of the House of Charity is open for overflow sleeping to women\n18 years of age and older. Sleeping mats are provided.\n    Signups until full\n   Clients can start checking in at 7:00 pm but no later than 8:00 pm\n    Wake up by 5:30 am\n\nRESIDENTIAL CLIENT PROGRAM\nOur RC Program is a client volunteer program that is aimed to help participants gain experience that they can utilize to find employment.\n    Clients work 20 hours a week in exchange for room and board\n\n    Goal: Participants gain the experience they can use to find employment.\n    Case management services provided to all RC clients.\n\nTRANSITIONAL RESPITE PROGRAM\nOne of the best medicines for people recovering from illness or injury is the ability to rest in a safe and comfortable environment. Respite at HOC is a nationally recognized program in partnership with Providence Healthcare and the 2016 winner of The Catholic Health Association of the United States \"Achievement Citation Award - For innovative programming that changes lives\"\n\n    Male and female clients are provided with a place to recuperate\n\n    Referred by Providence and other local hospitals and clinics\n    Case management services provided to all Respite clients.\n\n \nPROVIDENCE HOUSE OF CHARITY MEDICAL CLINIC\n Medical Clinic was founded in 1976 as an outreach of Sacred Heart Medical Center and once found its home in small quarters at the HOC. In 2017, the clinic moved into a new facility just one block from the shelter. It offers longer hours and now has the capacity to care for more unserved patients than ever before.\n\n32 W 2nd Avenue\nWalk-ins welcome\n\nOpen Monday through Friday 8:30 AM to 4:30 PM (closed 11:30 to 12:30 daily for lunch)\n\n\nMAIL\nMany of our clients do not have the luxury of having their own mailing address.\nThe House of Charity, offers a PO Box that clients may utilize.\n\nMail can be picked up daily from 8:00 AM to 12:00 PM\n(when a volunteer is available).\n\nWe ask clients to use the following format for their mail:\nYour Name\nC/O House of Charity                                                              \n32 W. Pacific Avenue                                                                           \nSpokane, WA 99201\n\nBreakfast and Lunch are served daily at 7:30am and 11:00am\nShowers and the Resource Room with select personal care items available are open daily from 7:30am-12:00pm.\nSSI/SSDI attorney available Thursdays 9:00-12:00pm\n\nArt therapy with Sister Kathy, Tuesday's 9:00-11:00am\n\n "
  },
  {
    "addressLine1": "1910 E. Sprague",
    "city": "Spokane",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99202",
    "name": "Truth Ministries",
    "organization": "Truth Ministries",
    "phone": "(509) 456-2576",
    "website": "http://www.truthministriesspokane.com/",
    "description": "For 7 years operating on Donations alone Truth has had over 10,000 men get a meal and a bed for the night.We are a men's shelter only open from 8 p.m. to 8 a.m. open every Holiday."
  },
  {
    "addressLine1": "101 E. Hartson",
    "city": "Spokane",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99202",
    "name": "St. Margaret's Shelter",
    "organization": "St. Margaret's Shelter",
    "phone": "(509) 624-9788",
    "website": "https://www.cceasternwa.org/st-margarets",
    "description": "EMERGENCY AND TRANSITIONAL HOUSING\n\nSt. Margarets ensures that families coming from homelessness, incarceration or drug treatment or fleeing domestic violence have safe, warm and welcoming living spaces that provide dignity. We offer stabilization services that are driven by the families we serve and provide housing and vocational experts to assist families with resources and connections to community partners and programs. Our goal is to serve as a brief stop that helps families on their path toward moving in to their permanent, new home..\n\nSt. Margarets Shelter provides emergency and transitional shelter to promote positive life changes in a supportive, short-term environment. St. Margarets Shelter offers social services that include individualized case management to regain and stabilize housing for families experiencing homelessness.\n\n"
  },
  {
    "addressLine1": "111 W Third Ave",
    "city": "Spokane",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99201",
    "name": "Hope House Spokane - Shelter for Women",
    "organization": "Hope House Spokane - Shelter for Women",
    "phone": "(509) 455-2886",
    "website": "http://www.voaspokane.org/hope-house",
    "description": "Shelter for women.\nhours: 8pm - 8am daily.\n\nEmergency Shelter\nThere are more than 1,800 homeless single women in Spokane, many with mental health or chemical dependency issues \"all with nowhere else to go. Named for the refuge it provides, Hope House offers refuge from the dangerous streets to any woman regardless of her mental health status, chemical dependency issues or lifestyle. Hope House offers an environment of dignity, respect and compassion that honors the intrinsic value and unique experience of every woman. Thirty-four shelter beds are available each night. Each woman receives personal care including: nutritious food a hot shower clean, dry clothing hygiene items a warm bed onsite case management resource information referrals to community resources\nPermanent Supportive Housing\nHope House also offers 25 apartments for low-income women who are ready to leave the streets. These safe, affordable apartments offer women committed to working on the causes of their homelessness a supportive transition to living on their own. This residential program also includes:\n    individualized case management\n    opportunities for permanent housing"
  },
  {
    "addressLine1": "204 E Indiana Ave",
    "city": "Spokane",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "99207",
    "name": "The Salvation Army Emergency Family Shelter",
    "organization": "The Salvation Army Emergency Family Shelter",
    "phone": "(509) 325-6814",
    "website": "https://spokane.salvationarmy.org/spokane_citadel/provide-shelter/",
    "description": ""
  },
  {
    "addressLine1": "1350 West Hanley",
    "city": "Coeur d Alene",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "83814",
    "name": "Children's Village",
    "organization": "Children's Village",
    "phone": "(208) 667-1189",
    "website": "https://twitter.com/childrencda",
    "description": ""
  },
  {
    "addressLine1": "108 E. Walnut",
    "city": "Coeur d Alene",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "83814",
    "name": "St. Vincent De Paul",
    "organization": "St. Vincent De Paul",
    "phone": "208-416-4699",
    "website": "https://stvincentdepaulnorthidaho.org/",
    "description": ""
  },
  {
    "addressLine1": "4001 N 30th Street",
    "city": "Phoenix",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "85016",
    "name": "Maggie's Place, The Mary House",
    "organization": "Maggie's Place, The Mary House",
    "phone": "(602) 262-5555",
    "website": "https://www.maggiesplace.org/",
    "description": "They accept women who are pregnant and parenting. Please, no severe mental illness, active domestic violence situations, or current users (30 days clean, please). Women and children only.\n\nThe mission of Maggies Place is two-fold. First, Maggies Place provides for the immediate physical and emotional needs of our guests; such as shelter, food, clothing, and support. Second, Maggies Place assists in connecting our guests to the appropriate agencies and resources including prenatal care, health insurance, low-cost housing, education programs, and counseling assistance.\n\nMaggie's Place has a unique staffing model in which moms and staff share a home together and we hope that the love that is experienced within our community life is transformational for all who encounter it.\nDuring a womans stay at Maggies Place, she is challenged to set and achieve goals. Short term goals usually include counseling, health insurance, prenatal care, and connection to government assistance programs. Long range goals include educational opportunities, employment, appropriate childcare arrangements, and budgeting and savings, and independence.\n\nMaggie's Place flows out of the Christian responsibility to recognize the innate beauty of motherhood and the dignity of every person. Our philosophy is founded on Catholic social teaching and our ability to love is rooted in a relationship with God, the source of all love."
  },
  {
    "addressLine1": "850 North 4th Street",
    "city": "Coeur d Alene",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "83814",
    "name": "Women's Center",
    "organization": "Women's Center",
    "phone": "(208) 664-9303",
    "website": "https://www.facebook.com/SafePassageID/",
    "description": ""
  },
  {
    "addressLine1": "721 South Fawcett",
    "city": "Tacoma",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98402",
    "name": "MDC - Housing For Homeless",
    "organization": "MDC - Housing For Homeless",
    "phone": "(253) 597-6728",
    "website": "http://www.mdc-hope.org/",
    "description": "MDC owns and manages 375 units of housing for homeless, low-income families and individuals, with four housing service models offered throughout Pierce County.\n\nHours: Monday through Thursday 8am to 4:00pm\nFriday 8am to 3:00pm\nClosed Weekends and Holidays"
  },
  {
    "addressLine1": "702 S 14th Street",
    "city": "Tacoma",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98405",
    "name": "Nativity House Day Shelter",
    "organization": "Nativity House Day Shelter",
    "phone": "(253) 502-2780",
    "website": "http://www.ccsww.org/",
    "description": "Hours of Operation: 7:00 am - 5:00 pm\nWe are open every day, including weekends and holidays.\n\nNativity House is the largest, most comprehensive facility in Pierce County serving low-income and homeless adult men and women. Our goal is to provide for the basic needs of adult individuals experiencing homelessness, and offer concrete pathways to permanent housing and self-sufficiency. The new Nativity House combines the services previously offered by three separate Homeless Adult Services (HAS) programs: Hospitality Kitchen, Nativity House, and Tacoma Avenue Shelter. Services are provided 365 days per year and include hot meals, day shelter, overnight shelter, mental health and chemical dependency assessments and referrals, rapid re-housing, access to mainstream public benefits such as Medicare and SSI, and job training. The new Nativity House also includes a new program, the Nativity House Apartments, which provides 50 units of permanent supportive housing for chronically homeless single adults with disabilities."
  },
  {
    "addressLine1": "425 South Tacoma Way",
    "city": "Tacoma",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98402",
    "name": "Tacoma Rescue Mission",
    "organization": "Tacoma Rescue Mission",
    "phone": "(253) 383-4493",
    "website": "https://www.trm.org/",
    "description": "Emergency Shelter for Men\nWe offer various emergency services at our Downtown Campus:\nShowers\nClean clothing\nLocker rental\nPersonal hygiene items\nOvernight shelter\n\nWomen and Families\nThe Adams Street Family Campus provides emergency shelter for single women and families with children, in apartment style housing. Meals, showers, and additional resources are provided in a welcoming atmosphere.\n\nTransitional Housing\nTyler Street Family Campus\nA home like setting that offers classes to help families build the necessary skills to successfully transition back into the community. Services include:\nParenting classes\nLife skills classes\nAdult basic education\nCareer coaching\nOn-site preschool\nAfter-school youth program\n\n"
  },
  {
    "addressLine1": "901 South 13th Street",
    "city": "Tacoma",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98405",
    "name": "Associated Ministries Coordinated Entry",
    "organization": "Associated Ministries Coordinated Entry",
    "phone": "(253) 383-3056",
    "website": "https://associatedministries.org/",
    "description": "For general questions about Coordinated Entry, contact Associated Ministries at:\n\nCall (253) 383-3056 Monday through Friday, 9am-5pm.\nQualifications\nThis program offers a point of entry for households experiencing homelessness. Households receive resources to secure housing and other needed services.\n\n\n\nHouseholds are screened for eligibility either by being in the shelter, outreach, or a phone call to 2-1-1.\n\n\nIf an appointment is scheduled we will have a housing solutions conversation with you to determine if a plan can be developed. If a plan is developed a Diversion Specialist will work with the household for the next 30 days toward that solution. The Diversion Specialist will partner with households to identify next steps and resources and the household will follow up with resources.\n\n\nIf a plan is not developed during the housing solutions conversations, households will be placed in the priority pool. The priority pool prioritizes households based on barriers and vulnerability for the next available resource. When a household is placed in the priority pool, they are in the priority pool for 90 days and a referral is not guaranteed.\n\nIf a household is entered onto the priority pool it is encouraged that they work on finding another housing solution.\nFAQ's\nDoes Coordinated Entry System (CES) include ALL shelters and housing in Pierce County?\n\nCES includes shelters and housing programs that are funded by Pierce County. We are having conversations with programs that do not receive this funding with the goal of developing partnerships that will benefit families experiencing homelessness. Types of programs included in Coordinated Entry are:\n-Emergency Shelters\n-Transitional Housing Programs\n-Diversion & Navigation Programs\n-Permanent Supportive Housing Programs\n-Rapid Re-housing\nWill CES get my family into housing faster/same day?\nIt is important that we are clear so your family has realistic expectations. CES is not creating additional housing resources and this process will not get your family into shelter or housing more quickly. This new process will make it easier for your family to navigate the housing system in Pierce County; instead of calling 80+ programs individually, you will now have a single access point to current shelter and housing resources.\n\nAre Section 8 vouchers included?\nNo. Section 8 waitlists remain the same as they have been.\n\nCan CES help pay my rent or utilities?\nNo. We do not provide rental or utility assistance.\n\n\n"
  },
  {
    "addressLine1": "1424 Tacoma Ave South",
    "city": "Tacoma ",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98402",
    "name": "Serra House Youth Shelter",
    "organization": "Serra House Youth Shelter",
    "phone": "(253) 328-6127",
    "website": "https://thecoffeeoasis.com/",
    "description": "24/7 youth shelter, serving teens experiencing homelessness form ages 13-17. We can house 12 youth at a time. We have case management resources, staff peer mentoring and working towards group therapy."
  },
  {
    "addressLine1": "405 Broadway",
    "city": "Tacoma",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98402",
    "name": "YWCA Pierce County - Emergency Shelter",
    "organization": "YWCA Pierce County - Emergency Shelter",
    "phone": "(253) 272-4181",
    "website": "https://www.ywcapiercecounty.org/emergency-shelter",
    "description": ""
  },
  {
    "addressLine1": "2306 NE Andresen Road Suite A",
    "city": "Vancouver",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98661",
    "name": "Council for the Homeless Temporary Emergency Shelter",
    "organization": "Council for the Homeless Temporary Emergency Shelter",
    "phone": "(360) 695-9677",
    "website": "http://www.councilforthehomeless.org/",
    "description": ""
  },
  {
    "addressLine1": "Box 821201",
    "city": "Vancouver",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98662",
    "name": "Gates of Grace",
    "organization": "Gates of Grace",
    "phone": "(360) 980-3973",
    "website": "mailto:mjordan98144@yahoo.com",
    "description": "We now have two transitional faith based homes for homeless women and children. We are centrally located and each home has six beds. We have shared and single rooms."
  },
  {
    "addressLine1": "5432 N. Albina Ave",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97217",
    "name": "Bradley Angle House",
    "organization": "Bradley Angle House",
    "phone": "(503) 281-2442",
    "website": "https://bradleyangle.org/",
    "description": "The mission of Bradley Angle is to offer survivors of domestic and sexual violence options for safety, empowerment, healing and hope, while collaborating with our communities to create social change.\n\nEmergency Shelter provides up to 10-12 weeks of shelter and support services for nine families. Case management and advocacy providers assist residents in obtaining clothing, furnishings, transportation, employment and/or job training, financial assistance, parenting support and groups, health services, drug, alcohol and mental health services. Services are from a combination of onsite inter-agency collaborations, referrals and information.\n\n\n24-Hour Crisis Phone Line is staffed by volunteers at the Emergency Shelter, and provides immediate access to safety planning, peer counseling, resource referral, emergency bed availability and domestic violence information. We collaborate with other domestic violence providers in the area to coordinate services and access to shelter openings.\n\nYouth Programs provide group and individual support to children up to age 17 staying in our shelter or transitional facility, or whose parents attend Bradley Angle support groups in any of our programs.\n\nTransition Services provide housing and support for 20 families at a time for up to two years, and is available to survivors who are not in immediate danger and feel stable enough to begin rebuilding their lives. We also provide emotional support, advocacy, long-term housing and strives to create stability in order to build strong, healthy families. This includes access to case management, skill-based educational opportunities, domestic violence and life-skills support groups, parenting support and connections to community resources.\n\n\nCommunity Based Services provide a safe, easily accessible community space for survivors to begin or continue their healing through peer support and domestic violence education. In addition to individual advocacy, a variety of support groups are available.\n\nLGBTQ Services provide culturally specific advocacy and support groups to survivors who identify as Lesbian, Gay, Bisexual, Transgender, and/or Queer.\n\nEconomic Empowerment Program uses an economic and financial education curriculum, and builds community partnerships with financial institutions, job training and placement agencies, and other transition housing service providers to implement two 10-week trainings with 12 participants each. The goal of the project is to enhance participants financial literacy and economic self-sufficiency.\n\nAwareness Raising Bradley Angle makes domestic violence educational presentations throughout the year to churches, community service groups and businesses, and presents testimony to local government funders."
  },
  {
    "addressLine1": "4545 ne garfield ave",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97211",
    "name": "United States Mission",
    "organization": "United States Mission",
    "phone": "(503) 288-9294",
    "website": "http://usmission.org/",
    "description": "Transitional housing for homeless men. ur purpose is to provide our residents with a long term clean and sober home with quality meals and a self-help work program that provides each person with the opportunity of turning their lives around.\n\nWe have discovered, in working with the homeless since 1962, that the problem is far from confined to the mentally ill and addicted, but extends across all boundaries of age, background or race.\n\n\nOur purpose is to provide our residents with a long term clean and sober home with quality meals and a self-help work program that provides each person with the opportunity of turning their lives around.\n\n\nWe have discovered, in working with the homeless since 1962, that the problem is far from confined to the mentally ill and addicted, but extends across all boundaries of age, background or race.\n\nWhile we are a religious corporation we are strictly dedicated to service. Belief in any faith or method of worship is never a requirement for the men and women entering our program. What is required is a sincere desire to get off the streets for good and return to society in a productive and positive way."
  },
  {
    "addressLine1": "627 NW 18th Avenue",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97209",
    "name": "Rose Haven Day Shelter for Women and Children",
    "organization": "Rose Haven Day Shelter for Women and Children",
    "phone": "(503) 248-6364",
    "website": "https://rosehaven.org/",
    "description": "Rose Haven is a day shelter and community center serving women and children of all ages, regardless of need.  We have an open door policy, and accept any woman in any condition who needs our help.  Staff and volunteers form a compassionate and supportive team for women who are traumatized by homelessness, abuse, and other disruptive life challenges. Rose Haven is a safe, respectful environment where change begins. We address basic needs, and help women build confidence and sustainable lives for themselves. Through reflection of trust and mutual respect, the foundation on which personal healing and healthy choice making begin.\n\nServices are provided Monday Friday from 8:30-4pm (closing at 3pm on Wednesdays to prepare for National University of Natural Medicine Community Clinic).\n\n\nWe close at 12pm the 2nd Monday of each month. Extended hours are provided on days with inclement weather. Closed daily from 12-1pm for volunteer debrief and staff lunch.\n"
  },
  {
    "addressLine1": "650 NW Irving Street",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97209",
    "name": "Transition Projects (TPI) Day Center",
    "organization": "Transition Projects (TPI) Day Center",
    "phone": "(503) 280-4700",
    "website": "https://www.tprojects.org/",
    "description": "Hours\nOpen 7 days a week from 8:00 AM - 4:00 PM\n\nTransition Projects provides services and programs to help people end their homelessness, transition to housing and maintain their housing.\n\nServices and Programs provided in our Resource Center:\n\n Showers\n\n Clothing\n\n Laundry Services\n\n Emergency Shelter\n\n Short-term Residential Programs\n\n Computer Lab\n\n Hair Salon\n\n Housing Assistance\n\n Information and Referrals\n\n Food Box Vouchers\n\n Hygiene Kits\n\n Identification and Birth Certificate Assistance\n\n TriMet Bus Tickets\n\n Telephone and Message Service\n\n Mailing Address\n\n Notary Services\n\n Housing Search Assistance\n\n Eviction Prevention and Move-in Assistance\n\n Veteran Support Services"
  },
  {
    "addressLine1": "111 W. Burnside St",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97209",
    "name": "Portland Rescue Mission",
    "organization": "Portland Rescue Mission",
    "phone": "(503) 906-7690",
    "website": "http://www.portlandrescuemission.org/",
    "description": "Services:\nFood:\nWe serve hot, nutritious meals -- up to 700 a day, 365 days a year.\n\nShelter:\nUp to 120 men have short-term shelter with us each night. Clothing and showers are available to overnight guests.\n\nRestrooms:\nWe provide safe, secure, 24-hour restrooms for men, women, and children. This restores dignity and allows us to reach people we may not otherwise meet.\n\nMail Service:\nWe provide a mailing address for hundreds of homeless individuals vital service for anyone who needs an address for job applications, family correspondence and legal issues.\n\nReferrals:\nWe refer our guests to treatment programs, medical providers, employment programs and transitional housing facilities to help get their needs met.\n\nChapel:\nWe invite our guests to hear the message of God's love and healing in our daily chapel services and Bible studies.\n\nAt our Burnside Shelter, up to 45 men participate in our residential New Life recovery programs.\n\n\nAs they begin to experience care and acceptance, these men slowly begin to see that a better life is possible. They don't have to continue to suffer for poor choices in their past.\n\n\nIn safe and grace-filled relationships with recovery counselors and fellow friends, they face the addictions, hurts and habits that have held them back from the life they've really wanted. They see that they have the power to choose a better way.\n\nShepherd's Door, our women and children's ministry center, is a refuge of safety and healing. The facility provides all they need \"nutritious meals, safe accommodations, a beautiful and nurturing environment, counseling and training\" all under one roof. Up to 37 women and their children engage in recovery during their 12 -18 month stay."
  },
  {
    "addressLine1": "30 SW 2nd Ave",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97204",
    "name": "SAFES at Fairbridge - Salvation Army Female Emergency Shelter",
    "organization": "SAFES at Fairbridge - Salvation Army Female Emergency Shelter",
    "phone": "(503) 227-0810",
    "website": "http://safeshelterpdx.org/",
    "description": "Hours of operation:\n- Dormitory (residents only) open 6pm to 8am\n- Day shelter open 7am to 11pm\n\nBASIC SERVICES and SUPPORT:\nemergency shelter\nshowers & restrooms\nsnacks\nlockers\ntelephone\nresting places\nlaundry\non-site support groups, activities\nhousing case management\ninformation, referrals\nwinter shelter\nadvocacy\n"
  },
  {
    "addressLine1": "30 SW 2nd Ave.",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97204",
    "name": "VETS (Veterans Emergency Transitional Shelter)",
    "organization": "VETS (Veterans Emergency Transitional Shelter)",
    "phone": "(503) 239-1259",
    "website": "http://www.tsacascade.org/",
    "description": "Short-term case management and transitional housing for veterans. Accepts men, women, and families for up to 9 months for veterans that qualify with TB card. Informational meeting every Wednesday at 9:00a.m."
  },
  {
    "addressLine1": "30 SW 2nd Ave",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97204",
    "name": "Salvation Army Female Emergency Shelter",
    "organization": "Salvation Army Female Emergency Shelter",
    "phone": "(971) 202-5360",
    "website": "http://www.safes.salvationarmy.org/",
    "description": "SAFES is a female shelter with dorm beds that are accessible via a waitlist, mats that are available on a first come first serve basis, and day services available from 9am - 8pm daily.\n\nThe shelter is a low barrier shelter. No ID necessary.\n\nEligibility Guidelines\n    Identify as Female\n    Must be able to care for self\n\nWe serve women in the community who are experiencing homelessness or are at risk of homelessness. We provide emergency shelter, showers, restrooms, lockers, telephone, resting areas, laundry, on-site support groups, activities, case management, information, referrals, snacks and advocacy."
  },
  {
    "addressLine1": "6220 SE 92nd Avenue",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97266",
    "name": "Family Village Shelter",
    "organization": "Family Village Shelter",
    "phone": "(503) 915-8306",
    "website": "https://www.path-home.org/",
    "description": "The umbrella organization is Portland Homeless Family Solutions.\nEligibility:\nFamilies who are currently experiencing homelessness with children under 18 in their care.\n\nServices in-shelter families receive:\nCase management services\nEmotional support\nAssistance in finding and retaining permanent housing\nBasic need resources\nAccess to adult education classes\nIndividual private bedroom for each family\nMeals and snacks\nToiletries and supplies\nLaundry and showers\nCommunal living rooms\nComputer lab\nLibrary\nKids playroom\nRec room\nPlayground\nGarden\nPicnic area\nBasketball court.\n\n\n"
  },
  {
    "addressLine1": "526 SE Grand Ave.",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97214",
    "name": "City Team Ministries",
    "organization": "City Team Ministries",
    "phone": "(503) 231-9334",
    "website": "http://www.cityteam.org/",
    "description": "In Portland, CityTeam Ministries is carrying on the work that the Peniel Mission began, providing hot meals, safe shelter, showers, clean clothing, recovery programs and other essential care to this city's homeless population. A recovery program is in place for those men that are on a road of destruction from drugs and alcohol.\n\nCityTeam is involved in real life situations with the people that walk through our doors. The caring staff and volunteers at CityTeam reach out to those people in need and show them there is real hope in Christ. CityTeam Portland offers several different programs that reach out to those in severe need. All of these programs incorporate a chance for our staff and volunteers to consistently walk along side someone and explain God's unconditional love for them in order to formulate an everlasting real change in their lives."
  },
  {
    "addressLine1": "2850 SW Cedar Hills Blvd",
    "city": "Beaverton ",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97005",
    "name": "Road to Hope Maternity Home",
    "organization": "Road to Hope Maternity Home",
    "phone": "(503) 648-4227",
    "website": "https://road2hopepdx.org/",
    "description": "Are you pregnant and in need of shelter?\n\nOur Shelter offers unsupported pregnant mothers a safe and stable home in a residential facility. Women enter the home at any point during their pregnancy and may stay up to a year after their baby is born. We offer an ongoing aftercare program to support women as they move out of the Road to Hope house and on to the next season of their life.\n\nOn a limited basis we do accept mothers with one other baby or toddler. We also accept clients with open DHS cases and provide advocacy and support.\n\n\nWe welcome young women from all cultural, ethnic, and religious backgrounds. Please answer all questions honestly and with as much detail as possible."
  },
  {
    "addressLine1": "12350 SE Powell Blvd.",
    "city": "Portland",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97236",
    "name": "Daybreak Shelter Portland",
    "organization": "Daybreak Shelter Portland",
    "phone": "(503) 548-0200",
    "website": "http://www.humansolutions.org/homelessness-services/daybreak-shelter.php",
    "description": "At this office: Anti-Poverty Classes, Energy Assistance, Employment Programs, Family Advocacy, Administrative Offices.\n\nThe Daybreak Shelter Network is a unique collaboration between Human Solutions and 30 area faith congregations. It is one of the very few homeless family shelters that keeps families together and the only one in Mid and East County that is completely secular. Daybreak Shelter is open 7 days a week, year round, to meet the needs of homeless families in our community.Description information:\n\n- The Daybreak Shelter provides shelter for 365 days and nights each year. Last year Human Solutions provided more than 4,500 nights of shelter and13,500 meals to homeless families.\n- Daybreak houses families while providing intensive and one-on-one case management\n\n- Daybreak ensures that most families coming into shelter move directly into permanent or transitional housing in about 45 days.\n- Families of any configuration can stay including single parent, two parent, same sex parent, extended families, families headed by mothers, fathers, grandparents, etc. and the family stays together while at our shelter .\n- Families have access to Human Solutions other services: employment training, helpfulclasses, computer lab for job and home searches, access to other educational tools, and a supportive network to help the family overcome homelessness for good."
  },
  {
    "addressLine1": "11130 SW Greenburg Rd.",
    "city": "Tigard",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97223",
    "name": "Good Neighbor Center",
    "organization": "Good Neighbor Center",
    "phone": "(503) 443-6084",
    "website": "https://gncnw.org/",
    "description": "Are you in need of Shelter?\nTo get on the main waitlist, please call: (503) 640-3263\n\nGood Neighbor Center is more than a place for families to sleep and eat. It is a place where families are transformed and become self sufficient once more. During their six-week stay at the shelter,families navigate the resources to assistance and finding jobs.Every year we serve between 75-95 families and 250-300 individuals"
  },
  {
    "addressLine1": "2316 SE Willard Street",
    "city": "Milwaukie",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97222",
    "name": "Northwest Housing Alternatives",
    "organization": "Northwest Housing Alternatives",
    "phone": "(503) 655-8575",
    "website": "http://www.nwhousing.org/homeless-services/annie_ross_house.shtml",
    "description": "The Annie Ross House family shelter.\n\nThe Annie Ross House helps families move from the crisis of homelessness to stable and secure lives in permanent and affordable homes. To meet this objective, Annie Ross program participants receive access to housing enriched with case management assistance provided by Family Support Specialists. Family Support Specialists guide parents through the tough times, and help them break the cycle of poverty to give their children the best opportunity to succeed in school and throughout their lives. Staff works with each family to determine their needs, and helps them develop a strengths-based plan of action.\n\nIf you are a family with children in need of emergency shelter, please contact Coordinated Housing Access at (503) 655-8575."
  },
  {
    "addressLine1": "5003 W Powell Blvd",
    "city": "Gresham",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97030",
    "name": "My Father's House Community Shelter",
    "organization": "My Father's House Community Shelter",
    "phone": "(503) 492-3046",
    "website": "https://www.familyshelter.org/",
    "description": "If you are homeless or know someone who is, please call 503-492-3046 x231 and we'll do all we can to help you.\n\nMy Father's House Community Shelter is a family shelter located in East Multnomah County, Oregon. We provide a safe environment for 30 families, a place families can stay together as they address their spiritual, physical, emotional, and relational issues and needs.\n\n\nSince more than half of our residents are children, our family shelter provides a home-style atmosphere that encourages change, structure, and accountability, as well as life changing classes and services that are suited for the entire family. For many of these parents it is their only opportunity for a chance to get back on their feet."
  },
  {
    "addressLine1": "715 SE Court Ave",
    "city": "Pendleton",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "97801",
    "name": "Pendleton Warming Station",
    "organization": "Pendleton Warming Station",
    "phone": "(765) 791-8332",
    "website": "http://www.n2npendleton.org/",
    "description": ""
  },
  {
    "addressLine1": "117 E 2nd St",
    "city": "Wapato",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98951",
    "name": "Noah's Ark Shelter",
    "organization": "Noah's Ark Shelter",
    "phone": "(509) 930-0686",
    "website": "https://www.generatinghope.org/",
    "description": "Rural shelter in small community and on the Yakama Nation reservation. 24/7 365 days per week. Overnight shelter for 30 beds (men and women), case management, interface with major homeless service providers for medical and other support from Yakima and Yakama Nation."
  },
  {
    "addressLine1": "16902 NE Woodinville Duvall RD",
    "city": "Woodinville",
    "state": "Washington",
    "stateAbbreviation": "WA",
    "postal": "98072",
    "name": "You Belong Community",
    "organization": "You Belong Community",
    "phone": "(425) 485-3582",
    "website": "https://you-belong.org/",
    "description": "You Belong Community is a housing program for women transitioning out of homelessness.\n\nWe exist to provide a place where you belong, just as you are.\n\n"
  }
]