[
  {
    "addressLine1": "604 N. Monroe St.",
    "city": "Albany",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31701",
    "name": "Albany Rescue Mission",
    "organization": "Albany Rescue Mission",
    "phone": "(229) 435-7615",
    "website": "http://www.albanyrescuemission.org/",
    "description": "Service for men, women and children. For 20 years, we have been providing for those in need by sharing food, shelter, and the Good News of the Gospel of the Lord Jesus Christ. Our feeding program is extensive, serving more than 7,000 meals each month. In addition to our residents, we also serve 3 meals a day, 7 days a week, 365 days a year to anyone who comes."
  },
  {
    "addressLine1": "304 W 2nd Avenue",
    "city": "Albany",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31701",
    "name": "The Salvation Army of Albany Emergency Shelter",
    "organization": "The Salvation Army of Albany Emergency Shelter",
    "phone": "(229) 435-1428",
    "website": "http://salvationarmygeorgia.org/albany/",
    "description": "Evening only shelter. 7:30pm to 7:00 am.\n\nOffice location: 300 West Second Ave.Albany, GA 31701.\n\n"
  },
  {
    "addressLine1": "420 Pine Avenue",
    "city": "Albany",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31702",
    "name": "Open Arms Bridge Shelter for Youth",
    "organization": "Open Arms Bridge Shelter for Youth",
    "phone": "(229) 431-1121",
    "website": "http://www.openarmsinc.org/",
    "description": "The Bridge accommodates children from birth to 18 years of age. During their time with us, all their necessities are provided, including but not limited to food, clothing, shelter, recreation, job training, advocacy, education, medical attention, and counseling. We provide a safe and structured environment for these children, allowing them time to heal and grow. We have and operate a 12 bed facility. The Bridge is a six-bedroom, three-bathroom home, located in a confidential location. There is plenty of living space, yard space, spacious dining facilities, and various forms of recreation (i.e. books, games, etc.). Referrals are taken from number of sources, including but not limited to the Department of Family and Children Services, the Department of Juvenile Justice, law enforcement, juvenile court, and family members. We do accept all runaway and homeless youth, but most of our children are confirmed cases of abuse and neglect. Aftercare Services are offered to clients for up to 6 months.\n\nThe Transitional Living Program provides a safe and stable home for youth transitioning out of foster care or those youth who are homeless, between the ages of 18 and 21. This program aims to transition these disadvantaged youth into productive citizens in the community. The participants are placed into scattered-site apartments where the basic necessities (i.e. food, clothing, and shelter costs) are provided for them until they eventually phase out of the program in graduated phases. The phases consist of assuming financial responsibility for their living expenses, one bill at a time, until they are able to assume all financial obligations successfully and independently. Youth are required to work and have the option to attend school while working. Youth are enrolled in a mandatory savings plan that ensures that before they exit the program, they have a savings account balance that is able to cover at least three months of living expenses. Youth are assessed at intake to develop a written plan that includes youth needs, strengths, goals and objectives while in the program. Progress is evaluated monthly by our trained and professional staff. At exit, youth are expected to have achieved the goals in the plan as well as the overall goals of the design of this program. This program has seen great success in changing the lives of young adults in this area. Open Arms, Incorporated is the only provider for the Transitional Living Program for Runaway and Homeless Youth in Southwest Georgia. Aftercare Services are offered to clients for up to 6 months.\n\n\nThe Street Outreach Program is our newest addition. This program provides mentoring and prevention methods to street youth. Staff members in this program work in low income areas and in hot spots for troubled youth. The goal of this program is to reduce sexual exploitation and abuse of street youth. Our staff members provide a strong presence in the community and express genuine concern for the youth in order to facilitate relationships with the youth so that they will listen to advice offered, take advantage of the services and items given (i.e. brochures, resource contacts, hygiene items, contraceptives, etc.), and hopefully choose to exit the streets for a safer environment."
  },
  {
    "addressLine1": "106 North Monroe Street",
    "city": "Albany",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31701",
    "name": "Faith and Community Outreach - Shelter for Women and Children",
    "organization": "Faith and Community Outreach - Shelter for Women and Children",
    "phone": "(229) 436-0807",
    "website": "http://www.faithcommunityoutreach.org/",
    "description": "Faith Community Outreach Center (FCOC) in Albany Georgia is a homeless shelter for women and children. It was founded by Janice P. Thompson \"as a place where low-income women can obtain the skills necessary to become self-sufficient and productive members of the community\". Prior to the founding of the center, the only women's shelter in Albany Georgia was Liberty House for battered women.\n\nOur Services\nHousing\nFood Bank\nClothing\nPersonal Hygiene\nMedical\nLegal Services\nUtility\nChild Care\nYouth Services\nTutorial\nParenting Classes\nBudgeting Classes\nLife Skills Training\nGED Training\nDomestic Violence Victims Referrals\nJob Referrals\nSpiritual Ministry\n\n\n"
  },
  {
    "addressLine1": "506 Pine Ave",
    "city": "Albany",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31701",
    "name": "Liberty House of Albany",
    "organization": "Liberty House of Albany",
    "phone": "(229) 439-7094",
    "website": "http://www.libertyhouseofalbany.com/",
    "description": "Mission: To provide shelter and services for victims of domestic violence and their children.\n\nOpen 24 hours a day, 365 days a year, crisis line counseling provides immediate assistance, information, referrals or just someone who will listen.\n\nEmergency Shelter\n\nA safe and confidential environment is provided in which shelter residents receive counseling, legal and medical advocacy, group support and help with exploring options for housing, employment, and childcare.\n\nServices for MenMen are not housed in the emergency shelter that is run by the organization, however, housing alternatives are located for men that are in need of escape from domestic violence situations. Hotels and relocation assistance are utilized during these cases. Men are also able to obtain assistance applying for temporary protection orders (TPO) and referrals for counseling services."
  },
  {
    "addressLine1": "602 W 3rd St",
    "city": "Tifton",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31793",
    "name": "Tiftarea House of Hope",
    "organization": "Tiftarea House of Hope",
    "phone": "(229) 396-5990",
    "website": "http://tiftareahouseofhope.org/",
    "description": ""
  },
  {
    "addressLine1": "326 Beech Street",
    "city": "Tifton",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31793",
    "name": "Brother Charlie Rescue Center",
    "organization": "Brother Charlie Rescue Center",
    "phone": "(912) 382-0577",
    "website": "https://www.facebook.com/pages/Brother-Charlie-Rescue-Center/111498838890954",
    "description": ""
  },
  {
    "addressLine1": "95 North Ave",
    "city": "Athens",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30603",
    "name": "Bigger Vision Community Shelter",
    "organization": "Bigger Vision Community Shelter",
    "phone": "(706) 850-3044",
    "website": "http://biggervisionofathens.org/",
    "description": "Who We Are:Bigger Vision is a winter emergency shelter.\nWe house 34 guests every night from mid-October to mid-April.\n\nWhen the shelter opens at 6:00 PM, our guests receive a hot homemade meal provided by volunteers in the community, access to showers and laundry machines on an alternating schedule, encouragement and relaxation through conversations and games with volunteers and other guests, a comfortable bed for the night, breakfast in the morning, and help connecting with other organizations in Athens that can help them get back on their feet.\n\nMission:To provide a safe and comfortable environment during the winter for those in homelessness in Athens, GA.\n\nCore Values:\nImpartial\nAll guests are treated equally without favoritism. Every person has the same opportunity to stay and continue to stay each night during the season.\n \nSafe\nOur guests are protected from the inclement weather and are afforded an environment free of the fear of harm or danger\nComfortable\nBigger Vision is a home for our guests and a home away from home for many of our volunteers.\n\nFaith-based\nWe believe God exists, and that He has given us this mission to bring Him glory. We rely on Him to supply success in all of our efforts and plans. Local\nWe are run and funded almost entirely by volunteers that come from the Greater Athens Area. Guests Requirements:We invite 34 individuals to stay with us each night from mid-October through mid-April. We accept both male and female guests, but all guests must be at least 18 years old. Guests should be physically, mentally, and emotionally capable of coping in a communal environment and able to take care of themselves without the assistance of our staff or volunteers. Guests will be held accountable to any and all shelter rules at all times, and shelter rules are subject to change as needed.\n\nWhat We Offer:\nEvening meal provided by volunteers from the community\nShowers on Mondays, Wednesdays, Fridays, and Saturdays\nLaundry on Tuesdays and Thursdays\nLibrary of reading materials\nInformation about services available in Athens\nComfortable bedSafe environment\nToiletries as needed\nWarm hats, gloves, scarves, and socks as needed\nBreakfast in the morning\n\nHow Do You Become A Guest?Call (706) 340-6062 at 4:00 pm daily to secure an invitation.\nThere are only 34 slots, and those slots are filled in the order the calls are received.No group calling is allowed. Each individual must call in separately, even if they are using the same phone.\nArrive at the shelter at 6:00 PM\nYou must have received a confirmation of your invitation before coming to the shelter. Do not enter the property before 6:00 PM.Do not block the parking lot or entrance.Arrivals after 6:15 are not guaranteed an evening meal.\nAll guests must be in the shelter no later than 8:00 pm. Exceptions can be made on a case-by-case basis at our discretion. What We Do Not Offer:\n\nWe do not offer Services to individuals without an invitation that night\nWe do not offer Guaranteed Extended Stays\nWe do not offer Shelter for Families with Minor Children\nWe do not offer Services from 7:00 AM to 5:59 PM\nWe do not offer Storage of Personal belongings beyond your nightly stay\nWe do not offer Excessive Storage of Personal Belongings during your stay, to be determined by us\nWe do not offer Medical Services of any kind\nWe do not offer Mail or Package Delivery of any kind\nWe do not offer Transportation Services of any kind\nWe do not offer Financial Assistance of any kind\nWe do not offer Food Storage or To Go Meals"
  },
  {
    "addressLine1": "620 Barber Street",
    "city": "Athens",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30601",
    "name": "Athens Area Homeless Shelter",
    "organization": "Athens Area Homeless Shelter",
    "phone": "(706) 354-0423",
    "website": "http://helpathenshomeless.org/",
    "description": "The Almost Home program provides safe, comfortable living space with trained and compassionate staff for up to six mothers with children--on average 20 people. Families are provided private rooms and bathrooms for an average of nine months. All of our moms are working, in school, or in training."
  },
  {
    "addressLine1": "393-1 West Hancock Avenue",
    "city": "Athens",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30606",
    "name": "Interfaith Hospitality Network of Athens",
    "organization": "Interfaith Hospitality Network of Athens",
    "phone": "(706) 425-1881",
    "website": "http://www.ihnathens.org/",
    "description": "The Interfaith Hospitality Network of Athens, Inc.  is a non-profit organization whose purpose is to provide immediate shelter and guidance to homeless families with children, due to the impact of misfortunes upon their lives.\n\nOnce accepted into our program, IHNA provides food, shelter, daycare, and transportation as needed."
  },
  {
    "addressLine1": "655 Potter's House Road",
    "city": "Jefferson",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30549",
    "name": "The Potter's House",
    "organization": "The Potter's House",
    "phone": "(706) 543-8338",
    "website": "http://atlantamission.org/",
    "description": "Atlanta Rescue Missions Potter's House.\nAtlanta Mission's The Potter's House offers a long-term residential discipleship program to more than 180 chemically addicted men. Located on a 550+ acre farm near Athens, Georgia, The Potter's House offers therapeutic and vocational programming, providing services that include GED training, computer literacy, and job training. The Potter's House property has been re-zoned, plans finalized and the money is being raised to build two additional buildings that will provide transitional housing and expanded education and job attainment programming.\n\nRequirements for Admission:\nCandidates for admission must:\n\nBe male between ages 25-55 requesting admission themselves, admitting their addiction problem, and sincerely willing to change.\nAgree to abide by all guidelines, fully participate in all aspects of the Christian program, and refrain from any activity staff deems contrary to recovery or Christian growth.  Violation of the guidelines may result in disciplinary measures and possible dismissal.\nBe fully detoxified and 72 hours away from their last use of drugs or alcohol of any kind.\nBe willing and able to commit to an uninterrupted one-year residential program followed by mandatory six-month Aftercare participation.  Those with child support or legal issues must provide written releases from appropriate parties assuring unhindered one-year program.\nBe physically able to perform work assignments such as shop, recycling, landscaping, farm, housekeeping, kitchen, or warehouse. \n\nBe medically able to fully participate in a program that does not provide medical care, dental care, or assistance with medications.  All candidates must arrange for outside sponsorship before they arrive.\n\nResidents will take TB and HIV tests at admission and furnish results to the Medical Coordinator.\nBe mentally stable and capable of functioning in a therapeutic community environment with classroom and group activities. The program is not equipped to care for the dual diagnosed individual or those on anti-depressant, mood stabilizing, or anti-psychotic medications.\nBe willing to refrain from the pursuit of romantic relationships other than with a legally married spouse while in the program.\nPay a program fee of $100.00 per week if he is receiving income of any type.  Those with no personal income of any kind will not be charged unless income status changes"
  },
  {
    "addressLine1": "655 Ethel Street NW",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30318",
    "name": "Restoration House - Atlanta Day Shelter and Food Distribution Center",
    "organization": "Restoration House - Atlanta Day Shelter and Food Distribution Center",
    "phone": "(404) 588-4007",
    "website": "https://atlantamission.org/restoration-house/",
    "description": ""
  },
  {
    "addressLine1": "469 Marietta Street",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30313",
    "name": "Salvaton Army Red Shield Services Atlanta",
    "organization": "Salvaton Army Red Shield Services Atlanta",
    "phone": "(404) 486-2700",
    "website": "http://salvationarmyatlanta.org/red-shield-services/",
    "description": "HOUSING PROGRAMS PROVIDED:\nCold Weather Program: When the weather is below 40 degrees and if the applicant is not intoxicated.\n\nEmergency Assessment Program: Individual applicants can access this program for a two week stay for men and three week stay for women, once in a twelve month period. Applicants must be homeless, and need to present a valid form of identification.\n\n\nFamily Emergency Program: Applicants must be the head of household with documented proof of custody of children. Applicants can stay up to 30 days, once in a twelve month period. Applicants must present a valid form of identification.\n\nSupportive Emergency Program: Applicants can stay up to six months, must be homeless, need to present two forms of identification and must have an income or sponsorship.\n\nRe-entry Program: Applicants can stay up to three months and must be referred by the State Board of Pardons and the Paroles Housing Coordinator.\n\n\nSpecial Needs: Applicants can stay up to one year, must be homeless, need to present two forms of identification and must have an income or sponsorship. This program is targeted towards those with mental or physical disabilities as well as people living with HIV+ and AIDS.\n\n\nSavings Program: Applicants can stay up to one year, must be homeless, need to present two forms of identification and must have an income. This program is targeted towards those who are willing to save 40% of their income in a monitored savings account.\n\nHarbor Light Drug Treatment: Applicants are entered into a 90-day program, must be homeless or referred through U.S. District Courts, must have qualifying medical paperwork prior to entry (call for details) and must complete a screening interview prior to entry. Most beds are fee based, some are free or sponsored.\n\nFamily Transitional Program: Applicants must be the head of household with documented proof of custody of children. Families can stay up to one-year, and must have income or sponsorship. Married couples must provide marriage certificate.\n"
  },
  {
    "addressLine1": "165 Ivan Allen Jr Blvd NW",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30313",
    "name": "Atlanta Mission The Shepherd’s Inn",
    "organization": "Atlanta Mission The Shepherd’s Inn",
    "phone": "(404) 367-2493",
    "website": "http://www.atlantamission.org/",
    "description": ""
  },
  {
    "addressLine1": "21 Bell Street Northeast",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30303",
    "name": "Trinity Community MInistries",
    "organization": "Trinity Community MInistries",
    "phone": "(404) 577-6651",
    "website": "http://www.tcmatlanta.org/programs/trinity-living/",
    "description": "Trinity House-Big Bethel is a 36-bed transitional housing and rehabilitation program, is much more than a shelter,  its a life line for men to turn their lives around. Trinity House-Big Bethel restores hope by providing support services leading back to employment, income, and recovery.\n\n\nTrinity Living\nTrinity Living was created with those who have served our country in mind. The program provides permanent supportive housing to male veterans who are experiencing homelessness, and, in many cases, recovery from addiction. Trinity Living is designed to provide case management, access to counseling, mentoring, education, and life skills remediation. Residents of Trinity Living have the added responsibility of maintaining an apartment while achieving their personal goals of recovery. The program houses 16 men in eight, two-bedroom apartment units at the Eagle's Nest complex in West Atlanta."
  },
  {
    "addressLine1": "Address Not Provided for safety reasons",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "00000",
    "name": "Serenity House of Atlanta Ministries",
    "organization": "Serenity House of Atlanta Ministries",
    "phone": "(844) 473-7364",
    "website": "https://www.serenityhouseatl.org/",
    "description": "Serenity House offers Transitional Living programs in metro Atlanta,\nWhile in Transitional care, residents are expected to work.\n\nOur faith based outreach serves people of all races, creeds, and religions. We do not discriminate. We merely support our fellow man.\n\nSerenity House of Atlanta Ministries is an 501c non-profit organization that provides housing and comprehensive support services to the homeless and people at risk in order to facilitate changes in their lives.\nOur Ministry deals with homeless clients in need of long term transitional housing. They stay on- site for a period of three months in order to obtain Employment, GED, Technical or College Education and guide them on a path to be responsible for their responsibilities in life.\nSerenity House of Atlanta Ministries is a place where clients can come together and rebuild their lives. Our mission is to help them regain their independence and dignity, and break the cycle of self destructive patterns to recreate productive lives. As life coaches, we provide transitional housing for hard to place clients such as, the Homeless, the mental ill, and Ex-Offenders.\nGoals\nProvide opportunities for individuals to maintain residential stability\nProvide opportunities for individuals to increase skills and/ or income\n\nProvide opportunities for individuals to increase self-determination\nTo provide residents an opportunity to receive interdisciplinary treatment and services that are individualized and coordinated on an on-going basis. Provision of these services will assist residents with managing their lives, their living space, their health and possessions.\n\nSerenity House of Atlanta Ministries, Inc. Program Services:\n24hr/7 days a week monitoring by staff\nRandom Drug Screens\nReferral to Anger Management classes\nGroup sessions\nReferral to physician/psychiatrist\nGED assistance\n\nWhat we do\nServe single male and single female; non pregnant\nReach out to community projects\nLook for the opportunity to help others everywhere we go\nHelping individual with food, housing, and referrals for other assistance\nProviding transition housing for clients in need of shelter"
  },
  {
    "addressLine1": "confidential",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30314",
    "name": "Serenity House of Atlanta",
    "organization": "Serenity House of Atlanta",
    "phone": "(844) 473-7364",
    "website": "http://www.serenityhouseatl.org/",
    "description": "What we do\n    Serve single male and single female; non pregnant\n    Reach out to community projects\n    Look for the opportunity to help others everywhere we go\n    Helping individual with food, housing, and referrals for other assistance\n\n    Providing transition housing for clients in need of shelter\n\nSerenity House of Atlanta Ministries is an 501c non-profit organization that provides housing and comprehensive support services to the homeless and people at risk in order to facilitate changes in their lives.\nOur Ministry deals with homeless clients in need of long term transitional housing. They stay on- site for a period of three months in order to obtain Employment, GED, Technical or College Education and guide them on a path to be responsible for their responsibilities in life.\n\nSerenity House of Atlanta Ministries is a place where clients can come together and rebuild their lives. Our mission is to help them regain their independence and dignity, and break the cycle of self destructive patterns to recreate productive lives. As life coaches, we provide transitional housing for hard to place clients such as, the Homeless, the mental ill, and Ex-Offenders.\nGoals\n    Provide opportunities for individuals to maintain residential stability\n    Provide opportunities for individuals to increase skills and/ or income\n\n    Provide opportunities for individuals to increase self-determination\n    To provide residents an opportunity to receive interdisciplinary treatment and services that are individualized and coordinated on an on-going basis. Provision of these services will assist residents with managing their lives, their living space, their health and possessions."
  },
  {
    "addressLine1": "373 W Lake Ave NW",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30317",
    "name": "Veterans Empowerment Organization Of Georgia",
    "organization": "Veterans Empowerment Organization Of Georgia",
    "phone": "(404) 889-8710",
    "website": "https://www.veohero.org/",
    "description": ""
  },
  {
    "addressLine1": "469 Marietta Street",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30313",
    "name": "The Salvation Army Metro Atlanta Red Shield Service",
    "organization": "The Salvation Army Metro Atlanta Red Shield Service",
    "phone": "(404) 486-2700",
    "website": "http://salvationarmyatlanta.org/red-shield-services/",
    "description": "Supportive Emergency shelter, $10/night, Harbor Light Drug treament $1800/month\n\nHOUSING PROGRAMS PROVIDED:\nCold Weather Program: When the weather is below 40 degrees and if the applicant is not intoxicated.\nEmergency Assessment Program: Individual applicants can access this program for a two week stay for men and three week stay for women, once in a twelve month period. Applicants must be homeless, and need to present a valid form of identification.\n\nFamily Emergency Program: Applicants must be the head of household with documented proof of custody of children. Applicants can stay up to 30 days, once in a twelve month period. Applicants must present a valid form of identification.\nSupportive Emergency Program: Applicants can stay up to six months, must be homeless, need to present two forms of identification and must have an income or sponsorship.\nRe-entry Program: Applicants can stay up to three months and must be referred by the State Board of Pardons and the Paroles Housing Coordinator.\nSpecial Needs: Applicants can stay up to one year, must be homeless, need to present two forms of identification and must have an income or sponsorship. This program is targeted towards those with mental or physical disabilities as well as people living with HIV+ and AIDS.\n\nSavings Program: Applicants can stay up to one year, must be homeless, need to present two forms of identification and must have an income. This program is targeted towards those who are willing to save 40% of their income in a monitored savings account.\n\nHarbor Light Drug Treatment: Applicants are entered into a 90-day program, must be homeless or referred through U.S. District Courts, must have qualifying medical paperwork prior to entry (call for details) and must complete a screening interview prior to entry. Most beds are fee based, some are free or sponsored.\nFamily Transitional Program: Applicants must be the head of household with documented proof of custody of children. Families can stay up to one-year, and must have income or sponsorship. Married couples must provide marriage certificate.\nVeterans on the Move: Applicants can stay up to two years and must be referred through the Veterans Administration Homeless Program.\n"
  },
  {
    "addressLine1": "275 Pryor St., SW",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30303",
    "name": "Gateway Center Atlanta",
    "organization": "Gateway Center Atlanta",
    "phone": "(404) 215-6600",
    "website": "http://www.gatewayctr.org/",
    "description": "This agency is designed to serve as the gateway to the continuum of care that helps individuals move out of homelessness. The Gateway Center is a collaborative effort. The Gateway is a program facility (with beds attached to the programs) designed to help persons become \"unhomeless.\" The Center also provides basic therapeutic services including showers, lockers, a clothing closet, access to telephones, and laundry facilities. In addition, the Center has an on-site primary care medical clinic operated by Saint Joseph's Mercy Care Services, a Department of Labor career center, and a chapel.\n\nAreas served: Clayton, Cobb, DeKalb, Douglas, Fulton, Gwinnett, Rockdale\n\n\n\nOther services provided: Alcoholism Counseling, Baggage Check Facilities, Bathing Facilities, Career Counseling, Central Intake/Assessment for Alcohol Abuse, Central Intake/Assessment for Drug Abuse, Central Intake/Assessment for Psychiatric Services, Classroom Training, Community Clinics, Comprehensive Job Assistance Centers, Drug Abuse Counseling, Ex-Offender Employment Programs, General Clothing Provision, General Legal Aid, General Medical Care, Homeless Advocacy Groups, Homeless Drop In Centers, Identification Cards, Job Interview Training, Job Readiness, Job Search Resource Centers, Job Search Techniques, Laundry Facilities, Long Term Case/Care Management, Resume Preparation Assistance, Shoes, Specialized Information and Referral for Homeless Individuals, Telephone Facilities, Transitional Housing/Shelter for Ex-Offenders, Transitional Housing/Shelter for Homeless Mentally Ill, Transitional Housing/Shelter for Homeless Veterans, Transitional Housing/Shelter for Men, Transitional Housing/Shelter for Single Parent Families Headed by Mothers, Transitional Housing/Shelter for Women, Vocational Assessment, Worship Services\n\nThe curfew for all program clients is 8pm. Under special circumstances, clients may work with their case manager to approve unique scheduling requests.\n\n\nShowers are available to male residents and walk-ins 24 hours a day, except during scheduled cleanings and from 1-3pm when women and children shower. Occasionally unplanned emergencies may also reduce capacity.\n\nWe provide all program clients with two meals per day:\nBreakfast, served 5:30 - 6:30am, and\nDinner, served 6:00 - 7:00pm\nIn addition, we provide lunch meals to certain program clients per contract specifications.\nFrom time to time local faith groups and community agencies may offer meals through the Gateway Center. In this event, all residential and non-residential clients are invited to take part on a first come, first serve basis."
  },
  {
    "addressLine1": "937 Sims St., SW",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30310",
    "name": "Jars of Clay Outreach - Kingdom Worship Center",
    "organization": "Jars of Clay Outreach - Kingdom Worship Center",
    "phone": "(404) 586-9793",
    "website": "http://www.jocatlanta.org/",
    "description": "This organization provides soup kitchen, shelter, tutoring to K-12 grade students, thrift store, job search and voice mail services to homeless individuals.\n\nList of hours for services provided:\nOffice: 8:00 am to 5:00 pm MON - FRIShelter: 6:00 am to 9:00 pm MON - SUNSoup Kitchen: 6:00 pm to 7:00 pm MON - SUNTutoring: 3:00 pm to 6:00 pm WEDShower: 7:00 pm to 9:00 pm MON - SUN\n\nTo be eligible for services: shelter: accept women, families and single parents with the male child up to 18 years of age; all other services: no restrictions\n\nWe Offer Day & Night Shelter Services\nOur Day Shelter is a Christian program that is geared to help people who truly what to help themselves. Persons who attend our day program are seeking refuge from the streets and have nowhere to rest for the day. They are usually serious about ending homelessness and are greatful for a warm, clean facility to help them become grounded again. We usually place working homeless familiesinto affordable housing in 30 days.\n\nOur Night shelter is a very active program; with a housing capacity of more than 80 persons or families per night. Operating as a Christ-centered program that is geared to help people who truly want to help themselves. We invest in people who want to invest in themselves. People find our innovative programs such as job search, resume preparation, life coaching, clothing, soup kitchen and counseling incredibly beneficial. If you are in need of shelter we can help. Call (404) 586-9793 for an interview.\n\nFor only $10 a day a family can remain safe and be in an environment that will empower them to reach for success."
  },
  {
    "addressLine1": "165 Ivan Allen Blvd NW",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30313",
    "name": "Atlanta Mission: The Shepherd's Inn",
    "organization": "Atlanta Mission: The Shepherd's Inn",
    "phone": "404-367-2493",
    "website": "http://www.atlantamission.org/the-shepherds-inn",
    "description": "The Atlanta Missions downtown Atlanta homeless shelter. Next to Olympic Park. Can serve up to 425 homeless men per night.\n\nMen, 18 years of age or older. We do not accept men with children at this facility.\n\n\nPrograms at The Shepherd's Inn are designed to solve the problem of homelessness one person at a time, by extending the love, compassion and hope found in Christ. We start by offering a warm place to sleep, a hot meal and an environment where our staff can engage each person to hear their story. Our shelter programs may help a man secure a job, find a transitional housing solution or enter a recovery program to address life controlling issues that feed the cycle of homelessness.\n\n"
  },
  {
    "addressLine1": "921 Howell Mill Road",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30318",
    "name": "My Sister's House Atlanta",
    "organization": "My Sister's House Atlanta",
    "phone": "(404) 367-2465",
    "website": "https://atlantamission.org/my-sister-s-house/",
    "description": "Atlanta Rescue Mission Women's Shelter.\n\nAtlanta Mission Women's and Children's services are provided at My Sister's House, a 264 bed facility that offers overnight shelter and residential discipleship programs for homeless women and women with children.\nServices\nEmergency Overnight Shelter\nTransitional Housing\nJob Training\nLife-Skills Training\nEducational Services\nCounseling\nAddiction Recovery\nSpiritual Recovery\nChild Care Services\n\n\n"
  },
  {
    "addressLine1": "144 Mills Street",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30313",
    "name": "Fuqua Hall Transitional Housing",
    "organization": "Fuqua Hall Transitional Housing",
    "phone": "(404) 367-2508",
    "website": "http://atlantamission.org/",
    "description": "Transitional housing for men.\nFuqua Hall offers affordable, transitional housing for men who have completed Atlanta Mission Shelter or Recovery Programs.\n\nFuqua Hall consists of 92 single unit apartments for clients who volunteer, work full time and/or attend school. The transitional housing program is a minimum of six months and graduation depends on successful completion of client and program goals. Individuals coming out of homelessness are often overcoming tragic losses, difficult circumstances or destructive lifestyles. Transitional Housing programs provide extended support that help men navigate the immediate transition to independent living."
  },
  {
    "addressLine1": "377 Westchester Blvd Nw",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30314",
    "name": "Making A Way Housing",
    "organization": "Making A Way Housing",
    "phone": "(404) 792-8011",
    "website": "http://www.makingawayhousing.org/",
    "description": ""
  },
  {
    "addressLine1": "625 Spencer Street, NW",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30318",
    "name": "Odyssey Villas – Intact Families",
    "organization": "Odyssey Villas – Intact Families",
    "phone": "(404) 671-3570",
    "website": "http://www.fultoncountyga.gov/fchhs-divisions-and-programs/emergency-and-transitional-housing",
    "description": "Hours of Operation: Monday-Friday, 8:00 A.M.-5:30 P.M.\n\nThe Office of Emergency and Transitional Housing is comprised of an Assessment Center, Supportive Services and Transitional Housing programs that provide support and structure for male, women and children relearning and developing life skills essential for securing stable employment and independent living. \n\n These services and programs are offered at the following locations.\nJefferson Place Transitional House\n1135 Jefferson Street, NW\nAtlanta, GA  30318\n(404) 613-0412\n(404) 881-5209 fax\nHours of Operation: 24 Hours, Sunday-Saturday\n\nOdyssey Villas Intact Families\n625 Spencer Street, NW\nAtlanta, GA  30318\n(404) 671-3570\nHours of Operation: Monday-Friday, 8:00 A.M.-5:30 P.M.\n\nWomen & Children Services\n(City of Refuge/Eden Village)\n1300 Joseph E. Boone Blvd.\nAtlanta, GA  30314\n(404) 564-7758\nHours of Operation: Monday-Friday, 8:00 A.M.-5:30 P.M.\n"
  },
  {
    "addressLine1": "4625 Ben Hill Rd",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30349",
    "name": "Youth Connections - Kings Manor Shelter",
    "organization": "Youth Connections - Kings Manor Shelter",
    "phone": "(404) 559-9297",
    "website": "https://www.facebook.com/kings.shelter",
    "description": "Kings Manor (Basic Center)\nThe purpose of this Basic Center project is to increase the safety, well-being and self-sufficiency of runaway, homeless and street youth in the metropolitan Atlanta area where there is a demonstrable need for these services.\nThis Basic Center will fulfill the requirements stipulated in the Basic Center solicitation and the state of Georgia requirements. It will provide outreach and recruitment to engage youth using harm-reduction and trauma-informed approaches and provide safe temporary shelter and living accommodations and other services for up to 21 days.\n\nThe target population for this center is males between the ages of 10-17. We will house up to 4 youths. The Center will provide services in the areas of outreach, crisis intervention, and aftercare services and youth development for runaway, homeless and street male youth. The services will also include substance abuse prevention information; medical and mental health information and screening; educational, employment, individual and group counseling and life skills training.\nThe shelter care services will be available 24 hours a day in order to meet the needs of youth. Staffing will be in accordance with the guidelines for Runaway and Homeless Youth Programs in Georgia and will include 1 Director, 1 Human Services Professional, 1 Lead Youth Care Specialist, 1 Licensed Clinical Social Worker (LCSW) and 4 Youth Care Specialists to provide direct services to the youth and see to their needs. The Basic Center Program will use the Positive Youth Development approach to promote the healthy development of an estimated 100 runaway, homeless and street male youth residentially each year and outreach services to an estimated 150 runaway and homeless youth male and female each 12 month period. Initial assessment will be made for each youth participant and counseling and aftercare services will be provided to insure that the youth form connections to caring adults and become productive citizens.\n\n\n\nYouth Connections, Inc. Group Home provides shelter and basic needs for runaway and at-risk youth. Kings Manor is a male only 24 hour emergency shelter, a safe place to refocus serving youth ages 10-17.\n    Temporary housing for up to 21 days.\n    Street Outreach\n    Positive mentorship\n    Crisis Intervention\nWe partner with the Department of Labor, MANY, Future Foundation, STAND, Inc., and Atlanta Workforce Development Agency to bring Project Restore to assist ages 16-24 who have been involved with the juvenile or adult justice system overcome their challenges in life and become positive, healthy and fully participating members of society. Skills, trade training and job placement are core components."
  },
  {
    "addressLine1": "830 Boulevard SE",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30316",
    "name": "Nicholas House, Inc.",
    "organization": "Nicholas House, Inc.",
    "phone": "(404) 622-0793",
    "website": "https://nicholashouse.org/",
    "description": "We serve homeless families with children of any composition with an array of housing programs for families experiencing different types of homelessness.\n\nFamilies must be verifiably homeless, in City of Atlanta/Fulton County, and have primary legal custody of at least one minor child.\n\nOur programs include:\nBoulevard Shelter: a 90 day emergency shelter for homeless families with no income\nHomeless to Homes: a partially-subsidized apartment-based program for families with some income, but not enough to pay rent\n\nHome Again: a homelessness prevention/rapid rehousing program for families with enough income to pay rent but facing immediate eviction or lacking the lump sum to move into their own housing\nNew Horizons: a permanent supportive housing program for chronically homeless families with disabilities\n\n\n\n\nWe are NOT a walk in shelter and do not serve single individuals.\n\nTo check on availability in our housing programs, call our office at 404-622-0793."
  },
  {
    "addressLine1": "173 Boulevard NE",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30312",
    "name": "Our House, Inc.",
    "organization": "Our House, Inc.",
    "phone": "(404) 522-6056",
    "website": "https://ourhousega.org/",
    "description": "To qualify for services:\nFamilies must have at least one infant child, six months old or younger.\nParents must submit a background check.\n\nThe Housing Services program accepts new families based on availability of space. To inquire about availability, call (404) 522-6056.The cornerstone of our Housing Services program is our shelter for homeless families with newborns. Located in the City of Atlanta, the shelter provides homeless families with up to six months of emergency housing in a safe and caring environment. The 76-bed facility has 18 individual family bedrooms. The program provides families with between 2-7 members with a private room, daily nutritious meals, laundry services and a weekly provision of infant and personal care items. In addition, shelter residents receive free childcare, job training and case management, delivered through our other core programs.\n\nIn addition to the supportive services received through our Family Advocacy program, shelter residents participate in weekly education sessions, life-skills activities and an income-savings program. The goal of the program is to provide families with the shelter and resources they need to achieve regular employment and improve their housing stability.\n"
  },
  {
    "addressLine1": "1328 Peachtree Street",
    "city": "Atlanta ",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30309",
    "name": "First Presbyterian Women's Transitional Center",
    "organization": "First Presbyterian Women's Transitional Center",
    "phone": "(404) 228-7758",
    "website": "http://www.firstpresatl.org/",
    "description": "We provide a transitional center for women who meet the following criteria. No children currently in their care, working at least 20 hours, able to meet 8pm curfew at our midtown location."
  },
  {
    "addressLine1": "2585 Chantilly Drive",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30324",
    "name": "Lost N Found Youth",
    "organization": "Lost N Found Youth",
    "phone": "(678) 856-7824",
    "website": "http://www.lnfy.org/",
    "description": "Lost-n-Found Youth is an Atlanta-based nonprofit corporation whose mission is to take homeless lesbian, gay, bisexual, and transgender youths to age 26 off the street and transition them into more permanent housing.\n\n\nWe operate a 24/7 hotline at 678-856-7825, a Youth Center, a 6-bed 90 day housing facility, and 3-6 month host home program.\n\n\n\n\nLost-n-Found Youth is Atlanta's only nonprofit agency actively working to take homeless LGBTQ youth off the street.\n\nReach Out\nIf you are a youth in need of help, reach out (talk or text) to 678-856-7825.\nSupport is available 24 hours a day, 7 days a week.\nWe support youth ages 13 through 25 at our Youth Center and provide transitional housing for youth age 18 to 25. Lost-n-Found Youth also provides services and referrals based on the needs of youth entering our program.\n\n43 percent of our clients find us by word of mouth while 38 percent are referred by area shelters. 16 percent find us online and 3 percent are identified through our street outreach program.\nServices\n24/7 phone, texts, and email response\nEmergency and transitional housing\nEmergency clothing and food for youth on the street\nMental health evaluations and counseling\nReferrals to HIV/STD testing, health and dental services\nAssistance for lost or stolen birth certificates, driver's licenses or state ID cards\n\nReferrals to GED training/testing and other education resources\nResume writing/editing and interview skills training\n\n"
  },
  {
    "addressLine1": "2836 Springdale Road SW",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30315",
    "name": "Solomon's Temple Inc.",
    "organization": "Solomon's Temple Inc.",
    "phone": "(404) 762-4646",
    "website": "http://www.solomonstempleinc.org/",
    "description": "Solomon's Temple is a holistic emergency and transitional facility for homeless families with children. We provide shelter, food, case management/family coaching and employment services are designed to help guide homeless families toward lives of independence.Located in metro Atlanta on 1 acre of park space which includes a playground, a basketball court, a gazebo and walking trails, it offers families in transition a peaceful setting to move toward stability.\n\nEmergency/Transitional Supportive Housing\nWe offer shelter for up to 144 women and children, with wraparound supportive services. Families may reside at Solomon's Temple for up to 6 months. Each family is assigned their own private dormitory style room that includes beds and a dresser. Our on-site supportive services help families gain self-sustainability that empower the entire family with the tools to break the cycle of homelessness."
  },
  {
    "addressLine1": "607 Peachtree St. NE",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30308",
    "name": "Atlanta Children's Shelter",
    "organization": "Atlanta Children's Shelter",
    "phone": "",
    "website": "http://acsatl.org/",
    "description": "Founded in 1986 by the Junior League of Atlanta and located in the North Avenue Presbyterian Church, the Atlanta Children's Shelter provides free, quality day care, emotional support, an educational curriculum for homeless children, and focused social services for their families. Dedicated to helping families overcome the issues that contribute to homelessness, including domestic violence and job loss, the Atlanta Children's Shelter focuses on the long term self sufficiency of the family - which sets us apart from other Atlanta homeless shelters. Since 1986, the Atlanta Children's Shelter has cared for almost 8,000 children and provided services for more than 5,000 families.\n\nTransition to Permanent Housing\nThe ultimate goal for our families is to have them leave the shelter system and return to live in the community. Services provided to assist families with transitioning to permanent housing include:\nCredit Counseling: Bad credit can prevent a family from obtaining housing. The Atlanta Children's Shelter has a partnership with CredAbility to provide our parents with money management workshops and individual credit counseling.\n\nThe Sunshine Fund: Funded by private donations, the Sunshine Fund allows The Atlanta Children's Shelter to provide rent and utility deposits for eligible enrolled families transitioning into permanent housing. Click here to donate.\nFurniture Referral: The Atlanta Children's Shelter maintains a partnership with the Metro Atlanta Furniture Bank to provide referral for household furniture to transitioning families.\n\nHome Starter Kit: The Shelter accepts donations of household goods from individuals and groups in the community in order to provide newly housed families a Home Starter Kit containing linens, lamps, iron, dishes, eating utensils, toaster, and cleaning supplies.\nTransitional Childcare: Newly housed families are eligible for up to a year of extended childcare enrollment based on need, availability of spaces, and parent motivation.\n"
  },
  {
    "addressLine1": "1300 Joseph E. Boone Blvd",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30314",
    "name": "City of Refuge - Eden Village Atlanta",
    "organization": "City of Refuge - Eden Village Atlanta",
    "phone": "(404) 874-2241",
    "website": "http://www.fultoncountyga.gov/fchhs-divisions-and-programs/emergency-and-transitional-housing",
    "description": "Hours of Operation: Monday-Friday, 8:00 A.M.-5:30 P.M.\n\nThe Office of Emergency and Transitional Housing is comprised of an Assessment Center, Supportive Services and Transitional Housing programs that provide support and structure for male, women and children relearning and developing life skills essential for securing stable employment and independent living.  These services and programs are offered at the following locations."
  },
  {
    "addressLine1": "17 Executive Park Drive Department W Suite 290",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30329",
    "name": "Jerusalem House",
    "organization": "Jerusalem House",
    "phone": "(404) 350-1633",
    "website": "https://www.jerusalemhouse.org/",
    "description": ""
  },
  {
    "addressLine1": "265 Washington St SW",
    "city": "Atlanta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30303",
    "name": "Action Ministries Arch Experience at Trinity Assessment Center (TAC)",
    "organization": "Action Ministries Arch Experience at Trinity Assessment Center (TAC)",
    "phone": "(404) 881-1991",
    "website": "https://actionministries.net/tac/",
    "description": "The Action Ministries Trinity Assessment Center (TAC) effectively transitions homeless women and children into stable housing by preparing them for self-sufficiency. TAC serves up to 24 women and children per month who have been identified as candidates for immediate permanent housing, while providing an additional 10 beds during inclement weather periods and welcoming over 200 homeless men and women to have dinner with us every Sunday."
  },
  {
    "addressLine1": "2268 Clanton Terrace",
    "city": "Decatur",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30034",
    "name": "Emma Cares, Inc.",
    "organization": "Emma Cares, Inc.",
    "phone": "(877) 746-8393",
    "website": "http://www.emmacares.org/",
    "description": "Emma Cares Senior and Community Services of Metro Atlanta is a 501(c)(3) public charity. We are a community-based organization who have partnered with like-minded others to provide supportive and collaborative services in Metro Atlanta with the hopes of helping to build and sustain communities.\n\nWe were founded to conquer the many obstacles seniors and people in need are facing by bridging innovative and creative services. As a local organization, we are pleased to offer the following programs and services:\n\n- Senior Housing - Women only, 60+, Decatur\n- Senior's helping Senior's Companion - Gwinnett & DeKalb\n- Senior and Disabled Light Transportation - Get in Gear Program, Gwinnett Only\n\n- Work @ Home Opportunities - Various Social Services Agencies, Metro Atlanta\n- Housecleaning - Gwinnett\n- Furniture Bank of Atlanta - Referral Agency, Metro Atlanta\n\nEmma Cares, Inc., is a 501 (c)(3) nonprofit organization that seeks to provide the highest quality housing for seniors aged 60 and above in a safe, warm, loving, sound, beautiful home-like milieu, so that they may age comfortably. We understanding the housing burden of fixed income seniors.\n\n\nWe were established to gather women and men to explore and develop creative options for living together in communities.\n\nEmma Cares provides housing, amenities and activities to women and men interested in spending less of their income on housing related expenses by sharing housing with other men and women."
  },
  {
    "addressLine1": "1739 Fenwick Street",
    "city": "Augusta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30904",
    "name": "Mercy Ministries - Day Center",
    "organization": "Mercy Ministries - Day Center",
    "phone": "(706) 737-7994",
    "website": "http://augustahomeless.org/",
    "description": "We are Georgia's only drop-in Day Center for the homeless. We are located at 1739 Fenwick St. in the historic Harrisburg neighborhood of Augusta, Ga.\n\nWHAT WE DO\n    We do NOT charge our clients for any of the services we offer.The Day Center on Fenwick St. provides services to the homeless and under housed (usually no utilities) and low income individuals and families.The center is a safe place, out of the weather with access to hot/cold food, showers and laundry use.The Fenwick Street Center also has a case management team to assist in preventing or ending homelessness. We have an active caseload of 1,500 individuals and families.\n    Also recovery 12-step programs are available.\n    We obtain birth certificates, social security cards, Georgia IDs, and provide transportation to job interviews and resume help.\n\n    We assist clients with finding medical help.We pay for doctors and clinic visits(if funds are available) and medications.\n\n    We also assist in locating affordable housing and give vouchers for clothing to our Thrift Shop.\n\n    We serve 8,000 - 10,000 meals each month and provide fresh fruit, vegetables and bread to 2,000 individuals and families\n    every month during our twice a week food drive. (See photo below-people line up behind Fenwick Street Tuesdays and Fridays at 3:30. Bring a bag or box to carry the food in.)"
  },
  {
    "addressLine1": "1384 Greene Street",
    "city": "Augusta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30901",
    "name": "The Salvation Army Center of Hope Shelter",
    "organization": "The Salvation Army Center of Hope Shelter",
    "phone": "(706) 364-7921",
    "website": "http://www.salvationarmyaugusta.org/",
    "description": "For individuals and families with documented need for housing. Providing crisis intervention and case management. Open 24 hours a day, 7 days a week.\n\nSoup Line A hot evening meal is available 365 days a year to anyone in the community who needs dinner. Dinner is served at the Center of Hope from 5:30pm to 5:50pm Monday- Saturday, and from 4:00pm to 4:20pm on Sundays. Available at our Center of Hope.\n\n\nShelters Our shelters offer spiritual and physical care, food, and shelter to people in need. They attend the total needs of the individual and are meant to be a kind resting place to help these individuals get back on their feet.\n\nWomen and Children's Emergency Shelter Single women and mothers with children can receive temporary shelter, three healthy meals per day, tutoring, and individual case management. Call the Homeless Social Services office at 706.364.7921 for availability and more information.\n\n\nMen's Emergency Shelter Homeless men receive a safe place to sleep, a shower, and breakfast each morning. Shelter check-in is from 6:00pm to 8:30pm. You must show identification and have shelter clearance from the sheriff's department. Individual case management and group classes are offered in order to help men move to permanent housing. Call the Men's Residential Manager at 706.434.3193 for more information.\n\n\nDrug and Alcohol Rehabilitation This free, 9-month, residential program is for adult males struggling with addiction. This program includes recovery classes, individualized support, work therapy, and spiritual guidance. Interested candidates must submit a pre-enrollment application to be considered for enrollment. The application can be faxed to 706.826.1801. For more information call the CSRC Manager at 706.434.3194.\n\nSocial Service Assistance\nSocial Service Assistance\nThe First Stop Family Service Center is The Salvation Army of Greater Augusta's Social Services office for people who are housed or have an address. To request an appointment, or to get more information, call 706-922-8330 between 8:30 a.m. and 12 p.m. or 1 p.m. and 4 p.m., Monday through Friday.\nRent and Utility Assistance\nAvailable through the Project SHARE program for residents of Richmond, Burke, Columbia, and Glascock Counties. The bill must be past due and the household must be facing a specific challenge or crisis that makes them unable to pay the bill. Natural gas assistance is offered through a special program that has additional income qualifications. For more information about application requirements or to see when the next screening date will be, contact the First Stop Family Service Center at 706-922-8330.\nEmergency Grocery Assistance\nAvailable for people who do not receive food stamps. Applicants should provide picture ID, social security card, proof of income and expenses, and a description of their food need. Applicants must wait at least 90 days after their last visit and will be referred by staff to food pantries in their neighborhood for additional food assistance.\nClothing Vouchers\nAvailable to The Salvation Army Family Stores for people who need clothing. Applicants should provide picture ID, social security card, proof of income and expenses, and a description of their food need. Applicants must wait at least 90 days after their last visit.\nChristmas Gift and Toy Assistance\nAvailable to families with children up to 12 years old. We participate in the Augusta Christmas Clearinghouse to insure families receive help from only one agency. Christmas open application dates vary each year, but will be released after September 1. Call 706.922.8330.  Applications require photo ID for all adults in the household, birth certificates for all children in the household, social security cards for all household members, proof of income (including food stamps) and expenses, proof of current address, and proof of child custody.  Senior citizens and disabled individuals should call 706.922.8330 after September 1 to ask about Christmas food boxes.\nFurniture Assistance\nAvailable only to fire or disaster victims with a referral from the Red Cross and other required documentation.  Please contact the First Stop Center at 706.922.8330 for information and to schedule an appointment for this service.\nOther assistance is available periodically, depending on the season and supplies available. Items available in the past have included fans, school supplies, children's books, toiletries or diapers, and children's pajamas."
  },
  {
    "addressLine1": "1739 Fenwick Street",
    "city": "Augusta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30904",
    "name": "Mercy Ministries Day Shelter For Homeless",
    "organization": "Mercy Ministries Day Shelter For Homeless",
    "phone": "(706) 737-7994",
    "website": "http://augustahomeless.org/",
    "description": "We are Georgia's only drop-in Day Center for the homeless.\n\nWHAT WE DO\n    We do NOT charge our clients for any of the services we offer.The Day Center on Fenwick St. provides services to the homeless and under housed (usually no utilities) and low income individuals and families.The center is a safe place, out of the weather with access to hot/cold food, showers and laundry use.The Fenwick Street Center also has a case management team to assist in preventing or ending homelessness.We have an active caseload of 1,500 individuals and families.\n    Also recovery 12-step programs are available.\n    We obtain birth certificates, social security cards, Georgia IDs, and provide transportation to job interviews and resume help.\n    We assist clients with finding medical help.We pay for doctors and clinic visits(if funds are available) and medications.\n\n    We also assist in locating affordable housing and give vouchers for clothing to our Thrift Shop.\n\n    We serve 8,000 - 10,000 meals each month and provide fresh fruit, vegetables and bread to 2,000 individuals and families\n    every month during our twice a week food drive. (See photo below-people line up behind Fenwick Street Tuesdays and Fridays at 3:30. Bring a bag or box to carry the food in.)"
  },
  {
    "addressLine1": "2177 Central Avenue",
    "city": "Augusta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30904",
    "name": "Family Promise of Augusta",
    "organization": "Family Promise of Augusta",
    "phone": "(706) 364-4462",
    "website": "http://familypromiseaugusta.com/",
    "description": "Assistance for homeless families with children. Also provides transitional housing. Waiting list. Call for details.\n\nThe Interfaith Hospitality Network (IHNA) service programs are formed from many already existing programs and resources in the local area. The benefit of using pre-existing assets is so we can react quickly and without major costs. Guests accepted in the network are eligible to receive the following services and assistance:\n\nHost Churches:\nWe have a network of local churches that volunteer to house our guests for one week at a time four times a year. When families enter our program they spend the night at one of these churches. At 5:00 they return to the church for the evening. The volunteers at the host church that week feed the guests supper and usually have family time or a mentoring class in the evening. Next morning these volunteers feed the guests breakfast and send them off with a sack lunch.\n\nEmployment Searches:\nAfter leaving the host church in the morning, the adults come to the Day Center. From there they are transported to job interviews, employment agencies, or wherever they need to be transported in their search for employment.\n\nTransportation:\nWhile in the program our guests and their children are provided with cost free transportation. Guests can be taken to and from various locations in conjunction with regaining their independence, while their children are taken to whichever school they were enrolled in prior to entering the program.\n\nDay Care Services:\nFPA operates a cost free Day Care Shelter for the children of our guests. Each morning the children who are not enrolled in school, or who are out of school, are transported to the Day Care center. Guests in transitional housing are still eligible for our day care services.\n\nPersonal Services:\nDuring their stay we try to ensure we meet all the needs of our guests including medical assistance and dental care. Life skills assistance, Budget Management and Parenting Classes are also offered. Assistance will be provided as needed with resumes, GED classes and navigating the job market.\n\nTransition to Independence:\nAfter our guests find stable employment they move to one of our transitional homes. When they move in we try to make sure they have everything they need. This includes furniture, linens, household items and transportation./p>\n\nTransitional Housing:\nAfter the adult of the family has found employment and has a stable income the family moves to one of our transitional homes; where they can stay, rent free, for up to two years. During their stay in transitional housing they are responsible for all other expenses and required to save 30 percent of their income as well as look for permanent housing. Regular meetings with the director is also required for all guest who enter transitional housing."
  },
  {
    "addressLine1": "526 Walker Street",
    "city": "Augusta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30901",
    "name": "Augusta Rescue Mission",
    "organization": "Augusta Rescue Mission",
    "phone": "(706) 722-2058",
    "website": "http://augustarescuemission.org/",
    "description": "Overnight Guest Program - homeless men benefit daily from hot meals, showers, clothing, safe sleeping facilities and chapel services, while in transition \"free of charge!\n\nThe Augusta Rescue Mission provides free holiday meals to those in need in the downtown area, including homebound individuals who cannot come to the Mission to receive assistance. In addition, ARM is prepared to provide food to families referred to the Mission by the Department of Family and Children Services.\n\nAnd while not a primary ministry of the Mission, during times of crisis - home fire, etc. - We will occasionally be called upon to provide furnishing for families who are less fortunate and have been left destitute.\nThe Augusta Rescue Mission is currently in the process of being certified by the Red Cross to serve families in the local community as an emergency shelter in times of disaster."
  },
  {
    "addressLine1": "828 Fenwick St",
    "city": "Augusta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30901",
    "name": "Garden City Rescue Mission",
    "organization": "Garden City Rescue Mission",
    "phone": "(706) 724-6960",
    "website": "https://www.gcrmaugusta.com/",
    "description": ""
  },
  {
    "addressLine1": "2136 Circular Dr",
    "city": "Augusta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30903",
    "name": "Head of the Giant Ministry Inc.",
    "organization": "Head of the Giant Ministry Inc.",
    "phone": "(706) 496-1540",
    "website": "https://www.headofthegiantministry.com/index.html",
    "description": "Head of the Giant Ministries provides emergency housing, transient housing, job training, job placement, Christian teaching, GED preparation, VA referral, and SSI benefit assistance to those who are in need within the CSRA.\n\nIntake is from 9-5pm. Guest are allowed up to 90 days stay. Must have shelter clearance pass. Mothers must show proof of guardianship of children. Men's intake upon appointment"
  },
  {
    "addressLine1": "2534 Augusta Rd",
    "city": "Gloverville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "29828",
    "name": "Mt. Salem Outreach Mission",
    "organization": "Mt. Salem Outreach Mission",
    "phone": "(803) 593-2276",
    "website": "mailto:brotherrob@atlanticbb.net",
    "description": "Check in time 4pm-6pm, Office hours are from 9am-3 pm. Men can stay everyday no limit.\n\nMt. SALEM'S soup kitchen will be at 2444 Jefferson Davis Hwy, Graniteville, SC 29829. Monday- Friday 11am-2pm."
  },
  {
    "addressLine1": "415 Newnan Rd.",
    "city": "Carrollton",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30117",
    "name": "HOPE Center for homeless",
    "organization": "HOPE Center for homeless",
    "phone": "(770) 834-4007",
    "website": "http://www.impactwestga.org/",
    "description": "Unlike traditional homeless shelters and services, HOPE is a place Men can call home, live with dignity, have access to support services, and focus on rebuilding their lives and returning to independent living.\n\nHOPE serves the west Georgia area and is located at 415 Newnan Rd. Carrollton, GA 30117. It opens Monday - Saturday at 6 p.m. and Sundays at 1 p.m. 770.834.4007\n\n\n\nHOPE Center is a communal home and transition program for homeless men where men may live with dignity while they work toward transitioning back into their own homes and independent living. HOPE Center provides a safe, drug and alcohol free, home-like environment; all basic necessities, including hygiene products, haircuts, bathing and laundry facilities, clothing and three meals a day; supportive services and a transition program for Men of HOPE so they can focus on obtaining and maintaining full-time employment, saving income, and making the transition.\n\n\n\n\nHOPE Center assists an average of 65 to 70 men annually. 80% of these men who complete the program make a successful transition, defined as maintaining employment and living independently for a period of one year after leaving the Center."
  },
  {
    "addressLine1": "6976 Bankhead Hwy",
    "city": "Douglasville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30134",
    "name": "Men's Assessment Center",
    "organization": "Men's Assessment Center",
    "phone": "(678) 715-1300",
    "website": "http://www.crossroadsforlife.com/",
    "description": "The Men's Assessment Center is a Christ-centered facility designed to connect homeless individuals with their needs based on structured assessment (i.e. mental health, substance abuse and economical) in a triage approach.\n\nOur Mission is to serve the homeless men of our community."
  },
  {
    "addressLine1": "110 Porter Street",
    "city": "Cartersville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30120",
    "name": "Good Neighbor Homeless Shelter (Cartersville)",
    "organization": "Good Neighbor Homeless Shelter (Cartersville)",
    "phone": "(770) 607-0610",
    "website": "http://www.goodneighborshelter.org/",
    "description": "Temporary shelter to individuals & families. Provides men, women, and families with temporary shelter and physical, emotional, and spiritual support. Our caring staff and volunteers assist the guests with developing and prioritizing goals for their return to the community as productive members.\n\nGuests are involved in our Goals Program in which they meet one on one with our Goals Coordinator on a weekly basis. Together they set and prioritize goals for independent living. In addition to getting a job, creating a budget, opening a savings account, and locating affordable housing, each guest has individual goals to achieve."
  },
  {
    "addressLine1": "55 Elizabeth Church Road",
    "city": "Marietta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30060",
    "name": "Elizabeth Inn Emergency Shelter (Marietta)",
    "organization": "Elizabeth Inn Emergency Shelter (Marietta)",
    "phone": "(770) 427-9862",
    "website": "http://www.mustministries.org/",
    "description": "Shelter for men women and children. Please arrive no earlier than 4:30 pm daily to stand in line. Space is limited and is offered on a first come first served basis, depending on availability. The priority is given to families and returning prospective guests (from the day before).\n\n\n\nThe shelter sleeps 64 people - 40 beds for men and 24 beds for women and children.\n\n\n\nRequirements to stay in the shelter are the following: You must have a photo ID, if you have children, either a social security card or birth certificate is needed for each child. You must be clean and sober and remain clean and sober in order to stay at the Elizabeth Inn.\n\nServices\nGroceries\nHot Meals (pantries, distribution sites, and service kitchen)\nEmergency Shelter\nSupportive Housing\nClothing\nEmployment Services\nSeasonal Outreach (Summer Lunch and Christmas Toy Shop)\nDonation Center"
  },
  {
    "addressLine1": "1116 North Main Street",
    "city": "Cedartown",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30125",
    "name": "Community Share Ministries - Men's Shelter",
    "organization": "Community Share Ministries - Men's Shelter",
    "phone": "(678) 634-4395",
    "website": "https://www.helpcommunityshare.com/",
    "description": "Hours: Mon - Sat: 10:00 am - 5:00 pm\n\nCommunity Share Ministries is a non profit ministry that will provide for the needs of others in the community. Through this organization we will provide shelter for the homeless and food for the hungry. The overall mission is to show Christ's love to those who have physical needs while ministering to their spiritual needs as well, through the gospel of Jesus Christ.\n\nWe have now established a mens homeless shelter located on Philpot St, and in the process of forming a womans shelter. God is doing some amazing things for our cummunity and its a blessing to have God use us for that purpose."
  },
  {
    "addressLine1": "132 East 18th St",
    "city": "Rome",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30262",
    "name": "William S. Davies Homeless Shelter",
    "organization": "William S. Davies Homeless Shelter",
    "phone": "(706) 512-1152",
    "website": "http://daviesshelter.com/",
    "description": "Men's Shelter (on 18th Street):\nHouses 16 men and features a commercial-grade kitchen, community garden, and ADA-compliant facilities.\nMen only.\nEmergency Shelter.\nReferrals.\nCommunity funded, faith-based homeless shelter for men over the age of 18.\nWomen's & Children's Shelter (on N Broad St):\nHouses 8 single women and 4 women with children, with room for up to 14 children at a time.\n"
  },
  {
    "addressLine1": "Office only (not a shelter): 105 Dove Lane",
    "city": "Clarkesville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30523",
    "name": "Habersham Homeless Ministries",
    "organization": "Habersham Homeless Ministries",
    "phone": "(706) 754-9031",
    "website": "mailto:habershamhomeless@windstream.net",
    "description": "We have 4 family shelters and 1 single women's shelter in Clarkesville and 1 single men's shelter in Toccoa.Call the business office for assistance. These are not walk-in shelters."
  },
  {
    "addressLine1": "882 Asbestos Rd",
    "city": "Cleveland",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30528",
    "name": "Yesha House Family Shelter",
    "organization": "Yesha House Family Shelter",
    "phone": "(706) 865-5044",
    "website": "https://www.yeshahouse.org/",
    "description": "Provides a family shelter. Call for details as we do not have any further information to publish on this website."
  },
  {
    "addressLine1": "5538 Old National Hwy Suite 325",
    "city": "College Park",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30349",
    "name": "Georgia Center for Youth Excellence - Transitional Housing",
    "organization": "Georgia Center for Youth Excellence - Transitional Housing",
    "phone": "(678) 545-6451",
    "website": "https://www.gacye.org/",
    "description": ""
  },
  {
    "addressLine1": "2525 Fox Hall Lane South",
    "city": "College Park",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30213",
    "name": "My Brothers House",
    "organization": "My Brothers House",
    "phone": "(678) 604-6422",
    "website": "http://www.mybrothershouse-gaelc.org/",
    "description": "My Brother's House provides outreach and recruitment to engage youth using harm reduction and trauma informed approaches and provide safe temporary shelter and living accommodations and other services for up to 21 days.\n\n\nThe youth we serve are males between age 10-17 in the Atlanta Metropolitan area.\n\nMy Brothers House will accommodate up to four youth at a time and provide services in the areas of outreach, crisis intervention, aftercare services and youth development for runaway, homeless and street male youth. Additional services will include substance abuse prevention information; medical and mental health information and screening; educational, employment, individual and group counseling and life skills training.\n\n\nThe shelter is open 24/7 for intake and provides all meals, activities, continuation of schooling, counseling, reunification with guardians and other supportive services."
  },
  {
    "addressLine1": "2405 2nd Avenue",
    "city": "Columbus",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31901",
    "name": "Open Door Community House",
    "organization": "Open Door Community House",
    "phone": "(706) 323-5518",
    "website": "http://opendoorcommunityhouse.org/",
    "description": "Open Door currently has three areas of Homeless Ministries: Community Case Management Program Showering Program for the Homeless Virginia D. Jackson Home for Women For more information on any of these Homeless Ministries please view their pages on this site or contact Andrea Powell, Director of Homeless Ministries.\n\nJackson Home for Women\nOpen Door's Transition Home for Women in Crisis is the oldest transitional housing program in our area. It provides a structured environment for adult homeless women for up to two years. Each resident must be employed, actively seeking employment, or attending school, and participate in the Community Case Management Program. The goal of the program is for each woman to obtain sustainable income, permanent housing and self-sufficiency. For more information about the Transition Home contact Andrea Powell.\n\nShowering Program\nThe Showering Program for the Homeless is a unique ministry in our area offering unsheltered homeless persons a place to shower, a change of clothing, breakfast, hygiene items, and a place to do laundry. This program also offers Bible Study, job search skills, and barber services. The goal of the program is for participants to become employable. Volunteers may assist in the Showering Program with registering participants, distributing hygiene items, cooking breakfast, assisting with computer skills training, or providing health related educational opportunities. Volunteers working more than once in the Showering Program are required to have a background check. Click here for a link to the volunteer application and information packet. This program serves the largest number of people at Open Door up to 600 different participants each year. For more information about the Showering Program contact Valerie Harvey.\n\nCommunity Case Management\nOur Community Case Management Program is a collaborative effort with several agencies in the Columbus area to aid women who are homeless in obtaining sustainable income and permanent housing. Clients receive assistance with rental deposits, first months rent, household necessities, counseling through the Pastoral Institute, job search, medical services, and assistance with the cost of childcare and education.\n"
  },
  {
    "addressLine1": "1532 Third Avenue",
    "city": "Columbus",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31901",
    "name": "House of Mercy",
    "organization": "House of Mercy",
    "phone": "(706) 322-6463",
    "website": "http://www.houseofmercycolumbus.com/",
    "description": ""
  },
  {
    "addressLine1": "2903 Second Avenue",
    "city": "Columbus",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31902",
    "name": "Valley Rescue Mission",
    "organization": "Valley Rescue Mission",
    "phone": "(706) 322-8267",
    "website": "http://www.valleyrescuemission.org/",
    "description": "Emergency Shelter. Men only. Offers these services:\nHoward Mott Center For Men: The Howard Mott Center for Men (HMC) Transient program offers short - term overnight lodging and basic essentials to men in need. Once a man enters this program he has 90 days within a 12 month period to stay with us. Men can also be assessed at this point and considered for the HMC goal - based addiction recovery programs if they so desire.\n\n\nThe goal-based program is designed to help men that have addiction problems. We believe that successful recovery is based on the knowledge and foundation in Jesus Christ. The goal-based recovery program is divided into three (3) separate phases.\n\nCrossroadsAddiction Recovery Program for Men\n\nDamascus WayHome for Women and Children:\nThe emergency shelter is a temporary shelter providing relief from physical, spiritual and material needs and offering a support system to individuals coming into our facility for temporary shelter.\n\nThe transitional program presents women with the opportunity for the healing of their personal lives, restoration with family members when possible, resolution of past issues and the opportunity to re-enter society with a positive mindset and lifestyle.\n\nVisit their website or call for full details on services.\n\n\nDaily check in is between 3:45pm - 7:00 pm. Since the shelter fills up quickly, it is recommended that an individual check in as early as possible.\n\nResidents must leave the premises by 7:00 am with all of their belongings.\n\nValley Rescue is not responsible for items left behind. Residents are allowed to stay up to 90 days in a 12 month period. Picture identification and police warrant check are required. There is a chapel requirement."
  },
  {
    "addressLine1": "1214 3rd Avenue",
    "city": "Columbus",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31902",
    "name": "Valley Interfaith Promise",
    "organization": "Valley Interfaith Promise",
    "phone": "(706) 494-6348",
    "website": "https://valleyinterfaithpromise.com/",
    "description": "VIP provides shelter, meals, and comprehensive support services to homeless families. Families must have at least one child under 18 years of age and in their custodial care who will participate in.\n\nA sheltering program for homeless families with children by providing shelter, meals, and comprehensive support services. A qualified homeless family will participate in the program for an initial 30 days. The family will be seeking employment/housing from the Valley Interfaith Promise Day Center during the day and will stay at a host congregation's facility overnight.\n\n\nIntake procedure: By phone. Application process takes 2-3 business days. Applicants will have to go through a nationwide criminal background check and be drug tested.\n\n\nFamilies must be willing to stay at the facilities of various religious congregations during the hours of 5:30 PM - 7:00AM. Will be housed at the VIPs Day Center during the day. Must make concerted effort to gain employment and permanent housing. Usual length of stay is 30 days. Must provide document ation of homelessness and police warrant check for all adults.Any applying family member must not be chemically dependent or have any acute mental illnesses."
  },
  {
    "addressLine1": "4001 N 30th Street",
    "city": "Phoenix",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "85016",
    "name": "Maggie's Place, The Mary House",
    "organization": "Maggie's Place, The Mary House",
    "phone": "(602) 262-5555",
    "website": "https://www.maggiesplace.org/",
    "description": "They accept women who are pregnant and parenting. Please, no severe mental illness, active domestic violence situations, or current users (30 days clean, please). Women and children only.\n\nThe mission of Maggies Place is two-fold. First, Maggies Place provides for the immediate physical and emotional needs of our guests; such as shelter, food, clothing, and support. Second, Maggies Place assists in connecting our guests to the appropriate agencies and resources including prenatal care, health insurance, low-cost housing, education programs, and counseling assistance.\n\nMaggie's Place has a unique staffing model in which moms and staff share a home together and we hope that the love that is experienced within our community life is transformational for all who encounter it.\nDuring a womans stay at Maggies Place, she is challenged to set and achieve goals. Short term goals usually include counseling, health insurance, prenatal care, and connection to government assistance programs. Long range goals include educational opportunities, employment, appropriate childcare arrangements, and budgeting and savings, and independence.\n\nMaggie's Place flows out of the Christian responsibility to recognize the innate beauty of motherhood and the dignity of every person. Our philosophy is founded on Catholic social teaching and our ability to love is rooted in a relationship with God, the source of all love."
  },
  {
    "addressLine1": "1718 2nd Avenue",
    "city": "Columbus",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31901",
    "name": "Salvation Army Shelter Columbus GA",
    "organization": "Salvation Army Shelter Columbus GA",
    "phone": "(706) 327-0275",
    "website": "",
    "description": "Shelter for men only.\nHot meal is served daily at 5:00 pm. Check in is approximately 6:30 pm, depending on weather. Photo ID and a police warrant check are required. The first 3 consecutive nights are free and $8 a night thereafter. Every 30 days you are eligible for the 3 free nights. Fees may be reduced or waived for residents who are making strong efforts to find work, but still have no income.\n\n\nResidents must leave at 7:30 am in the morning but may leave their belongings if they plan on returning that evening."
  },
  {
    "addressLine1": "2510 Pepperell Pkwy",
    "city": "Opelika",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "36801",
    "name": "Harvest Evangelism",
    "organization": "Harvest Evangelism",
    "phone": "(334) 742-0777",
    "website": "http://harvestevangelism.org/",
    "description": "Ministry to Men\nEmergency shelter, Long-term recovery/rehab program (urban), Long-term recovery/rehab program (rural), Transitional housing, Case management\n\nWomen and Family Ministries\nEmergency shelter, Case management, Extended shelter (not long term), Single women (no children), Single women (with children), Single men (with children), Married couple (no children), Married couple (with children), Long-term recovery/rehab program (90 days or more), Transitional housing (separate facilities)"
  },
  {
    "addressLine1": "P. O. Box 1155",
    "city": "Conyers",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30012",
    "name": "Phoenix Pass",
    "organization": "Phoenix Pass",
    "phone": "(770) 679-1363",
    "website": "http://www.phoenixpass.org/",
    "description": "The mission of Phoenix Pass, Inc. is to serve the needs of women and families experiencing temporary homelessness by giving them the opportunity to reestablish self-sufficiency in a stable residential setting. The focus of the transitional housing program for Phoenix Pass, Inc. is to empower Program Participants with supportive services and the resources to recover and rebuild a productive, stable lifestyle for themselves and for their families. Phoenix Pass, Inc. will operate under the vision that Program Participants who successfully complete the program will remain in the Conyers-Rockdale County community to live, work, and contribute the education, life skills, and job skills acquired during their tenure in the program back to the community. It is expected that Program Participants will transition from the program into the community as productive and self-sufficient citizens."
  },
  {
    "addressLine1": "2910 EVANS MILL RD B118",
    "city": "Lithonia",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30038",
    "name": "Able Housing Services Corp.",
    "organization": "Able Housing Services Corp.",
    "phone": "(770) 415-5363",
    "website": "https://ablehsc.org/",
    "description": ""
  },
  {
    "addressLine1": "7133 Turner Lake Circle",
    "city": "Covington",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30014",
    "name": "Garden of Gethsemane Shelter",
    "organization": "Garden of Gethsemane Shelter",
    "phone": "(770) 787-8519",
    "website": "https://rainbowcommunitycenter.webs.com/",
    "description": "A Christian homeless shelter.The Garden of Gethsemane is a Homeless Shelter serving those in need in the Rockdale and Newton County area.\n\nHours of Operation - 10:00 AM - 5:00 PM, (Monday to Friday)\n\n\nOur mission is to defeat homelessness, hunger, restore broken family relationships, and end illiteracy within the homeless population of Newton, Rockdale and the surrounding area."
  },
  {
    "addressLine1": "3482 keith bridge road #126",
    "city": "Cumming",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30041",
    "name": "IM IN A FAMILY RECEIVING HOMES,INC",
    "organization": "IM IN A FAMILY RECEIVING HOMES,INC",
    "phone": "(770) 889-7950",
    "website": "http://www.inafamily.org/",
    "description": "We provide housing and support services to homeless womenand children"
  },
  {
    "addressLine1": "3335 Hutchinson Road, Suite D1",
    "city": "Cumming",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30028",
    "name": "Family Promise of Forsyth County, Inc.",
    "organization": "Family Promise of Forsyth County, Inc.",
    "phone": "(678) 476-4657",
    "website": "https://www.fpforsyth.org/",
    "description": ""
  },
  {
    "addressLine1": "3427 Duluth Highway 120",
    "city": "Duluth",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30096",
    "name": "Rainbow Village, Inc.",
    "organization": "Rainbow Village, Inc.",
    "phone": "(770) 497-1888",
    "website": "http://rainbowvillage.org/",
    "description": "Rainbow Village's mission is to transform lives for homeless families with children of North Metro Atlanta through a community-based transitional housing program that promotes self-sufficiency.\n\n\n\nRainbow Village is NOT an emergency shelter and is not able to provide short-term emergency assistance.\n\n\n\n\nRainbow Village is a one-to-two year intensive program of intervention for homeless families with children of North Metro Atlanta. The program includes MANDATORY classes, counseling, advisement, and community activities in addition to managed housing that emphasizes accountability.\n\n\n\nIn order to be eligible to apply for the program, applicants must be veritably homeless or facing imminent homelessness, have custoody of a minor child or children, have a valid Georgia ID or Driver's License, and have lived in the state of Georgia for at least 30 days. In addition, all adult applicants must be willing and able to work and have reliable transportation to in order to get to work (if applicable), Rainbow Village activities, and to pick up their child(ren) from the After-School Program."
  },
  {
    "addressLine1": "711 South Hamilton Street",
    "city": "Dalton",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30720",
    "name": "Providence Ministries",
    "organization": "Providence Ministries",
    "phone": "(706) 275-0268",
    "website": "http://www.providenceministriesinc.com/",
    "description": "Office Hours:Mondays through Fridays 8 am - 4:30 pm.\n\nServices:\n1. Providence Ministries Homeless Men's Shelter - Providence Ministries homeless shelter is on the forefronts of the fight against the homelessness epidemic in Georgia. We believe that every man deserves dignity and refuge as they attempt to put their lives back together. The homeless situation is a tragic one. It is often a result of the all to common occurrence of people losing both their homes and their jobs at the same time, and is not a reflection of character but rather the result of ill-timed and unfortunate circumstances. We know that the homeless condition can happen to anyone.\n\n\n2. Men's Addiction Recovery - The Providence Ministries Christian Drug and Alcohol Recovery Program for men has been redeeming lives and saving souls in the name of Jesus Christ, since 1985. Our time-tested, long-term 6 month faith based rehab alternative to traditional drug and alcohol rehabilitation treatment has helped people from all across the nation, is extremely value packed, and extremely effective.\n\n3. Women's Addiction Recovery - Drug rehab, Alcohol rehab. We are more then a recovery center, we are a spiritual regeneration program, and our goal is to help women completely transform their lives. website: http://providencewomensrecovery.com/\n\n4. Homeless Women's and Children's Shelter - This mission's purpose is to offer a temporary place of refuge for homeless women and their children while the mother addresses the economic, social, and spiritual issues that led to their homelessness. It is designed to give homeless women an opportunity to take a hard look at themselves, and to take the necessary steps to move out of the bondage of homelessness.\n\n\nThe program can house a total of 12 persons, that being any combination of women and children. The prerequisites for approval into the shelter are that the mother be homeless, not suffering from a physical or mental disability (as we are not medically staffed but can refer), and not be in danger or dealing with a domestic dispute or battered woman situation (again, we can refer).\n\n\nWe offer one-on-one counseling, complimentary meals for the mother and children, and a fully furnished living area separated from any of the men's facilities. That said, their are some requirements. First, we require that the mother be ardently looking for work during the day. Second, we require that the women remain free of drugs and alcohol, and third, we require that the family attend church on Wednesdays, and twice on Sunday's.\n\nWe have gone to great lengths to create a safe, second-to-none shelter. The opportunity for women to grow and heal with us here at Providence is very real and very attainable. And as long as the women staying here are putting in the effort, we will stand behind them and assist them in any way we can. For more information or if you have questions, please call the women's intake coordinator at (706)275-0268.\n\n5. Free Meals.\nHours:\nMondays through Fridays: Breakfast: 7:15am, Lunch 12 noon, Dinner 5pm.\nSundays: Breakfast: 8:30am, Lunch 12 noon, Dinner, 5pm.\n\nHot Meals.Providence Ministries is fighting hunger in Georgia by serving fresh and hot meals prepared daily, and offering them for free to anyone who wants one, no questions asked... no one will be denied. Our community kitchen is open 365 days a year and serves 60-200 plates for any given meal. Also, we very often redistribute any extra unprepared donated food to our guests immediately following the serving of food (limit one small bag per family). Please take advantage of these offers as it's our pleasure to serve the community in this very important endeavor, and we hate throwing away excess food."
  },
  {
    "addressLine1": "416 S. Glenwood Ave",
    "city": "Dalton",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30721",
    "name": "City of Refuge Transitional Housing",
    "organization": "City of Refuge Transitional Housing",
    "phone": "(706) 226-1301",
    "website": "https://www.cityofrefugedalton.org/",
    "description": ""
  },
  {
    "addressLine1": "407 South Thornton Avenue Suite #3",
    "city": "Dalton",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30720",
    "name": "Dalton Whitfield CDC",
    "organization": "Dalton Whitfield CDC",
    "phone": "(706) 529-8270",
    "website": "https://dwcdc.business.site/",
    "description": "Business Hours:\nMon:    9:00 AM 5:00 PM\nTue:    9:00 AM 5:00 PM\nWed:    9:00 AM 5:00 PM\nThu:    9:00 AM 5:00 PM\n\nGHFA PSH (formerly known as Shelter Plus Care)\nThe GHFA Permanent Supportive Housing (PSH) Program (formerly known as Shelter Plus Care) provides permanent housing in connection with supportive services to persons who have a disability and are experiencing homelessness. The program provides rental assistance funded by the Department of Housing and Urban Development (HUD) accompanied by a range of supportive services funded by other sources. The GHFA PSH Program is designed to serve a population that has been traditionally hard to reach - homeless persons with disabilities such as (but not limited to) serious mental illness, chronic substance abuse, and/or AIDS and related diseases. This program is built on the best practice that housing and services should be connected in order to ensure stability for this population. Consequently, GHFA PSH provides rental assistance that local sub-grantees must match with supportive services appropriate to the target population. The goals of the GHFA PSH Program are to assist homeless individuals and their families to increase their housing stability, skills and/or income, and self-sufficiency."
  },
  {
    "addressLine1": "1512 South Holtzclaw Ave.",
    "city": "Chattanooga",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "37403",
    "name": "The Chattanooga Rescue Mission",
    "organization": "The Chattanooga Rescue Mission",
    "phone": "(423) 756-3126",
    "website": "http://www.chattanoogarescuemission.org/",
    "description": "Overnight Shelter-Guest MinistryWhether people have come to the mission needing help with substance abuse, or whether they just need a little help to get back on their feet, we provide meals, a chapel service, showers, and overnight lodging to all who want to come.\n\nPrograms\nOvernight Shelter Guest Ministry\nWhether people have come to the mission needing help with substance abuse, or whether they just need a little help to get back on their feet, we provide meals, a chapel service, showers, and overnight lodging to all who have needs.\n\nWomen and Children's Ministry\nIn the early years of the ministry most of the homeless we ministered to were homeless men. Because of the increase in homeless women and children in our area, and our burden to reach all the needy in our area, in October, 2002 we opened a free, emergency shelter for 14 of the estimated 400 homeless women and children.\n\nNightly Chapel Ministries\n\nMen's Chapel Service\nFor over 35 years, the mission has provided nightly chapel services to share the good news of salvation through the Lord Jesus Christ. Our chapel speakers are volunteers who come once a month to encourage and be a blessing to those who need Christ in their lives.\n\nWomen's Chapel Service\nSeparate chapel services are provided each night for our female shelter guests and program members. Godly women from area churches volunteer their time to provide music and teach the Word of God so that these women can come to know Christ as Savior and learn to live for Him.\n\nChristian Life Programs\n\nMens Christian Life Program\nSome of those to whom we minister realize they need to make changes in their lives and will enroll in our 12-month alcohol and drug program. Because we believe that only the Word of God and His Holy Spirit can change lives, all our classes and programs are Biblically based. In addition to the extensive Bible training, our CLPs/WCLPSs receive counseling and encouragement. While in this program, all of their needs are provided for them free of charge.\n\nThe last three months of the Christian Life Program is a transition period.  CLPs work outside the mission but continue to stay at the mission where food, shelter, and guidance are provided. As they transition back into society, we continue to monitor their success and provide continued counseling as needed.\n\nWomen's Christian Life Program\nNight Shelter Schedules\n\nWomens Night Shelter Schedule\n\n    5:00 pm  Shelter staff arrive to greet shelter guests\n    5:00 pm to 5:30 pm  Check-in\n    5:45 pm  Hot, delicious, balanced dinner\n    6:15 pm  Chapel Service\n    9:00 pm  Lights out\n\n \n\nMens Night Shelter Schedule\n\n    5:00 pm  Shelter staff arrive to greet shelter guests\n    5:00 pm to 5:30 pm  Check-in\n    6:30 pm  Hot, delicious, balanced dinner\n    7:00 pm  Chapel Service\n    9:00 pm  Lights out\n\n\n\n "
  },
  {
    "addressLine1": "230 N. Highland Park Ave",
    "city": "Chattanooga",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "37404",
    "name": "Chattanooga Room In The Inn",
    "organization": "Chattanooga Room In The Inn",
    "phone": "(423) 624-6144",
    "website": "https://chattanoogaroomintheinn.com/",
    "description": ""
  },
  {
    "addressLine1": "1184 Baldwin St",
    "city": "Chattanooga",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "37403",
    "name": "Family Promise of Greater Chattanooga",
    "organization": "Family Promise of Greater Chattanooga",
    "phone": "(423) 756-3891",
    "website": "http://familypromisechattanooga.com/",
    "description": "Family Promise is a nonprofit organization committed to helping low-income families achieve lasting independence.\n\n\n\nServices:\n\nThe IHN Overnight Shelter Program is our traditional, faith-based program that operates in area congregations and continues to provide food, shelter and hospitality to families in need. Over fifty area churches and synagogues currently partner to host and support efforts to provide temporary housing for our families, which is truly a cost-effective mobilization of community resources. Seventy-five to eighty percent of families exit this program to stable housing, either employed or with income supports if disabled and securely linked to supportive and follow-up services.\n\n\n\nThe Family Promise Day Center Program provides food, transportation, day shelter, shower and laundry facilities, case management, life skills and educational classes, computers to develop resumes and apply online for jobs and housing, indoor and outdoor play areas for children and a nap room. As the name suggests, our families stay here during the day.\n\n\n"
  },
  {
    "addressLine1": "745 Wildwood Ave SE",
    "city": "Cleveland",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "37311",
    "name": "Bradley County - Cleveland Emergency Shelter",
    "organization": "Bradley County - Cleveland Emergency Shelter",
    "phone": "(423) 478-1458",
    "website": "http://www.bradleyclevelandcsa.org/",
    "description": "Office hours: Mondays through Fridays 8am - 4:30pm. Provides and emergency shelter.\n\n\nThe Cleveland Emergency Shelter provides daily for those most vulnerable and desperate among us, first supplying emergency services of food and shelter. This comprehensive program offers support that will promote, empower, and nurture families or individuals. These services include, but are not limited to, case management, information/referral, advocacy, family/individual counseling, voucher assistance, job, life skills, and budgeting training.\n\n\nThe Cleveland Emergency Shelter has the opportunity to provide transitional housing right next to out current facility on Wildwood Avenue. Transitional housing programs assist people who are ready to move beyond emergency shelter but need additional supportive services to move out of homelessness. These programs often the bridge for those wishing to move into permanent housing. Transitional programs allow individuals and families who need services to further develop the stability, confidence, and coping skills needed to sustain permanent housing."
  },
  {
    "addressLine1": "P.O. Box 457",
    "city": "Decatur",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30031",
    "name": "Decatur Cooperative Ministry - Shelter For Women",
    "organization": "Decatur Cooperative Ministry - Shelter For Women",
    "phone": "(404) 377-5365",
    "website": "http://www.decaturcooperativeministry.org/",
    "description": "DCM\n    404.377.5365\n    Decatur Cooperative Ministry\n    P.O. Box 457\n    Decatur, GA 30031-0457\n\nHagar's House\n    404.370.0914\n\nFamily House\n    404.377.5365, extension 4\n\nProject Take Charge\n    404.284.4411\n\nWe offer:\nEmergency shelter for women with children\nLong-term transitional housing for families with children\nBill payment to prevent eviction, foreclosure, or utility cut-off\nFood for households at risk of hunger\n\nFamily House Transitional Program\nFamily House provides housing and support services to move families from homelessness to self-reliance in about 6 months. The program uses single-family houses and apartments throughout DeKalb County. Both single- and two-parent families can apply, and hard-to-place families, including those headed by single fathers or with teenage boys, are welcome.\n\nWhile participating in the program, families receive:\n    Housing\n    Utilities\n    Case management\n    Counseling\n    Financial management classes\n    A savings plan\n    Computer training opportunities\n    Referrals to other services, such as free child care, legal assistance, health care\n\nFamily House residents put 30% of their adjusted income into an account with DCM. At the end of their participation in the program, all but 10% is returned to the family as savings. This money can be used for rent, security and utility deposits, and moving expenses.\n\nFamilies can be referred to Family House by another agency, schools, congregations, or any advocate. They may also refer themselves.\nMinimum Eligibility Requirements\nTo apply for Family House Program, you must meet the following minimum requirements:\n    All adults must be employed, be looking for a job, or be enrolled in a work training program.\n    Your family must be homeless as defined by HUD guidelines. This means you do not have the resources to get other housing including options to live with friends or family, in a hotel, or in a private residence. You must also have an eviction notice, a letter from a shelter or other program where you have been living temporarily, or other written documentation of your situation.\n    Your family has multiple barriers to stable housing, such as multiple evictions or bouts of homelessness, large family size, a family member with special needs, or limited work experience, etc.\n\n    Your family must have at least one child younger than 18.\n\n    Your family must pay a minimum of 30% of its adjusted income into an account with DCM and must attend financial management classes.\nHow to Apply for the Family House Program\nIf you meet the minimum eligibility requirements above, call Decatur Cooperative Ministry at 404.377.5365, extension 4, between 9:00 am and 5:00 pm, Monday through Friday, to find out if the program has any spaces.\nIf space is available, the  program manager will contact you to complete a basic phone screening and pre-application. If you are a good candidate for the program based on your phone screening and pre-application, you will be asked to complete an application and will be interviewed by the program manager. This application process can take four to six weeks."
  },
  {
    "addressLine1": "1755 Sandy Lane",
    "city": "Douglasville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30134",
    "name": "Douglas County Homeless Shelter",
    "organization": "Douglas County Homeless Shelter",
    "phone": "(770) 949-4911",
    "website": "http://www.celebratedouglascounty.com/",
    "description": "The Douglas County Homeless Shelter is for transitional families and emergency shelter. The shelter takes single women and transitional families when space is available. All of the residents must be able to work or seek employment to live there."
  },
  {
    "addressLine1": "P.O. Box 723",
    "city": "Douglasville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30133",
    "name": "SHARE House Family Violence Crisis Center",
    "organization": "SHARE House Family Violence Crisis Center",
    "phone": "(770) 949-0626",
    "website": "http://www.sharehousedouglas.org/",
    "description": "24 Hour Crisis Line: 770.489.7513\nStaffed by trained advocates to provide immediate response to battered women in need.\nEmergency Shelter\n25 bed shelter available with 24 hour intake for battered and homeless women and children.\nTransitional Program\nA stepping stone for women to go from crisis to independant living. There are seven transitional housing units which will house up to 12 women and their children.\nCase Management\nFamilies are provided with comprehensive case management while in the program.\nChildren's Program\nComprehensive services are provided to children and youth that come from violent homes. Public education regarding violence and its effect on children and youth, and presentations to high school students on dating and domestic violence at local high schools.\nDomestic Violence Counseling\nThrough legal advocacy & TPO assistance, women are assisted in obtaining a Temporary Protective Order as soon as possible. Legal advocates are provided to escort and assist as needed for hearings and other legal matters.\nSupport Groups\nSupport groups are offered for battered women which include parenting classes and life skills classes. Through collaboration with agencies, required services for battered women and their chilren are available.\nEmergency Food & Clothing\nThe first five days of food are provided to families coming into the shelter while they await food stamps.\nCommunity Education\nVolunteer training is available for those wishing to volunteer with S.H.A.R.E. House, or learn more about Domestic Violence. Call 770.949.0626 for more information on how to help."
  },
  {
    "addressLine1": "1000 Center Place",
    "city": "Norcross",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30093",
    "name": "The Salvation Army - Divisional Headquarters",
    "organization": "The Salvation Army - Divisional Headquarters",
    "phone": "(770) 441-6200",
    "website": "http://salvationarmygeorgia.org/",
    "description": "Contact for area homeless shelter availability.\n\nThe Salvation Army of Georgia provides the following services and programs;\n    Emergency Financial Assistance\n    Homeless Shelters and Feeding Programs\n    Drug and Rehabilitation Centers\n    Mobile Kitchens and Other Services for Disaster Victims\n    Services to Prison Inmates and Their Families\n    Services to Elderly and Hospital Patients\n    Camping Program for Underprivileged Youth"
  },
  {
    "addressLine1": "669 Main Street SW",
    "city": "Gainesville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30501",
    "name": "Gainesville City Baptist Rescue Mission",
    "organization": "Gainesville City Baptist Rescue Mission",
    "phone": "(770) 287-9700",
    "website": "mailto:mission30501@att.net",
    "description": "Established in 1964. 28 beds for men only. Picture id required. Seven days free. Afterward, $7 per night. Breakfast and supper provided. Free clothing from thrift store."
  },
  {
    "addressLine1": "1 1st St",
    "city": "Gainesville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30504",
    "name": "Action Ministries Gainesville",
    "organization": "Action Ministries Gainesville",
    "phone": "(770) 531-1440",
    "website": "http://actionministries.net/locations/gainesville/",
    "description": "11 beds for housing. Emergency Assistance Program"
  },
  {
    "addressLine1": "1115 west solomon street",
    "city": "Griffin",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30223",
    "name": "Impact Christian Ministries",
    "organization": "Impact Christian Ministries",
    "phone": "(678) 603-0831",
    "website": "http://www.impactchristianministries.com/",
    "description": "We are a non profit 5oc3 outreach ministry. We provide food, clothes, shelter, church services and much much more. We have a very large volunteer staff to assist you. please visit our website to learn more.\n\nImpact Christian Ministries is a faith-based organization that ministers to the needs of the homeless, needy and the poor, as well as those who may have lost their homes to disaster. We are also able to assist people who need help getting their lives on track after leaving jail or prison.\n\n\nOur center is located at 115 West Solomon Street in downtown Griffin, Ga. From this facility we serve cooked meals and provide spiritual guidance, worship and fellowship for those in need. We also have a large clothing ministry facility located at 112 Merchant Way in downtown Barnesville. This ministry can supply clothing, hygiene items and from time to time some household cleaning supplies for the needy."
  },
  {
    "addressLine1": "305 Louise Lane",
    "city": "Griffin",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30223",
    "name": "A Higher Calling",
    "organization": "A Higher Calling",
    "phone": "(678) 603-2880",
    "website": "http://www.ahighercallinggriffin.org/",
    "description": "We operate an emergency shelter for 10 men and Transitional Housing for 40 More. We provide meals, transportation, and case management. We can assist with Mental Health and Substance Abuse issues.\n\nShelter\nA Higher Calling Inc. in Griffin, GA provides shelter for 30-90 days. Upon entering the program an assessment is done and at that time goals and benchmarks are set and monitored weekly. At the end of the first thirty days an evaluation will be done and if you meet the necessary requirements your stay in the shelter will be extended the other sixty days for a total of ninety days. You will be given a copy of your rights and responsibilities, and a copy of the rules of the program.\n\nTransitional Housing\nTransitional housing is a 24 month program, you will be assigned a room and key, you will be given orientation and a copy of the rules and regulations, there is a $87.50 weekly program fee associated with the stay at the transitional housing, this does not include utilities, the utilities will be shared equally with all residents in that particular unit, (no more than three or four residents per unit), each of the units have three bed rooms, two single rooms, and double room in master bedroom, (person can choose to occupy master bed alone, but the cost for that room to occupy alone is $125.00 weekly plus utilities).  There is also transportation services provided for an additional $50.00 per month, (the city of Griffin has no public transportation services).\n\nSupportive Housing for Homeless Citizens\nA Higher Calling Inc. is a non-profit Christian organization, with 501 (c) 3, public charity status, that endeavors to reduce homelessness in our community. Our goal is to institute evidence based programs and best practices that meet the multifaceted needs of homeless citizens. In an effort to obtain this goal, A Higher Calling Inc provides supportive housing for homeless men, women and children.  Understanding that housing is only one piece of the restorative puzzle, A Higher Calling Inc has forged collaborative relationships with local churches, federal, state and local governments, as well as, local businesses, health and wellness providers, educational institutions, mental health and substance abuse counseling providers, social service institutions, faith-based and grass-root organizations, in an effort to address the needs of homelessness in a comprehensive and holistic manner.\n\nOur Facility\nA Higher Calling Inc. is located in Griffin, GA. The facility consists of 12 townhouses. Each townhouse is fully equipped with washer/dryer, full kitchen, a dining area, and common area for TV viewing and community meetings. Our facility offers a structured setting with an on-site office, and 24-hour staffing."
  },
  {
    "addressLine1": "126 Highway 138 S.W.",
    "city": "Riverdale ",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30274",
    "name": "Sconiers Homeless Preventive Organization inc",
    "organization": "Sconiers Homeless Preventive Organization inc",
    "phone": "(404) 454-3554",
    "website": "https://shpoinc.wordpress.com/about/",
    "description": ""
  },
  {
    "addressLine1": "P.o. Box 776",
    "city": "Hampton",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30228",
    "name": "Women of Excellence - Transitional Home",
    "organization": "Women of Excellence - Transitional Home",
    "phone": "(404) 405-4023",
    "website": "https://www.woeinc.org/",
    "description": "We have a women's transitional home locate in the city of Barnesville that houses homeless and battered an abuse women and women coming out of prison.\n\nW.O.E. is a faith-based housing, therefore, we believe that every person should be given another chance at life through Christ Jesus. We are founded on the belief that change comes easier with the help of God. Our program is based on Biblical principles.  Our cost for housing is on a percentage-base. Each program participant is required to participate in:\n    In-House Bible Study\n    Weekly House Meetings\n    Weekly Church Gatherings\n    Morning Prayer\n    Scheduled Curfews\n    House Chores"
  },
  {
    "addressLine1": "80 M.L.K. Jr Drive",
    "city": "Winder",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30680",
    "name": "Northeast Georgia Homeless Veterans Shelter",
    "organization": "Northeast Georgia Homeless Veterans Shelter",
    "phone": "(678) 963-0790",
    "website": "https://www.neghvs.org/",
    "description": "The North East Georgia Homeless Veterans Shelter, a 501C (3) non-profit organization, in Winder Georgia, that serves homeless veterans in Northeast Georgia area. We have identified a need for a Homeless Veterans shelter, with over 420 homeless Veterans in the surrounding area, and even more in northeast Georgia. Currently, our shelter has the capacity to provide up to 52 beds to Homeless Veterans.\n\nWe offer transitional housing and access to a comprehensive array of support services to homeless Veterans and their families. Supportive services such as vocational and career development, life skills training, counseling services, and help obtaining Veteran's benefits, that will allow our Veterans to transition back into the community as productive citizens.\n\n\nOur shelter is structured in accordance with the VA homeless Veteran per diem program, which allows up to 10 of our available beds to be used by non veterans.\n\n\nWithout the generous support of our community and the collaboration with Action Ministries Inc and other agencies, we could not provide these services to our homeless veterans."
  },
  {
    "addressLine1": "849 South Davis Road",
    "city": "Lagrange",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30241",
    "name": "Baptist Tabernacle Food Closet",
    "organization": "Baptist Tabernacle Food Closet",
    "phone": "(706) 882-0087",
    "website": "http://www.baptisttabernacle.ws/",
    "description": "Food closet, clothes closet, puppet, homefolks, care, and HUB student, along with Hunters for Christ, Brotherhood, Children's Church, God's Helping Hands, Lighthouse Keepers, F.L.O.C.K., Sunday School, Vacation Bible School, Rock Middle School Students, Faithriders, Radio Ministry, Conquering Chemical Dependency, Churches Helping Churches and Media Ministry.Food closet hours: Thursdays, 9:00am"
  },
  {
    "addressLine1": "3495 B Sugarloaf Parkway",
    "city": "Lawrenceville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30044",
    "name": "Family Promise of Gwinnett County",
    "organization": "Family Promise of Gwinnett County",
    "phone": "(678) 376-8950",
    "website": "https://familypromisegwinnett.org/",
    "description": "Family Promise of Gwinnett provides 24 hour shelter, meals, transportation and supportive services for up to 90 days. The program is a partnership with faith communities throughout Gwinnett County; however, religious values are not imposed on our guests.\n\nIn partnership with Family Promise of Gwinnett, congregations provide overnight lodging to our guests. Congregations usually convert religious education or meeting rooms into private or semi-private bedrooms for each family. A home cooked dinner, sack lunches, and breakfast are provided everyday. Access to shower and laundry facilities are also provided. A congregation hosts guests from 5:30 p.m. to 7:00 a.m. for one week. On Sundays, guests move to a new congregation. Volunteers move guests belongings to the next host congregation.\n\n\nFamily Promise of Gwinnett provides families with a Day Center to use as their home base during their stay. At the Day Center, guests work on self-sufficiency plans and meet with staff. We provide transportation to and from the Day Center and Host Congregations everyday. All guests accepted into the program are eligible to receive the following additional services and assistance:\n\nToiletry items & diapers\nPhone & Internet access\nHousing Searches\nFurniture & Household items\nEmployment Searches\nJob Training\nDay Care Assistance\nClothing\nBudget Management\nCredit Counseling\nParenting & Nutrition Classes\nMedical & Dental Care\nGas Assistance\nAuto Repair/Donation"
  },
  {
    "addressLine1": "555 Hurricane Shoals Rd",
    "city": "Lawrenceville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30046",
    "name": "Quinn House",
    "organization": "Quinn House",
    "phone": "(770) 962-0470",
    "website": "http://www.thequinnhouse.com/",
    "description": "We provide food, clothing, and other assistance to people in need.\n\nPlease call our office at (770) 962-0470 Tuesday - Thursday from 9:00 a.m. to 12:00 p.m. to schedule an appointment.\n\nHow many men do you house?\nIt varies from week to week depending on the time of the year. We can house approximately 24 individuals.\n\nHow much does the program cost?\nThere is never a charge for men and women entering our program. The program is funded entirely by donations.\n\nLocated in downtown Lawrenceville, GA for the past 25 years, The Quinn House was founded by John and Carrol Quinn because they recognized a great need in Gwinnett County for assisting individuals and families on all levels. They began by bringing homeless families into their own home and as their outreach grew, so did The Quinn House. Over those 25 years, The Quinn House is now a multi-task, non-profit Outreach Operation that assists hundreds of people in Gwinnett County and in other areas of the State.\n\n\nOur Residential Program not only provides housing for the homeless, but also offers a 40-day Drug and Alcohol Program to help individuals get back on their feet and re-enter society in a stable and productive way. This Program is free and offers our residents an opportunity to develop a new way of thinking and developing self-esteem, along with decision-making that can lead them to steady employment and independent living again. We have approximately an 80% success rate with our residents for completion of the 40-day Program. At this time there are three homes available for housing of men and women, in addition to women with children in Gwinnett County. While we do not provide housing at our location in South Central Georgia (Washington County), at this time we do provide food, clothing, and furniture to those in need from our thrift store located there."
  },
  {
    "addressLine1": "6601 Zebulon Road",
    "city": "Macon",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31220",
    "name": "Rescue Mission of Middle Georgia",
    "organization": "Rescue Mission of Middle Georgia",
    "phone": "(478) 743-5445",
    "website": "https://www.rescuemissionga.com/",
    "description": "Services:\n1. Men's recovery program.\nHelp the men regain self-sufficiency, no longer controlled by addiction or their past. Since most of residents have addictions, which in most instances led to homelessness, programs are designed to help them focus on recovery.\nRegular chapel services\nReferrals to outside service providers\nWork therapy\nAssistance obtaining housing\nApartment furnishings provided to program graduates\n2. Women's Domestic Violence Program\nWomen's Division is a residential program for female victims of domestic violence and their children. Provide a safe place where women can find healing and regain their independence. The goal with this program is to empower the women to become self-sufficient. Residents gain self-esteem, life skills, Biblical knowledge and learn to recognize the cycle of violence. Most importantly, they find healing and the strength to move forward.The program is designed as a three phase program and requires a six month commitment from anyone entering the program.\n\nAdditional Services:\nDaily meals Holiday community meals with delivery to the elderly and disabled.Distribution of clothing, furniture, and household itemsProvide relief to fire victims\n"
  },
  {
    "addressLine1": "174 Walnut St.",
    "city": "Macon ",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31201",
    "name": "Daybreak center",
    "organization": "Daybreak center",
    "phone": "",
    "website": "mailto:gaye.martel@depaulusa.org",
    "description": ""
  },
  {
    "addressLine1": "501 Marshall Avenue",
    "city": "Warner Robins",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31093",
    "name": "Genesis JOY House Homeless Shelter",
    "organization": "Genesis JOY House Homeless Shelter",
    "phone": "(478) 236-2207",
    "website": "http://www.genesisjoyhouse.com/",
    "description": ""
  },
  {
    "addressLine1": "995 Roswell Street NE, Suite 100",
    "city": "Marietta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30060",
    "name": "Center for Family Resources Housing Assistance",
    "organization": "Center for Family Resources Housing Assistance",
    "phone": "(770) 428-2601",
    "website": "http://thecfr.org/",
    "description": "The Center for Family Resources places families in their own apartments, providing safety and security away from a group shelter environment. CFR's housing programs provide affordable, independent living options that include supportive services like childcare assistance, transportation, budgeting workshops and other life-skills classes. CFR is able to provide these housing services to the community with the partnership and participation from various apartment complexes in Cobb County.\nShort-Term Housing\nCFR's short-term housing program is a temporary \"shelter\" in a fully-furnished two-bedroom apartment for families that are currently or imminently homeless.\nRapid Re-Housing\nOur Rapid Re-Housing program assists currently homeless families in obtaining a permanent place to live by providing financial assistance for deposits, move-in costs and other obstacles toward obtaining an apartment.\n\nTenant-Based Rental Assistance\nThe TBRA program assists families who have a temporary inability to maintain housing. In cases of unexpected financial setback, TBRA can provide assistance to help families stay in their current home or obtain a new lease.\n\nIn order to be admitted into any of our housing programs, you must:\n1. Be a Cobb County resident\n2. Have resided in Cobb County for at least the past two months\n3. Have at least one minor child (under 18) in your household\n"
  },
  {
    "addressLine1": "995 Roswell Street, NE, Suite 100",
    "city": "Marietta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30060",
    "name": "The Center For Family Resources",
    "organization": "The Center For Family Resources",
    "phone": "(770) 428-2601",
    "website": "http://thecfr.org/",
    "description": "Services Provided: Assistance with: Rent, utilities, prescriptions, emergency shelter, employment services, life management skills, budget counseling, and food pantry available.\n\nHours of OperationsMonday: 8:30am - 7:00pmTuesday: 8:30am - 5:00pmWednesday: 8:30am - 5:00pmThursday: 8:30am - 5:00pmFriday: 8:30am - 5:00pm\n\nIntake hours\nare on a first come, first serve basis. You must bring a Picture I.D. and Social Security Card for yourself, and a Social Security Card or Birth Certificate on all household members. You must meet residency requirements and income eligibility.\n\nTypes of Housing Programs\nShort Term Housing\nShort Term Extended Housnig\nTransitional Housing"
  },
  {
    "addressLine1": "1978 Mount Vernon Rd.",
    "city": "Dunwoody",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30338",
    "name": "Family Promise of North Fulton - DeKalb",
    "organization": "Family Promise of North Fulton - DeKalb",
    "phone": "(770) 609-5407",
    "website": "http://www.familypromisenfd.org/",
    "description": "Non-denominational, non-sectarian organization for families in transition. Family Promise links to existing community resources (social service agencies) to more effectively and efficiently work with families. Host congregations provide lodging, meals and hospitality\n\nFamily Promise works with homeless families to tailor individualized plans to help them take the necessary steps toward lasting independence.  Families rotate on a weekly basis between congregations, with congregations hosting for one week a quarter, up to four times per year.\n\nAll Family Promise guest families receive:\n    Overnight accommodations at a local congregation\n    3 meals a day\n    Intensive case management\n    Family Day Center with internet access, laundry, and showers\n    Social support from volunteers\n    Linkage with needed social and educational services\n\nHost Congregations (places of worship that physically house our families each week):\n    Temple Sinai\n    Dunwoody United Methodist Church                              \n    Mount Vernon Presbyterian Church and Bnai Torah\n    St. Lukes Presbyterian Church                                     \n    Roswell United Methodist Church                                  \n    Northminster Presbyterian Church                                   \n    Temple Beth Tikvah\n    Roswell Presbyterian Church\n    Kingswood United Methodist Church\n    Alpharetta Presbyterian Church\n    St. Dunstan's Episcopal Church and Holy Innocent's Episcopal Church\nDay CenterWe have a Day Center where families can come during the day, that has computers, internet access, laundry and shower facilities. We also offer case management, employment resources, and the support of the North Fulton/Dekalb community.\n\n"
  },
  {
    "addressLine1": "461 E. Hancock Street",
    "city": "Milledgeville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31061",
    "name": "The Salvation Army Milledgeville",
    "organization": "The Salvation Army Milledgeville",
    "phone": "(478) 452-6940",
    "website": "http://salvationarmygeorgia.org/milledgeville/",
    "description": ""
  },
  {
    "addressLine1": "PO Box 1372",
    "city": "Redan",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30074",
    "name": "Open Hearts Youth Shelter",
    "organization": "Open Hearts Youth Shelter",
    "phone": "(770) 912-2972",
    "website": "http://www.ypmatlanta.org/",
    "description": "The Open Hearts Youth Shelter is a voluntary, short-term residential emergency shelter and crisis intervention service for youth ages 10-18 years old who have run away from home, have been pushed out of their homes, are homeless or who are acting out and at-risk for abuse. We are located in Lithonia/Stone Mountain border.Open Hearts also provides non-residential alternatives for parent(s), legal guardian(s) and legal custodians who need help with youth behavior problems. No referrals are needed by any youth (or family) and all services are FREE.\n\nOpen Hearts is open 7 days a week, 24 hours a day, 365 days a year, to accept youth and we provide transportation for youth who are in need of a ride to safety. Youth receive food, shelter, health screenings, education assistance, employment assistance as well as group, family and individual counseling, case management and after care services."
  },
  {
    "addressLine1": "640 Hwy 138 SW",
    "city": "Riverdale",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30274",
    "name": "The D.O.R.M. (The Development of Responsible Men)",
    "organization": "The D.O.R.M. (The Development of Responsible Men)",
    "phone": "(770) 997-4517",
    "website": "https://www.heartstonourishhope.org/",
    "description": "The D.O.R.M. (Development of Responsible Men) The DORM opened in March 2011. This 9-bedroom facility provides transitional housing for young adult males aged 18-24. Our primary population for the DORM is males that have recently \"aged out\" of foster care, were released from detention centers or are in a crisis situation.\n\nIn addition to a place to stay, the young men receive classes and sessions that focus on employment readiness, life skills, and group therapy in order to educate them on how to support themselves in becoming self-sufficient. The youth will be afforded up to twenty-four months to transition to a more permanent residence, i.e., apartment, home, college, military, etc. The DORM houses up to eight residents at a time supervised by one live-in staff member."
  },
  {
    "addressLine1": "120 Fahm St",
    "city": "Savannah",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31401",
    "name": "Union Mission Inc.",
    "organization": "Union Mission Inc.",
    "phone": "(912) 236-7423",
    "website": "https://www.unionmission.org/",
    "description": "Provides shelter for men women and families.\n\nTHE GRACE HOUSE\nThe emergency shelter services at Grace House provides temporary shelter to those in immediate need. The emergency shelter stay is 90 days. Grace House has 31 emergency shelter beds available for men. In addition to addressing clients shelter needs, Grace House offers case management and supportive services to address clients' medical, mental health, and employment needs in order to help them permanently end their homelessness.\n\nBEYOND GRACE\nBeyond Grace provides transitional housing support for those who have completed the 90 day emergency services program at Grace House. By providing an additional two years of transitional housing and supportive services, Beyond Grace gives clients additional time to save for a more stable future and increases their chances of success when they leave Union Mission.\n\nTHE PRISON REENTRY PROGRAM\nThe prison reentry program provides shelter and services to previously incarcerated individuals in order to assist with a successful transition to their community after they are released. Clients in the prison re-entry program receive the same supportive services as those enrolled in Grace House's 90 day emergency services program. Upon completing the prison reentry program, the client has the option of transitioning into the standard Grace House program for an additional 90 days of support, if bed space is available.\n\nMAGDALENE PROJECT\nFamily comes first even when you 're homeless. Women and children are the fastest growing population of homeless in America. Union Mission provides emergency shelter to women with children through The Magdalene Project. During the 90-day shelter stay, clients receive supportive services that help put them on the road to self-sufficiency."
  },
  {
    "addressLine1": "3100 Montgomery Street",
    "city": "Savannah ",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31405",
    "name": "Salvation Army Homeless Shelter Savannah",
    "organization": "Salvation Army Homeless Shelter Savannah",
    "phone": "(912) 651-7420",
    "website": "http://www.salvationarmy-georgia.org/",
    "description": "Homeless Shelter At Location. Can arrange for extended stays in order to gain self-sufficiency.  365 day a year emergency shelter for men, women and children.\n\nHours:\nMondays through Sundays intake starting 4:00 pm\n\nOffice hours: Mondays through Fridays8:00 am - 5:00 pm.\n\nThe emergency shelter and transitional housing programs provide lodging, meals, personal hygiene items, clothing, employment assistance and casework services with in-depth assessment of circumstances that led to homelessness. The Salvation Army Case Managers work one-on-one with each resident to formulate a plan toward self-sufficiency and stable housing."
  },
  {
    "addressLine1": "124 Arnold St",
    "city": "Savannah",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31401",
    "name": "Inner City Night Shelter",
    "organization": "Inner City Night Shelter",
    "phone": "(912) 232-4673",
    "website": "http://icns-sav.com/",
    "description": "Emergency Shelter for Women Sojourner is the emergency shelter program for adult women who are homeless. This facility provides safe place to shower, eat a meals, and rest for the night for homeless women.\n\nEmergency Shelter for Men Safe Haven is a place for homeless men to spend the night, take a shower, and eat meals.\n\n\nIndividual Case Management will address the challenges in the individual's life. After their challenges are identified they are provided access to the programs and help they need. We have aided many men and women move beyond drug addiction, alcoholism, mental illness to stabilize their lives.\n\nTransitional Housing is the next step in moving an individual to becoming more independent. Mens Transitional is the transitional program for adult men, and ABIDE is the transitional program for adult women.\n\n\nPrison Reentry is a program that provides an address and place to stay for former inmates to avoid homelessness. We have separate prison reentry programs for men and women.\n\n\n\nShelter: 6:00 pm to 7:00 am MON - SUN\nMeals: 4:30 pm to 6:00 pm daily\nShowers: noon to 1:00 pm MON WED FRI\n\nIntake hours: walk-in before 4:00 pm\nEligibility: single homeless males regardless of sobriety\n\nOther services provided: Bathing Facilities, Community Clinics, Community Shelters for Men, Community Shelters for Substance Abusers, Community Shelters for Women, Homeless Drop In Centers, Soup Kitchens"
  },
  {
    "addressLine1": "19 Santee Lane",
    "city": "Beaufort",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "29906",
    "name": "Streets of America Homeless Outreach",
    "organization": "Streets of America Homeless Outreach",
    "phone": "(843) 592-1001",
    "website": "http://www.streetsofamericaministry.com/",
    "description": "Streets of America Homeless Outreach Mission is a Mobile Outreach Mission providing Food and Clothes to our homeless living under bridges, in Alleys, out in the wooded area's of the city or Towns. Streets of America Homeless Outreach Ministry has been working the streets of Beaufort County SC, Charleston SC, Savannah Ga, And Atlanta Ga. Though we can not provide a shelter over their heads for a night we can make sure they don't go hungry, Naked, or Cold. We try to get donations for Food, Clothes, Sleeping Bags, Blankets, Tents etc, so our homeless have a temporary shelter until they can find one down the road. We are a Mobile Mission. Shelters can contact us and we will use you as a contact location when we are in your area. Thank You. Our Homeless need your help, so please help us. May the Lord Bless."
  },
  {
    "addressLine1": "201 Martin Luther King Jr Dr",
    "city": "Statesboro",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30458",
    "name": "Open Hearts Community Mission",
    "organization": "Open Hearts Community Mission",
    "phone": "(912) 623-2528",
    "website": "http://ohcm.org/",
    "description": "The Mission shares the Gospel of Jesus Christ by extending a hand-up, not a hand-out to our Friends and Neighbors. Residents of the Mission must have a job. If they do not have a job, their job is to get a job. In the meantime they must work day labor. All net earnings are deposited in the residents personal savings account. This program does not costs the individual anything; it costs them everything. It is open only to those who are willing to work, to save their earnings and to move forward in life. Male residents must be able to lift 50 lbs.; women must be able to lift 35 lbs. All residents have a Case Manager, Mentor and Life Skills Coach. Together with the resident they craft the goals, markers and duration of program. Recipients of public benefits are not eligible for the program. The Mission does not provide clinical services nor offer convalescence services."
  },
  {
    "addressLine1": "50 Eleanor Rd.",
    "city": "Summerville",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30747",
    "name": "Hope Rebirth Homeless Shelter",
    "organization": "Hope Rebirth Homeless Shelter",
    "phone": "(706) 857-4804",
    "website": "mailto:hoperebirth@windstream.net",
    "description": "We are a 501c3 nonprofit homeless shelter for families,single guys and vets.We have a structure program to assist in getting back on their feet.\n\nWe are a homeless shelter for family's and single men,we are also a day time shelter. We are a nonprofit organization, completely church and community funded. We do not have any pay roll it is strictly volunteer operated.\n\n\nHope Rebirth exists to restore lives, redeem Adults and return families home. Using a holistic approach, Hope Rebirth seeks to empower homeless Adults and children to regain control over their lives, to attain self sufficiency and to obtain permanent housing.Funding: Operating cost will be met by donations from the community, businesses, and churches. We will have an in-house yard sale and these proceeds will help with day to day needs. All proceeds go directly to Hope Rebirth; there is no payroll. This effort is a total Christian-based out reach. We will be doing fundraisers from time to time. We would love to come to your church and/or organization and make a presentation of Hope Rebirth.Please call and we will set a time. Come and visit us and see what GOD is doing in your community. We need and welcome volunteers and donations for Hope Rebirth.Community Building; There is no better way to help people than getting to know them first. The key to solving social problems is human understanding. Adopt-A-Block is an outreach program designed to do exactly that. It's boots-on-ground, door-to-door outreach, tireless. lost-cost and effective.Once the community sees who we are and what we're about, we're able to get more personal information and begin to assist in many different ways. Our greatest desire is to truly have a relationship with folks so that they desire to bring change as well, in whatever way that's possible.If you're able to connect with someone, then solutions are easier to come by. In a community that's been labeled many different names, we have an opportunity to be part of it's Rebirth. This community is rich with wisdom and knowledge, but it has to be brought out. We'll do this by knocking on doors, saying hello, and beginning a relationship that will hopefully last a lifetime. So come and join Our Good Works."
  },
  {
    "addressLine1": "PO Box 1713",
    "city": "Suwanee",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "30024",
    "name": "Maranatha House Ministries, Inc.",
    "organization": "Maranatha House Ministries, Inc.",
    "phone": "(678) 725-1146",
    "website": "mailto:maranathahouseministries@gmail.com",
    "description": "Situated on 33 acres in Northeast Georgia, Maranatha House is the first and only female head-of-household transitional shelter offering stays of up to one year. Located in Gwinnett Count, the facility offers housing for up to forty families and relies solely on private funding and donations for its operating budget.\n\nOUR PROGRAM BREAKING THE CYCLE OF POVERTY\nPAVING THE ROAD TO SELF-SUFFICIENCY\nMaranatha House Ministries [MHM] becomes the accountability team our residents partner with on their road to self-sufficiency. Each female head -of-household residing at MHM agrees to:\nMaintain employment and/or attendance in workplace re-education courses\nAttend mandatory weekly classes and support groups\nEnsure school-aged children attend school and MHM University, Jr. programming\nWork with assigned case manager on goals and objectives identified in individual sustainability plan.\n\nResidents are empowered to be accountable for their participation in MHM programs. We believe that with a commitment of conditional support, our residents have a greater chance of life-long success."
  },
  {
    "addressLine1": "714 Charlton St.",
    "city": "Valdosta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31601",
    "name": "LAMP - New Horizons Dev. Center",
    "organization": "LAMP - New Horizons Dev. Center",
    "phone": "(229) 245-7157",
    "website": "http://lampinc.org/",
    "description": "Day Center and Emergency Shelter for single men, single women, & families with children.\n\nServices offered to the homeless: assistance with obtaining ID's, clothing, housing search assistance, community resource referrals, case management, life skills classes (budgeting, resume writing, job interview skills, parenting, stress management, time management & computer skills classes), day center with shower facility, laundry access, hygiene kits, & client computer lab. Intakes are accepted 24 hours a day, please call first for availability & criteria."
  },
  {
    "addressLine1": "317 Virginia Ave",
    "city": "Valdosta",
    "state": "Georgia",
    "stateAbbreviation": "GA",
    "postal": "31601",
    "name": "The Salvation Army - Emergency Men's Shelter",
    "organization": "The Salvation Army - Emergency Men's Shelter",
    "phone": "(912) 651-7420",
    "website": "https://salvationarmygeorgia.org/Valdosta/",
    "description": ""
  }
]