[
  {
    "addressLine1": "444 S Main Street, Suite A4",
    "city": "Cedar City",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84720",
    "name": "Canyon Creek Services",
    "organization": "Canyon Creek Services",
    "phone": "(435) 867-9411",
    "website": "https://www.canyoncreekservices.org/",
    "description": "Domestic Violence Women's Shelter\nWe also have an Outreach Center where our main offices are outside of the shelter for those that do not need shelter but may need legal assistance or resources.\n\nThe mission of the Canyon Creek Women's Crisis Center (CCWCC) is to provide free, confidential help for survivors of domestic violence, sexual assault, and victims of crime. We provide 24 hour crisis intervention, emergency services to assist survivors in escaping abuse, breaking the cycle of violence, and supporting them through their healing journey. We also collaborate with the community in an effort to end domestic violence and provide preventative education throughout our service area of Iron, Beaver, and Garfield counties."
  },
  {
    "addressLine1": "222 West 900 North",
    "city": "Cedar City",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84720",
    "name": "Iron County Care and Share",
    "organization": "Iron County Care and Share",
    "phone": "(435) 586-4962",
    "website": "http://careandshare-ut.org/",
    "description": "ICCS is a non-profit agency. Our mission is to provide our neighbors with basic necessities of food, shelter and clothing. In order to accomplish this, ICCS provides resources for the economically disadvantaged by committing to:\n\n- Provide temporary housing to the needy with emphasis on transients.\n\n- Distribute donated food and government commodities to those in need.\n- Provide accessibility to showers, clothing and hygiene items for the needy.\n- Prepare daily hot meals and sack lunches to feed those in need.\n- Provide emergency assistance to the needy in extenuating circumstances.\n- Offer transitional housing.\n- Cooperate with other charitable organizations, agencies, and groups to offer those in need the services that ICCS does not provide.\n- Educate and inform the community about poverty issues\n\nThe food donated to (and distributed through) ICCS comes from a variety of sources, including state and local food manufacturers, distributors and retailers. Community, corporate and/or individual food drives contribute an essential mix of products for our agencies.\n"
  },
  {
    "addressLine1": "340 E Tabernacle Street",
    "city": "Saint George",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84770",
    "name": "Youth Futures St. George",
    "organization": "Youth Futures St. George",
    "phone": "(801)-528-1214",
    "website": "https://www.youthfuturesutah.org/",
    "description": "Services are available to all youth ages 12-18.\nSafe Shelter:\nDoors are open 24 hours/day for youth needing safe shelter.\n\nDrop-In Services:\nDaytime services, or \"drop-in\" hours are 6:30am-8pm when youth may access all of the resources provided at the shelter, including food, clothing, hygiene and school supplies, and programming. Meals are served and available for all youth at 6:30 am, 12 pm, and 5pm."
  },
  {
    "addressLine1": "529 W. 9th Ave,",
    "city": "Midvale",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84047",
    "name": "The Road Home - Midvale Family Resource Center",
    "organization": "The Road Home - Midvale Family Resource Center",
    "phone": "(801) 569-1201",
    "website": "https://www.theroadhome.org/",
    "description": " Serving families with children. The Midvale Family Center is open year-round.\nThe Road Home operates our community's low-barrier shelters, meaning there are no requirements to connect to no-cost services including a bed, showers, clothing, blankets, diapers, personal toiletries, etc. We do not maintain a waiting list and provide access to our Midvale Family Center 24 hours/day, 365 days/year (including holidays).We focus on making episodes of homelessness rare, brief, and nonrecurring by providing housing-focused services and support during a short-term shelter stay. Case managers assist in connecting people with public benefits, substance abuse treatment, mental health assessment and treatment, job training and development, and housing assistance. We work to identify clients who are unable to exit shelter and help clients connect to additional supports and permanent housing opportunities as applicable as well as to onsite resources, including Valley Behavioral Health, Department of Workforce Services, and the Veterans Administration."
  },
  {
    "addressLine1": "3380 S 1000 W",
    "city": "South Salt Lake",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84101",
    "name": "The Road Home - South Salt Lake Men's Resource Center",
    "organization": "The Road Home - South Salt Lake Men's Resource Center",
    "phone": "(801) 359-4142",
    "website": "https://www.theroadhome.org/",
    "description": "Serving single men. The Men's Resource Center is open year-round.\nThe Road Home operates our community's low-barrier shelters, meaning\n\nthere are no requirements to connect to no-cost services including a\nbed, showers, clothing, blankets, diapers, personal toiletries, etc.\n\nWe do not maintain a waiting list and provide access to our Salt Lake\nCommunity Shelter 24 hours/day, 365 days/year (including holidays).\n\nWe focus on making episodes of homelessness rare, brief, and\nnonrecurring by providing housing-focused services and support during a\nshort-term shelter stay. Case managers assist in connecting people with\npublic benefits, substance abuse treatment, mental health assessment and\n\ntreatment, job training and development, and housing assistance. We\nwork to identify clients who are unable to exit shelter and help clients\nconnect to additional supports and permanent housing opportunities as\napplicable as well as to onsite resources, including Valley Behavioral\nHealth, Department of Workforce Services, and the Veterans\nAdministration."
  },
  {
    "addressLine1": "1165 South State Street",
    "city": "Salt Lake City",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84111",
    "name": "Rescue Mission of Salt Lake - Rescue Haven",
    "organization": "Rescue Mission of Salt Lake - Rescue Haven",
    "phone": "(801) 521-5925",
    "website": "http://www.facebook.com/rescuesaltlake",
    "description": "shelter for women and children."
  },
  {
    "addressLine1": "999 S. Main Street",
    "city": "Salt Lake City",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84111",
    "name": "The Road Home - Palmer Court",
    "organization": "The Road Home - Palmer Court",
    "phone": "801-505-7777",
    "website": "http://www.theroadhome.org/",
    "description": "Provides affordable permanent housing for formerly homeless individuals and families. The Road Home's Palmer Court is a permanent supportive housing development with 201 units for chronically homeless single men, women and families with children.\n\nPalmer Court is Salt Lake's newest and largest supportive housing development with 201 units for chronically homeless single men, women and families with children. This renovated hotel includes studio, 1 & 2 bedroom apartments which provide permanent housing for those who have turned to the sheltering system as a long-term housing option. Palmer Court amenities include air conditioning, secured parking, on-site laundry, exercise rooms, a computer lab, library and game room, lounge areas, and a courtyard with a playground and basketball court."
  },
  {
    "addressLine1": "814 West 800 South",
    "city": "Salt Lake City",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84165",
    "name": "Family Promise of Salt Lake",
    "organization": "Family Promise of Salt Lake",
    "phone": "(801) 961-8622",
    "website": "https://familypromisesaltlake.org/",
    "description": "Family Promise Salt Lake is an organization that helps families experiencing homelessness. It networks with local churches to provide shelter at night and on the weekends. There is also a Day Center that is open to families in our program during the day, so that 24 hours a day there is somewhere safe for them to be."
  },
  {
    "addressLine1": "409 West 400 South",
    "city": "Salt Lake City",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84101",
    "name": "Fourth Street Clinic",
    "organization": "Fourth Street Clinic",
    "phone": "(801) 364-0058",
    "website": "https://fourthstreetclinic.org/",
    "description": ""
  },
  {
    "addressLine1": "463 South 400 W",
    "city": "Salt Lake City",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84101",
    "name": "Rescue Mission of Salt Lake",
    "organization": "Rescue Mission of Salt Lake",
    "phone": "(801) 355-1302",
    "website": "http://www.rescuesaltlake.org/",
    "description": "The Rescue Mission of Salt Lake is a faith-based emergency shelter and recovery center. We offer three meals a day, free clothing, showers, laundry facilities, day shelter during inclement weather and a place to sleep every night of the week for men and women. We also run the year-long New Life recovery program, designed to get people off the streets and into housing, employment and sobriety. Services for women and children are at 1165 South State Street, phone: 801-521-5925"
  },
  {
    "addressLine1": "2781 Wall Avenue",
    "city": "Ogden",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84401",
    "name": "Ogden Rescue Mission",
    "organization": "Ogden Rescue Mission",
    "phone": "(801) 399-3058",
    "website": "https://ogdenrescuemission.org/",
    "description": "Services:\nMeals prepared and served to the poor and needy men, women, and children who come to the doors seeking help.\nEvening nondenominational chapel services.\nResidential rehabilitation program for those with addictive behaviors.\nFree medical and dental care for shelter and local residents staffed by volunteer health professionals.\n\nThe Mission Thrift Store on Wall Avenue, which helps local needy families and provides jobs for the residents in the rehabilitation program.\n\n"
  },
  {
    "addressLine1": "269 W. 33rd Street",
    "city": "Ogden",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84401",
    "name": "Lantern House Shelter",
    "organization": "Lantern House Shelter",
    "phone": "(801) 621-5036",
    "website": "https://www.stannescenter.org/",
    "description": "Lantern House exists to aid the poor, needy and homeless by providing them food, shelter, and critical emergency services. We provide a hand up rather than a hand out. Our goal is to transition residents from shelter to housing; encouraging their sense of independence, self-sufficiency and self-confidence. We are committed to carry out this mission while treating those who come to us with compassion, dignity, and respect.\n\nShelter\nAccommodations for men, women, and families.\n    Check-In times for residents is 6:00pm - 9:00pm\n    Nightly Check-In time 10:00pm\n    Pets are also welcome\n\n\nHousing Placement\nCase management services are available to all who choose to stay.\n\nSoup Kitchen\nCommunity breakfast and lunch is provided every day from 7:00am - 8:00am and 12:00pm - 1:00pm. Anyone is welcome to join! Dinner served nightly for Lantern House Residents.\n\nOther\nBasic essential services provided to anyone in need, hygiene kits, clothing, diapers etc. Assists people in obtaining birth certificates, ID's, bus tokens, health care, etc."
  },
  {
    "addressLine1": "2760 Adams Ave",
    "city": "Ogden",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84403",
    "name": "Youth Futures",
    "organization": "Youth Futures",
    "phone": "(801) 528-1214",
    "website": "http://youthfuturesutah.org/",
    "description": ""
  },
  {
    "addressLine1": "700 Round Valley Drive #115",
    "city": "Park City",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84060",
    "name": "Peace House",
    "organization": "Peace House",
    "phone": "(435) 658-4739",
    "website": "https://peacehouse.org/",
    "description": "Peace House is a non-profit organization that provides an emergency shelter for individuals and families that are fleeing sexual assault and/or domestic violence. Peace House offers a confidential and safe environment with caring and knowledgeable staff, available 24 hours a day, that provides much needed support to these victims. All services provided are free of charge.\nAdditionally, while staying at the shelter, individuals will meet with a caseworker, will develop safety plans, look for jobs, work on action plans so that they can become self-sufficient, find resources so that they can get financial support and permanent housing and much more.\nShelter Services:\nPersonal advocacyCourt advocacyCase managementIndividualized safety planningOnsite clinical servicesDomestic violence support groupsLife skills classesImmediate needs assistance24 HOUR HELPLINE:Please contact (800) 647-9161\n\n\n\n\n\n\n\n"
  },
  {
    "addressLine1": "299 E 900 S",
    "city": "Provo",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84062",
    "name": "Provo Homeless Shelter - Food and Care Coalition",
    "organization": "Provo Homeless Shelter - Food and Care Coalition",
    "phone": "(801) 373-1825",
    "website": "https://foodandcare.org/",
    "description": "Now provides Transitional Housing. Visit the website provided or call the phone number provided for details.\n\n\nServing the homeless community of Utah County by providing much needed resources for food, showers, laundry, hygiene, and other basic necessities.\n\nHours\nMon: 8:30 am - 5:30 pm\nTue: 8:30 am - 1:00 pm, 3:30 pm - 5:30 pm\nWed: 8:30 am - 5:30 pm\nThu: 8:30 am - 1:00 pm, 3:30 pm - 5:30 pm\nFri: 8:30 am - 5:30 pm\nSat: 12:00 pm - 5:30 pm\nSun: 1:00 pm - 2:00 pm"
  },
  {
    "addressLine1": "948 N 1300 West",
    "city": "Saint George",
    "state": "Utah",
    "stateAbbreviation": "UT",
    "postal": "84770",
    "name": "Switchpoint",
    "organization": "Switchpoint",
    "phone": "(435) 628-9310",
    "website": "https://switchpointcrc.org/",
    "description": "Intake 24/7 Case Management by Mon-Fri 9-5 or by appointment.\nBeyond an emergency shelter, Switchpoint Community Resource Center\n\noffers individualized case management to connect those experiencing\nhomelessness and poverty to the resources they need to move to\nself-reliance.\nServices Mondays through Fridays 9am to 4pm.\nDinner served at 6pm.\n\nPantry Hours\n\nMonday: Clients with LAST name A-F (11 a.m. - 5 p.m.)\nTuesday: Clients with LAST name G-L (11 a.m. - 5 p.m.)\nWednesday: Clients with LAST name M-R (11 a.m. - 5 p.m.)\nThursday: Clients with LAST name S-Z (11 a.m. - 5 p.m.)\nFriday: Seniors ages 62+ ONLY (11 a.m. - 5 p.m.)\n\n\n\nServices We Offer\nClean, safe emergency living quarters\nShowers\nOn-site laundry facility\nNutritious meals served daily\nOn-site computers for obtaining GED, job searching, computer skills and resume building.\nOn-site case management for every client\nAssistance obtaining lost or stolen identification\nAccess to employment searching programs\nTransportation vouchers\nAssistance with applications and eligibility processes for Food Stamps, Medicaid, etc.\nAssistance with obtaining affordable housing\nFood assistance through on-site food pantry"
  }
]