[
  {
    "addressLine1": "105 North Seminary Street",
    "city": "Barre",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05641",
    "name": "Good Samaritan Haven",
    "organization": "Good Samaritan Haven",
    "phone": "(802) 479-2294",
    "website": "http://www.goodsamaritanhaven.org/",
    "description": "The Good Samaritan Haven is an overnight emergency homeless shelter serving single men and women, and is the only homeless shelter in the area. Half of all guests are from Washington County, a quarter come from other areas of Vermont and the remainder are from the rest of the country. Whether passing through or looking to settle again soon, all are welcomed and there is no charge for any services.\n\nIn 2009, we served over 4,500 meals, provided support services, hope and opportunity to over 325 people and assisted more than 75 people in obtaining or remaining in affordable housing. It's easy to be a \"Good Samaritan\" in Central Vermont."
  },
  {
    "addressLine1": "69 Main street",
    "city": "Vergennes",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05491",
    "name": "John W. Graham Shelter",
    "organization": "John W. Graham Shelter",
    "phone": "(802) 877-2677",
    "website": "https://twitter.com/jg_shelter",
    "description": ""
  },
  {
    "addressLine1": "Main Street",
    "city": "Franconia",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "03580",
    "name": "The Bancroft House",
    "organization": "The Bancroft House",
    "phone": "(603) 823-8842",
    "website": "http://thebancrofthouse.com/",
    "description": ""
  },
  {
    "addressLine1": "745 Hartford Avenue",
    "city": "White River Jct",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05001",
    "name": "Upper Valley Haven",
    "organization": "Upper Valley Haven",
    "phone": "(802) 295-6500",
    "website": "https://twitter.com/uvhaven",
    "description": "Upper Valley Haven is a food pantry.\n\nFood pantry service hours: Mondays through Fridays 8 am - 4 pm. .\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "95 North Avenue",
    "city": "Burlington",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05401",
    "name": "Committee on Temporary Shelter",
    "organization": "Committee on Temporary Shelter",
    "phone": "802-864-7402",
    "website": "http://cotsonline.org/",
    "description": "COTS is able to shelter fifteen families at a time between our two family shelters, which are the only Family Shelters in Chittenden County.  Both are staffed 24 hours a day, 365 days a year. Families can stay for up to six months while they work with COTS staff to find affordable housing, employment, childcare, and healthcare. Families are also expected to save 40% of their income while staying at COTS.\n\nChildren raised with housing instability are often at the greatest risk of becoming homeless themselves. With that in mind, we take a long-term approach to homelessness prevention with our children's programming in shelter. We aim to effectively intervene now to stabilize parents and children, help them build new skills, and stop homelessness from happening in the future.\n\n\nHomelessness is not just a financial crisis but also an early education issue. Last year, the U.S. Department of Education ranked Vermont as one of 10 states with the fastest-growing number of homeless schoolchildren. COTS has implemented additional support for children, including:\nCOTS' Children's Education Advocate enrolls children in family shelter in quality early learning, preschools, after-school, and summer camp enrichment programs. These relationships arranged in shelter continue after families move into permanent housing. We coordinate volunteer-based learning activities, including field trips, arts projects, and the COTS book buddies literacy initiative. We also work with the University of Vermont Early Education Enrichment program to provide academic support and partner with the Burlington School District on tutoring in shelter.\n\nOur AmeriCorps Children's Programming Specialist teaches children about nutrition and wellness. This year, we started Vermont's first after-school snack program in a family shelter. The AmeriCorp member also promotes physical activity and healthy choices.\n\n\n In 2014, 78 families, including 127 children, stayed in emergency shelter.  Please note that our shelters are consistently full with a waiting list.\nTo inquire about shelter availability, please call the Main Street Family Shelter at 864-2651."
  },
  {
    "addressLine1": "113 Elmwood Avenue",
    "city": "Burlington",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05401",
    "name": "The Committee on Temporary Shelter - Daystation and Waystation",
    "organization": "The Committee on Temporary Shelter - Daystation and Waystation",
    "phone": "(802) 864-7402",
    "website": "http://cotsonline.org/our-mission/cots-shelters/",
    "description": "Daystation\nThis daytime drop-in shelter is open 365 days a year seven days a week, from 9 a.m. to 5 p.m. It offers a refuge from the streets and access to an array of services and medical care. This is where individuals can meet with COTS staff and connect with local resources, receive mail and telephone calls, and find support toward their goal of self-sufficiency. Daystation staff provide support, assistance and referrals, as well as educational and recreational opportunities whenever possible.\n\nThe Daystation provides a free noontime meal each day. We are always looking for community members to help provide this critical service.\n\n\nWaystation For shelter bed availability, check in at 9am at the COTS Daystation: 113 Elmwood Ave., Burlington. After 6 p.m., call the Waystation at 862-7776\n\n\nMore Details: Provides a 36 bed shelter for men and women, ages 18 and older, who have no other place to sleep at night except for the streets. Individuals are expected to save 70% of their income while staying in COTS shelter. Located on lower Church Street in downtown Burlington."
  },
  {
    "addressLine1": "89 North Street",
    "city": "Burlington",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05401",
    "name": "ANEW Place",
    "organization": "ANEW Place",
    "phone": "(802) 862-9879",
    "website": "https://www.anewplacevt.org/",
    "description": "ANEW Place is a transitional housing shelter with 25 beds, for those experiencing homelessness within the local Burlington community.\n\nThey help by providing a continuum of support services for their guests staying at their shelter, helping them to make a a successful, sustainable transition toward wellness and self-sufficiency.\n\n\nIf you are interested in staying here, please contact us through our website.\n"
  },
  {
    "addressLine1": "60 Institute Road",
    "city": "Burlington",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05401",
    "name": "BTV SHELTER - ANEW Place",
    "organization": "BTV SHELTER - ANEW Place",
    "phone": "(802) 540-1095",
    "website": "https://www.anewplacevt.org/",
    "description": "Location: Due to COVID 19 we moved shelter operations to North Beach Campground: 60 Institute Road, Burlington.\nWith 27 campers onsite this provides a safer environment that encourages social distancing for both staff and guests.\n\nHours of Operation: 24/7\n\nMeal Providers.\nAs part of Vermonts Stay Home/Stay Safe efforts during the COVID 19 crisis,  ANEW Place will be preparing and distributing all meals internally beginning on Monday, April 13.   Case Manager Brian Hofmann, a sous-chef before entering social work, will be overseeing the process. Were thankful to the Rock Point Retreat Center for graciously allowing us to utilize their commercial kitchen during this season.  In lieu of providing a meal, you can donate the funds to prepare a meal."
  },
  {
    "addressLine1": "4 Island St.",
    "city": "Bellows Falls",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05101",
    "name": "Our Place Drop-In Center",
    "organization": "Our Place Drop-In Center",
    "phone": "(802) 463-2217",
    "website": "https://www.ourplacevermont.org/",
    "description": "day shelter for homeless and families in need."
  },
  {
    "addressLine1": "365 Summer Street",
    "city": "Springfield",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05156",
    "name": "Springfield Family Center Food Pantry and Meals Pick Up",
    "organization": "Springfield Family Center Food Pantry and Meals Pick Up",
    "phone": "(802) 885-3646",
    "website": "http://www.springfieldfamilycenter.com/",
    "description": "Community Food Shelf by appointment.\nOpen to those in Springfield, North Springfield and Baltimore, and those who are homeless.\nIncome eligibility and proof of residency are required.\n\nThe food shelf may be accessed once every seven days, and is meant to supplement the existing food budget of a individual or family.\nHours:\nMonday, Tuesday and Friday 9:00 a.m.- 11:30 a.m. and 12:30 a.m. to 12:30 p.m.\n\nTake Out Community Meals:\nMonday through Friday 11:30 a.m. to 12:30 p.m."
  },
  {
    "addressLine1": "81 Royal Rd",
    "city": "Brattleboro",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05301",
    "name": "Morningside Shelter",
    "organization": "Morningside Shelter",
    "phone": "(802) 257-0066",
    "website": "https://groundworksvt.org/",
    "description": "Morningside is the only homeless shelter in southeastern Vermont to specialize in housing placement with ongoing staff support and life skills development for both families and individuals. Morningside is located at 81 Royal Road (formerly Morningside Dr), just a quarter-mile south of downtown Brattleboro, Vermont.Morningside recently completed an expansion project - two new bedrooms and more living space - bringing our capacity to 33 beds for homeless individuals and families."
  },
  {
    "addressLine1": "17 Lamson St",
    "city": "Keene",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "03431",
    "name": "Hundred Nights Inc",
    "organization": "Hundred Nights Inc",
    "phone": "(603) 352-5197",
    "website": "http://www.hundrednightsinc.org/",
    "description": "Hundred Nights Cold Weather Shelter is open from mid-November to mid-April.\nThere are 26 bunk beds in a dormitory style setting on the second floor.\nCheck in each night begins at 6:45 pm.\n\nAll guests must be in by 9:45 pm, lights out is at 10 pm. Guests leave each morning by 7 am. During the shelter season there is a breakfast program available at a nearby church. The Open Doors Resource Center opens during shelter season at 8:30 am and is open until 4 pm.\n\nLunch is available at noontime. Laundry facilities are available, but must be signed up for ahead of time. The Center is the rest of the year as well, although the hours change to 9 am to 3pm. Evening dinner is served on weekends from 4:45 to 5:45 pm."
  },
  {
    "addressLine1": "Elm Street",
    "city": "Keene",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "00000",
    "name": "Keene Family Shelter",
    "organization": "Keene Family Shelter",
    "phone": "(603) 357-1654",
    "website": "https://twitter.com/keenehousing",
    "description": ""
  },
  {
    "addressLine1": "20 Kingman Street",
    "city": "Saint Albans",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05478",
    "name": "Samaritan House - Tim's House",
    "organization": "Samaritan House - Tim's House",
    "phone": "(802) 527-0847",
    "website": "https://www.cvoeo.org/samaritan-house",
    "description": "Samaritan House Inc., is a non-profit organization that provides emergency shelter and transitional housing to people without other options or resources within the Vermont counties of Franklin and Grand Isle.\nCost:\nThey do not charge people to stay in one of the shelters. They require guests to save a portion of their income while they stay sheltered. Those savings are kept in a secure area and released to the guests once they move on to stable housing.\nAdditional Information:\nGuests are free to come and go as needed.\nThey serve both individuals and families.\n\n\n\n\n\n"
  },
  {
    "addressLine1": "31 Park Street",
    "city": "Rutland",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05701",
    "name": "Rutland Open Door Mission",
    "organization": "Rutland Open Door Mission",
    "phone": "(802) 775-5661",
    "website": "https://www.openingdoormission.com/",
    "description": "The Mission is dedicated to providing meals and shelter to those in need.\n\nThe Mission is a place where the less fortunate may get a hot meal and a warm bed 365 days a year. Last year the Mission provided 37,000 meals and 14,000 bed nights to the disenfranchised of Vt., among whom 89% are veterans who served their country with honor. The Mission is primarily financed by it's thrift store, its once a year appeal and a yearly golf tournament. The Mission funding does not go on the ballot at election time. The Mission strives to operate as a self-sufficient, independent shelter."
  },
  {
    "addressLine1": "95 Crescent Street",
    "city": "Rutland",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05701",
    "name": "The Dodge House - For Veterans",
    "organization": "The Dodge House - For Veterans",
    "phone": "(802) 775-6772",
    "website": "http://www.gmvevac.com/dodge-house.html",
    "description": "The Dodge House, located at 95 Crescent Street in Rutland, Vermont, is a transitional housing project administered by the Veterans Assistance Office, Inc. (VAO). Since 1998, The Dodge House was the first transitional housing program in Vermont that is specific to Veterans who are homeless.\n\nOur goal is to provide Veterans a base to get their feet back on the ground in the community they volunteered to serve and defend. We provide supportive services during the Veteran's stay at the Dodge and as they eventually move to stable permanent housing in Vermont.\n\n\nSupportive services include: shelter, employment counseling, job search, financial literacy, educational opportunities and peer networking. These services are provided at no cost to our residents. Referrals to the program at The Dodge House come from the Veterans themselves, friends of Veterans, service organizations, substance abuse treatment centers, emergency homeless shelters, faith based services, Veterans Administration and various other support agencies that come in contact with the Veteran. The Dodge House has had numerous successful residents who have completed their stay here and moved on to further their education, start their own business or simply assimilate into the community as productive members of that community. We do have strict requirements that all residents are drug and alcohol free. For more information about the Dodge House, or if you would like an application please give us a call"
  },
  {
    "addressLine1": "69 Main St.",
    "city": "North Springfield",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "05150",
    "name": "North Springfield Warming Shelter",
    "organization": "North Springfield Warming Shelter",
    "phone": "(802) 886-8107",
    "website": "http://nsbcvt.org/",
    "description": "6:30PM - 6:30AM, open in winter only November 15 through April 15th."
  },
  {
    "addressLine1": "Main Street",
    "city": "Claremont",
    "state": "Vermont",
    "stateAbbreviation": "VT",
    "postal": "03743",
    "name": "Sullivan County Housing Coalition",
    "organization": "Sullivan County Housing Coalition",
    "phone": "(603) 542-2448",
    "website": "http://www.scshelps.org/",
    "description": "Southwestern Community Services, Inc. Homeless Services Program provides direct and immediate care to individuals and families experiencing homelessness or who are on the verge of becoming homeless in Cheshire, Sullivan, and Western Hillsboro counties. We are able to do this through the following programs\n\nEmergency Shelter\nSouthwestern Community Services (SCS) has short term emergency shelter to assist families and individuals who have a housing crisis. These shelters can be accessed 24 hours a day, 365 days a year. There are over 120 beds in Cheshire and Sullivan counties.\n\nUpon entering the emergency shelter program, consumers receive comprehensive case management to aid them in reaching and maintaining self-sufficiency. The goal is to transition individuals and families back into their communities into safe affordable housing.\n\nCase Management\nComprehensive case management includes:\nDaily/weekly meetings with Case Manager\nNeeds and Goals assessments\nReferrals and support for substance abuse and mental health treatment\nBudget counseling and savings program\nLife skills workshops to include parenting, nutrition, time management, family planning\nOff-site referrals to job readiness training\nTelephone and computer access\nTenancy 101 courses\n"
  }
]