[
  {
    "addressLine1": "2520 Minnesota Ave",
    "city": "Billings",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59101",
    "name": "Montana Rescue Mission Women's and Children's Shelter",
    "organization": "Montana Rescue Mission Women's and Children's Shelter",
    "phone": "(406) 259-3105",
    "website": "http://montanarescuemission.org/",
    "description": "The Montana Rescue Mission Women's and Children's Shelter, located at 2520 Minnesota Ave, serves single women, and women with children.  We also provide assistance to intact families. Three nutritious meals a day are served in our dining room for shelter guests only.  Upon check-in, guests receive essential hygiene products and emergency clothing.  A public shower facility is available, to Women and Children only, Monday thru Friday 9:00am -11:00am and 2:00pm-4:00pm.  All services are free of charge.\n\nIn addition to Emergency Shelter, we offer our guests a wide variety of programs to help make their stay with us productive by providing vital tools to overcome the causes of their homelessness. We offer classes in parenting, life skills, anger management, proper nutrition and food preparation, conflict resolution, addiction counseling, and spiritual development.  In addition, there are educational opportunities to improve skills and a dedicated computer lab that can be used for resume preparation, job searches and GED preparation. Chapel services are offered on a regular basis and staff are available for one-on-one counseling.\n\nWe are available 24 hours a day."
  },
  {
    "addressLine1": "2520 1st Ave No",
    "city": "Billings",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59101",
    "name": "The Women & Family Shelter",
    "organization": "The Women & Family Shelter",
    "phone": "(406) 259-3105",
    "website": "https://twitter.com/ywcabillings",
    "description": "shelter for families"
  },
  {
    "addressLine1": "2822 Minnesota Ave",
    "city": "Billings",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59101",
    "name": "Montana Rescue Mission for Men",
    "organization": "Montana Rescue Mission for Men",
    "phone": "(406) 259-6079",
    "website": "http://montanarescuemission.org/",
    "description": "The Montana Rescue Mission Men's Shelter, located at 2822 Minnesota Avenue, serves single men and provides assistance to single men with children and intact families. Shelter Guests receive three nutritious meals a day and the community dining room is open to the public for lunch and dinner.  Upon check-in, guests receive essential hygiene products and emergency clothing.  A public shower facility is available, to Men only, Monday thru Friday 9:00am -11:00am and 2:00pm-4:00pm. All services are free of charge.\nIn addition to Emergency Shelter, we offer our guests a wide variety of programs to help make their stay with us productive by providing vital tools to overcome the causes of their homelessness. We offer classes in parenting, life skills, anger management, proper nutrition, conflict resolution, addiction counseling,  and spiritual development. Chapel services are offered on a regular basis and staff are available for one-on-one counseling. In addition, there are educational opportunities to improve skills and a dedicated computer lab that can be used for resume preparation, job searches and GED preparation.\n\nRiverstone Health Care also provides Healthcare for the Homeless in the Mens Shelter Monday and Wednesday 7am - 10am, Friday 7am - 11am. Women and Children are also able to access this program.\n\nWe are available 24 hours a day."
  },
  {
    "addressLine1": "4100 Hwy 200 E.M.12",
    "city": "Wolf Creek",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59648",
    "name": "New Family New Life Women's And Children's Shelter",
    "organization": "New Family New Life Women's And Children's Shelter",
    "phone": "",
    "website": "mailto:starbluepurity@gmail.com",
    "description": "This is for women and children only. This is either a transitional community or emergency shelter.10 bedrooms are available with wood fireplaces.All inquiries are asked some simple questions before admittance. Like photos and goals."
  },
  {
    "addressLine1": "109 E Main",
    "city": "Bozeman",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59715",
    "name": "Battered Woman's Shelter",
    "organization": "Battered Woman's Shelter",
    "phone": "(406) 586-0263",
    "website": "mailto:montana.53@hotmail.com",
    "description": "shelter for women who are victims of domestic violence"
  },
  {
    "addressLine1": "209 South Tracy Avenue",
    "city": "Bozeman",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59715",
    "name": "Family Promise of Gallatin Valley",
    "organization": "Family Promise of Gallatin Valley",
    "phone": "(406) 582-7388",
    "website": "https://www.familypromisegv.org/",
    "description": "day shelter for families with children"
  },
  {
    "addressLine1": "2104 Industrial Ave",
    "city": "Bozeman",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59715",
    "name": "Warming Center",
    "organization": "Warming Center",
    "phone": "(406) 548-8246",
    "website": "http://www.thehrdc.org/programs/warming-center/",
    "description": "Warming Center sponsored by THE GREATER GALLATIN HOMLESS ACTION COALITION. SPONSORED BY THE NON-PROFIT HRDC AND OTHER COMMUNITY PARTNERS, THE WARMING CENTER OFFERS ANY PERSON OR FAMILY A SAFE, WARM PLACE TO SLEEP. THIS VITAL WINTER SERVICE IS AVAILABLE FROM THANKSGIVING THROUGH MARCH on the corner of Industrial Ave and East Griffin Dr, about 1/4 mile East of the train tracks, FROM 7 PM TO 7 AM, 7 DAYS A WEEK."
  },
  {
    "addressLine1": "123 E Park St",
    "city": "Butte",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59701",
    "name": "Butte Rescue Mission",
    "organization": "Butte Rescue Mission",
    "phone": "(406) 782-0925",
    "website": "https://butterescuemission.org/",
    "description": "We provide temporary housing for those in need. We serve 3 meals a day,and provide showers, laundry,also. The shelter is on a 1.6-acre Center of Hope campus in Buttes warehouse district near a bus route. Meals provided. Thrift Store is still at 123 E. Park St."
  },
  {
    "addressLine1": "1503 Gallatin Avenue",
    "city": "Helena",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59601",
    "name": "The Friendship Center",
    "organization": "The Friendship Center",
    "phone": "(406) 442-6800",
    "website": "https://twitter.com/tfc_helena",
    "description": "Women and children shelter for victims of domestic violence"
  },
  {
    "addressLine1": "326 2nd Ave S",
    "city": "Great Falls",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59403",
    "name": "Rescue Mission Men Shelter",
    "organization": "Rescue Mission Men Shelter",
    "phone": "(406) 761-0095",
    "website": "https://gfrm.org/",
    "description": "Men's homeless shelter."
  },
  {
    "addressLine1": "124 9th Ave W",
    "city": "West Kalispell",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59901",
    "name": "Samaritan House",
    "organization": "Samaritan House",
    "phone": "(406) 257-5801",
    "website": "http://www.samaritanhousemt.com/",
    "description": "Samaritan House is a homeless shelter and transitional living program in Kalispell, Montana. The mission of the Samaritan House is to provide shelter and basic needs for homeless people, while fostering self-respect and human dignity.\n\nHousing: Samaritan House provides food, housing, resources, and case management for the homeless in Kalispell and beyond the Flathead Valley. We served 34,860 meals, 1,350 people, including nearly 200 families and 225 Veterans.\n\n\nOur Veteran's Program is dedicated to assisting homeless United States veterans by providing resources allowing them access to physical and mental health check ups. Along with these services, we also provide affordable housing."
  },
  {
    "addressLine1": "46 5th Ave. West",
    "city": "Kalispell",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59901",
    "name": "A Ray of Hope",
    "organization": "A Ray of Hope",
    "phone": "(406) 755-4673",
    "website": "http://www.arayofhopemontana.com/",
    "description": "We provide the greater flathead valley; we get calls from other communities to help their homeless and from the courts to take people suffering with addiction who cannot afford in house. In cold weather we get calls to get people off the streets. We have police show up with people who would freeze and the Jails are full. We then make beds on the floor, and provide hot meals, tents and sleeping bags. As we take now state or federal funding we have greater latitude to have them slept on our floors and porch. We get many requests a day for help people to stay in their homes and this time we can only help one out of five requests. Many in our valley and around the state of Montana have lost jobs and are losing their homes. There are times the only way we can help them is to help them go to family in another state to care for them."
  },
  {
    "addressLine1": "506-B Toole Avenue",
    "city": "Missoula",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59802",
    "name": "Union Gospel Mission of Missoula (formely Missoula 3:16)",
    "organization": "Union Gospel Mission of Missoula (formely Missoula 3:16)",
    "phone": "(406) 542-5240",
    "website": "http://www.ugmofmissoula.org/",
    "description": "At our downtown location, Union Gospel Mission of Missoula provides hot meals, daytime shelter, a food pantry, use of phone and mail service, mentorship, and networking for appropriate community services. We also have a Thrift Boutique and will soon be opening a Women & Children's Shelter in the quiet of our country-side location. All our services are offered for any who choose them, are geared toward healthy life choices, and are provided with the love of Christ Jesus."
  },
  {
    "addressLine1": "1110 West Broadway St",
    "city": "Missoula",
    "state": "Montana",
    "stateAbbreviation": "MT",
    "postal": "59807",
    "name": "Poverello Center - The Poverello Center",
    "organization": "Poverello Center - The Poverello Center",
    "phone": "(406) 728-1809",
    "website": "https://thepoverellocenter.org/",
    "description": "30 days of emergency shelter for both men and women. Shelter for all men and women, 3 meals a day provided."
  }
]