[
  {
    "addressLine1": "147 Shaker Hill Rd",
    "city": "Alfred",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04002",
    "name": "York County Shelter Programs",
    "organization": "York County Shelter Programs",
    "phone": "(207) 324-1137",
    "website": "http://www.yorkcountyshelterprograms.com/",
    "description": "York County Shelter Programs is a homeless services provider which has operated in Alfred, Maine, for over thirty years. We offer emergency, transitional, halfway house, and permanent housing for previously homeless adults and children. We also provide substance abuse and mental health treatment, educational classes, case management, vocational training, home ownership opportunities, and medical care and legal assistance. We operate a working farm, half-way house, two Free Meals Kitchens, a catering business, two bakeries, a shared-use community kitchen, housing assistance, and a cafe. Green and environmentally-friendly practices are a priority in all projects with which we are involved.\n\nEmergency Shelter\nThe residential facility in Alfred provides shelter and treatment services for families and single adults.  Generally speaking, we have 15 beds for families and 48 beds for single women and men.  Women and families are housed on the lower level, single men on the upper level.  Housing is dormitory style, sharing a room with others, efforts are made to provide one private room per family.\nThe Residential Facility is dually licensed in Maine to provide both substance abuse and mental health treatment services.  Depending upon needs of the client, they may be involved in one of these programs. However, if a client is in need of intensive SA treatment they would be referred to one of our two half-way houses, Ray Anger's Farm in West Newfield or the Serenity House in Portland. Our shelter is staffed 24 hours a day and is very much a program. There is an expectation that all residents attend in house groups and participate in community service. All residents are assigned a Case Manager that works with them on identifying and resolving the issues that led to their homeless situation. The ultimate goal is to move people out of the emergency shelter, on a case by case basis, into more transitional and permanent housing with continued support through Community Outreach when appropriate. We want to end the cycle of homelessness so that when an individual or family leaves our emergency shelter, they no longer require our services now and in the future. It is often the individual and the families efforts that make this a reality. We are able to provide some support and a framework, but residents are often the catalyst to their own success. \n\nThe initial contact with a prospective client is either in person or on the telephone.  Initially, YCSPs trained staff will determine the appropriateness and eligibility for emergency admission.  If a client is intoxicated or in acute psychiatric crisis, YCSP is not an appropriate placement, and alternative referrals will be suggested.\nIf a client is homeless at the time of contact, not intoxicated, and not in crisis, the staff will see that client immediately.  Clients that have a day or two before being homeless will be scheduled for a face to face screen during regular business hours. With this in mind, the primary goal of the emergency shelter is to prevent a family or individual from having to spend the night in their car or on the street. "
  },
  {
    "addressLine1": "368 Washington Street",
    "city": "Dover",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "00000",
    "name": "My Friend's Place",
    "organization": "My Friend's Place",
    "phone": "(603) 749-3017",
    "website": "https://myfriendsplacenh.org/",
    "description": ""
  },
  {
    "addressLine1": "155 Hospital Street",
    "city": "Augusta",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04330",
    "name": "Bread Life Ministries Shelter",
    "organization": "Bread Life Ministries Shelter",
    "phone": "(207) 626-3479",
    "website": "http://www.mainebreadoflife.org/bolms-services/homeless-shelter/",
    "description": "Family and victims of domestic violence shelter. Also single men and women's shelter.\n\nThe Homeless Shelter offers a warm, welcoming, and safe facility to those needing shelter. The shelter is located on Hospital Street across from Riverview Psychiatric Center, a little over a mile from the Soup Kitchen. Originally having only 10 beds, the shelter now offers 20 beds, and 10 overflow beds each night to help those who are homeless.\n\n\nThe shelter is full virtually each night, and turns away 40-85 individuals and families each month. In 2000, we saw a growing number of families and children needing safety and warmth in our shelter. We have seen as many as 8,500 bed-nights in a year (one person/bed/night), up from 1,800 in 2000. Currently we see a mix of families, couples, single parents with children, and singles.\n\n"
  },
  {
    "addressLine1": "81 Church Hill Rd",
    "city": "Leeds",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04263",
    "name": "Rural Community Action Ministry",
    "organization": "Rural Community Action Ministry",
    "phone": "(207) 524-5095",
    "website": "http://rcam.net/",
    "description": "Office Hours\nSummer 7AM to 5PM\nMonday - Thursday\nWinter 8 AM to 4 PM\nMonday - Thursday, on-call Friday\n\nHomelessness Prevention and Shelter Services\nWe help people to access resources to meet their highest possible level of self-sufficiency by identifying needs, setting priorities and providing information and encouragement. RCAM helps families to stay in their homes by networking with other agencies to help prevent homelessness. Clients must meet criteria guidelines before they can receive assistance from Homelessness Prevention Services.\n\nThis Service offers a helping hand by providing information and making referrals to other agencies, we also make referrals within our own agency.\nThe following is an example of services that may be provided:\n    Eviction Prevention\n    Prevent Electric Service Disconnection\n    Partial Rent Payment or Security Deposit\n    Heating fuel (winter months only)\nThis Service provides information about other resources such as:\n    Contact Information for Food Pantries in the Area\n    Where to find Clothing & Furniture\nOur Homelessness Prevention Services include shelter for families and senior citizens.\nOur Shelter Services Coordinator assists those people who are homeless or at risk of becoming homeless. They determine needs and work to determine what kinds of assistance RCAM can provide. One such service is shelter.\n\nFamily Shelter\nRCAM operates a two-unit duplex shelter for homeless families. The families may stay in the shelter for a limited time. We assist the families with information and support to find affordable housing and additional resources to work on issues that may have led to homelessness.\nShelter services are available based on individual family needs, and availability of shelter units. There is an intake application process with RCAM which includes background checks. Due to the length of time required to process this information, we are not able to provide  emergency  shelter.\n\nShelter residents meet weekly with RCAM staff to set goals and work toward reaching those goals.\n\nTransitional Unit\nThe Transitional Unit is available to one family for up to two years. This family most often is one that has stayed for a bit of time at our homeless shelter and needs additional time to seek employment and all that is needed to sustain independence. The T-Unit family is required to accomplish goals to implement self-sufficiency during their stay.\nResidents of the Transitional Unit pay rent according to an agreed-upon formula.\nGilbert A. Ward Senior Residential Housing\nSenior Residential Housing is available in a multi-unit home designed to accommodate homeless at-risk seniors ages 55+. The Senior Residence has four bedrooms with attached baths, as well as communal living spaces living room, kitchen, dining room, sun room and laundry room.\nResidents of the Senior Housing unit pay rent based on Section 8 eligibility.\n"
  },
  {
    "addressLine1": "19 Colby St",
    "city": "Waterville",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04901",
    "name": "Mid-Maine Homeless Shelter",
    "organization": "Mid-Maine Homeless Shelter",
    "phone": "(207) 872-8082",
    "website": "http://www.shelterme.org/",
    "description": "Hours: Open 24 hours a day, 7 days a week, 365 days a year. The shelter also operates a Day Shelter Program for shelter guests from 8am to 4pm Monday - Friday and weekends by appointment to provide safe warm haven from the cold streets.\n\n\n\n48 bed dry shelter - Singles and Families. Also provides breakfast, dinner, showers, laundry facilities.\n\n\n\nMMHS provides emergency overnight shelter and programs to rebuild lives for those in need. We provide a safe, comfortable and friendly environment where we treat the people who stay with us with the dignity and respect that they deserve.\" MMHS is an 40 bed facility that includes 24 beds for single men and women and 24 beds in our family unit. We also offer 'pack-n-play' and toddler beds for infants to three year olds. The shelter provides evening and morning meals, showers, bedding, laundry facilities, links to other area services, short-term preventative case management, access to housing, a Homeless Prevention Program, and much more."
  },
  {
    "addressLine1": "181 State Street",
    "city": "Bangor",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04401",
    "name": "My Choice",
    "organization": "My Choice",
    "phone": "(800) 773-9595",
    "website": "",
    "description": "Housing for women with children or pregnant women."
  },
  {
    "addressLine1": "263 Main Street",
    "city": "Bangor",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04401",
    "name": "The Bangor Area Homeless Shelter",
    "organization": "The Bangor Area Homeless Shelter",
    "phone": "(207) 947-0092",
    "website": "http://www.bangorareashelter.org/",
    "description": "Homeless Day and Night Shelter.\n\nBAHS has 38 beds year round, and in the winter we will open up \"overflow\" beds in the TV room to keep up with the demand for shelter.\n\nAnyone seeking shelter at BAHS must first meet with staff in person and complete an initial intake. Beds are not reserved over the phone, and we act on a first come first served basis. We can only accept males and females 18 years of age or older. Guest at BAHS must be clean and sober from drugs or alcohol.\n\nHow long can someone stay at the Shelter?\nEach individual's length of stay is different. As long as someone is following rules and working hard everyday on their plan of care, there is no set length of stay. Individuals are dealt with on a case by case basis.\n\nIt is the vision of the BAHS to be a leading partner in insuring that no person in the greater Bangor area ever has to spend a night on the streets or in the woods because he or she cannot find or cannot afford safe housing. We believe in the principle that safe, affordable housing is a fundamental human right and our primary aim is to offer a stabilizing base and support for homeless men and women as they transition back into the community. We believe that services offered should actively involve those in need of assistance, be of high quality and be delivered with dignity and respect. Our concern is for both emergency care and the development of affordable housing for all."
  },
  {
    "addressLine1": "PO Box 616",
    "city": "Bangor",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04402",
    "name": "Barbara's Dwelling Place",
    "organization": "Barbara's Dwelling Place",
    "phone": "(207) 949-2273",
    "website": "http://www.godparenthomeme.com/",
    "description": "Our home is recognized as a homeless shelter by Maine State Housing Authority, which is helpful in getting you the help you need.\nThe shelter is for women who are homeless and have children from 0 - 5 years old.\n"
  },
  {
    "addressLine1": "179 Corporate Dr",
    "city": "Bangor",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04401",
    "name": "Hope House Health and Living Center",
    "organization": "Hope House Health and Living Center",
    "phone": "(207) 217-6713",
    "website": "http://pchc.com/locations/hope-house/",
    "description": "Hope House Shelter\nThe Hope House Shelter is a 64 bed emergency homeless shelter licensed by MSHA and the Office of Substance Abuse, and is the 2nd largest shelter in the state of Maine. In addition to housing and on-site health care services, 3 meals per day are provided with assistance from various community groups. Hope House is the community safety net in Bangor, managing the city of Bangors overflow of homeless persons from other shelters.\n\nHope House Transitional Housing\nEncouraging healthy living, the Hope House Transitional Housing helps people move toward self-sufficiency and successful independent living. Each tenant is given the chance to develop and work on personal, independent living goals in a positive, safe and supportive environment. Our Transitional Housing features 48 private rooms and access to on-site laundry, a community kitchenette, shared common rooms, and more. We offer both wrap around services and integrated health care through the Hope House Health Center to help tenants develop stability as well as prepare them for independent housing. Transitional Housing is short-term, up to 24 months, and works to help tenants overcome barriers to successful, permanent housing in the community."
  },
  {
    "addressLine1": "PO Box 616",
    "city": "Bangor",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04402",
    "name": "Shepherd's Godparent Home - Maternity Shelter",
    "organization": "Shepherd's Godparent Home - Maternity Shelter",
    "phone": "(207) 949-2273",
    "website": "http://www.godparenthomeme.com/",
    "description": "Hours of Operation:\n24 Hours a Day, 7 Days a Week\nProudly Serving the State of Maine & the Surrounding Area, including Penobscot, Washington, Hancock, Aroostook Counties\n\nThe Shepherd's Godparent Home is a residential maternity shelter for pregnant women. Interview intake process. Community based case management, individual counseling, parenting education, life skills building, Biblically based program.\n\n\nWe provide all the tools to prepare for the birth of your baby. Our Nikki's Hope transition apartment is for up to 3 women and their babies located in the same building. We are independently funded. No state or federal funding."
  },
  {
    "addressLine1": "59 Free Street",
    "city": "Dexter",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04930",
    "name": "Penquis Journey House",
    "organization": "Penquis Journey House",
    "phone": "(207) 924-0151",
    "website": "mailto:dtrafton@penquis.org",
    "description": "A transitional housing program available to pregnant and parenting young women ages 16-21 who are experiencing homelessness, at risk of becoming homeless or have an unsafe living situation. We provide safe transitional housing, case management services, life skills training, nutrition education, assistance to access health care, childcare, educational opportunities and job training. We also offer Parents Are Teachers, Too home visits for parenting support and education.\n\nHousing\nPenquis offers many services related to housing including home loans, subsidized housing,  weatherization, energy efficiency improvements, and lead testing among others.\nSome services are based on income eligibility, while others are offered on a sliding scale fee and  fee for service. Click the options below to learn more about our housing services.\nAffordable Housing/Rental Options\nBuying/Refinancing a Home\nHeating & Utilities for Your Home\nHome Improvements, Repairs & Inspections\nPenquis Housing Development Services - Penquis Development Inc. and Penquis Housing Inc."
  },
  {
    "addressLine1": "14 Middle St",
    "city": "Brunswick",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04011",
    "name": "Tedford Housing",
    "organization": "Tedford Housing",
    "phone": "(207) 729-1161",
    "website": "http://tedfordhousing.org/",
    "description": "Tedford Housing works together with people in their communities to find lasting solutions to the challenges of homelessness.\nWe provide shelter, housing, and services that empower adults, children and families in need.\n\nTedford Housing believes that everyone deserves to have a safe and affordable home. Over the years, the organization has evolved from providing emergency shelter to adults  to offering shelter, supported housing and homeless prevention services for adults, families and teens.\n\nEmergency Shelters\nEmergency Adult Shelter\n49 Cumberland Street\nBrunswick, Maine 04011\n\nEmergency Family Shelter\n34 Federal Street\nBrunswick, Maine 04011\n\n\nAdult shelter for single men and women over age 18\nThe emergency adult shelter houses up to 16 men and women in separate dorm-style rooms at 49 Cumberland Street in Brunswick, Maine. We have handicap accessible rooms for 1-2 people. The adult shelter is open from 3:30pm 8:00am Monday through Friday and all day on Saturdays and Sundays, 365 days a year.  While the shelter is often full, you may check for availability by stopping by the shelter or calling 207-729-1161, #104 after 3:30pm on weekdays or any time on the weekends.\nShelter guests are provided breakfast and dinner each day. A washer and dryer are available during shelter hours. Guests also work with a Tedford case manager to seek options for permanent housing and to access other services as needed. Those staying at the shelter must agree to and abide by shelter rules and help with general maintenance of the facility.\n\nIndividuals who are homeless, but are not staying at the shelter, may also seek assistance from a case manager. Call 207-729-1161, #105 to see if our case manager can work with you.\nFamily shelter for adults and children, including at least one parent\nFamilies, including at least one parent and one or more children, are provided temporary shelter at 34 Federal Street in Brunswick, Maine in 6 private apartments. Due to the very limited number of apartments at the family shelter, Tedford staff maintains a waiting list for families seeking access to the shelter. Contact the family shelter for more information or to put your name on the waiting list at 207-729-1161 #113.\nFamilies at the family shelter have their own bathrooms and kitchens and access to coin-operated laundry. Guests at the family shelter are responsible for providing their own meals and maintaining their apartments. They are also required to follow shelter rules and work with a Tedford case manager on a plan to access permanent housing.\n\nSupported Housing\nThose who face homelessness often deal with overwhelming stress in their lives. Many also combat physical and / or mental health challenges. Our long-term goal is to place people in permanent, affordable housing.\nTedford Housing manages six supported housing apartment complexes with a total of 37 units for previously homeless individuals and families. Tenants pay subsidized rent and are required to follow the rules of the building. A case manager is available to assist the tenants in obtaining needed services and to advocate for clients on an individualized basis."
  },
  {
    "addressLine1": "209 Lincoln Street",
    "city": "Lewiston",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04240",
    "name": "Hope Haven Gospel Mission",
    "organization": "Hope Haven Gospel Mission",
    "phone": "(207) 783-6086",
    "website": "http://www.hopehavengospelmission.org/",
    "description": "Homeless shelter that provides temporary shelter for all. Meals provided and is open 365 days a year.\n\nApplicants must be residents of Lewiston-Auburn area who won't be getting help from their church or any other agencies.\nFor children 13 and under ONLY\nApplicants need to bring:\n-Your Picture ID\n-Your latest DHS statement.\nAnyone who signs up for Children's Toys MUST pick them up Friday Dec. 16 between 9:30 AM - 3:00 PM. (Bring your Picture ID)\n\n\nShelter Hours:\nMonday thru Saturday: 5:30 P.M. to 8:00 P.M Sunday: 4:00 P.M. to 8:00 P.M.\n \nSoup Kitchen:\nDaily Breakfast: 7:30 AM to 8:00 AM\nMonday - Saturday Supper: 4:30 to 5:30 PM\nSunday Supper: 2:30 PM\n \nOffice Hours:\nClosed December 25th to January 2nd\nMonday, Wednesday and Friday 9:30 AM to 11:45 AM -- 12:30 PM to 4:00 PM\n \nGive Away Room Hours:\nClosed December 25th to January 4th\nMonday, Wednesday and  Friday 9:30 AM to 11:45 AM & 12:30 PM to 4:00 PM"
  },
  {
    "addressLine1": "100 Pine St",
    "city": "Lewiston",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04240",
    "name": "Sheltered by Jesus L/A",
    "organization": "Sheltered by Jesus L/A",
    "phone": "(207) 241-7047",
    "website": "https://shelteredbyjesusla.com/",
    "description": ""
  },
  {
    "addressLine1": "491 Main St.",
    "city": "Lewiston",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04240",
    "name": "New Beginnings",
    "organization": "New Beginnings",
    "phone": "(207) 795-4070",
    "website": "https://newbeginmaine.org/",
    "description": ""
  },
  {
    "addressLine1": "12 McClellan St, Suite 2",
    "city": "Skowhegan",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04976",
    "name": "Trinity Men's Shelter",
    "organization": "Trinity Men's Shelter",
    "phone": "(207) 474-8833",
    "website": "https://sheltersbyjesus.com/",
    "description": ""
  },
  {
    "addressLine1": "111 South Main Street",
    "city": "Solon",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04979",
    "name": "New Hope Women's Shelter",
    "organization": "New Hope Women's Shelter",
    "phone": "(207) 643-6015",
    "website": "http://www.newhopeshelter.com/",
    "description": "Women's Shelter. Mission StatementOur mission is to serve the homeless and reach out to women where they are, and in practical ways extend God's love and hope for the future through a personal relationship with Christ."
  },
  {
    "addressLine1": "51 Main St",
    "city": "Ellsworth",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04605",
    "name": "Emmaus Homeless Shelter",
    "organization": "Emmaus Homeless Shelter",
    "phone": "(207) 667-3962",
    "website": "http://www.emmaushomelessshelter.org/",
    "description": "The Emmaus Homeless Shelter is open to anyone in Hancock County.\n\nThe Emmaus Homeless Shelter is a 25 bed facility which can accommodate four families, six single women, and five single men, ages 18 and up.\n\n\nThe Shelter operates (24) twenty four hours a day, 365 days a year.\n\n\nOverview of Our Services\nThe Emmaus Homeless Shelter is open to anyone in Hancock County\nOur FREE Clothing Closet 4 days per week:\nMonday, Wednesday, Friday & Saturday 10:00 a.m. to 2:00 p.m.\nFeaturing Gently Used Clothing for men, women, and children!\nNo appointment is necessary!\n\nOur FREE Food Pantry Six days per week:\nMonday Friday 10:00 to 2:00 p.m. and\nSaturday 9:00 a.m. to 11:00 a.m.\nPlease call the Shelter the day before to sign up at 667-3962\n\nWe also feature FREE Produce Two days per week:\nThursday and Saturday at 8:30 a.m.\nNo appointment necessary!\n\nWe also have FREE Housewares, Linens, and some Furniture\nPlease come into the Shelter to sign up\nAs always, we are in need of Volunteers!\nPlease call the Shelter at 667-3962 for more information."
  },
  {
    "addressLine1": "PO Box 7227",
    "city": "Lewiston",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04243",
    "name": "St. Martin De Porres Residence Inc.",
    "organization": "St. Martin De Porres Residence Inc.",
    "phone": "(207) 786-4690",
    "website": "http://princeofpeace.me/st-martin-de-porres-residence-inc",
    "description": "Adult Homeless Residence for Men & Women - Contact with Shelter is by referral only.\n\nFor adults 18yo and over. Guests must have a referral from a social agency they are actively working with to change their situation. They should be motivated to seek housing, employment, and rehabilitation as needed. They need to be alcohol and drug free. If prescribed medications, they should have a supply of those meds and be responsible for taking them."
  },
  {
    "addressLine1": "5 Portland Street",
    "city": "Portland",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04104",
    "name": "Preble Street Resource Center",
    "organization": "Preble Street Resource Center",
    "phone": "(207) 775-0026",
    "website": "http://www.preblestreet.org/",
    "description": "Hours\nMonday-Friday\n8:00 AM - 6:00 PM\n\nSaturday-Sunday\n9:00 AM - Noon\n\nThe Preble Street Resource Center is the hub of services for homeless people in Portland, including a soup kitchen, providing meals 3/365, and day shelter open 7 days a week, providing clothing closet, case management services, and access to healthcare.\n\nHousing Services\nPreble Street is committed to providing safe, affordable permanent housing and support to chronically homeless men and women in Portland, Maine.Our services are based on approaches to homelessness and chronic mental illness that have emerged nationally as key strategies for ending homelessness combined with experience gained at the Preble Street Resource Center.Based on a pioneering \"housing first\" model and a strong partnership between Preble Street and Avesta Housing, the success of our landmark housing programs validates a strategy that can end chronic homelessness in Portland and across the nation.\n\nFlorence House\nFlorence House provides safe, supported permanent housing to chronically homeless women in Portland, Maine.\n\nLogan Place\nLogan Place provides adults who have lived in shelters and on the streets for much of their lives with a chance for a permanent and safe living situation.\n\nVeterans Housing Services\nPreble Streets Veterans Housing Services (VHS) seeks to assist low-income veterans and their families find a home and end homelessness among veterans.\n\n"
  },
  {
    "addressLine1": "203 Oxford Street",
    "city": "Portland",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04101",
    "name": "City of Portland, Oxford Street Shelter for Men",
    "organization": "City of Portland, Oxford Street Shelter for Men",
    "phone": "(207) 761-2072",
    "website": "http://www.portlandmaine.gov/",
    "description": "Open 24 hours a day.\n129 bed emergency shelter for men 18 and over, services include housing placement assistance, mental health services, substance abuse services, police on-site for safety. Toiletries, linen, emergency supplies and community referrals available.  They have beds for women but very limited.\n\nFrom the greyhound station, go right on St. Johns St, Right on Park Ave, and Park Ave turns into Portland St. Go left at the end of Portland St, and Right on Oxford St."
  },
  {
    "addressLine1": "65 India st",
    "city": "Portland",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04101",
    "name": "Milestone Foundation Emergency Shelter",
    "organization": "Milestone Foundation Emergency Shelter",
    "phone": "(207) 775-4790",
    "website": "http://www.milestonefoundation.org/",
    "description": "Milestone operates Maines only specialized substance use disorder emergency shelter. The 41-bed overnight shelter for men provides individuals with a safe place to sleep, nutritious meals, clean clothes, showers and counseling while being treated with dignity. In addition to providing a safety net to our communitys most vulnerable individuals struggling with chronic alcohol and drug dependence, shelter staff educate clients and encourage them to enter Milestones on-site medically managed detoxification program.\n\nDetoxification Program\nThe detox program provides men and women struggling with substance use disorders a safe and medically supervised transition through the acute phase of withdrawal from alcohol and other drugs. The program is staffed by nurses and CNAs 24 hours a day, and is overseen by a physician. Substance use counselors are available for education, intervention, case management, individual and group counseling, family counseling and referral management. Length of stay typically ranges between 3 and 7 days. Maine residents are admitted regardless of ability to pay.\n\nHOME Team\nThe Homeless Outreach and Mobile Engagement (HOME) Team provides outreach and community supports to those with chronic health, mental health and substance use disorders living on the streets of Portland. Services include daily outreach, intervention, referrals and transportation for individuals who are homeless, highly intoxicated, experiencing mental illness or engaging in disruptive behavior. Approximately, 8,200 encounters occur each year, resulting in 2,500 transports to area shelters, detox or area hospitals."
  },
  {
    "addressLine1": "745 Central Drive",
    "city": "Presque Isle",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04769",
    "name": "Sister Mary O'Donnell Homeless Shelter",
    "organization": "Sister Mary O'Donnell Homeless Shelter",
    "phone": "(207) 764-4125",
    "website": "http://www.aroostookhomeless.org/",
    "description": "Homeless Services of Aroostook - Sister Mary O'Donnell Homeless Shelter\nOur emergency homeless shelter for families and individuals is a program based operation. The program is simple. We provide internal case management services in cooperation with case managers from our sister agencies, establishing a plan to meet each persons or familys needs and then monitor the plans progress, holding everyone accountable for the goals mutually set. While progress is being made on each established plan, shelter support staff manage and address the daily needs of the shelter residents.\n\nTransitional Housing\nTransitional Housing provides low income subsidized 2 and 3 bedroom units to families with children renewed annually. The goal of transitional housing is to provide temporary affordable housing while families work to become self-sufficient. Parents must employed or taking classes to improve their financial situation. Families pay only their portion of the rent (determined by Presque Isle Housing Authority, Maine Housing, AMHC, or other rent subsidy agency), cable bill, phone bill, and electricity each year.\nIf you have any questions, please call the Transitional Housing Manager at 762-6000."
  },
  {
    "addressLine1": "169 Old County Rd",
    "city": "Rockport",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04856",
    "name": "Mid Coast Hospitality House",
    "organization": "Mid Coast Hospitality House",
    "phone": "(207) 593-8151",
    "website": "http://homehelphope.org/",
    "description": "Provides both a day shelter and overnight shelter.\n\nDay Shelter\nProvides support services: including: medical care, housing, mental health resources, substance abuse treatment, job search, job skills, and growing an effective support network.\n\nOvernight Shelter\nProvide a safe, hygienic and comfortable place to sleep.\n\nWe provide help by:\n    Offering wraparound programming and support that is delivered by highly skilled staff.\n    Shelter in different forms including Hospitality House \"safe, comfortable places to sleep.\n\n    Continually deepening connections and collaborations with community partners to have a broad range of programming options available for clients.\n    Supporting clients with respect, trust, caring, strict rules, safety, a sense of community and hope \"often for the first time in years.\n    Providing housing resources and information.\n    Delivering programming that develops life skills and addresses issues that lead to or perpetuate homelessness.\n    Connecting to general support including: medical care, housing, mental health resources, substance abuse treatment, job search, job skills, and growing an effective support network.\n    Peer and staff support system that results from communal living, grounded in mutual respect and understanding.\n    Onsite education, training, and life enrichment programs in art, music, exercise, nutrition, and more."
  },
  {
    "addressLine1": "32 Erchles Street",
    "city": "Rumford",
    "state": "Maine",
    "stateAbbreviation": "ME",
    "postal": "04276",
    "name": "Community Concepts - Strathglass Family Shelter",
    "organization": "Community Concepts - Strathglass Family Shelter",
    "phone": "(207) 364-3824",
    "website": "http://www.community-concepts.org/",
    "description": "Community Concepts offers emergency services for clients who live in Oxford and Androscoggin counties.\n\nWe provide Homeless Shelters in the Oxford Hills and Rumford areas.\n\n\nWant to know what services are offered in your area? Click on the Link to 211 for a complete directory of local services"
  }
]