[
  {
    "addressLine1": "17 Seelye Street",
    "city": "Amherst",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01002",
    "name": "AMHERST EMERGENCY SHELTER",
    "organization": "AMHERST EMERGENCY SHELTER",
    "phone": "(413) 253-5155",
    "website": "https://www.twitter.com/CHDSpringfield",
    "description": ""
  },
  {
    "addressLine1": "434 North Pleasant St",
    "city": "Amherst",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01002",
    "name": "Craig's Place Emergency Shelter",
    "organization": "Craig's Place Emergency Shelter",
    "phone": "(413) 256-0704",
    "website": "http://www.craigsdoors.org/",
    "description": "Craig's Place Emergency Shelter operates from November 1st through April 30th<\nWe are open from 9:30 p.m. though 8:00 a.m.Craig's Place has a behavior based admission policy: all who show respect for the safety and well-being of our guests, volunteers, and staff are welcome\n\nWe do not discriminate based on race, color, creed, national origin, age, disability, sex, gender, religion, or sexual orientation\n\nServices include:Overnight ShelterDinner and breakfastAccess to showers\nMedical Clinic\nReferrals to social servicesHousing referrals\n"
  },
  {
    "addressLine1": "91 Grove St.",
    "city": "Northampton",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01060",
    "name": "Grove St Inn",
    "organization": "Grove St Inn",
    "phone": "(413) 586-6001",
    "website": "https://www.facebook.com/servicenetinc/",
    "description": "The Grove Street Inn is the only year-round shelter in Hampshire County open to all homeless adults. The Inn was established in 1990 through community efforts. With no permanent base of funding, a unique community collaboration shares the responsibility for administering the Inn. The Inn is one of the few examples of a community working together to address the problem of homelessness.\n\nThe Inn shelters up to twenty men and women per night, for a maximum stay of three months. A bed and three meals per day are provided, along with staff support. Most nights the Inn is full, and there is often a forty-five person waiting list. Residents are able to:\nWork on job and housing searches.\nWork second and third shift jobs.\nConnect with rehabilitative and medical services.\n\nThe Grove Street Inn also plays a key role in our community's efforts to address the problem of homelessness. The Inn's staff collaborates with the Hampshire County Interfaith Shelter, which served an additional 140 men and women last winter."
  },
  {
    "addressLine1": "25 Central Street",
    "city": "Ashland",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01721",
    "name": "Shelter Hope and Dignity of Women Searching - SHADOWS Shelter",
    "organization": "Shelter Hope and Dignity of Women Searching - SHADOWS Shelter",
    "phone": "(508) 620-2690",
    "website": "http://www.smoc.org/",
    "description": "Shadows provides temporary emergency housing for up to 10 women who are sober. It is linked to SMOC's continuum of housing and services through the Common Ground Resource Center. Women at Shadows are eligible for employment and housing search services, mental health and substance abuse services and more.\n\nEligibility Requirements\nAll referrals are coordinated through the Common Ground Resource Center - (508) 620-2690.\n\nContact Information\nPlease call (508) 620-2690 to receive a referral packet."
  },
  {
    "addressLine1": "75 Hollis Street",
    "city": "Framingham",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01701",
    "name": "TURNING POINT",
    "organization": "TURNING POINT",
    "phone": "(508) 875-6429",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "300 Howard Street",
    "city": "Framingham",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01702",
    "name": "SOUTH MIDDLESEX OPPORTUNITY COUNCIL",
    "organization": "SOUTH MIDDLESEX OPPORTUNITY COUNCIL",
    "phone": "(508) 620-2300",
    "website": "https://twitter.com/smocma",
    "description": ""
  },
  {
    "addressLine1": "7 Bishop Street",
    "city": "Framingham",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01701",
    "name": "Pathways Family Shelter SMOC",
    "organization": "Pathways Family Shelter SMOC",
    "phone": "(508) 879-5047",
    "website": "https://www.smoc.org/pathways.php",
    "description": "Family congregate shelter for 14 homeless families.\nIt is staffed 24 hours a day.\nParents and children of each family share one private bedroom.\nThey share the rest of the common spaces with the rest of the families.\nStaff is on site 24 hours a day\nAssists families in acquiring affordable housing, medical, education, vocational, and social services.\nCall the shelter directly for address and directions.\n"
  },
  {
    "addressLine1": "11 Peck Street",
    "city": "Attleboro",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02703",
    "name": "FAMILY RESOURCE CENTER",
    "organization": "FAMILY RESOURCE CENTER",
    "phone": "(508) 226-5722",
    "website": "https://www.facebook.com/FRCTaunton/",
    "description": ""
  },
  {
    "addressLine1": "11 Peck Street",
    "city": "Attleboro",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02703",
    "name": "FOCUS Family Resource Center",
    "organization": "FOCUS Family Resource Center",
    "phone": "(508) 226-5722",
    "website": "https://www.oldcolonyymca.org/community-social-services/family-resource-centers?fbclid=IwAR3ws246IUa",
    "description": "Community Care Services is a private, non-profit corporation that provides emotional, educational and behavioral support to more than 7,500 children, adults, elders, and families annually throughout Southeastern Massachusetts, Rhode Island and now expanding into Connecticut."
  },
  {
    "addressLine1": "95 Pine Street",
    "city": "Attleboro",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02703",
    "name": "Attleboro Area Council of Churches",
    "organization": "Attleboro Area Council of Churches",
    "phone": "(508) 222-2933",
    "website": "http://www.attleborocouncilofchurches.org/",
    "description": "This is NOT a homeless shelter. They provide a program called Homes With Heart.\n\nHomes With Heart is a HUD sponsored program that's purpose is to find nd secure permanent housing for chronically homeless persons. Once this is accomplished, case management will be provided to assure support and services for the clients. This may include health insurance and care, nutrition and budget education, counseling and community integration through volunteerism.\n\n\nHomes With Heart has found permanent supportive housing for 24 men and women, and provided related services to numerous others. Homes With Heart staff and clients work cooperatively with other agencies in the area's Continuum of Care in order to provide the most successful experiences possible.\n\nContact them to see if they can assist you. Office hours: Mondays through Fridays 9am - 5pm."
  },
  {
    "addressLine1": "49-51 Trenton Street",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02906",
    "name": "Providence Community Action Interim House - Shelter for Families",
    "organization": "Providence Community Action Interim House - Shelter for Families",
    "phone": "(401) 831-4570",
    "website": "",
    "description": "Interim House Emergency Family Shelter. Community Action Agency."
  },
  {
    "addressLine1": "386 Smith Street",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02908",
    "name": "Sojourner House",
    "organization": "Sojourner House",
    "phone": "(401) 765-3232",
    "website": "http://www.sojournerri.org/",
    "description": "Domestic Violence Shelter\n\nSAFE HOUSE (EMERGENCY SHELTER)\nAs domestic violence victims take important steps to reclaim their lives, it is often necessary to move away from the abuser. Sojourner House's Safe House is in an undisclosed location and serves as immediate, safe, temporary housing for abused women and their children. Once there, advocates help residents work on their goals and provide emotional support for the duration of their stay, as well as follow-up care once they've moved to more permanent, safe housing. Our staff also provides information about domestic abuse, case management services, referrals, and educational programs. Each resident's length of stay at our Safe House depends upon her personal situation.\nOur Safe Home is fully handicap accessible. Women and their children are provided with 24-hour locked and secure shelter and comprehensive services through Sojourner House's network of local resources and service providers. Residents participate in a number of programs designed to help them process the various effects of domestic abuse.\n\nTRANSITIONAL HOUSING (INDEPENDENT APARTMENTS)\nSojourner House also offers a transitional housing program for victims of domestic violence and their children. Transitional housing may only be provided to victims exiting the Safe House, those who are homeless or in need of transitional housing as a result of fleeing a situation of domestic violence/dating violence, or those for whom emergency shelter services or other crisis intervention services are unavailable or insufficient.\nTransitional housing is the bridge to self-sufficiency and permanent housing for our clients. In addition to seeking permanent housing, clients have the opportunity to establish goals and learn skills to work toward economic stability.\n\nFor more information about our residential services, please call our hotline at 401-765-3232."
  },
  {
    "addressLine1": "P.O. Box 603300",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02906",
    "name": "Women's Center of RI",
    "organization": "Women's Center of RI",
    "phone": "(401) 861-2670",
    "website": "https://www.womenscenterri.org/",
    "description": "The Women's Center of Rhode Island has merged with Crossroads Rhode Island to better serve and provide safety and shelter to domestic violence survivors.\nThe Domestic Violence Program of Crossroads is an emergency shelter that serves exclusively domestic violence survivors and their children. The shelter provides 26 domestic violence survivors and their children in a confidential location where they will have basic needs assistance such as education, employment services and intensive care management. It is separate from the Crossroad Rhode Island additional shelters which serve homeless individuals and their families.\n\n\nAdditional Telephone Numbers:\nConfidential 24 Hour Helpline: If you or anyone you know is experiencing domestic violence, do not hesitate to call (401) 861-2760\nDomestic Violence Center Business Phone: (401) 861-2761\n\n\n\n\n"
  },
  {
    "addressLine1": "59 Ingall Street",
    "city": "Taunton",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02780",
    "name": "Samaritan House",
    "organization": "Samaritan House",
    "phone": "(508) 824-6497",
    "website": "",
    "description": "Homeless shelter for singles.\n\nThe Samaritan House is a sober transitional homeless shelter for men and women in Taunton, Massachusetts. It has 20 beds on multiple floors and is staffed 24 hours a day. In addition to shelter, the program offers a wide range of supportive services including assessment, job skills training, budgeting information, and access to mental health and other needed services. The Samaritan House is committed to helping individuals secure the needed community resources to secure housing, employment and long-term sustainability."
  },
  {
    "addressLine1": "160 Broad Street",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02903",
    "name": "Crossroads Rhode Island",
    "organization": "Crossroads Rhode Island",
    "phone": "(401) 521-2255",
    "website": "https://www.crossroadsri.org/",
    "description": "Need Help?\n\nIn need of emergency shelter and want to learn more about our services? Contact us at cesteam@crossroadsri.org or (401) 277-4316.\nBy doing so, you will be connected with our Coordinated Entry Team, who is responsible for helping neighbors in need connect with emergency shelter*, housing and resources.\n\n\nOur hotline is staffed weekdays (excluding major holidays); messages and emails are accepted 24/7.\n\n*Please note that shelter is not guaranteed.\n\n\nEmergency SheltersCitizens Bank Family Center:\n\nProvides emergency shelter and support for up to 15 families.\nCouples' Shelter:\n\nThe only emergency shelter in the state for couples without children, offers case management for four couples in scattered apartments.\nHarrington Hall:\n\nRhode Island's largest men's shelter, accommodates up to 112 men.\nWomen's Shelter:\n\nShelters 41 women in 10 shared bedrooms, one wheelchair-accessible bedroom, a common space and outdoor patio.\nDomestic Violence Program:\n\nProvides a 24/7 emergency hotline, emergency shelter services and more for 26 survivors in a confidential, safe house location for survivors of domestic violence and their children."
  },
  {
    "addressLine1": "415 Friendship Street",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02907",
    "name": "Amos House Shelter and Services",
    "organization": "Amos House Shelter and Services",
    "phone": "(401) 272-0220",
    "website": "http://www.amoshouse.com/",
    "description": "Hours: Monday to Friday 8-4, Social Services 8-4 Monday to Thursday, Friday 8-1\nmen's and women's shelter.\nHousing OverviewShelter\nMore than a meal, Amos House is home. And all that goes with it. Trust, safety, a solid foundation from which to grow, and friendships (made right here on Friendship Street). We offer a continuum of housing programs for individuals and families that are homeless and poor. Over the past ten years our properties have provided temporary and permanent housing to more than 2000 people. Our services include:\nTransitional Housing\nSupportive Housing\nOur men's and women's transitional housing programs provide safe housing for hundreds of homeless people each year. Our apartment program assists individuals and families on their journey from homelessness to self-sufficiency. And our rooming houses provide permanent and supportive housing for homeless people with special needs.\nClean and sober transitional housing for 20 men and 13 women; referrals and social support services. Prescription assistance. Employment services. Recovery Services. Housing assistance, Breakfast and Lunch served Monday to Saturday. ACE Culinary Arts Training Program.Permanent supportive housing includes 4 rooming houses, and 19 apartments. All housing is drug and alcohol free.\n\n"
  },
  {
    "addressLine1": "246 Prairie Avenue",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02905",
    "name": "URBAN LEAGUE",
    "organization": "URBAN LEAGUE",
    "phone": "(401) 351-5000",
    "website": "https://www.facebook.com/The-Urban-League-of-RI-Lives-2234666510102543/",
    "description": "shelter for all."
  },
  {
    "addressLine1": "557 Broad Street",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "00000",
    "name": "AIDS CARE OCEAN STATE",
    "organization": "AIDS CARE OCEAN STATE",
    "phone": "(401) 521-3603",
    "website": "http://www.aidscareos.org/",
    "description": "AIDS Care Ocean State is dedicated to providing quality housing, case management, medical and nursing care, and prevention to adults, families, adolescents and children who are affected by or at risk for HIV infection. AIDS Care Ocean State will act as an advocate for individuals and families at risk, while providing those support services needed to ensure and maintain a high quality of life for the people we serve."
  },
  {
    "addressLine1": "557 Broad Street",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02907",
    "name": "Aids Care Ocean State - Housing Assistance",
    "organization": "Aids Care Ocean State - Housing Assistance",
    "phone": "(401) 273-1888",
    "website": "http://www.aidscareos.org/",
    "description": "AIDS Care Ocean State is the largest provider of subsidized housing for persons living with HIV/AIDS.\nWe have built or developed 19 properties to serve our clients. We currently have 127 clients residing in 48 apartments that we own and operate. Federal funding sources allow us to sub-lease 47 apartments to assist an additional 76 clients."
  },
  {
    "addressLine1": "133 Delaine Street",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02909",
    "name": "YWCA Rhode Island Community Center",
    "organization": "YWCA Rhode Island Community Center",
    "phone": "(401) 351-2241",
    "website": "https://twitter.com/ywca_ri",
    "description": "Gateway to Independence program is for VETERAN MEN ONLY."
  },
  {
    "addressLine1": "127 Michigan Avenue",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02905",
    "name": "PROVIDENCE CENTER",
    "organization": "PROVIDENCE CENTER",
    "phone": "(401) 276-4000",
    "website": "https://twitter.com/theprovcenter",
    "description": "Shelter for all, men, women, children."
  },
  {
    "addressLine1": "627 Cranston Street",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02907",
    "name": "Providence Rescue Mission",
    "organization": "Providence Rescue Mission",
    "phone": "(401) 274-8861",
    "website": "https://providencerescuemission.org/",
    "description": "We provide emergency overnight accommodations for 75 to 90 homeless men and 15 to 30 homeless women, seven nights a week. Each overnight guest has the ability to take a hot shower, eat a hot dinner, sleep in a clean bed, and have breakfast in the morning. This is approximately 38,325 nights of safe shelter provided annually at the Mission.\n\nMeal Program\nOur meal programs provide approximately 8,500 - 10,000 hot meals a month to the needy in our community. This Thanksgiving we provided Thanksgiving food boxes for over 1,825 families in the Providence area. Each box contained 25 pounds of non-perishable food and a 15 pound turkey. At Christmastime, we provided 11,000 gifts to over 1,600 needy families through our Christmas Toy Ministry.\n\nDiscipleship Program\nWe run a one-year discipleship program that allows 10 to 15 homeless men with, but not limited to, substance abuse issues to start a new life by combining biblical values, counseling, education and career training and reunification with their families. This program is at capacity most of the time.\n\nDental Offices\nThe Providence Rescue Mission features a full service dental office that helps Individuals start a new life with a smile they can proud of. Our office features x-ray, full cleaning, and other dental services. Local dentists and staff see patients by appointment only.\n\nFood , Clothing and Other Community Outreaches\nWe operate an emergency food pantry and a clothing room. Individuals and families use these services on a daily basis. We distribute weekly and as needed, emergency food and 5,000 articles of clothing each month. In addition to our feeding ministry, we do special events during the holidays.\n"
  },
  {
    "addressLine1": "100 Bullocks Point Avenue",
    "city": "East Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02915",
    "name": "East Bay Coalition For the Homeless",
    "organization": "East Bay Coalition For the Homeless",
    "phone": "(401) 437-5104",
    "website": "http://www.eastbayhomeless.org/",
    "description": "Housing Program\nEast Bay Coalition for the Homeless housing program provides apartments for homeless families with children, combined with case management and supportive services. The East Bay Coalition for the Homeless has 18 apartments in the East Bay area. They are located in East Providence, Warren and Bristol. Length of stay depends upon each familys needs, and it is also determined by compliance to program criteria.\n\nRhode Island residents who meet the homeless criteria are eligible to apply. Families must meet the federal definition of homeless, be a Rhode Island resident for 6 months, and be employed. Case management and support services are cornerstones to every family's success. Our programs are designed to provide individualized support services to help families achieve and maintain financial stability."
  },
  {
    "addressLine1": "325 Niagara Street",
    "city": "Providence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02907",
    "name": "Mcauley Village - Mcauley Ministries",
    "organization": "Mcauley Village - Mcauley Ministries",
    "phone": "(401) 467-3630",
    "website": "https://mcauleyri.org/",
    "description": "Transitional housing program for homeless single parents and children. The Village has 23 apartments and an on-site Child Care Learning Center. We provide the basic human needs of shelter, child care, supportive services, advocacy and guidance to homeless families seeking help."
  },
  {
    "addressLine1": "176 Sayles St",
    "city": "Woonsocket",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02895",
    "name": "Community Care Alliance Woonsocket Homeless Shelter",
    "organization": "Community Care Alliance Woonsocket Homeless Shelter",
    "phone": "(401) 767-0866",
    "website": "https://www.communitycareri.org/ProgramsServices/Housing/WoonsocketShelter.aspx",
    "description": "The Woonsocket Homeless Shelter is open 24 hours a day, 365 days per year, housing nearly 80 persons per night through the shelter and six emergency apartments.\n\nIn addition to securing housing, residents receive case management services to help identify and address their specific needs. Residents are linked to other services within the agency and community including:\n\nLife skills training (household and financial management, home maintenance, nutrition)\nParenting support\nEmployment and training\nGED & other educational support services\nMental health and substance abuse counseling\nBasic needs assistance\nEarly childhood intervention\nHealthcare\nAfter school program\n\nShelter stays are limited to ninety days, but can be renewed based on progress demonstrated by residents or impending permanent housing. Nominal program fees are assessed based on income.\n\nFor information and to inquire about available openings, call 401-767-0866.\n\nThe Transitional Housing program is offered to families who will live in Woonsocket after leaving the emergency shelter. Case Management services are available for up to two years to help families strengthen the self-sufficiency skills needed to remain in their new housing.\n\n\nThe Burnside Permanent Supportive Housing Program serves single men who meet eligibility requirements related to homelessness, disability and income. Residents work with a case manager to access services and increase self sufficiency through life-skills training, community service or employment, access to income supports, and other services to help them improve their health and well-being. For more information about this program, contact 401-671-6975."
  },
  {
    "addressLine1": "24 Farnsworth Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02210",
    "name": "24 HOUR CHILD/AT RISK HOTLINE - C/O Dept. of Social Services",
    "organization": "24 HOUR CHILD/AT RISK HOTLINE - C/O Dept. of Social Services",
    "phone": "(800) 792-5200",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "1960 Washington St",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02118",
    "name": "Cardinal Medeiros Center",
    "organization": "Cardinal Medeiros Center",
    "phone": "(617) 619-6960",
    "website": "https://www.baycovehumanservices.org/the-cardinal-medeiros-center",
    "description": "Day program shelter for ages 45+.\nShelter Services:\nRecreational and therapeutic activities\nSkilled case managers\nReferrals to housing, medical and mental health care resources and addiction treatment\nMedical and related services\nMeal service\nNetwork of social service supports\n"
  },
  {
    "addressLine1": "Boston City Hall, Rm. 716",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02201",
    "name": "CITY OF BOSTON EMERGENCY SHELTER COMMISSION",
    "organization": "CITY OF BOSTON EMERGENCY SHELTER COMMISSION",
    "phone": "(617) 327-6831",
    "website": "http://www.cityofboston.gov/shelter/",
    "description": "The Emergency Shelter Commission's mission is to coordinate the City's efforts to prevent and end homelessness and hunger through proactive planning, policy analysis, program development and advocacy with our city, state, federal and community partner agencies. The Commission's goal is to eradicate hunger and homelessness by seeking systemic solutions to these challenging socio-economic problems. The ESC coordinates a safety net of services and provides information and referral to homeless and hungry citizens in need."
  },
  {
    "addressLine1": "316 Huntington Avenue",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02115",
    "name": "FAMILIES IN TRANSITION",
    "organization": "FAMILIES IN TRANSITION",
    "phone": "(617) 927-8290",
    "website": "https://www.instagram.com/fitnh1/",
    "description": ""
  },
  {
    "addressLine1": "407 Shawmut Avenue",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02118",
    "name": "HARBORLIGHT SALVATION ARMY SHELTER",
    "organization": "HARBORLIGHT SALVATION ARMY SHELTER",
    "phone": "(617) 536-7469",
    "website": "https://www.facebook.com/HarborlightCP/",
    "description": ""
  },
  {
    "addressLine1": "39 Kingston Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02112",
    "name": "Kingston House - Boston Rescue Mission",
    "organization": "Kingston House - Boston Rescue Mission",
    "phone": "(617) 338-9000",
    "website": "https://www.brm.org/",
    "description": "Mission:\n\n* To offer resources that prevent and end homelessness\n\n* To support the recovery, health, faith, and independence of those who have a history of substance abuse, incarceration, and homelessness\n\n\n* To raise awareness about the root causes of these life risks\n\n* To serve everyone with respect, integrity, and grace\n\n* To continue to learn, grow, and excel in our services\n\n* To be good stewards of the resources entrusted to us by our supporters\n\n* To reflect the teachings of Jesus and the love of God in all we do\n\n\n\nService:\n\n* Emergency Shelter\n\n* Food Pantries\n\n* Homeless Shelter\n\n* Meals\n\nOutpatient Counseling Center Kingston House\nThe Mission's Outpatient Counseling Center seeks to provide quality outpatient care to individuals struggling with substance abuse and substance dependence. Women and men have access to a professional, caring staff and will receive treatment in a safe, sober, and therapeutic environment. The center will provide clinical and support services to individuals to help address the wide variety of issues arising from substance abuse and substance dependence, including:\nIndividual and family counseling\nCase management to address vocational, financial, medical, mental health, educational, rehabilitative, and housing needs\nReferral to other services dependent on level of care needed (i.e. inpatient treatment, vocational training)\n\nPatient education related to sobriety, medical and mental health\nPatient education related to transmission of infectious diseases (i.e. TB, HIV/AIDS, Hepatitis, STDs)\nPatient education related to smoking cessation\nAftercare and transition planning\n\nSafe & Healthy Program\nOur year-round Safe & Healthy program members receive a nightly meal, bathroom and shower facilities, and breakfast before departing in the morning. Members also may speak with a case manager who may suggest further recovery programs, depending on the individual's needs. Nurses and a doctor are available thanks to a partnership with Boston Health Care for the Homeless.\n\nEmergency Overflow Shelter\nDuring the chilly winter months, our emergency shelter hosts people who don't have a place to sleep. Participants arrive in the evening, are screened for safety, and receive meals, shower facilities, and safe beds out of the cold. Guests leave in the morning, but may return the next evening if needed. This program generally runs between November or December through April, and is renewed on a yearly basis depending on the availability of state resources which anchor the program.\n\nResidential Recovery Program\nSubstance abuse is clearly one of the leading causes of homelessness and must be addressed in any prevention strategy. Unfortunately, recovery for individuals with limited financial means usually consists of a three to five day detoxification program provided by publicly funded insurance and a return to their typically unstable pre-detoxification living situation. This \"recovery\" is clearly inadequate, and many of these individuals soon revert to substance abuse and again put themselves at risk of becoming homeless.\n\nEach year, our recovery program provides hundreds of recovering alcoholics and addicts with a safe and therapeutic environment in which they can address their substance abuse issues and ultimately achieve a healthy, self-sufficient living situation. The program begins when a program member is referred by a licensed detoxification program. The referred program member is assigned to an individual case manager who conducts a careful and extensive evaluation to assess the program member's mental health and vocational, legal, cognitive behavioral, housing, medical, family, recovery, educational, and other needs. The case manager then develops an individualized care plan for the program member that is implemented through daily twelve step meetings. Over the course of the program, case managers and training sessions provide program members with substance abuse treatment, mental health services, anger management treatment, employment assistance, job training, housing assistance, and financial management assistance. In addition, program members participate in classes on living independently, repairing broken relationships, and improving social skills. The goal of these sessions is to build program member self-esteem and equip them with the tools and skills they need to achieve permanent self-sufficiency.\n\n\nAll program services are provided without monetary commitment from program members. This provides an opportunity to save money, including provisions for outstanding legal obligations. Instead, program members are asked to participate in community service projects that contribute to the health and well-being of their treatment environment. This provides a structured environment for each of our program members, which is an essential ingredient to the success of any recovery program.\nWhen a program member is ready to embrace independent living with a community-based support network, graduates are provided with detailed discharge and aftercare planning. Case managers track and monitor the program member's progress after discharge. Formalized aftercare services are offered at Boston Rescue Mission as well as through informal relationships that have been formed through the treatment process. Graduates are welcome to utilize the Boston Rescue Mission for vocational training, employment assistance, housing assistance, or any other services on their journey to establish an independent and supportive housing environment.\n\nSober Living Program\nThis fall, the Boston Rescue Mission launched an exciting new opportunity to support downtown Bostons community of recovering alcoholics and addicts - the Sober Living program. Adult men with 30 days of sobriety can complete a short screening procedure to determine eligibility and enter the Kingston House as a member of a sober community.\nLike other sober communities, members abide by certain house rules to ensure safety and sobriety and pay a nominal weekly fee as a commitment to the program and to support the cost of their living space.\n\nBut a few things distinguish the Missions Sober Living program from other sober communities:\n\n1. A centrally located and convenient downtown location is a huge plus for many program members, who can find and access places of employment and transportation options easily.\n2. Members' fees include all meals. Because the Mission serves so many people each day, its easy to include Sober Living members, and it saves a lot of money for members.\n3. Members have access to in-house group recovery meetings, case managers, spiritual development and many other resources available to residential recovery program members. Since many Sober Living members have recently graduated from a recovery program, these in-house resources are very attractive to potential members.\n\nThe Mission sees the Sober Living program as a natural extension of our residential recovery program to fill a critical need in the recovery community of downtown Boston. We appreciate your prayers and support through the launch of this exciting program.\n\nDirections - Public Transportation\nDirections by the \"T\" (Boston's subway system):\nThe Boston Rescue Mission is accessible by the Red, Orange and Green Lines.\nTake the Red Line to the Downtown Crossing stop. Go up the Chauncy Street Exit. You will be at the intersection of Chauncy and Summer Street (by the CVS Pharmacy). Walk down Summer Street one block with CVS on your right and take a right onto Kingston Street, we are located 3/4 of the block down Kingston Street on the right side at 39 Kingston.\nTake the Orange Line to the Downtown Crossing stop. Go up the Washington Street exit. You will be directly across from Macy's. Walk down Summer Street with Macy's on your right. Cross Chauncy Street, passing the CVS Pharmacy on your right, and take a right onto Kingston Street. We are located 3/4 of the block down Kingston Street on the right side at 39 Kingston.\nTake the Green Line to the Park Street Station. Cross over Tremont street and walk down Winter Street. Continue down Winter Street/Summer Street (Winter Street turns into Summer Street) Walk down Summer Street past Macy's on your right, cross Chauncy Street, passing the CVS Pharmacy and take a right onto Kingston Street. We are located 3/4 of the block down Kingston Street on the right side at 39 Kingston.\n\n\n"
  },
  {
    "addressLine1": "285 Columbus Ave.",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02116",
    "name": "MASS BAY CHAPTER AMERICAN RED CROSS",
    "organization": "MASS BAY CHAPTER AMERICAN RED CROSS",
    "phone": "(800) 564-1234",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "24 Farnsworth Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02210",
    "name": "MASS. DEPT. OF SOCIAL SERVICES - Metropolitan Boston",
    "organization": "MASS. DEPT. OF SOCIAL SERVICES - Metropolitan Boston",
    "phone": "(617) 748-2000",
    "website": "https://www.facebook.com/massgov",
    "description": ""
  },
  {
    "addressLine1": "112 Southampton St.",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02218",
    "name": "Shelter at 112 Southampton Street - Boston Public Health Commission",
    "organization": "Shelter at 112 Southampton Street - Boston Public Health Commission",
    "phone": "(617) 534-6100",
    "website": "https://www.bhchp.org/locations/southampton-street-shelter/",
    "description": "Our men's shelter, located on Southampton Street in the Newmarket district of the South End, is a state-of-the-art facility that opened in June 2015. This shelter serves men only and beds are allotted on a first-come, first-served basis. At full capacity, the shelter holds over 400 nightly guests. Men looking for shelter for the evening should go to Southampton Street Shelter, where they will be searched, screened and given admission.\n\nThe shelter is open 24 hours a day on year round basis.\n\nProvided at the shelter:\n\nMeals - Breakfast, lunch, and dinner meals are served to guests in our cafeteria.\n\nToiletries - Guests are provided with soap, toothpaste, shaving cream, and shampoo.\n\n\nEmergency Clothing - Guests are given access to emergency clothing assistance.\n\nLockers - Guests may access rental lockers for personal belongings or medications.\n\nMedical Health Care - Guests have access to the clinic operated by Boston's Health Care for the Homeless.\n\nMental Health - Mental Health services are available on a walk-in basis for anyone who feels they need help or counseling.\n\nIndividual Case Management - Guests are encouraged to meet with the Case Management Department for referrals to both internal and external job training, education and substance abuse services."
  },
  {
    "addressLine1": "569 Columbus Avenue",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02118",
    "name": "METROPOLITAN BOSTON HOUSING PARTNERSHIP",
    "organization": "METROPOLITAN BOSTON HOUSING PARTNERSHIP",
    "phone": "",
    "website": "https://twitter.com/metrohousingbos",
    "description": ""
  },
  {
    "addressLine1": "444 Harrison Avenue",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02118",
    "name": "Pine Street Inn Boston - Men's Shelter",
    "organization": "Pine Street Inn Boston - Men's Shelter",
    "phone": "(617) 482-4944",
    "website": "http://www.pinestreetinn.org/",
    "description": "Men seeking emergency shelter for the first time are encouraged to come to the Men's Inn, located at 444 Harrison Avenue, Monday through Saturday, 8 a.m.6 p.m. During these hours, an intake specialist can meet with you to assess your needs and help you to find the best options for your situation. Staff are available to assist you in securing permanent housing.\n\nThe Mens Inn provides emergency shelter services to over 350 men each night. Guests typically receive a bed after meeting with a case manager, who will help them chart the next steps toward securing permanent or transitional housing, job training, substance abuse counseling or other needed services.\n\nIn addition to a bed, the Mens Inn offers guests two meals a day, shower and laundry facilities and a health clinic.\nFrom the Mens Inn, many guests move on to one of Pine Streets transitional programs."
  },
  {
    "addressLine1": "401 Quincy Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02125",
    "name": "Queen of Peace Family Shelter",
    "organization": "Queen of Peace Family Shelter",
    "phone": "(617) 288-4182",
    "website": "",
    "description": "The Queen of Peace is a 11 bed family shelter. Provides dinner and breakfast. Clothing whjen available. 3 week stay maximum. Accepts women & children (boys under 5).\n\nMust be at shelter at 4prn & out by 9 am. Call for further details."
  },
  {
    "addressLine1": "39 Boylston Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02112",
    "name": "Saint Francis House Day Center Essex Station",
    "organization": "Saint Francis House Day Center Essex Station",
    "phone": "(617) 542-4211",
    "website": "https://stfrancishouse.org/",
    "description": "Programs:\n Day Shelter\n Medical Clinic\n Behavioral Health\n Womens Center\n Expressive Art Therapy\n Housing\n\n"
  },
  {
    "addressLine1": "41 New Chardon Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02114",
    "name": "TEMPORARY HOME FOR WOMEN AND CHILDREN",
    "organization": "TEMPORARY HOME FOR WOMEN AND CHILDREN",
    "phone": "(617) 720-3611",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "794 Massachusetts Ave",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02118",
    "name": "Woods Mullen Shelter and Services",
    "organization": "Woods Mullen Shelter and Services",
    "phone": "857-654-1690",
    "website": "https://www.bhchp.org/locations/woods-mullen-shelter/",
    "description": "Our women's shelter, known as Woods-Mullen, is located at 794 Massachusetts Avenue in Boston's South End. The shelter serves female adults ages 18 years or older. The shelter has 200 beds and is open 365 days a year, 24 hours a day. Beds are given out on a first-come, first-served basis. In the winter months, additional overflow beds are available."
  },
  {
    "addressLine1": "17 Court Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02108",
    "name": "New England Center for Homeless Veterans",
    "organization": "New England Center for Homeless Veterans",
    "phone": "(617) 371-1800",
    "website": "http://www.nechv.org/",
    "description": "The Mission of the New England Center for Homeless Veterans is to extend a helping hand to homeless men and women veterans who are addressing the challenges of: addiction, trauma, severe and persistent mental illness, and/or unemployment and who will commit themselves to sobriety, non-violence, and working for personal change. We are recognized as one of the most effective private veteran's transition programs in the country.\n\n"
  },
  {
    "addressLine1": "3815 Washington Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02111",
    "name": "FamilyAid Boston, Inc",
    "organization": "FamilyAid Boston, Inc",
    "phone": "(617) 542-7286",
    "website": "https://familyaidboston.org/",
    "description": "To utilize Family Emergency Solutions, a family must be homeless, have children under the age of 18, and have most recently resided in Boston. Families also must be ineligible for state-funded Emergency Assistance (EA) or an applicant for EA without shelter options. We have an on-call staff in place if you are in need of Family Emergency Solutions on nights, weekends, or at any other time that our offices are closed. They can be reached through the Mayor's Hotline at 617-635-4500."
  },
  {
    "addressLine1": "363 Albany Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02118",
    "name": "The Women's Inn at Pine Street",
    "organization": "The Women's Inn at Pine Street",
    "phone": "(617) 482-4944",
    "website": "https://www.facebook.com/PineStreetInn",
    "description": "Beds are assigned daily using a lottery system. To enter the drawing, please arrive at the Women's Inn by 3 p.m. and speak to the staff at the front desk. Names are drawn for the lottery at 3:30 pm. A bed is not guaranteed, though staff will work to find options for you."
  },
  {
    "addressLine1": "PO Box 180019",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02118",
    "name": "Casa Myrna Vazquez Domestic Violence Support",
    "organization": "Casa Myrna Vazquez Domestic Violence Support",
    "phone": "(617) 521-0100",
    "website": "http://www.casamyrna.org/",
    "description": "Emergency and transitional support for battered women. Also provides transitional housing. Call for details and support."
  },
  {
    "addressLine1": "1 Washington Mall",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02108",
    "name": "Crittenton Women's Union",
    "organization": "Crittenton Women's Union",
    "phone": "(617) 259-2900",
    "website": "http://www.liveworkthrive.org/",
    "description": "Crittenton Women's Union is the largest provider of family shelter in Massachusetts, serving more than 350 families a year. During their stay, families develop a plan to help them move toward an economically independent life. Also provides Family support services and Food Services.\n\nCrittenton Women's Union provides a residential meals program for its congregate housing sites in Brighton and Allston and conducts a for-profit food business delivering more than 1,000 meals day. CWU's for-profit food services contributes revenues that help fund CWU's direct services, research and advocacy."
  },
  {
    "addressLine1": "1 Westminster Ave",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02119",
    "name": "Roxbury Stone House",
    "organization": "Roxbury Stone House",
    "phone": "(617) 427-9801",
    "website": "https://www.stonehouseinc.org/",
    "description": "The Elizabeth Stone House is committed to countering the effects of trauma and breaking the cycles of violence and abuseone family at a time. Through residential and community support services, the Stone House helps families heal and women reclaim control over their lives.\n\nThe mission of the Elizabeth Stone House is to serve homeless families and individuals in a goal-oriented, outcome-driven service environment by resolving the issues that made them homeless - domestic violence, substance abuse, and mental illness - so that they can attain and maintain permanent housing, personal safety, and economic stability."
  },
  {
    "addressLine1": "112 Southampton Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02118",
    "name": "Shelter at 112 Southampton Street",
    "organization": "Shelter at 112 Southampton Street",
    "phone": "617-534-2881",
    "website": "mailto:delvalle@bphc.org",
    "description": "The new shelter, located on Southampton Street in the Newmarket district of the South End aims to offer a welcoming setting to guests. On January 14th, 2nd floor of a multiphase construction project was opened, allowing the shelter to serve adult males aged 18 years or older 365 days a year. During this developing period, the Southampton Street site has 100 beds available. Continued development is underway for Phase 2 of the facility's construction, including additional beds, increased space for programming and improved amenities. At full capacity, the shelter is slated to hold upwards of 400 nightly guests upon final completion in Spring 2015. Beds are allotted on a first-come, first-serve basis. Those looking for shelter for the evening should go to Central Intake at the Woods-Mullen Shelter, located at 794 Massachusetts Avenue, in Boston. Transportation goes from our intake site at 794 Massachusetts Avenue (Woods-Mullen Shelter) to the Southampton site every day between 4:10pm and 5:40pm. The shelter is open 24 hours a day during the colder months of the year."
  },
  {
    "addressLine1": "40 Berkley Street",
    "city": "Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02116",
    "name": "Betty's Place - Boston YWCA",
    "organization": "Betty's Place - Boston YWCA",
    "phone": "(617) 542-3740",
    "website": "http://projectplace.org/housing/",
    "description": "Transitional housing for women.\n\nCapacity 10 women at a time.\n\nProvides 2 meals a day.\n\nClients must follow a curfew and be sober."
  },
  {
    "addressLine1": "56 Havre Street",
    "city": "East Boston",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02128",
    "name": "Crossroads Family Shelter & Food Pantry",
    "organization": "Crossroads Family Shelter & Food Pantry",
    "phone": "617-567-5926",
    "website": "https://stmaryscenterma.org/about/home/crossroads/",
    "description": "Crossroads mission is to support families as they transition from homelessness to independent living and self-sufficiency. Today Crossroads provides shelter, case management, housing search, stabilization services, and food pantry assistance to homeless, formerly-homeless and low-income families.\n\nServices:\nCrossroads operates a food pantry at the shelter as an emergency resource for EAST BOSTON RESIDENTS who need food assistance for their families and themselves.\n\nShelter units at Crossroads Family Shelter are currently dedicated to families referred to by the states Department of Housing & Community Development (DHCD).\n\n\nFamilies seeking shelter are encouraged to contact DHCD to see if they are eligible for Emergency Assistance and placement in a family shelter such as Crossroads.\n\nDHCD Phone number: 877-481-3308"
  },
  {
    "addressLine1": "10 Pertshire Road",
    "city": "Brighton",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02135",
    "name": "EMPath Emergency Shelter - Main Program Facility",
    "organization": "EMPath Emergency Shelter - Main Program Facility",
    "phone": "(617) 782-7600",
    "website": "https://www.empathways.org/",
    "description": "Housing/EMPaths shelter programs (must apply through the state).\nEligibility and Requirements:\nResident of Massachusetts\nMeet the gross income standards\nHave needy children under the age of 21\nBe pregnant\nNo-fault fire\nFlood\nNatural disaster\nCondemnation\nForeclosure\nFleeing domestic violence\nNo-fault eviction\nChildren exposed to a substantial health and safety risk\nAdditional Services:\nFood\nCash Assistance & Mutual Aid\nUnemployment\nDomestic Violence\nImmigration\nChild Care\nTransportation\nHealth Care, Health Insurance, & Mental Health\nLegal Services\nLGBTQIA+ Resources\n"
  },
  {
    "addressLine1": "66 Winthrop Street",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02138",
    "name": "Harvard Square Homeless Shelter",
    "organization": "Harvard Square Homeless Shelter",
    "phone": "(617) 876-3256",
    "website": "http://www.hshshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "137 Newbury Street",
    "city": "Brockton",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02301",
    "name": "Old Colony YMCA David Jon Louison Center",
    "organization": "Old Colony YMCA David Jon Louison Center",
    "phone": "(508) 584-4315",
    "website": "https://www.oldcolonyymca.org/community-social-services/congregate-care/dhcd/david-jon-louison-cente",
    "description": ""
  },
  {
    "addressLine1": "54 North Main Street",
    "city": "Brockton",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02301",
    "name": "Mainspring House Shelter",
    "organization": "Mainspring House Shelter",
    "phone": "(508) 587-5441",
    "website": "https://helpfbms.org/",
    "description": "Open: 24 hours per day, 365 days per year.\n\nIf you are an individual in need of emergency shelter for the night, we operate two shelters for adults (no children or minors):\nFather Bills Place\n38 Broad Street\nQuincy, MA 02169\nPhone: 617-770-3314\n\nMainSpring House\n54 North Main Street\nBrockton, MA 02301\nPhone: 508-587-5441\n\nFather Bills Place, Quincy, and MainSpring House, Brockton is open to any individual adult, age 18+, who originates from our service area (proof of connection to service area required). Guests not originating from our service area may stay for up to 3 days as you make arrangements for shelter or other services in your area of origin.\n\nGuests may bring 2 bags. Intake begins at 4:30 p.m. and ends at 6:00 p.m. daily. During intake, belongings are searched to ensure safety of all guests; medications and electronics (including cell phones) are locked and made available as needed; beds are assigned; and guests are given towels. Guests must depart the building by 7:30 a.m. each morning, unless inclement weather dictates a \"stay-in\" day, which will be announced by staff that morning.\n\nGuests are served a hot dinner and a continental breakfast. Lunch is also available and open to the community from 11: 30 a.m. to 1:00 p.m.\nFamilies in need of shelter must be referred through the Department of Housing and Community Development."
  },
  {
    "addressLine1": "1045 Main Street",
    "city": "Hingham",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02043",
    "name": "MARY MARTHA",
    "organization": "MARY MARTHA",
    "phone": "(781) 749-5441",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "1045 Main Street",
    "city": "Hingham",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02043",
    "name": "MARY MARTHA CENTER",
    "organization": "MARY MARTHA CENTER",
    "phone": "(781) 749-5441",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "402 Massachusetts Avenue",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02139",
    "name": "Cambridge Shelter (Salvation Army)",
    "organization": "Cambridge Shelter (Salvation Army)",
    "phone": "(617) 547-3400",
    "website": "https://twitter.com/cambridgecorps",
    "description": "Short term and extended stay beds for sober men only. Provides case management, substance abuse services and vocational counseling. Call first thing in the morning (7am or later) to reserve a bed.\n\nArrive before 7pm to claim a bed. No referral needed. No geographic restrictions."
  },
  {
    "addressLine1": "109 School Street",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02139",
    "name": "Heading Home Shelter",
    "organization": "Heading Home Shelter",
    "phone": "(617) 547-1885",
    "website": "http://www.headinghomeinc.org/",
    "description": "Short term and extended stay beds for sober men and women. Provides case management, housing search, and referrals to community services to assist with mental health, medical care, employment, education, and benefits.\nReferral is needed; then call at 10 am to reserve a bed\n\n\nOur clients are both individuals and families spanning all ages, from infancy (and even pre-natal care) to elderly. A typical homeless family consists of a single mother in her 20s with 1-3 children; the majority of our own family program participants are young single mothers. People with disabilities are disproportionately homeless; we also provide specific services for individuals with disabilities both directly and via partnerships with housing development corporations.\n\nPrograms\n\nPermanent Housing\nCongregate Housing\nScattered-Site Apartments\nThe John G. Guillemont House\nLopez Avenue Property\n\nTransitional Housing\nMedford Family Life Education Center\nTransitional Housing Partnerships\nTransitional Apartments\n\nShelter and Emergency Services\nDorchester Family Shelters\nCambridge Shelter\nWomens Drop-In Program\nScattered-Site Apartments"
  },
  {
    "addressLine1": "7 Temple Street",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02139",
    "name": "YWCA CAMBRIDGE",
    "organization": "YWCA CAMBRIDGE",
    "phone": "(617) 491-6050",
    "website": "https://ywcacam.org/",
    "description": "Our shelter only excepts families referred by Department Housing Community Development."
  },
  {
    "addressLine1": "7 Temple St",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02139",
    "name": "YWCA Cambridge",
    "organization": "YWCA Cambridge",
    "phone": "617-491-6050",
    "website": "https://ywcacam.org/",
    "description": ""
  },
  {
    "addressLine1": "11 Garden Street",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02138",
    "name": "First Church Shelter",
    "organization": "First Church Shelter",
    "phone": "(617) 661-1873",
    "website": "http://www.firstchurchcambridge.org/",
    "description": "Emergency shelter. Stay is variable. Hours: 6pm - 7am.\n\nProvides a basic act of mercy to the poor and homeless of Cambridge and surrounding communities. Each evening 14 men are provided with a safe, comfortable place to stay. Our guests have access to two meals, showers and personal storage facilities for their belongings.\n\nFirst Church Shelter also offers guests assistance with identifying and securing resources they need to move out of homelessness. A significant portion of that assistantance comes from a partnership between the Shelter and Homestart.\nShelter staff are available to help guests negotiate the frequently difficult and intimidating process of applying for public benefits or subsidized housing.\nThe Shelter is accessed on a referral only basis and is not able to accept walk-ins. Primary funding for the Shelter comes from a contract between the Commonwealth of Massachusetts and First Church Cambridge. The work of the Shelter would not be possible without additional assistance from other sources including the membership of First Church. Donations to support the Shelter are tax deductible."
  },
  {
    "addressLine1": "362 Green St",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02139",
    "name": "Multi Service Center for the Homeless",
    "organization": "Multi Service Center for the Homeless",
    "phone": "(617) 349-6340",
    "website": "https://www.cambridgema.gov/DHSP/programsforadults/cambridgemultiservicecenter",
    "description": "The Cambridge Multi-Service Center (MSC) addresses the needs of homeless and near-homeless individuals and families living in the community, they provide homeless service but they are not a shelter.\nServices:\nPlanning and coordination of efforts for persons who are living on the street, in emergency shelters or at risk of losing their housing.\nPrevent evictions and resolve landlord-tenant problems through case management, advocacy and budget counseling.\nTransitional living program for homeless men.\nProvide assistance in applying for public benefits, financial counseling, legal services, and accessing mental health and substance abuse services.\nCase management, information and referral\nHaitian Creole interpretation\nImmigration and citizenship assistance\n\n\n"
  },
  {
    "addressLine1": "402 Massachusetts Avenue",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02139",
    "name": "The Salvation Army Massachusetts Division",
    "organization": "The Salvation Army Massachusetts Division",
    "phone": "(617) 547-3400",
    "website": "https://easternusa.salvationarmy.org/massachusetts/",
    "description": "This Salvation Army location provides much more than an emergency shelter. They also provide:\nAlcohol and Drug Treatment, Military Personnel Assistance, Transitional Care & Work Release, Emergency Financial Assistance, rent assistance, Transitional Housing.\n\nThere are many other services. Contact them for help and details."
  },
  {
    "addressLine1": "614 Massachusetts Avenue Third Floor",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02139",
    "name": "Hildebrand Family Self-Help Center - Congregate Family Shelter",
    "organization": "Hildebrand Family Self-Help Center - Congregate Family Shelter",
    "phone": "(617) 491-5752",
    "website": "http://www.hild-selfhelp.org/",
    "description": "This is the administrative office.\nHildebrand Family Self-Help Center provides shelter to families only and operates under a closed referral contract with the state.\nHildebrand Services provided:\nEmergency shelter units with common facilities and on-site services\nIndependent apartments with support services and less structured supervision, designed for families ready to transition to permanent housing\n\nTemporary (90 days) units for moderate income families in need of short- term homelessness support intervention\nAffordable housing offering permanent homes to low-income and formerly homeless families.\nContact them for more details.\n"
  },
  {
    "addressLine1": "1 Church St",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "00000",
    "name": "Y2Y Harvard Square - Seasonal Shelter",
    "organization": "Y2Y Harvard Square - Seasonal Shelter",
    "phone": "(617) 864-0795",
    "website": "http://y2yharvardsquare.org/",
    "description": "Y2Y is an emergency shelter for young adults. We accept anyone between the ages of 18-24. We also accept some 25 year-olds, as long as they were still 24 years of age at the beginning of our operational season (November 1st). Under no circumstances can we accept guests who are less than 18 years old.\n\nY2Y is not a wet shelter or a dry shelter. It is a safe shelter. At the door each night, our youth worker on staff will assess if everyone is safe to be in the space (i.e. not a potential danger to themselves and others). Our youth worker will also assess whether everyone who enters the shelter will be a non-disruptive and constructive presence in the space that evening.\n\n\nBecause of our youth-to-youth volunteer model, we dont have the ability to accept guests who need close medical supervision or guests who may be disruptive in the space. We use behavioral, not biological, thresholds to determine safety.\n\nGetting A Bed\nY2Y offers two kinds of stays, 30-night stays and 1-night stays. We only give away beds by lottery. Here is a printable version of information about Y2Y, services provided, and how to receive a bed.\n\n30 Night Stays At Shelter\nEnter the 30-night bed lottery by calling us in the morning at (617)864-0795 between 8:00 A.M and 8:45 A.M in the morning. A Y2Y staff member will ask for your name and date of birth, and then give you a lottery number.\n\nTo check if you have won the 30-night lottery, call us back after 8:50 A.M. or come to the entrance of the shelter, where we will post winning lottery numbers daily.\n\n1 Night Stays\nEnter the 1-night bed lottery by calling us in the evening between 9:00 P.M. and 9:30 P.M. Then, call back after 9:35 P.M. to check if you have won a bed for that night. You must arrive at the shelter by 11:45 P.M.\n\nYou may enter both the 30-night lottery and the 1-night lottery on the same day. For example, if you call us in the morning but do not receive a 30-night bed, you may call us that same evening to enter the 1-night lottery.\n\nMore Information\nOn a few days, beds will not be available at Y2Y if we have no space. If you call, a Y2Y staff member will tell you that beds are not available that day. We encourage you to call back the next day to re-enter the lottery, as beds will frequently open up.\nDo not enter the 30-night lottery more than once per day, or you may be disqualified. However, if you do not win the 30-night lottery, we encourage you to call back in the evening for a one-night stay, or call back the next day to re-enter the lottery.\n\nCase mangers, social workers, and other individuals may enter the lottery on behalf of someone else. If you are entering the lottery on behalf of someone else, make sure that person is aware you are doing so, and ready to accept a bed immediately. Make sure no one else is entering the lottery on behalf of that person, since double entries may lead to disqualification.\n\nYou can contact the shelter through email: info@y2yharvardsquare.org.\n\n"
  },
  {
    "addressLine1": "240 Albany Street",
    "city": "Cambridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02139",
    "name": "CASPAR Emergency Care Center",
    "organization": "CASPAR Emergency Care Center",
    "phone": "(617) 661-0600",
    "website": "http://www.casparinc.org/",
    "description": "Bed lottery is at 2:30 PM.  Beds can only be reserved in person.\n\nCASPAR's Emergency Service Center (ESC) is one of three shelters in Massachusetts that accept homeless people who are actively using alcohol and drugs. At the ESC clients receive medical and mental health care, nutritional food, personal hygiene supplies, clean clothes, counseling, case management, and employment, housing, and treatment referrals in an environment that is welcoming and safe. The ESC provides 24-hour shelter, 365 days a year to residents of Cambridge and Somerville.\n\nProvides\n107 beds for men and women who are actively using drugs and/ or alcohol.  Clients have access to medical care, 3 meals a day, personal hygiene supplies, case management, and treatment referrals in a safe and welcome environment.\n\nCASPAR is a nonprofit organization founded in 1970 in response to the need for community-based services for those affected by substance use disorders. Since then CASPAR has built a comprehensive array of outreach, shelter, stabilization, residential, aftercare, education, and prevention services. We focus on programs that are safe, accessible, and supportive and that meet the needs of a diverse population of high-risk men, women, children and adolescents, most of whom are uninsured and indigent."
  },
  {
    "addressLine1": "270 Washington St",
    "city": "Somerville",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02143",
    "name": "St. Patrick's Shelter",
    "organization": "St. Patrick's Shelter",
    "phone": "(617) 268-3088",
    "website": "http://www.ccab.org/",
    "description": "An emergency and extended stay shelter for women only over the age of eighteen. Operated by Catholic Charities. No referral needed, walk in by 3pm. Hours of operation: shelter 24/7, Office 9/5 daily except for weekends. Serves all of Middlesex County. Clients need to call in the morning for bed reservation. Shelter pick-up is at the Cambridge Multi-Service Center, 362 Green Street, Cambridge (Central Square) at 4:00 pm. Shelter offersbed and a food pantry on Tuesdays and Thursdays. It is not wheelchair accessible"
  },
  {
    "addressLine1": "address not disclosed",
    "city": "Cataumet",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "00000",
    "name": "Village at Cataumet Family Shelter",
    "organization": "Village at Cataumet Family Shelter",
    "phone": "(508) 563-7619",
    "website": "http://www.haconcapecod.org/programs-and-services/shelter-individuals-and-families/",
    "description": "The Village at Cataumet is a family shelter that offers education and employment services, as well as assistance in finding permanent housing. HAC also operates scattered-site family shelters, which are apartments and duplexes in the mid-Cape area."
  },
  {
    "addressLine1": "294 Old Main Road",
    "city": "North Falmouth",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02556",
    "name": "Carriage House Shelter",
    "organization": "Carriage House Shelter",
    "phone": "(508) 564-6485",
    "website": "",
    "description": "The Carriage House shelter in North Falmouth specializes in serving first-time mothers and their children. While sheltering is primary, Carriage House also provides an ongoing in-house workshop program, supportive services and linkages to community resources."
  },
  {
    "addressLine1": "2 Brookview Street",
    "city": "Dorchester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02124",
    "name": "Brookview House Transitional Housing Program",
    "organization": "Brookview House Transitional Housing Program",
    "phone": "(617) 265-2965",
    "website": "https://brookviewhouse.org/",
    "description": "Established in 1990, the agency's mission is to help homeless and at risk families learn the skills necessary to break the cycle of homelessness and poverty. With sites in Roxbury and Dorchester, we provide a safe, community setting with customized services to give homeless moms and kids the help and skills they need to succeed.\n\n\nAGENCY PROGRAMS:\n1) YOUTH DEVELOPMENT PROGRAMS are licensed by the Commonwealth and designed to help school-age children (5.9 to 19 years old) recover from the trauma of homelessness and do well in school. Research indicates that children in a supportive, stable community can heal from the traumas of homelessness, stay in school and thrive. Brookview provides daily after school and full day summer programs with customized academic, emotional and behavioral support.\n\n2) TRANSITIONAL HOUSING, EMERGENCY HOUSING & RENTAL HOUSING with services. HOUSING SEARCH ASSISTANCE.\n\nBrookview provides a safe, supportive place to stay with on-site children's programs and lots of support. Moms who know their children are safe can focus on building the skills they need to support their families.\n\n3)TRAINING & EDUCATION. Our dedicated staff helps people address and overcome their particular barriers to success by offering a full range of skill building and health workshops. Each participant has a customized education, life skills and job skills training plan.\n\n4) PREVENTION & STABILIZATION. Brookview House also opens its programs to local area residents and schools to help those at risk of homelessness stay at work and housed. As a result, we're stabilizing the community as we're helping families thrive.\n"
  },
  {
    "addressLine1": "25 Leonard Street",
    "city": "Dorchester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02122",
    "name": "CATHOLIC CHARITIES St. Ambrose Family Inn",
    "organization": "CATHOLIC CHARITIES St. Ambrose Family Inn",
    "phone": "(617) 288-7675",
    "website": "http://www.bc.edu/bc_org/avp/cas/pulse/stambrose.html",
    "description": "St. Ambrose Family Inn, a program of Catholic Charities, is a shelter in the Field's Corner neighborhood of Dorchester. Opened in 1989, the shelter can accommodate 12 families. The population is mostly women and children, but we do accept fathers with their children. There are usually 18-25 children staying at the shelter and they range in age from 0 to 17 years. The goals of the shelter are to assist families in finding safe and affordable housing, and to prepare families to live successfully and independently in their own apartments. While families stay at the Inn, they are provided with housing search assistance, social work services, comfortable rooms and nutritious meals."
  },
  {
    "addressLine1": "250 252 Columbia Road",
    "city": "Dorchester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02121",
    "name": "FAMILY HOUSE SHELTER",
    "organization": "FAMILY HOUSE SHELTER",
    "phone": "(617) 427-4470",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "1 Lingard Street",
    "city": "Dorchester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02125",
    "name": "HOLY FAMILY SHELTER",
    "organization": "HOLY FAMILY SHELTER",
    "phone": "",
    "website": "",
    "description": "We currently do not have an active phone number for this shelter. I am not sure if this shelter itself is still active - Mike (HomelessShelterDirectory.org)"
  },
  {
    "addressLine1": "1500 Dorchester Avenue",
    "city": "Dorchester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02122",
    "name": "KIT CLARK SENIOR SERVICES",
    "organization": "KIT CLARK SENIOR SERVICES",
    "phone": "(617) 825-5000",
    "website": "https://www.baycovehumanservices.org/",
    "description": ""
  },
  {
    "addressLine1": "540 Columbia Road",
    "city": "Dorchester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02125",
    "name": "PILGRIM CHURCH SHELTER",
    "organization": "PILGRIM CHURCH SHELTER",
    "phone": "(617) 282-0456",
    "website": "",
    "description": "Since 1990, a Shelter for unaccompanied homeless men has been operated at Pilgrim Church. Originally established by Positive Lifestyles, it is now under the direction of the United Homes Adult Services division of Children's Services of Roxbury (this connection began with a recognition that a large number of homeless adults are, in fact, former foster children.)"
  },
  {
    "addressLine1": "45 Magnolia Street",
    "city": "Dorchester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02125",
    "name": "Family Shelter Project Hope",
    "organization": "Family Shelter Project Hope",
    "phone": "(617) 442-1880",
    "website": "https://twitter.com/project_hope",
    "description": "The Family Shelter was one of the first homeless shelter for families in the state and remains a model for its respectful and empowering approach. Approximately 20 women and their children are sheltered each year. The women are assisted to secure permanent housing and to connect with Project Hope's adult education and career development opportunities. If you need more information about how to access emergency shelter in Massachusetts call the Washington Street branch of the Department of Housing & Community Development DHCD at 617-989-6100."
  },
  {
    "addressLine1": "not disclosed",
    "city": "Dorchester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02124",
    "name": "ReVision Family Home",
    "organization": "ReVision Family Home",
    "phone": "(617) 541-0222",
    "website": "http://www.vpi.org/NewVPI/ReVisionHouse.html",
    "description": "shelter for 22 homeless women and their families that provides life-stabilization services, intensive housing placement services and vocational case management services. ReVision Family Home is directly connected to Victory Programs ReVision Urban Farm and also provides hands on nutritional services to shelter residents."
  },
  {
    "addressLine1": "90 Cushing Avenue",
    "city": "Dorchester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02125",
    "name": "Saint Mary's Women and Infants Center Margaret's House",
    "organization": "Saint Mary's Women and Infants Center Margaret's House",
    "phone": "(617) 436-8600",
    "website": "https://stmaryscenterma.org/",
    "description": "Shelter for homeless families. Contact for full detail."
  },
  {
    "addressLine1": "14 East Grove Street",
    "city": "Middleboro",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02346",
    "name": "Conway House Shelter",
    "organization": "Conway House Shelter",
    "phone": "(508) 946-8505",
    "website": "https://www.facebook.com/pages/The-Conway-House/117026075026065",
    "description": "Office hours: Mondays through Fridays 8am to 5pm.\n\nAdvocacy.\nCounseling by referral.\nCommunity Kitchen.\nSome clothing.\nMedical care nearby.\nDay program.\nTransportation.\nMaximum age for males is 14.\nSobriety required."
  },
  {
    "addressLine1": "55 Lunenburg Street",
    "city": "Fitchburg",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01420",
    "name": "Our Father's House",
    "organization": "Our Father's House",
    "phone": "(978) 345-3050",
    "website": "http://ofhshelter.com/",
    "description": ""
  },
  {
    "addressLine1": "758 Main St.",
    "city": "Leominster",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01453",
    "name": "North Star Family Services - Shelter",
    "organization": "North Star Family Services - Shelter",
    "phone": "(978) 466-1704",
    "website": "https://northstarfs.org/",
    "description": "Shelter and Food\n\n    North Star Family Services is an emergency shelter that assists five families simultaneously in a community living/group environment.\n    Families share all common area spaces such as kitchen, living room, dining room, bathrooms, laundry room, playroom, lawn and playgrounds.\n\n    Each family is assigned a private, locking bedroom which is tastefully decorated and beds for each family member. Each room is individually climate controlled.\n    The shelter is run as a community setting where every family and staff member share the responsibility of cleaning by completing daily chores and building upkeep.\n    Meals, groceries and milk are provided on a daily basis and stored in community refrigerators and in kitchen cabinets. Additionally, each family has an individual, dorm style fridge exclusively to use for their family."
  },
  {
    "addressLine1": "180 Main Street",
    "city": "Gloucester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01930",
    "name": "Action, Inc. Emergency Homeless Shelter",
    "organization": "Action, Inc. Emergency Homeless Shelter",
    "phone": "(978) 282-1000",
    "website": "http://actioninc.org/",
    "description": "Emergency Homeless Shelter.\nACTION's Emergency Homeless Shelter provides a limited number of beds to homeless adults ages 18 and older.\nPLEASE NOTE: Space at the Shelter is limited and beds may not be available. Call before visiting. Anyone wishing to access a bed must complete an intake form at the main ACTION office building, located at 180 Main Street, Gloucester (enter through 5 Pleasant Street).\n30 people can stay at the shelter.\n\nACTION's Client Services department offers a range of assistance and resources. Our Advocates help with applications for public benefits, referrals to other service providers, help with housing issues such as eviction notices, financial advice and budgeting, and more. For many individuals, speaking with an Advocate is the first step toward a better life. Advocates are also available to meet with clients at our satellite offices in Ipswich and Rockport."
  },
  {
    "addressLine1": "45 Congress Street, Suite 4120",
    "city": "Gloucester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01970",
    "name": "Wellspring House - Emergency Shelter for Families",
    "organization": "Wellspring House - Emergency Shelter for Families",
    "phone": "(978) 281-3221",
    "website": "http://www.wellspringhouse.org/",
    "description": ""
  },
  {
    "addressLine1": "27 Congress St #103",
    "city": "Salem",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01970",
    "name": "Spirit Wellness Institute",
    "organization": "Spirit Wellness Institute",
    "phone": "978-414-5068",
    "website": "https://www.hawcdv.org/",
    "description": "Healing Abuse Working for Change (HAWC) is a nonprofit agency serving victims of domestic abuse in 23 cities and towns in the North Shore of Massachusetts. We provide free and comprehensive services for domestic violence victims including emergency family shelter, legal advocacy, individual counseling, parent-child trauma recovery program, hospital advocacy and community outreach."
  },
  {
    "addressLine1": "56 Margin Street",
    "city": "Salem",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01970",
    "name": "Lifebridge North Shore Community - Seeds of Hope Shelter",
    "organization": "Lifebridge North Shore Community - Seeds of Hope Shelter",
    "phone": "(978) 744-0500",
    "website": "http://www.lifebridgesalem.org/",
    "description": "Eligibility:\nIndividual men and women\nMust be from Essex County including Salem, Beverly, Lynn, Danvers, Peabody, Gloucester, Swampscott and Marblehead.\nServices:\nDay services to community residents\nAccess to nurses\nShowers\nClothing\nPersonal care products\nBasic supplies\n"
  },
  {
    "addressLine1": "128 Federal Street",
    "city": "Greenfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01301",
    "name": "Greenfield Family Inn And Shelter",
    "organization": "Greenfield Family Inn And Shelter",
    "phone": "(413) 774-6382",
    "website": "http://www.servicenet.org/",
    "description": ""
  },
  {
    "addressLine1": "127 How Street",
    "city": "Haverhill",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01831",
    "name": "Emmaus House",
    "organization": "Emmaus House",
    "phone": "(978) 241-3500",
    "website": "http://www.emmausinc.org/",
    "description": "We offer emergency shelter for both families and individuals, with the goal of providing not just a place to sleep but also services to help those who are homeless get back on their feet.\n\n\n\nThe Emmaus Family House program serves up to 54 homeless families at one time. Of these, 28 families live together in a congregate setting at 150 How Street in Haverhill. Families live with dignity and respect in their own suites and join together for meals, meetings, and group activities in the spacious common area located on the first floor. The family shelter program also serves 26 families in scattered site apartments located in the same Haverhill neighborhood."
  },
  {
    "addressLine1": "57 Jackson St.",
    "city": "Lawrence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01840",
    "name": "Casa Nueva Vida",
    "organization": "Casa Nueva Vida",
    "phone": "(978) 557-5775",
    "website": "http://casanuevavida.org/",
    "description": "Casa Nueva Vida (House of New Life) is the only homeless shelter in the state of Massachusetts with a completely bilingual staff. Although we serve a diverse population, we believe our bilingual expertise makes us ideally capable of providing a unique, specialized package of services and programs to Latino families some of the most vulnerable members of society. Our Mission is to To help homeless families gain the education and skills needed to permanently pull themselves out of poverty and into stable affordable housing.\n\n\n\n\nCasa Nueva Vida is committed to help homeless families find their own affordable and permanent housing as well as helping them build the skills necessary to stay out of homelessness and become active member of society."
  },
  {
    "addressLine1": "48 Holly Street",
    "city": "Lawrence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01841",
    "name": "LAZARUS HOUSE",
    "organization": "LAZARUS HOUSE",
    "phone": "(978) 689-8575",
    "website": "http://www.lazarushouse.org/",
    "description": "Opened in 1983, Lazarus House's 31-bed emergency shelter is located in the Arlington District of Lawrence, MA. Seven days a week, Lazarus House provides a safe, clean and supportive environment for individuals and families on referral by social service, law enforcement, church or community groups.\n\nGuests are provided with three meals, a place to sleep, showers and laundry services, as well as counseling and referrals for community support.\n\n\nGuests may stay at Lazarus House while looking for a permanent home. We strive to encourage and support those who are unable to find housing or for those who are working towards making a deposit on housing.\n\nAll services are provided free of charge and without regard to sex, race or religion. Above all, services are provided in the spirit of Christ with compassion and in regard for the dignity of each individual.\n\nLazarus House has 31 beds and 7 cribs, with separate rooms for men, women, and families. Lazarus House provides three meals a day, clothing, laundry, linens, toiletries, infant care supplies, as well as all of the things a family needs to be a family. Our shelter is the foundation to break the cycle of poverty and resume independent living in the future.\n\nLazarus House provides a hand up rather than a hand out:\n\nStructured, supervised environment\nAll guests work with staff advocates toward self responsibility\nEncouragement to save money - budget - develop life skills\nResponsibility - Household shelter chores\nMany people who live at the shelter work full time. Due to limited job training, experience and corresponding wages, an average of 4-6 months is required for families to save enough money to move to a permanent residence."
  },
  {
    "addressLine1": "19 Winter Street",
    "city": "Lawrence",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01843",
    "name": "DAYBREAK SHELTER",
    "organization": "DAYBREAK SHELTER",
    "phone": "(978) 975-4547",
    "website": "https://www.facebook.com/ThePsychologicalCenterDaybreakPegasusWomensView/",
    "description": ""
  },
  {
    "addressLine1": "38 Broad Street",
    "city": "Quincy",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02169",
    "name": "Father Bill's Place",
    "organization": "Father Bill's Place",
    "phone": "(617) 770-3314",
    "website": "http://helpfbms.org/",
    "description": "Emergency Shelter for those 18 years old and up.\n\n\nWe shelter an average of 225 individual adults each night at Father Bill's Place in Quincy and MainSpring House in Brockton. No one in need is turned away. Public funding covers less than half of our shelter costs. That is why your support is so important! Would you consider running a donation drive for basic supplies? Please see the wish lists below and call the development office at 617-376-2255."
  },
  {
    "addressLine1": "51 Hamilton Street",
    "city": "Holyoke",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01040",
    "name": "Providence Ministries - Loreto House",
    "organization": "Providence Ministries - Loreto House",
    "phone": "(413) 533-5909",
    "website": "https://www.provministries.org/portfolio/loreto-house/",
    "description": ""
  },
  {
    "addressLine1": "319 Main Street",
    "city": "Holyoke",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01040",
    "name": "MAIN STREET SHELTER",
    "organization": "MAIN STREET SHELTER",
    "phone": "(413) 534-2466",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "288 Oak St #1L",
    "city": "Holyoke",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01040",
    "name": "Family Place Shelter Holyoke",
    "organization": "Family Place Shelter Holyoke",
    "phone": "(413) 536-2787",
    "website": "http://www.partnersforcommunity.org/",
    "description": "A Family Place is a 28 unit congregate family shelter located in Holyoke, MA. The shelter is staffed 24 hours a day, 7 days a week and provides a number of services to assist families in locating and securing stable housing. Ongoing case management is provided to each family in addition to workshops, classes, referral to local service providers, housing search, activities for children, homework assistance, and many other services designed to make the family's stay in shelter as safe, enjoyable, and productive as possible. Our goal is to assist each family in becoming self sufficient and transitioned into stable housing as quickly as possible."
  },
  {
    "addressLine1": "43 Center St.",
    "city": "Northampton",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01060",
    "name": "Interfaith Cot Shelter",
    "organization": "Interfaith Cot Shelter",
    "phone": "(413) 585-1300",
    "website": "http://www.servicenet.org/content/interfaith-emergency-shelter",
    "description": "The Interfaith Emergency Shelter is an overflow shelter for Grove Street Inn. Guests are provided with warm beds and hot meals from November through April. The 20-bed site is located in the basement of a professional office building at 43 Center Street in Northampton (plus a 6-bed annex in Easthampton). The shelter is a cooperative effort among the City of Northampton, the 400+ volunteers of the Friends of the Hampshire county Homeless Individuals, and ServiceNet, which provides professional staffing."
  },
  {
    "addressLine1": "6870 Calhoun Street",
    "city": "Springfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01107",
    "name": "OPEN PANTRY TEEN LIVING PROGRAM",
    "organization": "OPEN PANTRY TEEN LIVING PROGRAM",
    "phone": "(413) 731-5960",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "103 Prospect Street",
    "city": "Springfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01107",
    "name": "EMERGENCY SHELTER OF GREATER SPRINGFIELD - PROSPECT HOUSE",
    "organization": "EMERGENCY SHELTER OF GREATER SPRINGFIELD - PROSPECT HOUSE",
    "phone": "(413) 737-5518",
    "website": "https://www.instagram.com/vanderburgh_house/",
    "description": ""
  },
  {
    "addressLine1": "103 Prospect Street",
    "city": "Springfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01107",
    "name": "PROSPECT STREET SHELTER",
    "organization": "PROSPECT STREET SHELTER",
    "phone": "(413) 737-5518",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "95 Jefferson Avenue",
    "city": "Springfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01107",
    "name": "JEFFERSON STREET SHELTER",
    "organization": "JEFFERSON STREET SHELTER",
    "phone": "(413) 736-2263",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "769 Worthington Street",
    "city": "Springfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01105",
    "name": "Friends of the Homeless Shelter",
    "organization": "Friends of the Homeless Shelter",
    "phone": "(413) 732-3069",
    "website": "https://www.fohspringfield.org/",
    "description": "FOH provides separate men's and women's overnight shelters, serving individuals 18 years of age and older every evening on its Worthington Street campus. No responsible individuals are turned away. FOH is recognized as the shelter of last resort for those individuals needing temporary overnight lodging as FOH facilitates the process to secure permanent housing.\n\nThe men's shelter is located at 769 Worthington Street in Springfield. This shelter is for single men 18 years of age or older.\n\n\nThe women's shelter is located at 755 Worthington Street. It provides overnight shelter for single women 18 or older.\n\nShower and laundry facilities are available for our shelter guests.\n\nBoth men's and women's shelters open for the evening at 5:30 p.m. Beds are assigned as they become available. There is usually a waiting list for beds and floor space is limited. All check-ins must be completed by 8 p.m. unless special arrangements have been made (employer's letter, medical emergency,etc.) If you do not check in on time, your bed may be given to the next person on the list. Individuals new to shelter should attempt to have a phone interview in advance of their arrival.\n\nMeals\nMeals are served Sunday through Saturday in the FOH dining room at 755 Worthington Street.\nBreakfast: 8:00 9:00 AM\nLunch: 12:00-1:00 PM\n\nHousing\nIt is our goal at Friends of the Homeless to house chronically homeless, homeless, and low income individuals either by providing permanent supportive housing in our properties, on our Worthington Street campus, or in the community at large. FOH owns and operates 110 single-room units available through waitlists for each building for qualified applicants.\n\nWorthington House, 769 Worthington Street, located on the FOH campus is permanent housing, with 60 furnished single room occupancy units in a dormitory style setting with common kitchens, lounges, restrooms, and elevator. Women and men live on separate floors. These are Massachusetts Rental Voucher Program (MRVP) subsidized units. To qualify you must be homeless or chronically homeless at the time of application and acceptance. A priority is given to chronically homeless applicants. The wait list and applications are managed on campus. This property is handicap accessible. Free laundry on site.\n\n\nThe Apartments at 755 Worthington Street, located on the FOH campus is a newly constructed residential building comprised of 32 enhanced single room occupancy studio apartments that are fully furnished and include a kitchenette and bathroom. The building is co-ed and is Section 8 subsidized. Applicants must be chronically homeless and submit initial applications to the Springfield Housing Authority on Sanderson Street. The first floor of this building is handicap accessible. Free laundry on site.\nSupper: 4:30-5:30 PM"
  },
  {
    "addressLine1": "148 Taylor Street",
    "city": "Springfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01105",
    "name": "Springfield Rescue Mission Emergency Shelter",
    "organization": "Springfield Rescue Mission Emergency Shelter",
    "phone": "(413) 732-0808",
    "website": "http://www.springfieldrescuemission.org/",
    "description": "To meet the immediate and basic life needs of homeless men living in crisis by providing a safe, clean, warm and healthy environment."
  },
  {
    "addressLine1": "1537 Main Street",
    "city": "Springfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01103",
    "name": "WESTERN MASS. MASS. DEPT. OF SOCIAL SERVICES Region I Western Mass.",
    "organization": "WESTERN MASS. MASS. DEPT. OF SOCIAL SERVICES Region I Western Mass.",
    "phone": "(413) 452-3200",
    "website": "https://www.twitter.com/massgov",
    "description": ""
  },
  {
    "addressLine1": "10 Mill Street",
    "city": "Springfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01108",
    "name": "Springfield Rescue Mission",
    "organization": "Springfield Rescue Mission",
    "phone": "(413) 732-0808",
    "website": "https://hope4springfield.org/",
    "description": "The Emergency Shelter is located at 148 Taylor Street, Springfield, MA. No mail is accepted at this address.\n\nThe Springfield Rescue Mission is a Christian based Emergency Shelter, Rehabilitation Program & Transitional Living Facility, serving Greater Springfield since 1892.\n\n\nThe goal of our Emergency Shelter is to meet the immediate and basic life needs of homeless men living in crisis by providing a safe, clean, warm and healthy environment. While meeting these immediate needs, each guest is encouraged to enter a local or regional rehabilitation program to deal with the issues that led them to homelessness. We provide showers with clean towels and personal care items, nutritious evening and morning meals, clean beds with fresh linens, medical attention, new undergarments and gently used clothing as needed, chapel services, counseling, and advocacy.\n\nThe hours of operation are Monday - Saturday 4:00PM to 8:00AM. Beds are available first come, first serve.\n\nRehabilitation Center\n10 Mill Street\nSpringfield, MA, 01108\nHours of Operation\n8:30AM - 3:00PM, Monday-Thursday\ntel (413) 732-0808 ext. 129\n\nGive-Away Center\n10 Mill Street\nSpringfield MA 01108\nHours of Operation\nBy Appointment Only\nCall 413-732-0808 ext. 121\n\nBusiness Offices\n10 Mill Street, P.O. Box 9045\nSpringfield, MA, 01102-9045\nHours of Operation\n9:00AM - 5:00PM, Monday - Friday\ntel (413) 732-0808\nfax (413) 732-5512\n"
  },
  {
    "addressLine1": "170 Orange Street",
    "city": "Springfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01108",
    "name": "WayFinders Residential Resource Center",
    "organization": "WayFinders Residential Resource Center",
    "phone": "(413) 301-7405",
    "website": "https://www.wayfindersma.org/",
    "description": "This is a shelter for families with minor children located in Springfield, MA.\n\nWayFinders Programs and Services:\nGrowing Assistance for Homeless Families\nUnfortunately, in these tough economic times, the number of local homeless families continues to climb.  At WayFinders, we understand that many families live on the brink of homelessness every day, and that to avoid permanent or recurring homelessness, they need more than just a place to sleep. That is why WayFinders offers specialized and comprehensive assistance for families, including paths to permanent housing, programs for young pregnant or parenting women, and support services for survivors of domestic violence.\nFor information on programs that can help families avoid becoming homeless, including the program known as RAFT, click here.\nEmergency Housing\nIn 2011 the Commonwealth of Massachusetts implemented a new approach to assisting families at risk of becoming homeless.  HomeBASE offers an alternative to shelter and provides time-limited assistance designed to provide a housing solution for families who are at serious risk of homelessness rather than going into a shelter or motel.  WayFinders is the primary HomeBASE provider in Hampden and Hampshire Counties and has contracts with the state to provide prevention, temporary accommodations, re-housing and stabilization services.  For more information on eligibility, click here.\nRapid Re-Housing Program: WayFinders leases 46 scattered site apartments that are used as temporary housing for homeless families.  In line with state policy, WayFinders's approach emphasizes permanent housing and support instead of shelter. WayFinders's rapid re-housing initiatives move families from shelter units and motels into affordable permanent housing as soon as possible, and then provides 18 months of follow-up support.\n\nProspect House Shelter for Families: After serving as a congregate shelter for homeless families for more than 25 years, Prospect House in Springfield is now part of WayFinders's Rapid Re-Housing Program."
  },
  {
    "addressLine1": "7 Free Street",
    "city": "Westfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01805",
    "name": "Samaritan Inn",
    "organization": "Samaritan Inn",
    "phone": "(413) 568-3122",
    "website": "",
    "description": "Capacity: 32 men, 5 women.\nLength of Stay: 90 days.\nServices: Spanish; advocacy; counseling; 2 meals & snack; nurse; some clothing; referral to other social service agencies and resources.\nLanguage: SpanishRestrictions: Sobriety.\nReferral: Self (intake process over through a phone call) or through community social service agencies."
  },
  {
    "addressLine1": "77 Winter Street",
    "city": "Hyannis",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02601",
    "name": "Catholic Social Service Joseph House Shelter",
    "organization": "Catholic Social Service Joseph House Shelter",
    "phone": "(774) 470-5976",
    "website": "https://www.cssdioc.org/",
    "description": ""
  },
  {
    "addressLine1": "372 North Street",
    "city": "Hyannis",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02601",
    "name": "Safe Harbor Shelter",
    "organization": "Safe Harbor Shelter",
    "phone": "(508) 778-9470",
    "website": "https://www.cacci.cc/programs/safe-harbor-shelter/",
    "description": ""
  },
  {
    "addressLine1": "460 West Main Street",
    "city": "Hyannis",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02601",
    "name": "TENANCY AND INDEPENDENCE PROGRAM",
    "organization": "TENANCY AND INDEPENDENCE PROGRAM",
    "phone": "(508) 771-5400",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "460 West Main Street",
    "city": "Hyannis ",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02601",
    "name": "Angel House Family Shelter",
    "organization": "Angel House Family Shelter",
    "phone": "(508) 775-8045",
    "website": "http://www.haconcapecod.org/angel-house/",
    "description": "The Angel House shelter in Hyannis works with families recovering from alcohol or other drug abuse. Angel House provides a structured and secure environment where mothers and children can be reunited and recover from the dual traumas of substance abuse and homelessness.\n\nAngel House is a HAC-operated family shelter in Hyannis for homeless women, who are recovering from drug and alcohol addiction, and their children. Angel House typically shelters 13 mothers and 20-26 children for approximately 12 months."
  },
  {
    "addressLine1": "170 Morton Street",
    "city": "Jamaica Plain",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02130",
    "name": "Shattuck Shelter",
    "organization": "Shattuck Shelter",
    "phone": "(617) 892-9100",
    "website": "http://www.pinestreetinn.org/",
    "description": ""
  },
  {
    "addressLine1": "PO Box 300670",
    "city": "Jamaica Plain",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02130",
    "name": "Finex House Shelter For Battered Women",
    "organization": "Finex House Shelter For Battered Women",
    "phone": "(617) 436-2002",
    "website": "https://twitter.com/FinexH",
    "description": "Finex House is shelter for battered women and their children; especially those who have disabilities and/or women who are trafficked. We are wheelchair accessible with two concrete ramps and an internal lift. Finex House also has a light-coded signal system for deaf, battered women and their children. Finex House is an equal opportunity service provider and therefore any woman who has been abused is strongly encouraged to call for services."
  },
  {
    "addressLine1": "360 Pawtucket Street",
    "city": "Lowell",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01854",
    "name": "COMMUNITY TEAMWORK PAWTUCKET HOUSE",
    "organization": "COMMUNITY TEAMWORK PAWTUCKET HOUSE",
    "phone": "(978) 452-5410",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "167 Dutton Street",
    "city": "Lowell",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01852",
    "name": "GREATER LOWELL EMERGENCY FAMILY SHELTER",
    "organization": "GREATER LOWELL EMERGENCY FAMILY SHELTER",
    "phone": "(978) 459-0551",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "812 Merrimack Street",
    "city": "Lowell",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01854",
    "name": "House of Hope",
    "organization": "House of Hope",
    "phone": "(978) 458-2870",
    "website": "http://houseofhopelowell.org/",
    "description": ""
  },
  {
    "addressLine1": "189 Middlesex Street",
    "city": "Lowell",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01852",
    "name": "Lowell Transitional Living Center",
    "organization": "Lowell Transitional Living Center",
    "phone": "(978) 458-9888",
    "website": "http://ltlc.org/",
    "description": "Lowell Transitional Living Center provides three daily meals, a safe environment, detox placement, individual assessment and referrals, medical care, case management, street outreach to chronically homeless, rep payee services, clothing and on site GED and support group programming.\n\nThe Lowell Transitional Living Center provides the most vulnerable adults in our community with programs and services that meet immediate needs for emergency shelter and food, along with case management and other help that enable those we serve to make the transition from a shelter bed to a permanent place to call home.\n\n\nOur approach matches what people experiencing homelessness want and seek our help to achieve, and it is particularly effective for people who have lost their homes due to a personal crisis.\n\n    We provide intensive services for the chronically homeless.\n\n    Many of our programs, including the Meals program, are open to the wider community.\n\n    Clients can continue to access these programs after they move into new homes.\nOur Case Management Program is the heart of our organization. With our clients, Intake Case Managers develop a plan that will lead to employment and housing.\n\n\nSometimes it is the little things that require the help of a case manager, such as obtaining a form of identification, or accessing health care.  Other times the problems are long standing and difficult.  Either way our dedicated team of case managers provide support, education, and guidance on the road to housing and self-sufficiency.\n\nCase Managers promote overall stability, emphasizing physical and behavioral health and nutrition. When needed, our case managers work with those in need of drug/alcohol rehabilitation through relationships with local rehabilitation programs, as well as proving transportation.\nMany clients elect to enroll in continued Case Management to maintain stability while in housing."
  },
  {
    "addressLine1": "423 Pawtucket Street",
    "city": "Lowell",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01854",
    "name": "MERRIMACK HOUSE",
    "organization": "MERRIMACK HOUSE",
    "phone": "(978) 937-2418",
    "website": "https://www.instagram.com/merrimackunityhouse/",
    "description": ""
  },
  {
    "addressLine1": "180 East Merrimack St.",
    "city": "Lowell",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01852",
    "name": "Under the Oak Day Shelter",
    "organization": "Under the Oak Day Shelter",
    "phone": "(978) 459-9631",
    "website": "http://www.undertheoak.org/",
    "description": "Under the Oak is a day shelter that is Christian based and located at Christ Church United in Lowell, Ma. UTO is open every Wednesday from 11am till 2pm..On cold or snow days we open earlier and stay open later. We serve a hot lunch along with fellowship and arts and crafts - UTO helps those in need feel needed."
  },
  {
    "addressLine1": "24 Baker Street",
    "city": "Lynn",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01902",
    "name": "Bridgehouse",
    "organization": "Bridgehouse",
    "phone": "(781) 593-3898",
    "website": "",
    "description": "BridgeHouse derived its name from the new housing concept at that time, 'bridge housing,' which is an alternative temporary housing arrangement that seeks to bridge the gap between homelessness and independent residency. The mission of the house is to provide a continuum of strong support services for each family to establish self-sufficient lifestyles, and restore self-esteem and dignity to the head of the household and children. Today at BridgeHouse 11 families participate in a comprehensive service plan that includes benefits assistance, workshops and classes that target the development of tenancy skills and other life skills, such as parenting, budgeting, menu panning, health care services, mental health services, substance abuse treatment or prevention programs, domestic violence prevention services and referrals to any other programs necessary to assist our families.\nHours of operation (or meeting times & dates):\n24 hours a day"
  },
  {
    "addressLine1": "91 Liberty Street",
    "city": "Lynn",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01901",
    "name": "Lynn Shelter Association - Adult Emergency Shelter",
    "organization": "Lynn Shelter Association - Adult Emergency Shelter",
    "phone": "(781) 581-0739",
    "website": "http://www.lsahome.org/",
    "description": "General Information\nProviding emergency shelter to individuals and families, transitional and permanent supportive housing and street outreach\n\nAdult Emergency Shelter\nOpen 365 days a year, our emergency shelter serves up to 44 men and women over age 18, providing on-site case management, mental health and medical triage, access to basic necessities and a starting point on the path to permanent housing.\n\nOther Area Shelters Provided By Lynn Shelter Association.\n\nBridge House Family Shelter: 781.593.3898\n\nIndependence House: 781.477.7974\n\nGreat Hill: 781.593.3484\nVeterans\nGroup Housing for Chronically Addicted People\nHousing Opportunities for People with AIDS\n\nGreen House Family Shelter: 781.346.6568\n\nShelter & Care at the Osmund: 781.596.3290\nInn Progression\nMassachusetts Rental Voucher Program"
  },
  {
    "addressLine1": "73 Buffum St",
    "city": "Lynn",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01902",
    "name": "Mass. Coalition for the Homeless",
    "organization": "Mass. Coalition for the Homeless",
    "phone": "(781) 595-7570",
    "website": "https://www.mahomeless.org/",
    "description": "Programs\n\nHomeLink\nThe HomeLink Initiative is designed to work with community health centers, public school districts and early intervention workers to help identify households that are having a housing crisis and then offer quick assistance to ensure that they remain stably housed.\n\nA Bed for Every Child Initiative\nA good night's sleep has a major effect on a child's ability to come to school prepared to learn; falling behind due to a lack of sleep can have negative long term consequences on a student's education and future. A proven pathway out of homelessness is to ensure children of low-income families receive an education that will allow them to graduate from high school. To do this, we have to give these children the tools they need to succeed. One of these tools is a bed.\n\nRoom to Breathe\nThe Room to Breathe Initiative was launched by the Coalition in 2013 to assist low-income families and individuals who are living with chronic respiratory diagnoses to improve their home environment to lessen environmental triggers with a goal of improving their quality of life.\n\nFurniture Bank\nSince its inception in 1985 as one of the first furniture banks in the nation, the Massachusetts Coalition for the Homeless has assisted in furnishing the future of thousands of households who are transitioning out of homelessness into permanent housing. The approach is simple - take other peoples castaway furniture and household goods and give them new life in the home of someone in need.\n\nTeen Closet\nToday 1 in 7 children growing up in Massachusetts is growing up in poverty.  A teenager growing up in poverty often has to live without the most basic items - like clothing."
  },
  {
    "addressLine1": "25 Holten Street",
    "city": "Peabody",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01960",
    "name": "INN BETWEEN",
    "organization": "INN BETWEEN",
    "phone": "(978) 532-2372",
    "website": "http://cahns.org/",
    "description": "The Inn Between is an emergency program for homeless families. Founded in 1985, our original building, a lovely Victorian home, houses six families at a time, and includes one fully handicapped-accessible room. In this program we also maintain a \"community room,\" available for homeless families who are ineligible for shelter assistance from the state.\n\nServices\nOngoing meetings with a case manager to coordinate health care, childrens needs (counseling, school transportation, summer camp, day care), and parents needs (education, employment, legal, mental health, etc.)\nAssist families on a daily basis in their effort to obtain permanent, affordable housing\n\nLife skills development, including budgeting, nutrition, health, parenting skills and successful coping abilities\nProvide educational programs by community service providers, volunteers and businesses (GED, ESL, etc.)\nComputer access to work on resumes, letters, and hone job skills.\nHousehold chores, cooking, and shopping as shared responsibilities.\nFollow-up by a case manager who tracks families who move on for a full year, and sometimes longer"
  },
  {
    "addressLine1": "919 Eastern Ave",
    "city": "Malden",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02148",
    "name": "Housing Families Inc.",
    "organization": "Housing Families Inc.",
    "phone": "(781) 322-9119",
    "website": "https://housingfamilies.org/",
    "description": "Office Hours: Mondays through Fridays 9:00am to 5:00pm\n\nEmergency Shelter\nThe Emergency Shelter consists of 100 apartments for homeless families throughout Greater Boston. Unique to Housing Families, each apartment is designated to one family at a time and includes a private bath and kitchen. Once in HFIs Emergency Shelter, families receive intensive case management, comprehensive housing search assistance, life skills instruction, mental health counseling services, and other assistance in overcoming barriers to securing permanent housing.\n\nDirections:\nRoute 93 South\n\n    Take exit 32 for MA-60 toward Medford/Malden\n    At the traffic circle, take the 3rd exit onto MA-60 E/Salem St.\n    Continue onto MA-60 E/Pleasant St.\n    Continue to follow MA-60 E as it turns into Centre St.\n    Continue to follow MA-60 E as it turns into Eastern Ave.\n    Our offices are on right.\n\nPublic Transportation\n    Take the Orange line/Oak Grove train to Malden Center.\n    Take the 106/108/411/430 bus to Salem St. at Maplewood St.\n    Walk 0.3 miles down Maplewood St.\n    Turn left onto Eastern Ave.\n    Our offices are on the right."
  },
  {
    "addressLine1": "2 Central Avenue",
    "city": "Medford",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02155",
    "name": "MEDFORD FAMILY LIFE EDUCATION CENTER",
    "organization": "MEDFORD FAMILY LIFE EDUCATION CENTER",
    "phone": "(781) 391-9116",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "57 Mechanic Street",
    "city": "Marlboro",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01752",
    "name": "MARLBORO SHELTER",
    "organization": "MARLBORO SHELTER",
    "phone": "(508) 460-6226",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "728 Main Street",
    "city": "Marshfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02050",
    "name": "Carolina Hill Shelter",
    "organization": "Carolina Hill Shelter",
    "phone": "(781) 837-1377",
    "website": "http://www.carolinahill.org/home.html",
    "description": "Carolina Hill is an emergency shelter for homeless families. The facility houses up to 17 families at the time and they remain at Carolina Hill an average of three months. The Carolina Hill shelter has a fenced yard, a recreation building for young children and a fully-equipped classroom for adult education classes. Families whose members may have special needs (e.g., developmentally disabled or handicapped) can be accommodated.\n\n\nPrograms Offered:\nTraining: Basic life skills such as money management, parenting, nutrition, as well as how to look for and access community resources. Upon completion of this program, individuals will get a certificate of \"housing readiness\"Case ManagementHousing searchGED and ESL classesSome of the individuals that end up staying at Carolina Hill are escaping situations such as: domestic violence or recovering from substance abuse. Carolina Hill committed staff refer these individuals to outside agencies and services that provide assistance such as: childcare, individual, group and family counseling, community support, domestic violence programs, furniture programs, substance abuse programs, day programs and more. Follow up services are also offered after families are placed in a new home with the main purpose of ensuring their smooth transition into local schools and social services.\n\nPlease contact the office for further information.\n"
  },
  {
    "addressLine1": "71 Obery Street",
    "city": "Plymouth",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02360",
    "name": "South Shore Community Action Council",
    "organization": "South Shore Community Action Council",
    "phone": "508-747-7575",
    "website": "https://www.sscac.org/",
    "description": "South Shore Community Action Council (SSCAC) assists homeless and low-income South Shore residents of all ages with food, housing, utilities, transportation, and early education.\n\n\n\nPrograms offered:\nCase Management & Emergency Assistance: Main goal is to empower low-income individuals and/or families to achieve financial stability for long-term well-beingEarly Education & Care: Main goal is to create a great atmosphere for children between three months and five years of age to encourage self-confidence, school readiness, independence and intellectual curiosity. Children will have access to highly trained and dedicated training staff, nutritious meals and transportation with dedicated bus stops. Please note that space is limited.Food Resources & SSCAC's Food Distribution Center: Main goal is to get nutritious food to hungry individuals in the most cost-effective way through coordinated food pick-up, transport, storage and distribution.Transportation Assistance: Provides transportation services to eligible residents to adult day health programs, doctor and dental visits, dialysis, non-emergency hospital visits, social or recreational trips, shopping trips, education facilities , employment and/or welfare to work programs. Transportation is available by appointment only. Monday to Fridays from 6:00a.m. to 6:00p.m. Saturdays are reserved for medical necessities from 6:00a.m. to 6:00p.m.\n\nFor additional information please contact508-747-7575.\n\n"
  },
  {
    "addressLine1": "P.O. Box 382",
    "city": "Mattapan",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02126",
    "name": "HORIZON HOUSE",
    "organization": "HORIZON HOUSE",
    "phone": "(617) 296-2492",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "14 Chapel St.",
    "city": "Somerville",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02144",
    "name": "Somerville Homeless Coalition Adult Shelter",
    "organization": "Somerville Homeless Coalition Adult Shelter",
    "phone": "(617) 623-2546",
    "website": "https://www.somervillehomelesscoalition.org/",
    "description": "Services:\nSHELTER\n- Adult Shelter\n14 Chapel Street\nSomerville, MA 02144\nPhone: 617-623-2546\n\n Operated by the Somerville Homeless Coalition.  An emergency and extended stay\nsober\nshelter for\n12 men and 4 women.\nCall to get on waitlist (leave name and number on voicemail) and call daily to check in on waitlist status.  Drug and alcohol testing.\nMandatory housing focused case management.  Required to save 50% of income during stay.\n\n\n- Family Shelter\n59 Cross Street\nSomerville, MA 02145\n617-776-6661\n\nHOUSING\n- Prevention & Stabilization Services\n- Sewell Street SRO\n- Shelter Plus Care\n- Sobriety & Stability\n- Better Homes I & II\n- Home For Good\n\nCASE MANAGEMENT\n- Passages\n\nFOOD SERVICES\n- Project SOUP\n\nSHC is considered Greater Somerville's lead agency in responding to homeless and hunger related situations and issues."
  },
  {
    "addressLine1": "17 Congress St",
    "city": "Milford",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01757",
    "name": "Pathway to a Better Life",
    "organization": "Pathway to a Better Life",
    "phone": "(508) 488-9107",
    "website": "https://sites.google.com/view/pathwaytoabetterlife/home",
    "description": ""
  },
  {
    "addressLine1": "713 Shawmut Ave",
    "city": "New Bedford ",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02746",
    "name": "Harbour House Family Center",
    "organization": "Harbour House Family Center",
    "phone": "(508) 992-6027",
    "website": "http://www.srnfamilycenters.org/",
    "description": "Family shelter. Shelter for families.\n\nSoutheast Family Services (SFS) Family Centers (Fall River Family Center, Harbour House Family Center, and Taunton Family Center) help families by providing emergency shelter and support services, as well as assist them in securing permanent housing. Southeast Family Services also operates scattered sites in Attleboro, Fall River, and Taunton, through a subcontract with Catholic Social Services.\n\nIn addition, Southeast Family Services operates the Family Preservation Program, a reunification program that provides permanent housing with supportive services for families in recovery with children.\n"
  },
  {
    "addressLine1": "71 Division Street",
    "city": "New Bedford",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02740",
    "name": "Sister Rose's House",
    "organization": "Sister Rose's House",
    "phone": "(508) 997-3202",
    "website": "https://www.cssdioc.org/",
    "description": "Sister Rose's House is a Dry Men's Shelter and is staffed 24 hours a day. The program offers a wide range of supportive services including assessment, job skills training, budgeting information, and access to mental health and other needed services, and the goal of Sr. Rose House is to help our clients to gain long term sustainability while working on the current issues that lead to their homelessness"
  },
  {
    "addressLine1": "848 Mt Pleasant Street",
    "city": "New Bedford",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02745",
    "name": "House of Hope New Bedford",
    "organization": "House of Hope New Bedford",
    "phone": "(508) 996-6814",
    "website": "http://www.facebook.com/HouseOfHopeOfNewBedford",
    "description": "This is not a free service. This is a for cost Addiction Recovery service. Call for costs.\n\nOur Mission is to provide a safe and positive atmosphere for recovery to those in need STRUCTURED SUPPORTIVE TRANSITIONAL HOUSING NURTURING THE BODY, MIND, AND SPIRIT we provide Individual Substance Abuse CounselingGroup Substance Abuse CounselingIndividual Dual Diagnosis CounselingCase ManagementDream Therapy GroupRelapse Prevention GroupEarly Recovery GroupA 12 Step Class Not Meant To Replace AA or NA 12 Step GroupsUrinalyses 3x a Week Plus Random Urinalyses(Provided By An Outside Independent Lab)Homemade Dinner Meal Served DailyMeeting Space For A Daily Noon AA Meeting And 4 Evening AA Meetings24 Hour Emergency Shelter Services24 hour Volunteer Support StaffMedication Management IncludingSecured Medications Available At 9AM And 10PM(all medications are locked in individual lockers in the office and are administered by a licensed rn at the above times)These Services Are Provided By The Following Professional Staff On-Site A Licensed Clinical PsychologistA Licensed Neuro PsychologistLicensed Substance Abuse CounselorsA Licensed Social WorkerA Licensed Psychiatric Nurse Practitioner2 Ordainded MinistersOur Office For Screenings And Intakes Is At: Addiction Rehabilitation Services Inc.306 Mount Pleasant streetNew Bedford Ma 02746"
  },
  {
    "addressLine1": "PO Box 227",
    "city": "North Pembroke",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02358",
    "name": "Bethesda House",
    "organization": "Bethesda House",
    "phone": "(781) 361-2418",
    "website": "https://bethesdahousema.org/",
    "description": ""
  },
  {
    "addressLine1": "27 Lexington Street",
    "city": "Waltham",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02451",
    "name": "Bristol Lodge Men's Shelter",
    "organization": "Bristol Lodge Men's Shelter",
    "phone": "(781) 893-0108",
    "website": "https://www.mhsainc.org/",
    "description": "The Bristol Lodge Men's Shelter operate on a first-come, first-served basis.  If you are in need of a bed, you must go through the pre-screening process by calling 781-893-0108, Monday through Friday.  Phone calls are accepted beginning at 9:00am. \n\nProvides a 43 bed shelter. Can stay up to 90 days. Must sign up each morning for a bed.\n\nHours Open: 6pm until 7:45am.\nStaff at each location are trained to provide a variety of specialized and essential services. Support staff are trained to provide all guests with a safe and supportive environment. Case managers help guests locate permanent housing, provide supportive counseling, refer guests to other agencies as needed, organize in-house AA meetings, offer employment counseling groups, and assist clients with entitlement benefits such as SSI or SSDI. Each and every guest has an individualized goal plan.\n\nThe Bristol Lodge Men's and Women's Shelters can only accept individual homeless adults.  All beds at the Bristol Lodge Men's and Women's Shelters operate on a first-come, first-served basis and are subject to availability.  Anyone in need of a shelter bed must complete the pre-screening process by calling 781-893-0108, Monday through Friday (phone calls are accepted beginning at 9:00am).\n\n \nBoth the Men's and Women's Shelters are \"dry\" shelters, meaning that staff cannot offer a bed to any resident who is intoxicated or under the influence of any substance.  Alcohol, drugs and other Illicit substances are strictly prohibited on shelter property.\n \nThe Men's and Women's Shelters are night shelters and cannot accommodate residents during daytime hours.  With the exception of scheduled meetings with shelter staff, residents will be asked to leave the buildings from 8:00am until 4:00pm, each day.\n \nBecause the Bristol Lodge Shelters are only able to provide temporary, emergency accommodations, residents are limited to a maximum stay of up to 90 days. Each resident's \"90 day clock\" begins on the first night she/he reserves a bed and this \"clock\" does not stop, even if the resident sleeps elsewhere for one or more nights.  After 90 days, the resident must wait an additional 30 days before reentering the program.\n \nPublic Transportation To Shelter\nMen's Shelter: The Bristol Lodge Men's Shelter is located on the second floor of the old Waltham Central Fire Station.  The entrance is located on the side of the building.  The MBTA 70A and 554  buses stop at the intersection of Lexington Street and School Street, which is approximately 100 feet from the Men's Shelter.\n \nThe Men's Shelter is also located 0.3 miles from the Waltham MBTA Commuter Rail station (Fitchburg Line). From the Waltham station, walk up the Waltham Common (along Elm Street), towards Main Street.  Take a left onto Main Street, then a right onto Lexington Street where the Men's Shelter will be on your right."
  },
  {
    "addressLine1": "205 Bacon Street",
    "city": "Waltham",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02451",
    "name": "Bristol Lodge Women's Shelter",
    "organization": "Bristol Lodge Women's Shelter",
    "phone": "(781) 894-1225",
    "website": "https://www.mhsainc.org/",
    "description": "Operates on a first come, first served basis.  If you are in need of a bed, you must go through the pre-screening process by calling 781-893-0108, Monday through Friday.  Phone calls are accepted beginning at 9:00am. \n \nPlease note that the Women's Shelter cannot receive phone calls placed before 4:00pm each day.  Daytime phone calls should be directed to the Men's Shelter at 781-893-0108.\n\n\n12 Beds. Stay is 6 months. Night shelter. Opens at 6:00 pm - bein by 7:00 pm. Leave 7:45 in morning.\n\nThe women's shelter provides emergency shelter to a combined total of area residents each night. Staff at each location are trained to provide a variety of specialized and essential services. Support staff are trained to provide all guests with a safe and supportive environment. Case managers help guests locate permanent housing, provide supportive counseling, refer guests to other agencies as needed, organize in-house AA meetings, offer employment counseling groups, and assist clients with entitlement benefits such as SSI or SSDI. Each and every guest has an individualized goal plan.\n\nProvides temporary, emergency accommodations, residents are limited to a maximum stay of up to 90 days. Each resident's \"90 day clock\" begins on the first night she/he reserves a bed and this \"clock\" does not stop, even if the resident sleeps elsewhere for one or more nights.  After 90 days, the resident must wait an additional 30 days before reentering the program.\n\nPublic Transportation To Shelter:\nThe Bristol Lodge Women's Shelter is located directly adjacent to a large athletic field and across the street from the Thomas Plympton Elementary School.  The entrance is located just past the athletic field parking lot.  The Women's Shelter is also located 0.8 miles from the Waltham MBTA Commuter Rail station (Fitchburg Line)."
  },
  {
    "addressLine1": "1307 North Street",
    "city": "Pittsfield",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01201",
    "name": "Bartons Crossing Emergency (BCAC)",
    "organization": "Bartons Crossing Emergency (BCAC)",
    "phone": "(413) 442-1445",
    "website": "https://www.servicenet.org/services/shelter-and-housing/shelters/",
    "description": ""
  },
  {
    "addressLine1": "825 Simonds Road",
    "city": "Williamstown",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01267",
    "name": "Turner House Living Center for Veterans",
    "organization": "Turner House Living Center for Veterans",
    "phone": "(413) 458-8234",
    "website": "mailto:turnerhousevets@verizon.net",
    "description": "We're not a shelter but rather a 10 bed transitional residence for homeless veterans; we offer housing, food, clothing, case management, group work.\n\nCall for more information if you are interested."
  },
  {
    "addressLine1": "PO Box 692246",
    "city": "Quincy",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02169",
    "name": "Friends of the Unborn",
    "organization": "Friends of the Unborn",
    "phone": "(617) 786-7903",
    "website": "http://www.friendsoftheunborn.org/",
    "description": "Established in 1984, it is a Christian Home for homeless, pregnant women. Applicants must be 18 years of age and not have issues with alcohol or drugs. Loving home where we offer classes in Parenting, Birthing, Computer Skills, Budgeting, Nutrition, Bible Sharing among other offerings. Women can stay after the birth up to the baby's first birthday if mom obeys the house rules. Networking offered to housing, financial assistance, education, etc."
  },
  {
    "addressLine1": "59 Cross Street",
    "city": "Somerville",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02144",
    "name": "Cross Street Family Shelter",
    "organization": "Cross Street Family Shelter",
    "phone": "(617) 776-6661",
    "website": "http://www.somervillehomelesscoalition.org/",
    "description": "The shelter is open 24 hours a day, 7 days a week.\n\nThis is a residential facility for families in a communal-like atmosphere where families reside together and share services and resources. The family shelter can serve five families at one time and offers housing search, case management, referrals to community resources such as school enrollment, child care, parenting skills, budgeting, etc.\nReferral required from DTA.\nThe building is not wheelchair accessible\n"
  },
  {
    "addressLine1": "141 Main Street",
    "city": "Southbridge",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01550",
    "name": "St. Luke's Guesthouse",
    "organization": "St. Luke's Guesthouse",
    "phone": "(508) 764-9800",
    "website": "https://stlukesguesthouse.wordpress.com/",
    "description": "Intake: Call our office during regular business hours: Mondays through Fridays 8:30 to 4:30pm.We are a dry shelter.We accept men, women, and children for short-term shelter, generally around 30 days up to a maximum of 90 days.\n\nSt. Luke's Guesthouse provides Christian hospitality to those in need of temporary shelter. We are here to provide a quiet place to stay while guests work on their problems, especially getting into permanent housing. Since very simple beginnings as a private effort in March of 2013 we are now in the process of becoming a non-profit public charity (501c3). With community support and funding we will be able to expand our services and better meet the needs of the homeless in our area.\n\n\nWe are the only homeless shelter in southern Worcester County. Each night there are dozens of men, women, and children out on the streets, in great need. Sadly, we often get calls asking for help but are forced to turn people away.  We hope that with expanded services and greater community involvement  we can more effectively serve those in need. No human being should be without decent shelterit is one of the most basic human rights.\n\nWhom Do We Serve?:  The Guesthouse is open to anyone in need of temporary shelter as long as they are willing to abstain from the use of drugs and alcohol and follow commonsense household rules."
  },
  {
    "addressLine1": "1059 Main St",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01603",
    "name": "Jeremiah's Inn",
    "organization": "Jeremiah's Inn",
    "phone": "(508) 755-6403",
    "website": "http://www.jeremiahsinn.com/",
    "description": "We are not a homeless shelter. If you are seeking shelter,\n\nResidential Program\n\nJeremiahs Inn has a 29 bed Social Model Recovery Program for men. This is a program of experiential learning that is peer oriented. Everyone gives and receives help. Residents in this program work with their case manager to develop individual service plans that give focus to their efforts. The residents share rooms, receive meals, have access to clothing, and participate in programs and services that move them closer to their goals.\n\nParticipants contribute $10 per day for program fees which help offset the cost of the program. In most cases we are able to accept food stamps as a method of payment for program fees. We also have a Resident Work Program in which 4 residents are able to receive assistance with program fees if they are having financial difficulty.\n\nEligibility Criteria\n\n18 years and older\nClean and sober for at least 30 days prior to admission\nStable medical and mental health status\nSubstance abuse/misuse diagnosis\nMassachusetts resident\nWillingness to change your life, desire to stay clean\nPriority population: Section 35 & criminal justice referrals"
  },
  {
    "addressLine1": "120 Route 28, 3rd Floor",
    "city": "West Harwich",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02671",
    "name": "Harwich Ecumenical Council for the Homeless",
    "organization": "Harwich Ecumenical Council for the Homeless",
    "phone": "(508) 432-0015",
    "website": "http://www.hech.org/",
    "description": "HECH is a 501(c)(3) non-profit organization whose mission is to develop compassionate solutions to homelessness problems for families on Cape Cod.\n\nPrograms\n\nHousing Emergency Loan Program (H.E.L.P.) for the Towns of Brewster, Orleans and Yarmouth.\nWith funds from each town listed above, HECH manages an Emergency Loan program for qualifying homeowners who need emergency home repairs. Please click on the Town above for more information on that Towns program.\n\nEastham Rental Assistance Program\nWith funds from the Town of Eastham CPC, HECH administers a Rental Assistance Program to income qualified households who live or work in Eastham or who have children attending an Eastham school.  HECH is currently accepting applications for this progam."
  },
  {
    "addressLine1": "91 Regent Street",
    "city": "Roxbury",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02119",
    "name": "Nazareth Residence For Mothers & Children",
    "organization": "Nazareth Residence For Mothers & Children",
    "phone": "(617) 541-0100",
    "website": "http://www.ccab.org/?q=shelter-services",
    "description": "Nazareth Residence provides an opportunity for homeless mothers and their children to begin rebuilding their lives.\n\nFamilies are able to maintain their independence while they transition to permanent housing.\n\nThe community-like atmosphere, supportive services, and 24-hour staffing create a safe and secure environment.\n"
  },
  {
    "addressLine1": "85 Rockland Street",
    "city": "Roxbury",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02119",
    "name": "Sojourner House Family Shelter",
    "organization": "Sojourner House Family Shelter",
    "phone": "(617) 442-0590",
    "website": "https://sojournerhouseinboston.wordpress.com/",
    "description": "Must have a referral from the Department of Housing and Community Development and be eligible for Emergency Assistance.\nCall for full details.\n\nSojourner House is a family shelter in Roxbury which opened in October of 1981. The program, set up in a recently remodeled house, is designed to meet the immediate survival needs of displaced families. We shelter two-parent and single-parent families on a 24-hour basis. Families that come to stay here are not required to leave after a limited time. The population consists largely of women and children, and children are the majority of our guests.\n\nThe goal of Sojourner House is to provide a stable environment for families, while helping them obtain and maintain safe, permanent, affordable housing. Counseling and referrals are provided within the context of a supportive and stable atmosphere."
  },
  {
    "addressLine1": "889 Harrison Avenue",
    "city": "Roxbury",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02118",
    "name": "Rosie's Place For Women",
    "organization": "Rosie's Place For Women",
    "phone": "(617) 442-9322",
    "website": "http://www.rosiesplace.org/",
    "description": "Overnight Shelter\n\nRather than requiring our guests to leave each morning, we allow women to stay longer, providing much-needed time to find some stability and focus on long-term solutions.\n\nRosies Place Overnight Program provides emergency shelter to 20 women for up to 21 days at a time.\n\n\nThe Overnight Program is open 365 days a year to give a woman a warm, safe bed, three meals a day and enough time to get her footing so she can best make a plan for what comes next. Last year, nearly 300 guests found sanctuary at Rosies Place.\nOVERNIGHT SHELTER\n\nLottery (when beds are available)\nMonday-Friday: 8:00 a.m.\nSaturday, Sunday, Holidays: 10:00 a.m.\n\nDining Room\n\nEvery day an average of 220 poor and homeless women and their children can count on having a healthy lunch and dinner in our bright and welcoming Dining Room. Another 60 women enjoy breakfast Monday through Friday.\n\nUnlike other places, we dont require our guests to line up and wait to receive their meals. Our volunteers and dining room staff act as waiters and waitresses to serve them at the table, just as you would a guest in your own home. For many of our diners, it well may be the only respite in their day.\nDINING ROOM HOURS\n\nMonday-Friday\nBreakfast: 7:30 - 8:15 a.m.\nLunch: 11:30 a.m. - 1:00 p.m.\n     Lunch Served: 12:00 - 12:30 p.m.\nDinner: 4:30 - 7:30 p.m.\n     Dinner Served: 6:00 - 6:30 p.m.\nSaturday and Sunday\nBrunch: 10:30 a.m. - 12:00 p.m.\n     Brunch Served: 11:00 - 11:30 a.m.\nDinner: 3:30 - 5:00 p.m.\n     Dinner Served: 4:00 - 4:30 p.m.\n\nFood Pantry\n\nAn average of 1,900 women visit our Food Pantry each month and leave with 20-40 pounds of healthy food for their families. While many pantries distribute pre-bagged groceries, our guests \"shop\" free of charge among shelves set up like a grocery store, choosing which items they would like from juices, grains, canned goods and more. And thanks to relationships we have developed with local farms, we can also offer women a wide selection of seasonal, nutritious fresh fruits and vegetables year round.\nFOOD PANTRY HOURS\n\nTuesday-Friday\n9:00 a.m. - 12:00 p.m. (80 guests maximum)\nMonday-Friday\n4:30 p.m. - 6:30 p.m. (40 guests maximum)\n\nEssential Services\n\nWomen are welcomed in from the streets and invited to rest, regroup and spend time in a safe place.\n\nMany women come to Rosies Place for services that may be considered basic but are nonetheless important to enhancing their self-esteem. Women living on the street know that they can count on us for a place to launder their clothes, take a shower, store their belongings in a locker or rest in our Sitting Room, all free of charge. We also provide guests with lifelines like a mailing address and use of computers and phones. Last year, Rosies Place provided 8,638 showers, 1,750 loads of laundry, 10,705 phone uses and 12,341 computer uses."
  },
  {
    "addressLine1": "41R Dimock Street",
    "city": "Roxbury",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02119",
    "name": "Mary Eliza Mahoney House Family Shelter",
    "organization": "Mary Eliza Mahoney House Family Shelter",
    "phone": "(617) 442-8800 ext 1005",
    "website": "https://www.dimock.org/",
    "description": "Emergency Shelter\n\nThe Dimock Centers Emergency Shelter program was created to help individuals have access to resources that will help them put their lives back together. Simply put, if there is a need to be met, we will support it.  The goal is to move our homeless families into a permanent housing unit.\n\nOur center, The Mary Eliza Mahoney House Emergency Family Shelter (MEMH), is a closed referral program serving Department of Housing and Community Development (DHCD) homeless families. The program is completely funded by DHCD, and has the distinction of being one of the few shelters in Massachusetts that accepts boys up to age 18 and male head-of-households.\n\nOur Services\n\nThe program works to reduce the barriers that exist for victims of domestic violence, families in crisis, pregnant young mothers, infants and toddlers, mothers, fathers and intact families having difficulties locating safe, affordable, secure housing.  Residents in our shelters may stay up to 120 days.  While the search for permanent housing is our main focus, Mary Eliza Mahoney Houses staff work to assist all families in navigating service-based programs both on and off campus.\n\nThis housing program provides food, shelter for 26 families, health care, youth services, substance abuse and mental health services, along with referral services for education, training and housing, through pro-active case management for residents to regain their self-sufficiency."
  },
  {
    "addressLine1": "10 Putnam Street",
    "city": "Roxbury",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "02119",
    "name": "Urban Ministries Renewal House Domestice Violence Shelter",
    "organization": "Urban Ministries Renewal House Domestice Violence Shelter",
    "phone": "(617) 566-6881",
    "website": "https://twitter.com/uuurbanministry",
    "description": "Renewal House is a domestic violence shelter for individuals in crisis and their children. Since 1980, Renewal House has provided temporary emergency shelter and advocacy services to more than 1,000 individuals and families escaping domestic violence. Emergency shelter for up to three months."
  },
  {
    "addressLine1": "119 Endicott Street",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01610",
    "name": "Visitation House Shelter Free of Charge to Expecting Mothers",
    "organization": "Visitation House Shelter Free of Charge to Expecting Mothers",
    "phone": "(508) 798-8002",
    "website": "https://visitationhouse.org/",
    "description": ""
  },
  {
    "addressLine1": "36 Wall St",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01604",
    "name": "Friendly House Shelter",
    "organization": "Friendly House Shelter",
    "phone": "(508) 755-4362",
    "website": "http://www.friendlyhousema.org/",
    "description": "The Friendly House Shelter & Scattered Sites Program is a temporary emergency shelter program providing short-term housing, extensive housing search and services to help families to become self-sufficient. We serve families with children and expectant parents who are homeless. Most of the families we serve are supported with funding from the Department of Housing and Community Development (DHCD) and families must be referred directly by them.  We also have rooms for homeless families in the community who do not meet the eligibility criteria of the  DHCD.\n\nOur program offers many services that will assist families in achieving their goal of being self-sufficient.\n\nEmergency Shelter Services\n\n    24-hour staffing\n    Housing Search\n    Case Management\n    Life Skill Training\n    Parenting Support\n    Advocacy"
  },
  {
    "addressLine1": "133 Granite Street",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01604",
    "name": "Youville House - Catholic Charities Worcester County",
    "organization": "Youville House - Catholic Charities Worcester County",
    "phone": "(508) 753-3084",
    "website": "https://www.ccworc.org/wp-content/uploads/2019/07/Youville-House-Brochure-.pdf",
    "description": ""
  },
  {
    "addressLine1": "1 Salem Square",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01608",
    "name": "Ywca Transitional Housing Program",
    "organization": "Ywca Transitional Housing Program",
    "phone": "(508) 791-3181",
    "website": "http://www.ywcacentralmass.org/support/transitional-housing",
    "description": "When living paycheck to paycheck, a jump in the cost of rent, an abusive relationship, addiction, or an unexpected catastrophe can have a lasting and devastating affect. Each year increasing numbers of adult women are faced with the prospect of homelessness in our community. The YWCA responds to this urgent community need by providing safe, affordable housing with supportive services for adult women striving to improve the quality of their lives, while preparing them for stable housing in the community.\n\nWomen in need of short-term housing have access to safe, affordable dormitory style living quarters at One Salem Square for four weeks up to two years. For a modest program fee, each resident has a private room with essential furnishings and access to a community kitchen and living area.\n\nVisit this page for an application\nhttp://www.ywcacentralmass.org/support/transitional-housing"
  },
  {
    "addressLine1": "41 columbia st",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01604",
    "name": "Laura's Shelter House",
    "organization": "Laura's Shelter House",
    "phone": "(508) 371-8009",
    "website": "mailto:mrpunching@gmail.com",
    "description": "*Note - This is not FREE. There is a cost to stay at this location. Call for details.\nOur furnished affordable rooms provide each individual the opportunity for personal security and individual growth. With our community style setting, our residents form bonds that last a lifetime. In addition to learning necessary interpersonal communication skills, our unique living model makes Laura's Shelter House a living experience and a learning experience.\n\nLaura's Shelter House has been in the business of helping homeless and near indigent individuals back onto the path of self sufficiency. With seven fully furnished rooms, and easily affordable rent, we offer stability to those struggling to pull themselves up to a better standard of living."
  },
  {
    "addressLine1": "P.O. Box 3093",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01613",
    "name": "DayBreak YWCA",
    "organization": "DayBreak YWCA",
    "phone": "(508) 755-9030",
    "website": "https://www.facebook.com/YWCACM/",
    "description": "Women and Children's shelter. To get help, you should call the Daybreak Resources for Women and Children hotline at 508-755-9030. The Daybreak hotline will accept collect calls.\n\nThe Daybreak program provides services to the greater Worcester area. All services offered can be accessed through the 24-hour hotline, 508-755-9030."
  },
  {
    "addressLine1": "91 June Street",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01602",
    "name": "IHN Worcester Shelter",
    "organization": "IHN Worcester Shelter",
    "phone": "(508) 755-2212",
    "website": "http://ihnworcester.org/",
    "description": "Family shelter\n\nOur program staff counsels families to help them identify their needs and develop a comprehensive service plan. The families receive case management, advocacy, assistance in securing housing, employment and other vital services such as obtaining a doctor or health insurance, enrolling in school, day care or counseling. They attend weekly classes on budgeting, parenting and developing employment skills, and they are taught to advocate for themselves and their children.\n\nProgram guests are required to seek employment (unless receiving disability) or enroll into school, develop a budget, save money, payoff past due bills and work on the goals of their service plan. Our goal is to provide the guests with the knowledge and skills that they will need to maintain their families in their new homes. Our volunteers provide meals, supplies and grocery gift cards as well as companionship, moral support and encouragement. Volunteers also work in the evening and overnight staffing."
  },
  {
    "addressLine1": "25 Queen St",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01610",
    "name": "Queen Street Shelter Worcester - SMOC",
    "organization": "Queen Street Shelter Worcester - SMOC",
    "phone": "(508) 872-4853",
    "website": "http://www.smoc.org/",
    "description": ""
  },
  {
    "addressLine1": "52 High St",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01609",
    "name": "Abby's House",
    "organization": "Abby's House",
    "phone": "(508) 756-5486",
    "website": "https://www.abbyshouse.org/programs/shelter/",
    "description": ""
  },
  {
    "addressLine1": "162 Chandler St",
    "city": "Worcester",
    "state": "Massachusetts",
    "stateAbbreviation": "MA",
    "postal": "01609",
    "name": "HOAP (Homeless Outreach & Advocacy Program)",
    "organization": "HOAP (Homeless Outreach & Advocacy Program)",
    "phone": "(508) 860-1080",
    "website": "http://www.fhcw.org/en/HealthServices/WorcesterHealthCareHomeless",
    "description": ""
  }
]