[
  {
    "addressLine1": "480 Metacom Avenue",
    "city": "Bristol",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02809",
    "name": "RI VETERAN'S HOME",
    "organization": "RI VETERAN'S HOME",
    "phone": "(401) 253-8000",
    "website": "",
    "description": "Veteran's shelter."
  },
  {
    "addressLine1": "100 Bullocks Point Avenue",
    "city": "East Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02915",
    "name": "East Bay Coalition For the Homeless",
    "organization": "East Bay Coalition For the Homeless",
    "phone": "(401) 437-5104",
    "website": "http://www.eastbayhomeless.org/",
    "description": "Housing Program\nEast Bay Coalition for the Homeless housing program provides apartments for homeless families with children, combined with case management and supportive services. The East Bay Coalition for the Homeless has 18 apartments in the East Bay area. They are located in East Providence, Warren and Bristol. Length of stay depends upon each familys needs, and it is also determined by compliance to program criteria.\n\n\nRhode Island residents who meet the homeless criteria are eligible to apply. Families must meet the federal definition of homeless, be a Rhode Island resident for 6 months, and be employed. Case management and support services are cornerstones to every family's success. Our programs are designed to provide individualized support services to help families achieve and maintain financial stability."
  },
  {
    "addressLine1": "80 East Street",
    "city": "Cranston",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02920",
    "name": "SSTARBIRTH",
    "organization": "SSTARBIRTH",
    "phone": "(401) 463-6001",
    "website": "https://twitter.com/sstarinc",
    "description": "SSTARbirth is the only residential substance abuse treatment program in the state of Rhode Island specifically designed for pregnant and postpartum women and their children."
  },
  {
    "addressLine1": "30 Howard Ave",
    "city": "Cranston",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02920",
    "name": "Harrington Hall",
    "organization": "Harrington Hall",
    "phone": "(401) 462-0724",
    "website": "https://www.crossroadsri.org/About/Blog/PostId/32/harrington-hall-the-1-year-mark",
    "description": "Harrington Hall is Rhode Islands largest shelter, with 112 beds available for single men each night. Just over a year ago, Crossroads Rhode Island took over management of the shelter and began operating using our Housing First approach to service delivery."
  },
  {
    "addressLine1": "33 Chestnut Avenue",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02908",
    "name": "PEOPLE TO END HOMELESSNESS",
    "organization": "PEOPLE TO END HOMELESSNESS",
    "phone": "(401) 274-0065",
    "website": "",
    "description": "Men's homeless shelter."
  },
  {
    "addressLine1": "557 Broad Street",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "00000",
    "name": "AIDS CARE OCEAN STATE",
    "organization": "AIDS CARE OCEAN STATE",
    "phone": "(401) 521-3603",
    "website": "http://www.aidscareos.org/",
    "description": "AIDS Care Ocean State is dedicated to providing quality housing, case management, medical and nursing care, and prevention to adults, families, adolescents and children who are affected by or at risk for HIV infection. AIDS Care Ocean State will act as an advocate for individuals and families at risk, while providing those support services needed to ensure and maintain a high quality of life for the people we serve."
  },
  {
    "addressLine1": "246 Prairie Avenue",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02905",
    "name": "URBAN LEAGUE",
    "organization": "URBAN LEAGUE",
    "phone": "(401) 351-5000",
    "website": "https://www.facebook.com/The-Urban-League-of-RI-Lives-2234666510102543/",
    "description": "shelter for all."
  },
  {
    "addressLine1": "386 Smith Street",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02908",
    "name": "Sojourner House",
    "organization": "Sojourner House",
    "phone": "(401) 765-3232",
    "website": "http://www.sojournerri.org/",
    "description": "Domestic Violence Shelter\n\nSAFE HOUSE (EMERGENCY SHELTER)\nAs domestic violence victims take important steps to reclaim their lives, it is often necessary to move away from the abuser. Sojourner House's Safe House is in an undisclosed location and serves as immediate, safe, temporary housing for abused women and their children. Once there, advocates help residents work on their goals and provide emotional support for the duration of their stay, as well as follow-up care once they've moved to more permanent, safe housing. Our staff also provides information about domestic abuse, case management services, referrals, and educational programs. Each resident's length of stay at our Safe House depends upon her personal situation.\nOur Safe Home is fully handicap accessible. Women and their children are provided with 24-hour locked and secure shelter and comprehensive services through Sojourner House's network of local resources and service providers. Residents participate in a number of programs designed to help them process the various effects of domestic abuse.\n\nTRANSITIONAL HOUSING (INDEPENDENT APARTMENTS)\nSojourner House also offers a transitional housing program for victims of domestic violence and their children. Transitional housing may only be provided to victims exiting the Safe House, those who are homeless or in need of transitional housing as a result of fleeing a situation of domestic violence/dating violence, or those for whom emergency shelter services or other crisis intervention services are unavailable or insufficient.\nTransitional housing is the bridge to self-sufficiency and permanent housing for our clients. In addition to seeking permanent housing, clients have the opportunity to establish goals and learn skills to work toward economic stability.\n\nFor more information about our residential services, please call our hotline at 401-765-3232."
  },
  {
    "addressLine1": "627 Cranston Street",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02907",
    "name": "Providence Rescue Mission",
    "organization": "Providence Rescue Mission",
    "phone": "(401) 274-8861",
    "website": "https://providencerescuemission.org/",
    "description": "We provide emergency overnight accommodations for 75 to 90 homeless men and 15 to 30 homeless women, seven nights a week. Each overnight guest has the ability to take a hot shower, eat a hot dinner, sleep in a clean bed, and have breakfast in the morning. This is approximately 38,325 nights of safe shelter provided annually at the Mission.\n\nMeal Program\nOur meal programs provide approximately 8,500 - 10,000 hot meals a month to the needy in our community. This Thanksgiving we provided Thanksgiving food boxes for over 1,825 families in the Providence area. Each box contained 25 pounds of non-perishable food and a 15 pound turkey. At Christmastime, we provided 11,000 gifts to over 1,600 needy families through our Christmas Toy Ministry.\n\nDiscipleship Program\nWe run a one-year discipleship program that allows 10 to 15 homeless men with, but not limited to, substance abuse issues to start a new life by combining biblical values, counseling, education and career training and reunification with their families. This program is at capacity most of the time.\n\nDental Offices\nThe Providence Rescue Mission features a full service dental office that helps Individuals start a new life with a smile they can proud of. Our office features x-ray, full cleaning, and other dental services. Local dentists and staff see patients by appointment only.\n\nFood , Clothing and Other Community Outreaches\nWe operate an emergency food pantry and a clothing room. Individuals and families use these services on a daily basis. We distribute weekly and as needed, emergency food and 5,000 articles of clothing each month. In addition to our feeding ministry, we do special events during the holidays.\n"
  },
  {
    "addressLine1": "49-51 Trenton Street",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02906",
    "name": "Providence Community Action Interim House - Shelter for Families",
    "organization": "Providence Community Action Interim House - Shelter for Families",
    "phone": "(401) 831-4570",
    "website": "",
    "description": "Interim House Emergency Family Shelter. Community Action Agency."
  },
  {
    "addressLine1": "127 Michigan Avenue",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02905",
    "name": "PROVIDENCE CENTER",
    "organization": "PROVIDENCE CENTER",
    "phone": "(401) 276-4000",
    "website": "https://twitter.com/theprovcenter",
    "description": "Shelter for all, men, women, children."
  },
  {
    "addressLine1": "133 Delaine Street",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02909",
    "name": "YWCA Rhode Island Community Center",
    "organization": "YWCA Rhode Island Community Center",
    "phone": "(401) 351-2241",
    "website": "https://twitter.com/ywca_ri",
    "description": "Gateway to Independence program is for VETERAN MEN ONLY."
  },
  {
    "addressLine1": "325 Niagara Street",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02907",
    "name": "Mcauley Village - Mcauley Ministries",
    "organization": "Mcauley Village - Mcauley Ministries",
    "phone": "(401) 467-3630",
    "website": "https://mcauleyri.org/",
    "description": "Transitional housing program for homeless single parents and children. The Village has 23 apartments and an on-site Child Care Learning Center. We provide the basic human needs of shelter, child care, supportive services, advocacy and guidance to homeless families seeking help."
  },
  {
    "addressLine1": "160 Broad Street",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02903",
    "name": "Crossroads Rhode Island",
    "organization": "Crossroads Rhode Island",
    "phone": "(401) 521-2255",
    "website": "https://www.crossroadsri.org/",
    "description": "Need Help?\n\nIn need of emergency shelter and want to learn more about our services? Contact us at cesteam@crossroadsri.org or (401) 277-4316.\nBy doing so, you will be connected with our Coordinated Entry Team, who is responsible for helping neighbors in need connect with emergency shelter*, housing and resources.\n\n\nOur hotline is staffed weekdays (excluding major holidays); messages and emails are accepted 24/7.\n\n*Please note that shelter is not guaranteed.\n\n\nEmergency SheltersCitizens Bank Family Center:\n\nProvides emergency shelter and support for up to 15 families.\nCouples' Shelter:\n\nThe only emergency shelter in the state for couples without children, offers case management for four couples in scattered apartments.\nHarrington Hall:\n\nRhode Island's largest men's shelter, accommodates up to 112 men.\nWomen's Shelter:\n\nShelters 41 women in 10 shared bedrooms, one wheelchair-accessible bedroom, a common space and outdoor patio.\nDomestic Violence Program:\n\nProvides a 24/7 emergency hotline, emergency shelter services and more for 26 survivors in a confidential, safe house location for survivors of domestic violence and their children."
  },
  {
    "addressLine1": "415 Friendship Street",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02907",
    "name": "Amos House Shelter and Services",
    "organization": "Amos House Shelter and Services",
    "phone": "(401) 272-0220",
    "website": "http://www.amoshouse.com/",
    "description": "Hours: Monday to Friday 8-4, Social Services 8-4 Monday to Thursday, Friday 8-1\nmen's and women's shelter.\nHousing OverviewShelter\nMore than a meal, Amos House is home. And all that goes with it. Trust, safety, a solid foundation from which to grow, and friendships (made right here on Friendship Street). We offer a continuum of housing programs for individuals and families that are homeless and poor. Over the past ten years our properties have provided temporary and permanent housing to more than 2000 people. Our services include:\nTransitional Housing\nSupportive Housing\nOur men's and women's transitional housing programs provide safe housing for hundreds of homeless people each year. Our apartment program assists individuals and families on their journey from homelessness to self-sufficiency. And our rooming houses provide permanent and supportive housing for homeless people with special needs.\nClean and sober transitional housing for 20 men and 13 women; referrals and social support services. Prescription assistance. Employment services. Recovery Services. Housing assistance, Breakfast and Lunch served Monday to Saturday. ACE Culinary Arts Training Program.Permanent supportive housing includes 4 rooming houses, and 19 apartments. All housing is drug and alcohol free.\n\n"
  },
  {
    "addressLine1": "P.O. Box 603300",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02906",
    "name": "Women's Center of RI",
    "organization": "Women's Center of RI",
    "phone": "(401) 861-2670",
    "website": "https://www.womenscenterri.org/",
    "description": "The Women's Center of Rhode Island has merged with Crossroads Rhode Island to better serve and provide safety and shelter to domestic violence survivors.\nThe Domestic Violence Program of Crossroads is an emergency shelter that serves exclusively domestic violence survivors and their children. The shelter provides 26 domestic violence survivors and their children in a confidential location where they will have basic needs assistance such as education, employment services and intensive care management. It is separate from the Crossroad Rhode Island additional shelters which serve homeless individuals and their families.\n\n\nAdditional Telephone Numbers:\nConfidential 24 Hour Helpline: If you or anyone you know is experiencing domestic violence, do not hesitate to call (401) 861-2760\nDomestic Violence Center Business Phone: (401) 861-2761\n\n\n\n\n"
  },
  {
    "addressLine1": "557 Broad Street",
    "city": "Providence",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02907",
    "name": "Aids Care Ocean State - Housing Assistance",
    "organization": "Aids Care Ocean State - Housing Assistance",
    "phone": "(401) 273-1888",
    "website": "http://www.aidscareos.org/",
    "description": "AIDS Care Ocean State is the largest provider of subsidized housing for persons living with HIV/AIDS.\nWe have built or developed 19 properties to serve our clients. We currently have 127 clients residing in 48 apartments that we own and operate. Federal funding sources allow us to sub-lease 47 apartments to assist an additional 76 clients."
  },
  {
    "addressLine1": "19 Valley Road",
    "city": "Middletown",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02842",
    "name": "Lucy's Hearth",
    "organization": "Lucy's Hearth",
    "phone": "(401) 847-2021",
    "website": "https://www.lucyshearth.org/",
    "description": "Emergency Shelter Program\n\nOur Emergency Shelter Program is located at 19 Valley Road in Middletown, Rhode Island.  Six families with children may be accommodated at any one time in the efficiency units with includes beds, a bureau, a full bathroom,  and a closet.  The families share use of a kitchen, television room, dining room, playground and a learning center.\n\nEligibility requirements for families include: be at least 18 years old and have a minor child in custody, and be homeless.\n\n\nBefore acceptance into the emergency shelter, families must:\n\n- complete a telephone screening with United Way 2-1-1 and be placed on the Statewide Family Shelter Waiting List;\n\n\n- should respond within 2 hours to a call from Lucys Hearth when they call to report an opening;\n\n- must provide various documents, including birth certificates and other identification, health insurance cards if any, and financial and housing history records.\n\n \nEmergency Shelter services include:\n- crisis intervention,\n- life-skills group,\n- a daily goal-setting group,\n- case management,\n- parenting skills groups,\n- financial literacy education,\n- preparation for testing for a General Equivalency Degree (GED),\n- mental health treatment,\n- job readiness skills development,\n- nutrition classes,\n- after-school homework help,\n- art classes,\n- fitness classes,\n- transportation to appointments,- referrals to outside providers for education, training, medical care and additional mental health treatment."
  },
  {
    "addressLine1": "15 Meeting Street",
    "city": "Newport",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02840",
    "name": "McKinney Cooperative Shelter",
    "organization": "McKinney Cooperative Shelter",
    "phone": "(401) 846-6385",
    "website": "",
    "description": "Shelter for 19 men, 6 women. Transitional housing for 12 men, 4 women.\nHours: 4:30pm - 8:30am, preference to Newport county residents\n\nServices provided:\nChronic/Severe Mental Illness\nEmergency Shelter\nHomeless Shelter\nPeople with Chronic Illnesses\nTransitional Housing/Shelter\n"
  },
  {
    "addressLine1": "114 Touro Street",
    "city": "Newport",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02840",
    "name": "Women's Resource Center of Newport/ Bristol Counties",
    "organization": "Women's Resource Center of Newport/ Bristol Counties",
    "phone": "(401) 847-2533",
    "website": "https://www.wrcnbc.org/",
    "description": ""
  },
  {
    "addressLine1": "24 School Street",
    "city": "Newport",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02840",
    "name": "CHILD & FAMILY SERVICES OF NEWPORT COUNTY WINSLOW COURT",
    "organization": "CHILD & FAMILY SERVICES OF NEWPORT COUNTY WINSLOW COURT",
    "phone": "(401) 849-2300",
    "website": "https://twitter.com/child_familyri",
    "description": "Adults and family shelter."
  },
  {
    "addressLine1": "P.O. Box 459",
    "city": "Narragansett",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02882",
    "name": "GALILEE MISSION TO FISHERMEN",
    "organization": "GALILEE MISSION TO FISHERMEN",
    "phone": "(401) 789-9390",
    "website": "https://twitter.com/missiongalilee",
    "description": "Men's shelter."
  },
  {
    "addressLine1": "61 Main Street",
    "city": "Wakefield",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02879",
    "name": "WOMEN'S RESOURCE CENTER OF SOUTH COUNTY",
    "organization": "WOMEN'S RESOURCE CENTER OF SOUTH COUNTY",
    "phone": "(401) 782-3990",
    "website": "https://www.facebook.com/DVRCSC/",
    "description": "Victim's of domestic violence and their children."
  },
  {
    "addressLine1": "8 North Road",
    "city": "Peace Dale",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02883",
    "name": "Welcome House of South County Emergency Shelter",
    "organization": "Welcome House of South County Emergency Shelter",
    "phone": "(401) 782-1648",
    "website": "http://www.welcomehouseofsouthcounty.org/",
    "description": "Hours: Monday to Friday 9-8, Saturday and Sunday 4-8\nAge Details: 18 years of age and older. Children when accompanied by a parent.Services: Overnight 17 bed shelter (13 men, 4 women) offering a warm evening meal, brown bag lunch, and \"fix your own\" morning breakfast. Referrals to other agencies. Staffed by trained volunteers and a salaried director. Families are accommodated when space is available.Income Source: Grants; foundations; private donations\nServices:\n* Brown Bag Programs\n* Case/Care Management\n* Emergency Shelter\n* Homeless Family Reunification Services\n* Homeless Shelter\n* Housing Search and Information\n* Housing Search Assistance\n* Information and Referral\n* Information Services\n\n"
  },
  {
    "addressLine1": "P.O. Box 5643",
    "city": "Pawtucket",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02862",
    "name": "Blackstone Valley Advocacy Center - Food Distribution Center",
    "organization": "Blackstone Valley Advocacy Center - Food Distribution Center",
    "phone": "(401) 723-3057",
    "website": "mailto:info@bvadvocacycenter.org",
    "description": "Domestic violence shelter.\n\nResidential Programs\nSafe Home\nIt is often a very traumatic experience for a family to come to a safe home for the first time. In addition to fleeing an abusive relationship, the family is faced with living in an unknown environment. We recognize the difficult steps a family had to make prior to coming to our agency and we attempt to provide a homelike setting in a sensitive and caring environment.\nWhile residing in the safe home, guests are provided with basic needs such as: food, clothing, linens, personal items, furniture and household items. Additionally, extensive case management services are provided for all family members through our Residential Team. A clinical counselor is available to families to help deal with their emotional stress and trauma.\n\nFamilies learn to live without fear and abuse, and work to create a life of peace.\n\nTransitional Housing Program\nOur Transitional Housing Program offers intensive case management and services around client identified issues. The families who reside within in the program are single female head of households who are survivors of domestic violence. It is a supervised living situation in a safe environment. It is designed to provide intensive services for a period of two years. The program assists families with individual case management that includes identifying immediate needs, reviewing options that are available and assist in long-term goals. It further assists families in their work towards personal, family and economic stability."
  },
  {
    "addressLine1": "95 Pine Street",
    "city": "Attleboro",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02703",
    "name": "Attleboro Area Council of Churches",
    "organization": "Attleboro Area Council of Churches",
    "phone": "(508) 222-2933",
    "website": "http://www.attleborocouncilofchurches.org/",
    "description": "This is NOT a homeless shelter. They provide a program called Homes With Heart.\n\nHomes With Heart is a HUD sponsored program that's purpose is to find nd secure permanent housing for chronically homeless persons. Once this is accomplished, case management will be provided to assure support and services for the clients. This may include health insurance and care, nutrition and budget education, counseling and community integration through volunteerism.\n\n\nHomes With Heart has found permanent supportive housing for 24 men and women, and provided related services to numerous others. Homes With Heart staff and clients work cooperatively with other agencies in the area's Continuum of Care in order to provide the most successful experiences possible.\n\nContact them to see if they can assist you. Office hours: Mondays through Fridays 9am - 5pm."
  },
  {
    "addressLine1": "11 Peck Street",
    "city": "Attleboro",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02703",
    "name": "FAMILY RESOURCE CENTER",
    "organization": "FAMILY RESOURCE CENTER",
    "phone": "(508) 226-5722",
    "website": "https://www.facebook.com/FRCTaunton/",
    "description": ""
  },
  {
    "addressLine1": "11 Peck Street",
    "city": "Attleboro",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02703",
    "name": "FOCUS Family Resource Center",
    "organization": "FOCUS Family Resource Center",
    "phone": "(508) 226-5722",
    "website": "https://www.oldcolonyymca.org/community-social-services/family-resource-centers?fbclid=IwAR3ws246IUa",
    "description": "Community Care Services is a private, non-profit corporation that provides emotional, educational and behavioral support to more than 7,500 children, adults, elders, and families annually throughout Southeastern Massachusetts, Rhode Island and now expanding into Connecticut."
  },
  {
    "addressLine1": "P.O. Box 9476",
    "city": "Warwick",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02889",
    "name": "Elizabeth Buffum Chace Center",
    "organization": "Elizabeth Buffum Chace Center",
    "phone": "(401) 738-1700",
    "website": "http://www.ebccenter.org/",
    "description": "Contact Info:\nHotline: (401)738-1700\nBusiness: (401) 738-9700\n\nDomestic violence shelter for women and children.\n\nSafe Shelter\nThe Elizabeth Buffum Chace Center offers short-term,safe, confidential shelter for victims of domestic violence and sexual assault and their children. Residents are provided with all basic needs and are encouraged to participate in a program that includes education about domestic violence, parenting and financial literacy. We also provide specialized childrens services, advocacy and referrals.\n\nTransitional Housing\nThe Elizabeth Buffum Chace Center offers a transitional housing program for families who have been affected by domestic violence and sexual assault.\nOur program provides safety, stability and support, while clients take the next steps toward self-sufficiency."
  },
  {
    "addressLine1": "3188 Post Rd",
    "city": "Warwick",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02886",
    "name": "House of Hope CDC",
    "organization": "House of Hope CDC",
    "phone": "(401) 463-3324",
    "website": "http://thehouseofhopecdc.org/",
    "description": "Operation First Step was created after the closing of one of Rhode Islands largest temporary shelters. To fill the void with a more effective solution, the organization collaborated with the State and other partners to develop a new comprehensive and coordinated system of smaller, community based short term housing options. House of Hope CDCs First Step program, catering to both men and women, and provides a higher level of case management and support with dignity not found in the typical night-to night shelter. Currently, our Womens First Step program provides transitional housing for 5 homeless women. Our mens First Step program currently provides transitional housing for 12 homeless men. We operate our First Step program in North Providence and Providence locations."
  },
  {
    "addressLine1": "54 Providence St",
    "city": "West Warwick",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02893",
    "name": "Harold Lewis House",
    "organization": "Harold Lewis House",
    "phone": "(401) 615-3155",
    "website": "http://www.crossroadsri.org/",
    "description": "Harold Lewis House is designed to provide elder individuals with a safe, secure, and affordable place to live. Harold Lewis House offers 14 beds of permanent supportive housing for disabled adults aged 50 and over.\n\nThe house is located in West Warwick.Services Residents receive supportive services.\n\nEligibility Homeless. Disabled. Aged 50+.\n This facility is not exclusively for veterans, but it maintains a veterans' preference. Therefore, no service-connection or discharge status is required.\n\nHow To Apply Hard copy application. Submit application in person or by mail to Jennifer Watkins. Applicants will be required to meet with Jennifer Watkins in person during the screening process."
  },
  {
    "addressLine1": "56 Spruce Street",
    "city": "Westerly",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02891",
    "name": "W.A.R.M. Shelter",
    "organization": "W.A.R.M. Shelter",
    "phone": "(401) 596-9276",
    "website": "http://www.warmshelter.org/",
    "description": "19-bed facility Emergency shelter for single adults and couples with no children.\nIntake hours:\nMonday to Friday from 9:00am to 5:00pm.\nObligations while staying in the Shelter:\nRemain alcohol and drug free\nFollow house rules\nMeet with their peers and staff weekly\nSubmit to random alcohol/drug testing\nNotes:\nWalk in: 24 hr/7days\nThe maximum continuous stay is 30 days.\nSeparate sleeping quarters for men and women\nLaundry facility\nEligibility:\nSingle adults; Pregnant women; Couples without children\nOther Services:\nCommunity Outreach\nAnitas Kitchen, Lunch and Dinner\nAttire for Hire\nHarvest Homes\nSupportive Homes\nStreet Outreach\n"
  },
  {
    "addressLine1": "76 Federal Street",
    "city": "New London",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "06320",
    "name": "NEW LONDON HOMELESS HOSPITALITY CENTER",
    "organization": "NEW LONDON HOMELESS HOSPITALITY CENTER",
    "phone": "(860) 701-0574",
    "website": "http://www.nlhhc.org/",
    "description": "Overnight shelter for individuals or couples (NO FAMILIES) from 7pm to 7am. Snacks are available at the shelter. Free breakfast is available down the street.\n\nAnyone wishing to utilize the shelter must first go to the New London City Police Department at 5 Governor Winthrop Boulevard to complete a background check, and then bring the clearance to the shelter for admission. This is a one-time requirement. Anyone with a history of violence may be denied admission to the shelter. The police department will attempt to resolve any outstanding warrants as quickly as possible to allow use of the shelter.\n\nApplication: First come, first served; New London Police screening required for first time users\nCapacity: 45\nServices: Homeless Shelter\nSite hours: Homeless shelter hours:\ndaily: 7pm-7am"
  },
  {
    "addressLine1": "42 Jay St.",
    "city": "New London",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "06320",
    "name": "Covenant Shelter of New London, Inc",
    "organization": "Covenant Shelter of New London, Inc",
    "phone": "(860) 443-0537",
    "website": "https://www.covenantshelterofnewlondon.org/",
    "description": "Emergency shelter for single adults and families consisting of a single parent with children (newborn to age 17); intake hours vary; referrals accepted 24 hrs/7 days. Maximum stay is 30 days for individuals and 90 days for families. Meals, case management and other support services are provide for shelter residents.\nEligibility:Single adults (ages 18+); Pregnant women; Single parent with children (newborn to age 17)\n\nFees:$4 per night for singles; 15% of family income for families; Clients with an income are expected to reimburse the shelter for servicesCapacity: M/W, Ww/C, Mw/C 35 beds\nServices: Homeless Shelter\nSite hours: M-F: 8am-4pm\n"
  },
  {
    "addressLine1": "176 Sayles St",
    "city": "Woonsocket",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "02895",
    "name": "Community Care Alliance Woonsocket Homeless Shelter",
    "organization": "Community Care Alliance Woonsocket Homeless Shelter",
    "phone": "(401) 767-0866",
    "website": "https://www.communitycareri.org/ProgramsServices/Housing/WoonsocketShelter.aspx",
    "description": "The Woonsocket Homeless Shelter is open 24 hours a day, 365 days per year, housing nearly 80 persons per night through the shelter and six emergency apartments.\n\nIn addition to securing housing, residents receive case management services to help identify and address their specific needs. Residents are linked to other services within the agency and community including:\n\nLife skills training (household and financial management, home maintenance, nutrition)\nParenting support\nEmployment and training\nGED & other educational support services\nMental health and substance abuse counseling\nBasic needs assistance\nEarly childhood intervention\nHealthcare\nAfter school program\n\nShelter stays are limited to ninety days, but can be renewed based on progress demonstrated by residents or impending permanent housing. Nominal program fees are assessed based on income.\n\nFor information and to inquire about available openings, call 401-767-0866.\n\nThe Transitional Housing program is offered to families who will live in Woonsocket after leaving the emergency shelter. Case Management services are available for up to two years to help families strengthen the self-sufficiency skills needed to remain in their new housing.\n\n\nThe Burnside Permanent Supportive Housing Program serves single men who meet eligibility requirements related to homelessness, disability and income. Residents work with a case manager to access services and increase self sufficiency through life-skills training, community service or employment, access to income supports, and other services to help them improve their health and well-being. For more information about this program, contact 401-671-6975."
  },
  {
    "addressLine1": "17 Congress St",
    "city": "Milford",
    "state": "Rhode Island",
    "stateAbbreviation": "RI",
    "postal": "01757",
    "name": "Pathway to a Better Life",
    "organization": "Pathway to a Better Life",
    "phone": "(508) 488-9107",
    "website": "https://sites.google.com/view/pathwaytoabetterlife/home",
    "description": ""
  }
]