[
  {
    "addressLine1": "114 East 5th",
    "city": "Alton",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62002",
    "name": "Salvation Army Booth House",
    "organization": "Salvation Army Booth House",
    "phone": "(314) 960-2532",
    "website": "https://twitter.com/salarmystl",
    "description": "Services: Provides residential housing. EMERGENCY SHELTER.\n\nHousing for men, women and their children."
  },
  {
    "addressLine1": "111 Market St",
    "city": "Alton",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62002",
    "name": "Oasis Women's Shelter",
    "organization": "Oasis Women's Shelter",
    "phone": "(618) 465-1978",
    "website": "http://www.oasisshelter.org/",
    "description": "Domestic Violence shelter for women or women with children."
  },
  {
    "addressLine1": "610 N SIlver Street",
    "city": "Silver City",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "88061",
    "name": "SPIN (Supporting People In Need) Shelter",
    "organization": "SPIN (Supporting People In Need) Shelter",
    "phone": "(575) 494-1128",
    "website": "https://spinhousingnm.org/",
    "description": ""
  },
  {
    "addressLine1": "215 E. New York Street",
    "city": "Aurora",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60505",
    "name": "Elgin Wayside Center",
    "organization": "Elgin Wayside Center",
    "phone": "(847) 695-4405",
    "website": "https://www.waysidecross.org/",
    "description": "The Elgin Wayside Center is more than a homeless shelter. Its a place where struggling and broken men, women and children, and the church, can connect. Here, guests come to our center for food, clothing, and a place to rest, but receive much more.\nThe Elgin Wayside Center has provided shelter for the homeless and witnessed lives transformed by the Gospel of Jesus Christ.  With the help of faithful volunteers, hundreds of individuals and needy families are assisted each year with practical, life-changing services and basic necessities, so the broken can find hope.\n\n\nLike a temporary home, the center offers what most people take for granted meals, safe daytime shelter, free laundry services, showers, and individual lockers to keep personal items secure. Computers to connect with loved ones, apply for work, or collaborative services.\n"
  },
  {
    "addressLine1": "659 South River St",
    "city": "Aurora",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60506",
    "name": "Hesed House",
    "organization": "Hesed House",
    "phone": "(630) 897-2156",
    "website": "https://www.hesedhouse.org/",
    "description": "A not-for-profit coalition of religious ministries serving the very poor in the Fox Valley area. A center for ministries providing services to poor and homeless persons.\n\nPADS Emergency Shelter\nPublic Action To Deliver Shelter\nThe PADS Overnight Emergency Shelter is the second largest shelter in the State of Illinois. Each night, an average of 175 men, women and children line up outside the doors of Hesed House seeking a place to sleep, shower, do laundry, eat a meal, find medical and legal assistance and other life sustaining services.\nThe PADS program at Hesed House serves as a model for other similar agencies in the Western Suburbs and across the nation. The PADS Overnight Emergency Shelter operates from 7 p.m. to 7 a.m., every night of the year. Over 70 faith based communities with teams of volunteers provide food and serve meals, and oversee the shelter dining room, store, laundry facilities, lockers and four sleeping areas. Volunteers also make sack lunches and breakfasts to serve guests as they depart for work or other destinations in the morning.\n\nThe men's sleeping area accommodates 88 sleeping mats. After 9:30 pm, additional mats are placed in our double duty dining room. Several other smaller sleeping areas provide mats and volunteer oversight for single women, women with children, single fathers and families with special needs. The PADS Overnight Emergency Shelter will typically house 5 to 10 children per night.\nWhile in the PADS shelter, guests may sign up for Case Management services, assistance in finding housing, identification, employment training, medical and legal assistance as well as obtaining veterans benefits.\nPADS Overnight Emergency Shelter does not turn anyone away (other than people listed as sex offenders involved with children) for a night. Longer stays are generally limited to those with ties to our service area.\nOur basic rules are simple: while a guest is in PADS, he/she may not possess drugs, alcohol or weapons. Violence, threats and profanity are not tolerated.\n\nTransitional Living Community\nTLC is a temporary dormitory style home to 52 individuals and families who are between homelessness and returning to an independent life and aggressively working toward self improvement and independence (by developing skills to manage a household and maintain employment, learning sound money management and savings practices, honing parenting skills and much more).  Our recent grant award from B of A Community (Bank of America) will help us reach this goal by providing shelter, food and the services needed for those that stay at our Transitional Living Community.  Last year, 110 residents stayed in TLC.  Of those that completed the program, 87% returned to independent living.  We'd like to thank Bank of America for their continued support of our mission.\n\nHesed House is the second largest shelter in the State of Illinois, and the largest shelter outside of the city of Chicago. With the help of professional staff, alliances with outside agencies and 6,000 volunteers from 70 area churches, almost one thousand individuals (including 188 children) are served each year through Hesed Houses shelter and three housing programs. Hesed House sees 16 newly homeless individuals each week thats one new homeless individual every 8 1/2 hours. Hesed House strives to get 16 or 17 individuals out of homelessness each week. Between 155 and 207 individuals are given shelter and meals each night.\nThe Harbor Permanent Supportive Housing\n\nThe Harbor provides permanent supportive housing for up to sixteen chronically homeless individuals with a disabling condition (i.e. substance abuse, mental illness, physical disabilities, etc.) This project provides housing for our communitys most vulnerable population. The Harbor targets those that are the greatest utilizers of community resources, including police and ambulance services, as well as those who are frequent hospital emergency room patients often for non-emergency reasons.\n\nEach individual has their own dorm-room style housing unit with 24/7 on-site staff to assist with life skills (cooking, etc.) as well as access to all of the services in our Comprehensive Homeless Resource Center (e.g. mental health counseling, primary health/medical care, substance abuse counseling, etc.) There is a shared kitchen, laundry room and bathrooms for the residents along with a computer lab and community room.\n"
  },
  {
    "addressLine1": "214 Walnut St.",
    "city": "Saint Charles",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60174",
    "name": "Lazarus House",
    "organization": "Lazarus House",
    "phone": "(630) 587-2144",
    "website": "https://lazarushouse.net/",
    "description": "Office Hours\nEmergency Shelter\n24 hrs\n\nDonations\nMonday - Saturday 9am 9pm\nSunday 1pm 9pm\n\nAdmin Office\nMonday - Friday 8am 4pm\n\nOutreach\nMonday - Thursday 9am 5:30pm\nFriday 9am 3pm\n\nOur mission is to offer guests connected to our communities, who are homeless or in need, hope for the future by providing hospitality, food, safe shelter, and education -tools for life. We strive to make certain that all who enter feel the love of Jesus.Our desire is to offer everyone who comes to our doors the opportunity for hope and a future. We give people a hand up, not a hand out.\n\nHomeless Shelter\nOur emergency housing offers a safe haven for persons in need. We are open 365 days/year, and shelter staff are available 24/7. The program provides:\n    Warm bed\n    Three meals every day\n    Shower and laundry facilities\n    Personal hygiene items\n \nDay Center\nOur Women & Children's Day Center, open 7 days per week, provides a safe, home-like daily living environment away from male Guests in the Lazarus House program. The Day center provides:\n    Separate, enhanced space to allow women and children to focus on and more\n    effectively achieve their goals\n    Indoor and fenced outdoor play area and recreational space for children\n    Additional bathroom facilities, including showers and a bath tub for children\n    Classes specific to womens issues\n    Individualized attention and support\n \nSupport Services\nAll Lazarus House Guests have access to:\n    Case management and advocacy to address the problems that caused homelessness\n    Referrals to external professional resources to address mental health, substance abuse, health or other issues\n    GED and educational tutoring\n    Life skills classes on topics such as budgeting and financial management, job readiness, goal planning, parenting\n    Community clothes closet\n    Health care (provided through FQHC clinics and a cooperative effort on the part of doctors, dentists, Tri City Health Partnership, and local funding assistance)\n    Haircuts\n    Employment services\n    Computer usage (monitored)\n    Optional Bible studies and Sunday worship services\n\nTransitional Housing\nCenter for Transitional Living\nSometimes people need extended support to help navigate the transition to independent living. Lazarus House offers a transitional housing program for individuals and families who have stayed at our shelter and are ready to begin living on their own.\nThe Center for Transitional Living offers dormitory-style bedrooms, including rooms designed for families to stay together. The Center also provides increased support services and a more specialized case management plan to address the unique problems a Guest may have and to help the Guest achieve permanent independence.\n\n\nThere is an interview process to enter the transitional housing program, and Guests are expected to make certain commitments to Lazarus House. The Center may not be right for every Guest. But for those who do stay here, it can open the door to long-term success.\n"
  },
  {
    "addressLine1": "1204 Deer St",
    "city": "Yorkville",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60560",
    "name": "Kendall County PADS",
    "organization": "Kendall County PADS",
    "phone": "(630) 553-5073",
    "website": "http://www.kendallcares.org/",
    "description": "PADS is a place where men, women, and children living in homelessness are provided overnight safe shelter and hot meals. A team of caring volunteers serve our homeless guests each night.  Volunteers will greet each guest, and will register them on their first night and explain how the program operates. Guests may enjoy a hot, home-cooked meal and will have opportunities to visit with the volunteers. Social workers on site will provide information guests about local social services.\n\nShelter services are available each night from 7:00 p.m. to 7:00 a.m. Seven churches in Kendall County will serve as shelter sites, one for each night of the week.\n\nWho can use PADS?Men, women, and children who need temporary overnight shelter and food may use Kendall County PADS. Children under the age of 18 must come with a parent or legal guardian (documentation of guardianship is required).\nThe Kendall County PADS program does not allow guests to use the alcohol or drugs at the shelter sites. There is no restriction as to where the homeless person recently has been staying prior to coming to PADS . The program has a limit of 20 guests.\n"
  },
  {
    "addressLine1": "101 S. Adams St.",
    "city": "Avon",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61415",
    "name": "Angel Services Homeless Outreach Care",
    "organization": "Angel Services Homeless Outreach Care",
    "phone": "8153242422",
    "website": "https://www.facebook.com/WhiteWoodsHomelessHelp/",
    "description": ""
  },
  {
    "addressLine1": "435 E. Third Street",
    "city": "Galesburg",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61402",
    "name": "Galesburg Rescue Mission and Women's Shelter Home",
    "organization": "Galesburg Rescue Mission and Women's Shelter Home",
    "phone": "(309) 343-4151",
    "website": "http://www.galesburgrescuemission.org/",
    "description": "Emergency Shelter for Men and Women.\n\nServices Provided For The Community\n    Providing shelter, food and clothing all free of charge, to needy men, women and their children.\n    Food Boxes, furniture distribution and clothing giveaways with a Clothing Day Service usually on the first and third Wednesdays at 1:30 pm.\n    Counseling for individuals and families.\n    Discipleship support groups for those with addictive behaviors.\n    Programs for civic and church groups.\n    Free noon meal (except Sunday)\n\nWE ARE A COMMUNITY SOCIAL SERVICE AGENCY offering hope for the homeless, hungry, poor, needy, addicted, mentally challenged, victims of domestic violence, ex-prisoners, lonely and lost. We do not discriminate on the basis of age, sex, handicap, race, color, religion, nationality or ethnic origin."
  },
  {
    "addressLine1": "1306 Maple Ave # T",
    "city": "Macomb",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61455",
    "name": "Samaritan Well",
    "organization": "Samaritan Well",
    "phone": "(309) 837-3357",
    "website": "https://www.samaritanwellinc.org/",
    "description": ""
  },
  {
    "addressLine1": "303 East Oakland Avenue",
    "city": "Bloomington",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61701",
    "name": "Home Sweet Home Mission - Billy Shelper Center HSHM Main Campus",
    "organization": "Home Sweet Home Mission - Billy Shelper Center HSHM Main Campus",
    "phone": "(309) 828-7356",
    "website": "https://hshministries.org/",
    "description": "We are open 24 hours per day, seven days per week.\n\nWe serve men, women and children under 18 accompanied with a parent. Overnight services, food, clothing and case management. Worship services, classes and other activities are available. Contact us or visit our website for complete details.\n\nServices:\nShelter\nMeals\nCounseling\nVocational/Educational classes\nCase management\n\nWe feed whoever needs a nice hot meal, whoever needs a hug, pray for whoever needs prayer , provide safe shelter for whoever needs to rest, and we offer a way out."
  },
  {
    "addressLine1": "611 W. Washington",
    "city": "Bloomington",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61701",
    "name": "Safe Harbor Homeless Services",
    "organization": "Safe Harbor Homeless Services",
    "phone": "(309) 829-9476",
    "website": "http://www.sabloomington.org/bloomington/Safe_Harbor",
    "description": "Safe Harbor works with clients to identify barriers and move to self-sufficiency. We provide a safe and warm place to sleep, laundry facilities, breakfast and dinner and shower services.\n\nCase management and referral helps clients achieve housing security. Safe harbor also assists in clothing and personal products provision.\n\nHours:  5:00 PM to 8:00 AM daily."
  },
  {
    "addressLine1": "208 N. Oak Street",
    "city": "Bloomington",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "00000",
    "name": "Salvation Army Safe Harbor Shelter",
    "organization": "Salvation Army Safe Harbor Shelter",
    "phone": "(309) 829-7399",
    "website": "http://www.sabloomington.org/bloomington/Safe_Harbor",
    "description": "Hours: Residential: Everyday, 5:00 pm - 8:00 am.\nNon residential: Everyday, 8:00 am - 4:00 pm.\n\nShelter for single men and/or women.\n\nDay services and meals provided.\n\nIn order for the Safe Harbor staff to assist clients in need of services, it is expected that all individuals receiving Safe Harbor services will work, to the best of their abilities, to better their situation and seek more permanent housing as quickly as possible.  In working with case managers, residents address the root cause of their homelessness and work toward overcoming the underlying barrier.\nExamples of services offered are: assistance in obtaining Bloomington Township General Assistance, Supplemental Security Income, veteran's benefits, providing or referring clients to programs which provide training for job counseling, life skills, parent training, budget counseling, AA/NA meetings, housing assistance, spiritual guidance, drug / alcohol treatment and mental health referrals.\nLength of Stay\nThe length of stay for an individual will be 8 weeks beginning on the day one arrives.  The 8 week time frame continues even if the resident is not here.  This policy is in place so that we may continue to work with a resident to overcome homelessness.  If one is not here, we cannot help.  It is encouraged that residents stay as long as possible to develop the tools necessary to sustain independence.  Staying beyond 8 weeks may be approved through a case manager.  If an extension is not approved, you will not be eligible to return for a period of 3 months.  Exceptions are made on a case by case basis, if an individual is requesting to return.\n\nBasic program requirements for all individuals who stay at Safe Harbor include: saving 75% of any income received or earned and applying for 10 jobs per week if one is not working or underemployed.\n\n\nSafe Harbor works with clients to identify barriers and move toward self sufficiency. Safe Harbor provides a safe warm environment to sleep, storage of some personal belongings, breakfast and dinner (some people have meals that are not residents), shower and laundry facilities and case management services, including access and referral to local resources. Safe Harbor also provides clients with clothes and personal hygiene products when available.\n\nSafe Harbor residents choose between three programs that accommodate their personal situation. Factors in program selection include: employment, decision to use case management and income. Length of client stay is determined by their program selection, as well as participation in case management services and compliance with Safe Harbor policies."
  },
  {
    "addressLine1": "300 Reagan Drive",
    "city": "Eureka",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61530",
    "name": "Heart House",
    "organization": "Heart House",
    "phone": "(309) 467-6103",
    "website": "https://heartlineandhearthouseorg/",
    "description": "Heart House is a faith based not for profit homeless shelter for women and children(boys up to 14).\n\nHeart House is a six room shelter for woman and her children who need to flee a domestic abuse or homelessness crisis situation.\n\nIt is our goal to assists our guests in gathering skills necessary to live healthy, independent, and productive lives. Together, guests and the case manager set attainable goals while continually accessing the need for support services and agency benefits such as food stamps, Medicaid, WIC, and housing.  "
  },
  {
    "addressLine1": "PO Box 911",
    "city": "Cairo",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62914",
    "name": "Cairo Women's Shelter",
    "organization": "Cairo Women's Shelter",
    "phone": "(618) 734-4357",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "820 Anderson Street",
    "city": "Sikeston",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63801",
    "name": "DAEOC Homeless Services",
    "organization": "DAEOC Homeless Services",
    "phone": "(573) 471-6014",
    "website": "https://www.daeoc.com/",
    "description": "Non profit organization that operates an emergency homeless shelter. Call for more information.Open 24 hours.\n"
  },
  {
    "addressLine1": "12610 S. Honore St. #1",
    "city": "Calumet Park",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60827",
    "name": "Kingdom Residential Housing",
    "organization": "Kingdom Residential Housing",
    "phone": "(708) 314-9899",
    "website": "mailto:kingdomresidentialhousing@gmail.com",
    "description": ""
  },
  {
    "addressLine1": "12242 S Parnell Ave, Chicago, IL 60628",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60628",
    "name": "Zacchaeus House",
    "organization": "Zacchaeus House",
    "phone": "(773) 568-7822",
    "website": "https://bci.archchicago.org/resources/zacchaeus-house",
    "description": ""
  },
  {
    "addressLine1": "1330 E. Ash St.",
    "city": "Canton",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61520",
    "name": "Fulton-Mason Crisis Service",
    "organization": "Fulton-Mason Crisis Service",
    "phone": "(309) 647-7487",
    "website": "https://www.facebook.com/Fulton-Mason-Crisis-Service-1386659381566608/",
    "description": "Provides off-site emergency shelter, counseling, and support services to domestic violence victims. 24 hour hotlines: (309) 647-8311 or (309) 543-6706."
  },
  {
    "addressLine1": "235 Derby Street",
    "city": "Pekin",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61554",
    "name": "Salvation Army Rust Transitional Center",
    "organization": "Salvation Army Rust Transitional Center",
    "phone": "(309) 478-7878",
    "website": "http://www.salvationarmypekin.org/",
    "description": "This is a transitional living facility run by the Salvation Army. Provides for single men, single women, families. Provides shelter for about 30 individuals a night.\n\nMeal and Case management are also provided. Call for more information on intake.\n\n\nThe Salvation Army's work in Pekin includes the Harold J. Rust Transitional Center, a shelter for families, single men, and women working towards independence. Each night we provide shelter to an average of 30 individuals.\nThis facility allows us to provide much needed shelter, meals and case management services designed to help the adult identify and work on the underlying causes of their homelessness."
  },
  {
    "addressLine1": "701 S. Marion",
    "city": "Carbondale",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62901",
    "name": "Good Samaritan House of Carbondale",
    "organization": "Good Samaritan House of Carbondale",
    "phone": "(618) 457-5794",
    "website": "http://www.goodsamcarbondale.org/",
    "description": "Emergency Assistance\nThe Emergency Assistance program helps area residents pay their rent or utility bills in order to prevent them from becoming homeless. This is a one-time assistance. The recipient must demonstrate the ability to maintain a normal payment schedule in the future.\n\nEmergency ShelterVolunteer Opportunities in the Emergency Shelter include answering phones 9-5, transporting and assisting clients, and minor maintenance and repairs. The shelter is in operation 24/7, at 701 S Marion. The Emergency Shelter has the capacity to house 30 persons.\n\n\nFood PantryVolunteers at the Food Pantry stock shelves and fill orders from 9:00 am to 1:00 pm, Monday and 9:00 am - 11:00 am Friday, at the University Baptist Church, 700 S Oakland. The Food Pantry provides canned goods and perishables to people in need. Area churches and civic organizations provide food and augment federal commodities. We also need volunteers for pick ups.\n\nSoup KitchenOpportunities in the Soup Kitchen include picking up food and helping to prepare and serve it. Meals are served at 8:00, 11:30 and 5:30, at 701 S Marion. Our Soup Kitchen provides nutritionally balanced meals served three times a day, every day of the year, to residents of the emergency shelter. We also welcome people from the community who are hungry.\n\nTransitional House\nSome individuals staying in the Emergency Shelter are not prepared to live independently without additional basic life skills training. The Transitional House helps these people by providing support services for up to 24 months to prepare them for a smooth transition into the community. The Transitional House has the capacity to house 12 persons."
  },
  {
    "addressLine1": "103 E Calvert",
    "city": "Marion",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62959",
    "name": "Marion Ministerial Alliance",
    "organization": "Marion Ministerial Alliance",
    "phone": "(618) 993-8419",
    "website": "https://www.facebook.com/MarionMinisterialAlliance/",
    "description": "Utility Assistance, Rent Assistance, Temporary Shelter, Hygiene Kits, Etc.\nAssistance Office\nOpen Monday Friday\n9:00 am 1:00 pm\n\nDo you need a meal?\nSoup Kitchen\nOpen Monday-Friday\n11:30 am 12:30 pm\n\nDo you need groceries?\nProject Manna Food Pantry\nOpen Tuesday Only\n8:30 am 11:30 am"
  },
  {
    "addressLine1": "70 East Washington",
    "city": "Champaign",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61820",
    "name": "C-U at Home",
    "organization": "C-U at Home",
    "phone": "(217) 819-4569",
    "website": "https://www.cuathome.us/",
    "description": ""
  },
  {
    "addressLine1": "504 E. Church Street",
    "city": "Champaign",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "00000",
    "name": "Austin's Place - Winter Emergency Shelter for Women",
    "organization": "Austin's Place - Winter Emergency Shelter for Women",
    "phone": "(217) 819-4569",
    "website": "http://shelter-austinsplace.weebly.com/",
    "description": "Location: First United Methodist Church (FUMC)\n\nAustin's Place is the only emergency shelter for single women in Champaign County. Austins Place operates solely on volunteer effort - from volunteers who stay overnight, transport guests, do laundry, make phone calls, advertise, collect donations, etc. Dedicated service meets significant needs and provides valuable support to all the guests that come through our doors. We are thankful for all the faithful volunteers who so generously give their time, energy, prayers, and financial support! Austin's Place happens because of our volunteers!"
  },
  {
    "addressLine1": "see list below",
    "city": "Champaign",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61820",
    "name": "Champaign IL Centralized Intake",
    "organization": "Champaign IL Centralized Intake",
    "phone": "(217) 819-4117",
    "website": "",
    "description": "Centralized Intake for Homeless (CIH) Walk-In Assessments\n\nIf you are experiencing homelessness and live in Champaign County, CIH may be able to connect you to a homeless assistance program that can help.\n\nYou are strongly encouraged to bring:\n\n    Verification of your homeless situation (for example, a letter from someone like a case manager or friend stating where you are currently sleeping; it must include the date and their contact information)\n    Photo ID\n    Social Security card(s)\n    Birth certificate of minor child(ren)\n    Disability verification (if applicable)\n\nWhen a homeless assistance program has a vacancy and you are the next eligible household based on the prioritization established by the Continuum of Service Providers to the Homeless, you will be referred to the homeless assistance program. Each homeless assistance program has individual and specific eligibility requirements.\n\nCURRENT WALK-IN HOURS AND LOCATIONS\n\nThe Phoenix Drop-in Center\n70 E. Washington Street, Champaign\nTuesdays 124pm\n\nIllinois workNet Center\n1307 N. Mattis Avenue, Champaign\nThursdays 9am12pm\n\nSalt & Light\n1819 S. Philo Road, Urbana\nMondays 58pm\n\nCommunity Service Center of Northern Champaign County\n520 E. Wabash Ave., Ste. 1, Rantoul\nEvery 4th Wednesday 13pm\n"
  },
  {
    "addressLine1": "2212 N. Market St",
    "city": "Champaign",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61822",
    "name": "Salvation Army Stepping Stone Program and Daytime Warming Center",
    "organization": "Salvation Army Stepping Stone Program and Daytime Warming Center",
    "phone": "(217) 373-7832",
    "website": "https://www.facebook.com/CUSalvationarmy",
    "description": "The Stepping Stone Program will house men, women and families who present as homeless and who commit to working the program. Capacity is limited, so agencies must contact the Program Manager before referring. The Salvation Army Red Shield Center on Market Street also serves as a daytime warming center Monday through Friday from 9:00 a.m. to 4:00 p.m."
  },
  {
    "addressLine1": "834 N. Bowman Ave.",
    "city": "Danville ",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61832",
    "name": "Danville Rescue Mission",
    "organization": "Danville Rescue Mission",
    "phone": "(217) 446-7223",
    "website": "https://danvillemission.com/",
    "description": "Our basic services are: shelter for homeless men. Two meals a day to the public, and New Life Discipleship program which is a Bible based rehab program.\n\nShelter Check-in: 4pm.\nMeals are served daily at 12:30 and 5:30 pm to the outside public. Sundays and Holidays one meal is served at 4 pm to the public. Regular meals served to transients and program men.\n\n\nMen's emergency shelter. New Life Discipleship Program: Bible Based Recovery Program Coming soon Dayspring Women and Children shelter: emergency\n"
  },
  {
    "addressLine1": "11005 S 76th Ave",
    "city": "Worth",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60482",
    "name": "BEDS Plus, Worth IL - Daytime Support Center",
    "organization": "BEDS Plus, Worth IL - Daytime Support Center",
    "phone": "(708) 354-0858",
    "website": "https://beds-plus.org/",
    "description": "Hours: Monday through Friday - 8 am to 4 pm\n\nLocated at:\nSt. Mark Evangelical Lutheran Church\nHeaney Hall\n\nLunch served daily 121 pm Case managers available to assist with: basic needs; access to medical and behavioral health care; housing services; employment assistance; and, specialized assistance for Veterans and families.\n\nShelter hours: 7 pm - 7 am daily (October thru May 15)\n\n\nEmergency Overnight Shelters - See our shelter locations on our website or call. We have 2 of these shelters.\n\nBEDS Plus provides emergency overnight shelter from October into May seven nights a week on a rotating basis among 16-18 shelter sites located in churches across Southwest Suburban Cook County. BEDS also provides a limited shelter program and dinner program in the summer.\n\nSchedules and locations of winter and summer emergency overnight shelter and summer dinner program are subject to change.\n\nA shelter night begins with a warm dinner. Each guest is provided with a sleeping area, mattress, and clean linen. All overnight guests can request clothing, including winter gear, and toiletries. A volunteer site leader and BEDS case manager act as resources for clients each night until 11:00 pm and remain on-call throughout the evening. Guests are provided breakfast in the morning and are given a sack lunch. At least one shelter per week has shower facilities. Showers also are available daily at the Day Centers and through YMCA shower passes. Clients are provided with bus passes or other transportation when needed.\n\n\nBEDS Plus enters into an annual agreement with each shelter site. We provide management oversight, liability insurance, volunteer recruitment, on-site case management, client registration, and data entry into the Homeless Management Information System (HMIS), as well as all necessary supplies. To ensure effective management, our staff regularly meets with volunteer site leaders and communicates with faith community leaders.\n"
  },
  {
    "addressLine1": "6602 W 111th St",
    "city": "Worth",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60477",
    "name": "Crisis Center for South Suburbia",
    "organization": "Crisis Center for South Suburbia",
    "phone": "(708) 429-7255",
    "website": "https://www.crisisctr.org/",
    "description": "To contact the Crisis Center 24 Hour Hotline dial 708-429-SAFE (7233).\nThe Crisis Center for South Suburbia Residential Shelter program offers a safe haven for individuals or families fleeing a domestic violence situation.  Our bright, updated, accessible residential facility accommodates up to 35 adults and children that can be housed for up to 60 days.  Our hope is that individuals can use the services offered to ensure safety, gain confidence, become empowered and obtain support while transitioning into the next stage of their lives.\nWhat to Expect at the Residential Shelter\n\n- No fees: The Residential Shelter program is free.\n\n- Safe, private location: The Residential Shelter program makes everyones safety their first priority. Everyone associated with the shelter is asked to sign an agreement to keep the location confidential.\n\n\n- Communal living setting: Residents share the kitchen, common living areas, bathrooms and bedrooms.\n\n- Childrens safety:  As advocates, we understand that children are also impacted by domestic violence. Advocates will be able to work with both parents and children offering support, information and parenting resources.\n\n- Domestic Violence education:  Through the Residential program, many services are offered including: counseling, case management, personalized safety plans and numerous educational groups.\n\n- Self-provided childcare:  Children are under their parents watch and care at all times. Childcare may be provided during groups and other activities.\n\n\n- Confidentiality: All client information is private and will not be shared with other agencies unless written permission is given. Residents are also asked to honor the privacy of other program participants by not discussing their names or situations with anyone else.\n\n- Food, clothing, and toiletries: Provided to all residents at no cost.\n\n- Laundry facilities: The Residential Shelter program has laundry facilities and will provide clients with linens (sheets, towels and blankets).\n\n"
  },
  {
    "addressLine1": "660 N. 5th Ave.",
    "city": "Kankakee",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60901",
    "name": "Gift Of God Street Church Homeless Shelter - Soup Kitchen",
    "organization": "Gift Of God Street Church Homeless Shelter - Soup Kitchen",
    "phone": "(815) 507-6603",
    "website": "https://www.giftofgod.us/",
    "description": ""
  },
  {
    "addressLine1": "2822 West Jackson Blvd.",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60612",
    "name": "Deborah's Place",
    "organization": "Deborah's Place",
    "phone": "(773) 722-5080",
    "website": "https://www.deborahsplace.org/",
    "description": ""
  },
  {
    "addressLine1": "1023 W Irving Park Rd",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60613",
    "name": "Broadway Youth Center",
    "organization": "Broadway Youth Center",
    "phone": "(773) 388-1600",
    "website": "https://howardbrown.org/",
    "description": "Free services for homeless and LGBTQ youth age 12-24.\n\n\n\nHours of Operation:\nDrop-In Programming\nMonday, Tuesday, Thursday, Friday 9:00 am - 5:00 pm\n\n\nA safe and affirming space for youth to receive hot meals, showers, laundry, clothing, and get sleep and participate in youth development workshops.\n\nYouth Case Management\nMonday, Tuesday, Thursday, Friday 9:00am -7:00pm\n\n\nHelp with public benefits, transportation, Governement ID, housing\n\nMedical and Testing, Youth Walk-in Clinic\nMonday, Tuesday, Thursday, Friday 12:00 pm - 7:00 pm\n\n\nHIV/STI/Pregnancy testing and treatment as well as same-day access to birth control, HIV prevention medication, hormones, and primary care.\n\n\n\nTherapy:\nMonday, Thursday, Friday\n11:00 AM -2PM for walk-in ; 3:00 PM 6:00 PM appointment only\nSame-day access to individual or group therapy\n\nGED/Vocation:\nMonday, Tuesday, Thursday, Friday\n11:00 AM 3:00PM and 5:00PM 7:00PM appointment only\nFree GED tutoring/testing, college applications, financial aid and employment support\n\nEvening Programming\nFridays 5:00PM 7:00PM: F@B, a sexuality discussion group for all youth that focuses on education, fun, and ending stigma.\nThursdays 5:00PM 7:00PM: TYRA: safe space for Trans and Gender Non-Conforming youth to connect and share skills.\n\n\n\nTuesdays 5:00PM- 7:00PM: WOOSAAHH (working on our spirits against anger hate and hostility): A program that engages the artistic self-expression and healing to transform harmful behavior.\nMondays 5:00PM 7:00PM: In.Power*, an empowering support group for survivors of violence to build community and discover healing resources.\n\nTransit:\nCTA-36 Broadway bus, CTA-80 Irving Park bus, CTA-151 Sheridan bus, Sheridan Red Line"
  },
  {
    "addressLine1": "3456 W. Franklin Boulevard",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60624",
    "name": "The Boulevard",
    "organization": "The Boulevard",
    "phone": "(773) 533-6013",
    "website": "http://www.blvd.org/",
    "description": "The Boulevard helps ill and injured homeless adults restore their lives.\n\nThe Boulevard provides medical respite care for homeless men and women in medical recovery. This 64-bed center on Chicago's West Side, offers interim housing and support to ill and injured homeless adults who would otherwise lack a stable and safe place to heal. As the only agency of its kind in Illinois, Interfaith House fills a critical gap in services for homeless individuals who have been discharged from area hospitals and emergency shelters and who require housing and support. The Boulevard also provides comprehensive psychological and social support services that are critical to helping homeless individuals return to health and to break the debilitating cycle of homelessness.\n\nEligibility\nUnattached men and women who are homeless and being discharged from the hospital needing a short term placement (four to six weeks) in order to complete their recovery from a physical illness or injury. Interfaith House is not appropriate for patients requiring long term nursing home care.\n\nPatients who can physically care for themselves (e.g. dress, bathe, self-ambulate, attend personal hygiene and take medication as prescribed), who no longer require bedside nursing care, can come to the dining room for meals, make their bed, and keep their living space neat. Interfaith House provides support to residents to complete their healing but it is not a medical treatment facility.\n\n\nPatients who are mentally stable. Interfaith House is not a psychiatric treatment facility.\n\nPatients who understand their care plan and can carry out the measures necessary to implement them with the help of Interfaith House staff, including compliance with medications and returning to their physicians for follow-up care.\n\nPatients who are able to live in a communal environment, share a bedroom with four or five roommates, share meals in a common dining room with 64 residents, participate in educational sessions and group meetings (including AA and NA if appropriate) and follow Interfaith House conditions of residency.\n\nPatients who will not use drugs or alcohol during their stay at Interfaith House."
  },
  {
    "addressLine1": "1458 S Canal St",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60605",
    "name": "Pacific Garden Mission - Shelter",
    "organization": "Pacific Garden Mission - Shelter",
    "phone": "(312) 492-9410",
    "website": "http://www.pgm.org/",
    "description": "Emergency Shelter. We serve the poor and homeless with the compassion of Christ. We minister to all within our limits with the transforming message of the Gospel.\n\nFor Homeless Men:\nThe Chicago men's homeless shelter division of Pacific Garden Mission is a constant haven for homeless men with nowhere else to turn.\nUpon arrival, each man is interviewed by a counselor to determine his individual need. At the conclusion of the interview, he is provided with information regarding meals, overnight accommodations, and the possibility of obtaining clothing and medical assistance. He is then provided a shower, clean sleepwear, and a comfortable bunk in which to sleep.\n\n\nFor Homeless Women\nEach lady is interviewed by a counselor to determine his individual need. At the conclusion of the interview, she is provided with information regarding meals, overnight accommodations, and the possibility of obtaining clothing and medical assistance. She is then provided a shower, clean sleepwear, and a comfortable bunk in which to sleep.\n\n\n\n\n"
  },
  {
    "addressLine1": "6423 South Woodlawn Avenue",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60644",
    "name": "St. Martin de Porres House of Hope - For Women",
    "organization": "St. Martin de Porres House of Hope - For Women",
    "phone": "(773) 643-5843",
    "website": "http://www.smdp-hoh.org/",
    "description": "St Martin de Porres House of Hope is a private, non profit, faith based recovery home for homeless women who are affected by substance abuse. \n\nIntake is conducted as follows:Monday 9 a.m. to 5 p.m.Tuesday 9 a.m. to 5 p.m.Wednesday 9 a.m. to 5 p.m.Thursday 1 p.m. to 6 p.m.Friday 11 a.m. to 5 p.m.\n\n\nSt. Martin de Porres House of Hope creates a safe, healing community where women and their children recover from substance abuse, trauma and mental illness. We serve homeless women and their children or grandchildren from inner city neighborhoods in Chicago and surrounding communities. All adult residents have an addiction to drugs and/or alcohol.\n\nThere are a number of programs tailored individually to each woman which enable her to achieve success.  Programs include:  individual, group and family counseling, health care, educational and life skills training for adults and pre-school children, personal development, music and spiritual direction.  Residents participate in AA / NA  meetings held within the St Martin de Porres HOH facility as well as AA / NA meetings held nearby."
  },
  {
    "addressLine1": "6450 N Califormia Avenue",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60645",
    "name": "The Ark",
    "organization": "The Ark",
    "phone": "(773) 973-1000",
    "website": "http://www.arkchicago.org/",
    "description": "The Sarnoff Levin Residence provides up to 120 days of housing for the Jewish community, Kosher food and a complete array of supportive services for homeless families and individuals.\n\nThe primary goals of the program are to stabilize clients situations, minimize the trauma of homelessness, and ease the transition into stable or second-stage housing as efficiently and effectively as possible, drawing upon The ARK's wide array of services.\n\n\nWith bright, clean rooms, nutritious meals and holiday celebrations, the Residence serves as a home away from home a source of shelter, support and the warmth of a caring Jewish community for 70 or more people each year. "
  },
  {
    "addressLine1": "2750 West Roosevelt Road",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60608",
    "name": "A Safe Haven Foundation",
    "organization": "A Safe Haven Foundation",
    "phone": "(773) 435-8300",
    "website": "http://www.asafehaven.org/a-safe-haven-outreach/",
    "description": ""
  },
  {
    "addressLine1": "1343 N California Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60651",
    "name": "La Posada Family Shelter - Casa Central",
    "organization": "La Posada Family Shelter - Casa Central",
    "phone": "(773) 782-8820",
    "website": "https://www.casacentral.org/",
    "description": "We provide interim housing for families experiencing homelessness.\n70 homeless families receive housing and support services at La Posada each year, on their way to permanent housing.\n\n\nLa Posada seeks to place families who are experiencing homelessness on to independent and permanent housing within 120 days. The program strives to assist families in becoming self-sufficient so that they can obtain and maintain permanent housing.\n\nLa Posada is made unique by the comprehensive network of supportive services it offers, a factor which ensures maximum participation and a high success rate. The program provides program- related childcare, transportation vouchers, food. Supportive services include life skills education, counseling, nutrition education, and financial management to help families regain and sustain self-sufficiency.\n\nParticipants at La Posada also have access to the following services: counseling, nutrition education, domestic violence intervention, financial management, food, clothing, transportation, relocation assistance, and public assistance advocacy. Community partnerships for referrals to alcohol/drug treatment and medical services are coordinated through nearby community health centers and hospitals. In addition, monthly workshops help families deal with a variety of other concerns ranging from financial planning and legal related issues.\nEligibility\nUpon initial contact, families referred to La Posada must meet certain eligibility criteria prior to entrance into the program:\n\nMust provide verification of homelessness\nMust meet Income Poverty Guidelines\nApplicant must be an adult over the age of 18 with minor children\n\nAt La Posada, once a family is determined to be eligible and has entered the program, they work with a Family Support Case Manager. As a family-centred program, La Posada provides services that are designed to identify the unique needs of each individual family through a service plan. Case managers advocate on behalf of the participants as needs are identified in order to help them become self-sufficient and assist families as they apply for benefits acquisition and other necessary services. During their temporary stay at La Posada, each participant has access to on-site supportive services that include food, clothing from donations, transportation vouchers, babysitting, pre-vocational training/job readiness, ESL, and financial literacy.\n"
  },
  {
    "addressLine1": "4628 N Clifton Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60640",
    "name": "Cornerstone Community Outreach",
    "organization": "Cornerstone Community Outreach",
    "phone": "(773) 271-8163",
    "website": "http://www.ccolife.org/",
    "description": "Primary Woman and Family Shelter. Single men, and women have programs with us but on a very limited basis. We provide job training, skills assessment, case workers, and hope to change. We also have several shelters in our organization.We accept large groups to volunteer.\n\nCornerstone Community Outreach offers shelter and services to homeless and low-income families and individuals through a variety of programs:\n\nCCO Shelter Programs for Homeless Families\n\nCCO Shelter Programs for Homeless Individuals\n\nCCO Senior Services\n\nCCO Services for Our Residents\n\nCCO Services for Our Neighbors\nShelter Programs for Families (300 parents and children daily)\n-Hannah House: Single mothers with children\n-Sylvia Center: Intact family units with 2 parents, teenage children, or single fathers with kids\n-Leland House: permanent supportive housing for homeless families\n\n\nShelter Programs for Individuals (200 single men and women daily)\n-Naomi: Single Women. 24 hour shelter\n\n-Epworth: Single Men: Epworth Shelter is located a mile north of our CCO buildings and provides shelter for 65 single men each night. Men sheltered at Epworth receive wrap-around services which include, personalized case management, referrals, and advocacy from CCO staff and partner agencies.\n\nServices for all our Residents\n-Case-management assistance, on-site mental\nhealth counseling and medical examinations,\non-site classes, Stepping Stones Daycare\nCenter, after-school program, and a free\nclothing store\n\nServices for our Neighbors\n-Food Bags provides groceries to 200\nneighborhood households weekly\n-Free Store offers clothing and is open weekly\nto our residents and neighbors\n-Dinner Guests serves a weekly meal for\napproximately 250 of our neighbors\n"
  },
  {
    "addressLine1": "2715 W Harrison",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60612",
    "name": "Franciscan Outreach",
    "organization": "Franciscan Outreach",
    "phone": "(773) 278-6724",
    "website": "https://www.franoutreach.org/",
    "description": "Franciscan Outreach provides a 257 bed shelter with separate men's and women's dorms that has been providing refuge for 30 years. The Shelter is located at 2715 W. Harrison Street on Chicago's West Side, just south of the I-290 expressway.\n\nIn 2012, at the urging of the City of Chicago, Franciscan Outreach assumed management of a 65-bed shelter at 200 S. Sacramento. Now known as Franciscan Annex, this space prevents vulnerable citizens from being turned back on to the streets.\n\n\nAt Franciscan House and Franciscan Annex, we provide all guests with:\na bed that includes sheets, a blanket, and a pillow.\na safe and drug-free environment\nsupper and breakfast\naccess to showers\nvisits by health care personnel\nopportunities to meet with mental health workers\nopportunities to build a better life\n\nVolunteers\n\nWe are assisted by full time volunteers who live in community at the Marquard Center. These volunteers spend an entire year working directly with the men and women we serve, including performing various shelter jobs at Franciscan House.\n\nFranciscan House needs community volunteers each night to greet and serve supper to guests, as well as help with daily shelter logistics. If you are interested in volunteering some of your time at Franciscan House, check the Shelter Volunteer page to learn more.\n\nSupporting the Shelter Facilities\nWe are always in need of soap, deodorant, toothpaste, feminine hygiene products and other personal items. Whether you save them from a hotel stay or you buy them at the local store, these items are always appreciated. Our case managers provide our guests with vouchers to clothing distributors, so we do not usually accept clothing, except on rare occasions (such as winter coats, gloves, scarves, etc.) You can always check our Wish List to see what items are most needed.\n"
  },
  {
    "addressLine1": "600 W Fullerton Pkwy",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60614",
    "name": "Lincoln Park Community Services - Homeless Shelter",
    "organization": "Lincoln Park Community Services - Homeless Shelter",
    "phone": "(773) 549-6111",
    "website": "https://www.lpcschicago.org/",
    "description": "Chicago homeless shelter for men and women.\n\nLPCS Waiting List\nThere is a waiting list for Lincoln Park Community Services. After completing an intake appointment, a person will have their name placed on the waiting list and they will be asked to call each week until there is space available in the program. Once admitted, there is no time limit for length of stay, as long as an individual is making progress toward their goals and following all rules and requirements.\n\nTo join the waiting list for the Interim Housing Community at LPCS individuals must attend our Community Engagement Program (CEP) held on Sunday afternoons. At CEP there are LPCS intake appointments as well as basic services. CEP is held each Sunday at St. Paul's UCC at 645 W. Fullerton beginning at 1:30 pm, except for holidays. Please line up for entry to CEP by the tall black iron gate\n\nThe Lincoln Park Community Shelter (LPCS) is comprehensive social service agency serving adult men and women who are experiencing homelessness. Located in Chicago's Lincoln Park neighborhood, the LPCS has been providing shelter and other basic needs to our homeless neighbors for 25 years. Today, the LPCS provides interim housing, meals, and a targeted array of social services to over 300 people each year.\n\nInterim Housing Community\n\nThe Interim Housing Community serves up to 35 guests each night year-round - 24 men and 11 women. In addition to meals and safe living space, the Interim Housing Community provides storage space, showers, and laundry facilities for guests. The average length of stay is three months, although there is no time limit as long as guests are making progress toward their goals. Last year, the LPCS provided safe, structured interim housing and three nutritious meals per day to over 260 guests.\n\nReferral Information:\n\nThere is a waiting list for this program. After completing an intake appointment, a person's name will be placed on the waiting list and s/he will be asked to call each week until there is space available in the program. Once admitted, there is no time limit to length of stay, as long as a person is making progress toward goals and following all rules and requirements.\n\n\nTo schedule an intake appointment, call (toll-free) 1-877-204-5624 on Monday at 10 am to 12 noon . All of our intakes take place the following Saturday at our Community Engagement Program."
  },
  {
    "addressLine1": "4241 West Washington Boulevard",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60624",
    "name": "Primo Center For Women And Children",
    "organization": "Primo Center For Women And Children",
    "phone": "(773) 722-0544",
    "website": "http://www.primocenter.org/",
    "description": "A 120-day transitional shelter located on the west side of Chicago for women and children."
  },
  {
    "addressLine1": "7320 S. Yale-South Wing of the Building",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60621",
    "name": "Ujima Village Youth/Young Adult Shelter",
    "organization": "Ujima Village Youth/Young Adult Shelter",
    "phone": "(312) 778-5732",
    "website": "https://www.unityparenting.org/",
    "description": "Ujima Village is a low threshold shelter (not a lot of rules that can be barriers to getting basic needs) serving homeless young people of all genders, ages 18-24. No minors or babies permitted in the facility. Intake is from 8pm to 8:30pm and young people can simply come to the door to get a bed. Ujima is only open overnight from 8pm to 8am and offers dinner, breakfast, safe beds, showers, laundry and voluntary social services."
  },
  {
    "addressLine1": "2857 West 63rd St",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60609",
    "name": "You Can Make It - Family Shelter",
    "organization": "You Can Make It - Family Shelter",
    "phone": "(773) 451-0602",
    "website": "https://www.facebook.com/You-Can-Make-It-131763366858868/",
    "description": "We have 2 interim facilities for homeless women and children and 1 shelter for men.\nPrograms and Services:\n\nEmergency Shelter for Families\n\nproviding shelter and support services\n\nOutreach for Families offering services and support for\n\n The addictions\n The alcoholism\n The downtrodden"
  },
  {
    "addressLine1": "11321 South Wentworth Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60628",
    "name": "A Little Bit of Heaven Homeless Mens Overnight Shelter",
    "organization": "A Little Bit of Heaven Homeless Mens Overnight Shelter",
    "phone": "(773) 264-5332",
    "website": "https://www.alboh.org/",
    "description": "Shelter for single males.\n\nA Little Bit of Heaven is a 50 plus bed facility that has been in existence since 2001. Located on Chicago's far south side, A Little Bit of Heaven assist homeless men in the Chicagoland area, surrounding suburbs and from out-of-state. Each participant is given a safe, clean environment, hot nutritional meals, clothing and personal hygiene items as well as 24 hour security.\nAt A Little Bit of Heaven which also provides case management services and referrals for job training/placement, medical/mental health, and substance abuse counseling. Additional services include community outreach and client assistance with vital documents such as birth certificates, state identification and other special needs that are handled on a case-by-case basis."
  },
  {
    "addressLine1": "1110 N. Noble Street",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60622",
    "name": "The Night Ministry - Open Door Shelter",
    "organization": "The Night Ministry - Open Door Shelter",
    "phone": "(773) 784-9000",
    "website": "https://www.thenightministry.org/",
    "description": "The Night Ministry is a Chicago-based organization that works to offer housing, healthcare and human connection to members of the Chicago community struggling with poverty or homelessness. With an open heart and an open mind, we accept people as they are and work to address their immediate needs while affirming their sense of humanity.\n\nOutreach Services: The Night Ministry operates on the ground in Chicago neighborhoods to build relationships and provide immediate, practical resources. Our Health Outreach Bus offers medical exams, treatment and HIV testing, as well as coffee, conversation and a sense of community. The Youth Outreach teams reach out to homeless and LGBT youth in Lakeview to offer non-judgmental support, guidance, food and self-care supplies.\n\n\nShort-Term Housing: Our youth housing programs provide structured, safe and supportive living situations to youth from all backgrounds who face multiple, difficult challenges. The Crib is an overnight youth shelter for people age 18-24 that addresses immediate housing needs. Our 120-Day Interim program offers longer-term, housing and social services for homeless youth.\n\nPregnant and Parenting Program: The Night Ministrys Open Door program is the only shelter in Chicago that will work with pregnant or parenting teens as young as 14. We operate a 120-day interim housing program dedicated to serving pregnant or parenting runaway, throw away, or homeless youth and their children.\n\nTransitional Living Program: STEPS aims to transition teens age 18-20 from homeless to independent living within two years."
  },
  {
    "addressLine1": "33 E. 114th Street",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60628",
    "name": "HRDI Women's Supportive Housing",
    "organization": "HRDI Women's Supportive Housing",
    "phone": "(773) 660-4630",
    "website": "http://www.hrdi.org/",
    "description": "A HUD funded program that provides supportive housing and mental health services to 16 women over the age of 18 who are homeless"
  },
  {
    "addressLine1": "332 S Michigan Ave, Suite 1032",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60604",
    "name": "Darkim Responsible Living for Women Inc Nfp",
    "organization": "Darkim Responsible Living for Women Inc Nfp",
    "phone": "(312) 934-8203",
    "website": "http://darkimincnfp.com/",
    "description": "Hours of Operation\nMon-Fri: 9-5pm\nSaturday/Sunday-not in public operation:\nOur lines are periodically checked during weekends, please leave a voice message 0r a text message.\nIf any calls should need immediate attention, please dial 911 or 311 for further assistance.\n\n\nDarkim is a transitional shelter for women, which aids wrap around services while providing temporary housing for women.\n\nDarkim is operated on the South-side of Chicago. Our mission is to offer outreach programs and temporary housing for women. We provided women with a safe environment featuring all necessities that a home has to offer.  Darkim Responsible Living For Women Inc Nfp is focused on providing high-quality community service and advocacy  satisfaction.  Darkim is determine to change a woman's life, \"One day at a time\".\n\n"
  },
  {
    "addressLine1": "9519 South Commercial Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60617",
    "name": "Believe shelter (Institution for women and kids)",
    "organization": "Believe shelter (Institution for women and kids)",
    "phone": "(773) 374-7705",
    "website": "http://margaretsvillage.org/",
    "description": " 50 bed program expanded IWTs services to include families headed by fathers and intact families due to the emergence of this as a major need since the economic downturn. Each year, Believe serves more than 200 women, children and men."
  },
  {
    "addressLine1": "3533 W. North Avenue",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60647",
    "name": "La Casa Norte - Casa Corazon Emergency Beds Program",
    "organization": "La Casa Norte - Casa Corazon Emergency Beds Program",
    "phone": "773.388.1600",
    "website": "https://www.lacasanorte.org/",
    "description": "Casa Corazon is La Casa Norte's youth engagement program that is comprised of a Drop-in Center and an Emergency Beds Program for youth experiencing homelessness. Casa Corazon is a Non-violent, safe space for clients from all race, religions, backgrounds and sexual orientations.Our Emergency Beds Program serves youth ages 18-24 and is open seven days a week, 365 days a year, with doors opening at 9pm. Our Emergency Beds staff provide dinner and breakfast, as well as access to a variety of resources.Logan Square - Northside location1940 N. California, ChicagoBack of the Yards - Southside location1736 W. 47th Street, ChicagoWe also operate an emergency shelter for pregnant and parenting youth, ages 18-24 years old.Logan Square - Northside location1942 N. California, Chicago"
  },
  {
    "addressLine1": "4410 N. Ravenswood suite 101",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60640",
    "name": "Michael Segoviano Emergency Shelter",
    "organization": "Michael Segoviano Emergency Shelter",
    "phone": "(773) 244-6401",
    "website": "https://www.northsidehousing.org/",
    "description": ""
  },
  {
    "addressLine1": "4838 N Sheridan Rd",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60640",
    "name": "Sarah's Circle",
    "organization": "Sarah's Circle",
    "phone": "(773) 728-1991",
    "website": "https://www.sarahs-circle.org/",
    "description": "Address: Sarah's Circle's Daytime Support Center and offices are located at 4838 N. Sheridan Rd (in the Uptown neighborhood - just north of Lawrence and Sheridan).\n\nProgram Services Phone: 773.728.1991 (Services, volunteer opportunities, in-kind donations)\n\n\nInterim Housing Program: 773.751.7475 (Questions regarding bed availability, etc.)\n\nAdministrative Phone: 773.728.1014 (Donations, all other inquiries)\n\nSarahs Circles primary goal is to end homelessness for unaccompanied adult women in Chicago. We strive for and achieve excellence in each of our programs by utilizing an approach and philosophy guided by best practices and outstanding leadership. To support this, our programs utilize the Housing First model, have no barriers, and use a trauma-informed approach. We also provide case management and supportive services to assist each woman in her journey. Sarahs Circle has three primary programs:\nDaytime Support Center\n\nThe Daytime Support Center is a comprehensive drop-in center available to any woman in need Monday - Friday. Here, we provide a safe space, shelter from extreme weather, services to meet basic needs, educational and general interest programming, as well as case management. Basic need services include two meals a day, computers, phones, showers, laundry, free hygiene products, and lockers. Case managers assist women to address barriers to finding housing, implement strategies to extend their income, and find permanent housing. The Daytime Support Center is much more than a facility and services; its a vibrant community of women who have created lasting friendships and a supportive, healing environment. This community is a critical aspect of our success, as it fosters an increased sense of well-being and, once a woman is housed, helps ensure housing retention.\nInterim Housing\n\nThe Interim Housing Program is a 50-bed shelter, providing a safe space, basic needs, and supportive services for any woman experiencing homelessness. This program has no barriers and accepts any unaccompanied woman. Our Interim Housing Program is open 24 hours a day, 365 days a year. We serve three meals a day in addition to helping women meet all their other basic needs. Each woman works closely with a case manager to identify goals and strive to meet them. Securing permanent housing for each woman is the primary goal. Improving overall well-being and increasing self-sufficiency as quickly as possible are other common goals. Like our other programs, we foster a community of support, as it strengthens a womans likelihood of success.\n\n\nPermanent Supportive Housing\nThe Permanent Supportive Housing Program provides 30 units of affordable housing to women who have been chronically homeless. Residents are identified through Chicagos coordinated entry system, ensuring that the most vulnerable women are given housing first. Notably, some women were homeless for over a decade before finding a home with Sarahs Circle. Each woman works closely with a case manager to identify and develop a plan to meet her individualized needs. This housing model improves outcomes for the most difficult to serve individuals and helps reduce public costs associated with emergency room and shelter use."
  },
  {
    "addressLine1": "10858 S. Michigan Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60628",
    "name": "Roseland Christian Ministries Grow Program",
    "organization": "Roseland Christian Ministries Grow Program",
    "phone": "(773) 264-5665",
    "website": "https://roselandchristianministries.org/",
    "description": ""
  },
  {
    "addressLine1": "915 N. Menard Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60651",
    "name": "Loving Hands of Jesus Shelter",
    "organization": "Loving Hands of Jesus Shelter",
    "phone": "(773) 209-8114",
    "website": "mailto:lovinghandsofjesusshelter@zoho.com",
    "description": ""
  },
  {
    "addressLine1": "825 N Christiana Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60651",
    "name": "The Salvation Army Freedom Center",
    "organization": "The Salvation Army Freedom Center",
    "phone": "(312) 667-2200",
    "website": "https://centralusa.salvationarmy.org/freedom/",
    "description": "Our homelessness prevention programs and shelters provide safe housing, food, spiritual and practical support to individuals and families who have nowhere else to go.  The Salvation Army Freedom Center Campus provides a holistic approach to those who need to change their direction in life, including those suffering from substance abuse, homelessness, and/or unemployment.\n\nHarbor Light\nThe Harbor Light program at The Salvation Army Freedom Center is an intense, inpatient (residential) substance abuse treatment program. The program - one of the most respected in the country - also provides transitional services and employment training to help clients overcome their addiction and successfully transition back into their communities. "
  },
  {
    "addressLine1": "924 N Christiana Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60651",
    "name": "The Salvation Army Shield of Hope Chicago",
    "organization": "The Salvation Army Shield of Hope Chicago",
    "phone": "(773) 725-1100",
    "website": "https://centralusa.salvationarmy.org/metro/shield-of-hope/",
    "description": "Open 24 hours a day.\nThe nation's first emergency homeless assessment and rapid-response center (EHARC) to provide families facing homelessness personalized service and support.\n\nThe Shield of Hope is located across the street from The Salvation Army Freedom Center Campus.\n\nThe Shield of Hope has 75 beds available for vulnerable families on a nightly basis, and can accommodate up to 125 beds in emergency shelter situations.\n\nProvides the following:\n    20 bedrooms with private bathrooms and personal storage; several rooms connect to accommodate larger families and allow them to remain together\n    Laundry Room\n    Cafeteria\n    Counseling, Support Services, and Life Skills Training\n    Assistance Obtaining Permanent Housing\n\n\n Families staying at the Shield of Hope will also have access to an array of services at the Freedom Center.\n    Social Service Programs\n    Job Training\n    Recreational and Educational Programs for the Entire Family\n    Nutritious Meals and Snacks\n    Treatment for Substance Abuse\n\n\n\n\n"
  },
  {
    "addressLine1": "7320 S. Yale Avenue",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60621",
    "name": "Maria Shelter",
    "organization": "Maria Shelter",
    "phone": "(773) 994-5350",
    "website": "https://www.margaretsvillage.org/",
    "description": "Always Open\n\nMaria Shelter is a 50-bed interim shelter in the Englewood community for primarily for homeless women and their children.\n\nEach year, the facility provides food, shelter and programs to promote health and wellness and self-sufficiency for more than 200 women and children."
  },
  {
    "addressLine1": "1125 N. Cleaver St",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60642",
    "name": "Anawin Homeless Shelter For Women",
    "organization": "Anawin Homeless Shelter For Women",
    "phone": "(773) 486-8344",
    "website": "https://trojcowo.com/en/anawim-shelter-for-women/",
    "description": ""
  },
  {
    "addressLine1": "3722 South Indiana Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60653",
    "name": "Matthew House Chicago Shelter",
    "organization": "Matthew House Chicago Shelter",
    "phone": "(773) 536-6628",
    "website": "https://www.mhchicago.org/",
    "description": ""
  },
  {
    "addressLine1": "3745 S Indiana Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60653",
    "name": "Ignite Belfort House",
    "organization": "Ignite Belfort House",
    "phone": "(312) 568-5700",
    "website": "https://www.ignitepromise.org/programs-services",
    "description": ""
  },
  {
    "addressLine1": "5313 S Indiana Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60615",
    "name": "Door of Hope Rescue Mission",
    "organization": "Door of Hope Rescue Mission",
    "phone": "(773) 624-0586",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "645 E 91st Pl",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60619",
    "name": "Chrysalis Center For Homeless",
    "organization": "Chrysalis Center For Homeless",
    "phone": "(773) 723-0769",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "3121 W 71st St",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60629",
    "name": "Southwest Chicago PADS",
    "organization": "Southwest Chicago PADS",
    "phone": "(773) 737-7070",
    "website": "http://www.homelessservices.org/",
    "description": ""
  },
  {
    "addressLine1": "6656 S Talman Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60629",
    "name": "Olive Branch Mission",
    "organization": "Olive Branch Mission",
    "phone": "(773) 476-6200",
    "website": "https://www.obmission.org/",
    "description": ""
  },
  {
    "addressLine1": "8801 S Saginaw Ave",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60617",
    "name": "Casa Esperanza Chicago",
    "organization": "Casa Esperanza Chicago",
    "phone": "(773) 374-9670",
    "website": "https://www.facebook.com/casaesperanzachicago/about/?ref=page_internal",
    "description": ""
  },
  {
    "addressLine1": "2703 West Division Street",
    "city": "Chicago",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60622",
    "name": "El Rescate",
    "organization": "El Rescate",
    "phone": "(312) 927-1658",
    "website": "",
    "description": "Homeless shelter and transitional living center for LGBTQ+ people from 18-24 years only."
  },
  {
    "addressLine1": "1851 S 9th St",
    "city": "Maywood",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60513",
    "name": "Housing Forward",
    "organization": "Housing Forward",
    "phone": "(708) 338-1724",
    "website": "http://www.housingforward.org/",
    "description": "The shelter opens at 7:30 p.m. and closes at 6:45 a.m.\nClients, please do not arrive before 7 p.m., and be prepared to present photo ID.\n\n\nThe PADS Shelter program provides seasonal, mid-September to mid-May, overnight shelter for 40 to 70 persons per night. Dinner, breakfast and sack lunches are available. On site services include Health Clinic, Legal Clinic and nightly Engagement Specialists. Showers are available on select nights. Dedicated family sites are available Sunday, Thursday and Friday.\n\nThe Summer Transitional Shelter is available June through August for up to 15 persons per night. On site services include case management, support group activities and life skills.\n\n\nEligibility\nPhoto ID required. Individuals without an ID may stay one night and must report to the Support Center the following day.\nThe shelter is unable to serve unaccompanied youth (under 18) or registered sex offenders.\n\n"
  },
  {
    "addressLine1": "1458 Chicago Ave.",
    "city": "Evanston",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60201",
    "name": "Connections for the Homeless - Hilda's Place Shelter",
    "organization": "Connections for the Homeless - Hilda's Place Shelter",
    "phone": "(847) 475-7070",
    "website": "http://www.connect2home.org/",
    "description": "The shelter Can serve up to 12 men and 8 women.\nIntakes are by appointment only by calling 847-424-0945 ext. 15.\nClients must arrive by 7 p.m. and depart by 7 a.m.\nLockers are available for people to keep their belongings during the day.\nHomeless women with kids and families should phone 847-424-0945 ext 15.\n\n\nIn addition to housing, theyprovide supportive services that \"meet people where they're at\" and help them move toward self-sufficiency."
  },
  {
    "addressLine1": "1458 Chicago Avenue",
    "city": "Evanston",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60201",
    "name": "Hilda's Place Transitional Shelter",
    "organization": "Hilda's Place Transitional Shelter",
    "phone": "(847) 424-0945",
    "website": "http://www.cfthinc.org/",
    "description": "Hilda's Place Transitional ShelterHilda's Place is our transitional shelter for qualified single men and women for whom permanent housing is not yet available. Hilda's Place has room for 20 participants, who typically remain at Hilda's Place for 3 months before moving into their own housing.\n\nHilda's is not an emergency shelter. If you would like to apply, call our Chicago Ave. office, extension 10, and schedule an intake appointment."
  },
  {
    "addressLine1": "1215 Church St",
    "city": "Evanston",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60201",
    "name": "Mary Lou's Place - Domestic Violence Shelter",
    "organization": "Mary Lou's Place - Domestic Violence Shelter",
    "phone": "(847) 864-8780",
    "website": "https://twitter.com/ywcaevanston",
    "description": ""
  },
  {
    "addressLine1": "not provided.",
    "city": "Evanston",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60201",
    "name": "Family Promise Chicago North Shore",
    "organization": "Family Promise Chicago North Shore",
    "phone": "(847) 475-4500",
    "website": "http://www.fpcnorthshore.org/",
    "description": "Family Promise Chicago North Shore, Inc. (FPCNS) provides services for homeless families in transition. Our main focus is to help families with children in need get back into permanent and sustainable housing and employment. By working at our Day Center and through cooperating congregations we provide:\n\nTemporary housing\nJob placement counseling\nassistance finding permanent housing\nMeals\nAccess to services through our cooperating organizations\n\nAt Family Promise Chicago North Shore, we are dedicated to helping families who are homeless or at risk of becoming homeless get back on their feet and provide a stable lifestyle for their children.\n\n\nOur main focus is to help our guest families get back into permanent and sustainable housing and employment as quickly as possible. When we help parents meet their basic needs and give them the opportunity to create a plan to get back on their feet, they can begin to realize their dreams of providing a better life for their children. This improves the lives of future generations and also changes our community for the better."
  },
  {
    "addressLine1": "1439 Emerald Avenue",
    "city": "Chicago Heights",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60412",
    "name": "Respond Now",
    "organization": "Respond Now",
    "phone": "(708) 755-4357",
    "website": "https://respondnow.org/",
    "description": "We provide immediate, short-term assistance so families can meet their day-to-day needs and focus on looking for more long-term solutions. With the assistance of partners, donors, staff and volunteers we strive to break the cycle of poverty.\n\nWe assist our clients through the following services: food pantry, rent/mortgage assistance, utility assistance, foreclosure prevention, SNAP Outreach, Medicaid Expansion assistance, prescription medication vouchers, temporary lodging, transportation, clothing, Community Garden, books for children, Holiday Giveaway and Back-To-School backpacks and supplies.\n\nHOUSING\n    We strive to keep our families happy and healthy in their local homes through mortgage, rental and utility assistance.\n    Temporary lodging is also available to qualifying families and individuals who may be facing homelessness due to fire, eviction, or other crisis.\n\n    Foreclosure Prevention Specialists advise those families who are having difficulty paying their mortgages.\n    We offer ongoing housing support for the chronically homeless or otherwise in need.\n    We offer monthly pre-purchase counseling and home buying workshops.\n\nADDITIONAL SERVICES\n    Clothing donations for all ages, men and women.\n    Transportation support, including assistance with bus fares.\n    Yearly events, such as our \"Christmas Store\" holiday giveaway.\n    Support with back-to-school materials, such as backpacks.\n\nFOOD ASSISTANCE\n    Our food pantry consists of a client choice menu that includes the basic food groups; fruits, vegetables, proteins, grains, and dairy. Clients typically receive several bags of groceries.\n    We offer our clients an opportunity to apply for food stamps through our SNAP Outreach program.\n\n    Our Community Garden allows our clients to grow their own fruits and vegetables.\n    Through this combination of services we make sure our clients are able to access the food they need."
  },
  {
    "addressLine1": "414 W. Lincoln Highway",
    "city": "Chicago Heights",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60411",
    "name": "South Suburban PADS SOUTH TIER",
    "organization": "South Suburban PADS SOUTH TIER",
    "phone": "(708) 754-4357",
    "website": "http://www.sspads.org/",
    "description": "Hours: Monday thru Thursday 9am to 5pm Friday, 9am until noon.\n\nOur mission is to prevent and end homelessness. Key characteristics of SSPADS' model are interfaith partnerships, hospitality, compassion, service and dignity.\n\n\nEmergency Shelter NetworkThe ESN provides warm, secure overnight lodging, meals and hospitality at 28 local churches, ministries and synagogues throughout the region during the cold weather months. Shelter is provided between 7 p.m. and 7 a.m. from October 1 to April 30. SSPADS has provided emergency overnight shelter in the south and southwest suburbs of Chicago since 1990 that includes socialization and support, a hot dinner, breakfast and sack lunch. Shelters are located within churches and synagogues throughout the south and southwest suburbs of Chicago. The ESN is managed and administered by SSPADS, but is coordinated and operated by a massive base of volunteers who staff the shelter sites during hours of operation. SSPADS contracts with bus services to transport participants every night from its supportive services center to the ESN sites and then return them back to the service center site every morning. Many then go to work, school, participate in case management, search for jobs, and go to medical and other appointments, among other activities."
  },
  {
    "addressLine1": "not provided",
    "city": "Sauk Village",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60411",
    "name": "NorthStar Homes",
    "organization": "NorthStar Homes",
    "phone": "(708) 329-0089",
    "website": "http://www.northstarhomeschi.org/",
    "description": "We are a transitional home located in the south suburbs of chicago. We serve the homeless and mentally ill community. We have a controlled coed affordable home and provides case management needs."
  },
  {
    "addressLine1": "243 W Cerro Gordo St",
    "city": "Decatur",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62522",
    "name": "Oasis Day Center",
    "organization": "Oasis Day Center",
    "phone": "(217) 422-3940",
    "website": "https://www.heritagenet.org/oasis",
    "description": ""
  },
  {
    "addressLine1": "929 North Union Street",
    "city": "Decatur",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62522",
    "name": "God's Shelter of Love",
    "organization": "God's Shelter of Love",
    "phone": "(217) 422-2790",
    "website": "http://www.godsshelteroflove.org/",
    "description": ""
  },
  {
    "addressLine1": "2225 S. Franklin Street",
    "city": "Decatur",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "02521",
    "name": "Virtue House",
    "organization": "Virtue House",
    "phone": "(217) 424-8808",
    "website": "",
    "description": "VIRTUE House wants to provide shelter for women, 18 to 25 years old, who are continuing in their recovery from a life-controlling issue such as drug or alcohol addiction, an abusive relationship, or parole. We have found that many people who recover from these situations often find themselves with no place to go in order to get started on the right track. Unfortunately, many young women return to familiar surroundings and find themselves re-entering the cycle of addiction and abuse, rather than overcoming because they have no skills and no safe place to learn independence. VIRTUE House wants to not only house these women, but also to teach them life skills such as cooking, cleaning, managing their finances, getting out of debt and seeking employment or further education. Our hope is that by the time a young lady has completed her stay at VIRTUE House, she will have learned to care for herself, so that she will not have to return to a life of hopelessness and dependency on others."
  },
  {
    "addressLine1": "229 W. Main Street",
    "city": "Decatur",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62522",
    "name": "Salvation Army Decatur",
    "organization": "Salvation Army Decatur",
    "phone": "(217) 428-4672",
    "website": "https://centralusa.salvationarmy.org/decatur/",
    "description": "The Salvation Army in Decature IL provides an emergency shelter for single men. Contact for full details.\n\nEmergency Shelter, Transitional Housing, Housing Assistance\n"
  },
  {
    "addressLine1": "758 North Water Street",
    "city": "Decatur",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62523",
    "name": "Water Street Mission Ministry",
    "organization": "Water Street Mission Ministry",
    "phone": "217-424-2381",
    "website": "https://www.facebook.com/The-Water-Street-Mission-Resurrected-863600683773276/",
    "description": "We are a men's Homeless shelter. Our goal is to help restore men's lives through the Gospel of Jesus Christ."
  },
  {
    "addressLine1": "1100 East Adams",
    "city": "Springfield",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62703",
    "name": "Contact Ministries Emergency Shelter",
    "organization": "Contact Ministries Emergency Shelter",
    "phone": "(217) 753-3939",
    "website": "https://contactministries.com/",
    "description": "The Homeless Shelter provides immediate relief to women with children. In addition to shelter, we provide lifes basic needs food, clothing, personal care items, laundry facilities, transportation, and telephones to make appointments. Supportive services provided include employment assistance, budgeting, family literacy, parenting classes, tutoring, and case management with a goal of finding and maintaining permanent housing. Referrals are made for daycare, treatment centers, adult education, and other mainstream resources. We also work with District 186 to make sure that school-age children are attending classes."
  },
  {
    "addressLine1": "601 S. W. Adams",
    "city": "Peoria",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61652",
    "name": "Peoria Rescue Mission",
    "organization": "Peoria Rescue Mission",
    "phone": "(309) 676-6416",
    "website": "https://www.peoriarescue.org/",
    "description": "Check In:\nFirst time clients can check in 24/hours a day, 7 days a week.\n \nAfter initial check-in, check in time is between the hours of 2:30-5:30 every day.\n\n\nReaching homeless men with the gospel of Jesus Christ, while providing for their physical needs with food, clothing, and shelter.\n \nServices included:\nWarm beds\nClean clothes\nHot showers\nMeals\nMedical care\nChapel services\nIndividual counseling\nLong-term recovery program also available\n\nMission Facilities Include:\n    82 bed dorm room\n    Shower facilities \n    Kitchen/dining room\n    Clothing room\n    Day room - books, magazines, board games, etc.\n\nOther Assistance Programs/Services\nVictory Acres - A long-term restoration program for men designed to break them from their addictive lifestyles and help them develop the basic life skills needed to rejoin society as responsible men.\nWomen's Pregnancy Center - A pro life ministry providing services to women experiencing unplanned pregnancies or post-abortion trauma.\n\nBarnabas Center - A Biblical counseling center committed to providing assistance to individuals, couples and families who are mentally, emotionally or spiritually discouraged.\nEsther House - A long-term restoration program for women and their children that allows the residents to be freed from their damaging past and to work toward spiritual and emotional wholeness."
  },
  {
    "addressLine1": "714 Hamilton Blvd",
    "city": "Peoria",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61603",
    "name": "Dream Center Peoria",
    "organization": "Dream Center Peoria",
    "phone": "(309) 676-3000",
    "website": "https://www.dreamcenterpeoria.org/",
    "description": "Provides a 24 hour a day, 7 day a week shelter for women, children and families.\nThis is a Faith Based program.\n\nProvided:\nFree showers\nFree meals\n* Assistance Resources\n\nThe Village\n2 year transitional housing resource for women, children and families.\nGuides women to be self sufficient from homelessness.\n\nIntense assistance is also provided during the 2 years."
  },
  {
    "addressLine1": "7 Vieux Carre Dr",
    "city": "East Saint Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62203",
    "name": "Catholic Urban Programs Holy Angels Shelter and Food Pantry",
    "organization": "Catholic Urban Programs Holy Angels Shelter and Food Pantry",
    "phone": "(618) 398-5616",
    "website": "http://www.catholicurbanprograms.org/cup",
    "description": "The purpose of Holy Angels Shelter is to provide shelter, support services, and transitional case management for citizens in the Metro East. The staff strives to identify the needs, as well as the holistic care and concerns of women, men, and children who are caught in the temporary web of poverty and homelessness or are recovering from some catastrophic experience that rendered them without a stable living situation.\n\nServices:\n\nEMERGENCY SHELTER\n18-bed, 24/7 shelter program serving single women, mothers with children, and intact families, meeting basic needs of safety, food, clothing, and shelter, CUPs intensive case management program is centered on personalized housing stability plans.\n\n\nEMERGENCY MOTEL PROGRAM\nEmergency motel nights for people in short-term housing crises, including victims of issues such as domestic violence. The voucher program adds capacity when shelters are full and keeps families together and safe until permanent housing solutions are found.\nFOOD PANTRY HOURS:\nTuesday, Wednesday and Thursday 9:00am to 12:00pm, and, 1:00pm to 3:00pm\n\n\n\n"
  },
  {
    "addressLine1": "510 N. 25th Street",
    "city": "East Saint Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62205",
    "name": "The Family Living Center",
    "organization": "The Family Living Center",
    "phone": "(618) 274-7832",
    "website": "http://www.cdbgops.org/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 3310",
    "city": "East St Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62204",
    "name": "Holy Angels Shelter",
    "organization": "Holy Angels Shelter",
    "phone": "(618) 398-5616",
    "website": "https://catholicurbanprograms.org/",
    "description": ""
  },
  {
    "addressLine1": "800 North Tucker",
    "city": "St. Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63101",
    "name": "St. Patrick Center Shelter For Women",
    "organization": "St. Patrick Center Shelter For Women",
    "phone": "(314) 802-0700",
    "website": "http://www.stpatrickcenter.org/",
    "description": "The Womens Night program is an emergency shelter that provides temporary housing for women who are homeless and have a history of or are experiencing mental illness. The Womens Night program is an Enhanced Shelter Program, which offers services requiring clients participation. Case management services focus on trauma intervention and treatment, in addition to helping women identify permanent housing opportunities, attain financial stability and obtain psychiatric and/or medical services.\nThe Womens Night program seeks to provide shelter and services to up to 15 homeless women each night. Women are admitted to the shelter for a four-month term, which can be extended in certain circumstances. Women residing in the shelter participate in the Shamrock Club Intensive Case Management program and work individually with the shelter manager for ongoing psycho-therapeutic treatment and case management.\n\nIf you or someone you know is interested in this and the many other St. Patrick Center programs, visit our Welcome Center at 800 N. Tucker Blvd. We are open Monday-Friday from 8am-4:30pm."
  },
  {
    "addressLine1": "1315 Howard Street",
    "city": "St. Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63106",
    "name": "Sunshine Mission Emergency Homeless Shelter",
    "organization": "Sunshine Mission Emergency Homeless Shelter",
    "phone": "(314) 231-8209",
    "website": "http://www.sunshineministries.org/",
    "description": "When a homeless man walks through Sunshine Ministries doors, they are not initially seeking a complete life change. They are coming in off the dangerous streets, escaping the summer heat or winter cold seeking two simple things shelter and food.\nSunshine Ministries provides emergency services for men in need of immediate assistance in a caring and accepting environment. Food, shelter and other basic needs are provided for each man. A simple hot meal could be their first step to a new life!\nEach evening our shelter guests are given:\n    A nutritious, hot dinner prepared in a meticulously clean kitchen\n    A chapel service presented by volunteers that shares the Gospel message of Gods love and mercy\n    A comfortable heated and air-conditioned dormitory\n    Clean bathroom facilities and toiletries for a warm shower and shave before bed\n    A warm, comfortable bed with fresh linens\n    A nutritious breakfast and sack lunch for the day\n    Safe storage for their personal possessions overnight\n    Counseling and encouragement from our staff and volunteers\n    Special holiday meals and celebrations\n    And the safety and security that comes from knowing that our staff is on duty all night to protect them.\n\nAddiction Recovery\nFor men who are ready to change their lives, Sunshine Ministries offers a 13-month Resident Program to help them recover from substance abuse and past failures, and equip them for a productive, God-honoring future.\n\nThe men arrive at the mission facility each day to participate in a rigorous program schedule including:\n    A self-paced adult education program that allows the men to improve their reading, writing and math skills or prepare to take the GED test\n    Behavioral, spiritual and personal counseling\n    Life-skills classes that teach basic skills for independent living\n    A Christian 12-Step Addiction Recovery Program\n    Daily work details that train the men to have a good work ethic\n    Computer literacy training\n    Career Employment Services which include testing, classes and personal tutoring that equips students to find and keep a job\n    Spiritual development activities such as Bible studies and church\n    participation\n\n"
  },
  {
    "addressLine1": "1000 N 19th St",
    "city": "Saint Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63016",
    "name": "Gateway 180 Homeless Services - Emergency Shelter",
    "organization": "Gateway 180 Homeless Services - Emergency Shelter",
    "phone": "(314) 231-1515",
    "website": "http://www.gateway180.org/",
    "description": ""
  },
  {
    "addressLine1": "1000 N 19th Street",
    "city": "Saint Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63106",
    "name": "Gateway 180 Homeless Services",
    "organization": "Gateway 180 Homeless Services",
    "phone": "(314) 231-1515",
    "website": "https://gateway180.org/",
    "description": "Gateway180 :: Homelessness Reversed is a valuable resource for women, children and families experiencing the unimaginable burden of homelessness. We provide safe, nurturing emergency shelter and supportive housing services designed to empower adults and families to become independent and permanently housed.\n\nGateway180 :: Homelessness Reversed operates its 171-bed emergency shelter in a 90-year-old building. With the community's continued support, we will improve our building and improve the quality of support and care we provide for women, children, and families experiencing homelessness. Here are some of our most exciting renovations:\n\nInstallation of a new roof and guttering (through a grant from Roofers Local 2 Industry Advancement Fund and Kirberg Company)\nWeatherization, including boiler replacement, new water heater, new air-conditioning/heating unit for cafeteria, new appliances, new fire doors, roof insulation, and infiltration work throughout the building (through Department of Natural Resources and the Urban League of Metro St. Louis)\n\n"
  },
  {
    "addressLine1": "1225 Warren St",
    "city": "Saint Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63106",
    "name": "The Haven of Grace",
    "organization": "The Haven of Grace",
    "phone": "(314) 621-6507",
    "website": "http://havenofgracestl.org/",
    "description": "Shelter and transitional living facilities for homeless young women, ages 18 to 24 who are pregnant.\n\nThe Haven of Grace provides a home for young, homeless pregnant women to redefine their lives. The Haven offers a caring environment for young mothers to heal and bond with their infants while providing programing designed to empower each woman."
  },
  {
    "addressLine1": "1402 Hebert Street",
    "city": "Saint Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63107",
    "name": "Stepping Into The Light Ministry",
    "organization": "Stepping Into The Light Ministry",
    "phone": "(314) 231-5175",
    "website": "https://www.sitlm.org/",
    "description": "Shelter and Rehabilitation.\nThey house and feed homeless/addicted to drugs and/or alcohol.\n90 day program that encourage the men to stay at least one year. They have Bible study daily and plenty of love to go around.\n\n\nNon-profit 501-3c organization. A drug and alcohol treatment center and faith based first and foremost.Stepping Into The Light Ministry is one of the best rehabilitation program for men in Saint Louis, MO for those that are wanting to get closer to God and know what being a man is really about.\n"
  },
  {
    "addressLine1": "2300 Lafayette Ave",
    "city": "Saint Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63104",
    "name": "HomeFirst STL, Inc.",
    "organization": "HomeFirst STL, Inc.",
    "phone": "(314) 669-4980",
    "website": "https://www.missionstl.org/homefirst",
    "description": "Provides supportive transitional housing. Not a shelter.\n\nWe are dedicated to providing supportive housing to help end homelessness. We do not provide temporary shelter, but partner with other organizations in the area providing these services. Potential residents complete an application to become part of the program."
  },
  {
    "addressLine1": "2612 Wyoming St",
    "city": "St. Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63104",
    "name": "Peter & Paul Community Services",
    "organization": "Peter & Paul Community Services",
    "phone": "(314) 588-7111",
    "website": "http://www.ppcsinc.org/",
    "description": "GET HELP\nTo get a bed in the emergency shelter, you need to first go to the Housing Resource Center. The address is 800 N Tucker Blvd, St. Louis. Get there early, 7:30 am if possible, to speak with the staff there.\nCall the Housing Resource Center phone line. The line opens at 8 am, so call as early as possible. The number is 314-802-5444. If you do not get a bed at the emergency shelter on the first day, continue to try every day until a bed opens up.\n\nOnce you have gotten a bed at the emergency shelter through the Housing Resource Center, arrive at the shelter to speak with staff. The shelter is in the basement of the Saints Peter and Paul Church on 1919 S 7th St, St. Louis 63104. The door to the shelter is on the Allen Avenue side of the church.\n\n\nPeter & Paul Community Services offers a year-round emergency shelter for homeless single adult men. The shelter provides beds, food, showers, laundry, lockers, and a safe, caring alternative to living on the street.\n\nProvides 60 beds, all occupied every night\nResidents may stay up to 90 days\nMore than 50% of residents are employed\n30% of residents are mentally ill\n30% of residents have substance abuse problems\n15% of residents are veterans\n\nEmergency Shelter staff members also educate residents on community resources available to them, including:\nHealth and mental health services\nDevelopmental disability services\nVA Services"
  },
  {
    "addressLine1": "1825 Delmar Blvd.",
    "city": "Granite City",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62040",
    "name": "The Good Samaritan House of Granite City",
    "organization": "The Good Samaritan House of Granite City",
    "phone": "(618) 876-0607",
    "website": "mailto:goodsamaritanhouse@gshofgc.org",
    "description": "The Good Samaritan House enriches the lives of homeless women and children by supporting them in a loving Christian environment. While providing safe and temporary housing, basic human needs and supportive services, the Good Samaritan House offers residents opportunities to enhance life skills, increase self-esteem and become self-sufficient.\n\n\nTemporary Shelter\n\nGood Samaritan House provides temporary shelter for up to ten women and their children who are facing homelessness. While in the shelter, residents participate in activities to build their self-sufficiency, self-esteem, and chance of succeeding in life.\n\n\n\nTransitional House\n\nGood Samaritan House's transitional housing program provides longer-term housing in nine single-family dwellings. These units are offered to women who have demonstrated self motivation in the shelter setting, depending on availability."
  },
  {
    "addressLine1": "4302 Farlin Ave",
    "city": "St. Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63115",
    "name": "Genesis Men's Home",
    "organization": "Genesis Men's Home",
    "phone": "(314) 381-0700",
    "website": "http://www.stldreamcenter.org/",
    "description": "Our mission is to provide men the most effective comprehensive faith-based opportunity for life transformation by moving students from a self-centered paradigm to a Christ-centered paradigm. We are committed to helping and equipping men in the discipleship process find freedom from addictive behaviors and assisting them in becoming mentally sound, emotionally balanced, socially adjusted, physically well, and spiritually alive.\n\nThe Genesis Mens Home is a 9 to 12 month residential program that teaches men to rely on the power of Christ to break free from addiction, while also providing comprehensive recovery and rehabilitation assistance.By trusting God's infinite forgiveness, and working to restore a relationship with Him, men will find their way on the path to true recovery, no matter how far addiction has steered them off course.\n\nFor more information, please call.."
  },
  {
    "addressLine1": "2727 North Kingshighway Blvd",
    "city": "Saint Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63113",
    "name": "Covenant House Missouri - Saint Louis",
    "organization": "Covenant House Missouri - Saint Louis",
    "phone": "(314) 533-2241",
    "website": "https://www.covenanthouse.org/homeless-charity/missouri",
    "description": "Covenant House Missouri (CHMO) empowers homeless, runaway and at-risk youth to live independently and become contributing members of the community. With open doors and open hearts, more than 6,400 young people (16 - 21 years of age) in the St. Louis metropolitan area are provided programs and resources every year.As one of the leading St. Louis nonprofits servicing youth, CHMO is dedicated to providing hope, enrichment and a positive direction to all youth in need. This all-encompassing approach is housed within the CHMOs Center for Youth, a welcoming, bright environment with dorm-like floors and classrooms.\n\nIn addition to emergency shelter services, the Center for Youth provides educational resources, job skill development, personal counseling and numerous life skill classes.\n\n\nThere is also an extensive transitional living program where youth can live in the facility for up to two years. Moreover, youth with mental health issues who have left the CHMO program (for up to six months) are personally called by After-care Program staff to ensure stability and if essential needs are being met.Outside of the Center for Youth, CHMO staff bring awareness of youth homelessness and services to schools (safe outreach) and on poverty stricken streets (street outreach). The outreach team continuously educates the public and directly assists youth in crisis with resources and immediate supplies like food and clothing."
  },
  {
    "addressLine1": "6809 West Florissant Ave.",
    "city": "Saint Louis",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63136",
    "name": "Project Downtown Saint Louis",
    "organization": "Project Downtown Saint Louis",
    "phone": "(314) 556-0938",
    "website": "http://www.pdstl.org/",
    "description": "Our mission is to provide essential services for homeless and impoverished segments of the St. Louis community. Furthermore, the organization strives to uphold the principles and spirit of Islam in our endeavors. We believe we can promote a positive image of Islam through such social work and adherence to Islamic ideals."
  },
  {
    "addressLine1": "6816 Washington Ave.",
    "city": "University City",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "63130",
    "name": "Epworth Youth Emergency Services (YES) Shelter",
    "organization": "Epworth Youth Emergency Services (YES) Shelter",
    "phone": "(314) 727-6294",
    "website": "http://epworth.org/",
    "description": "The Youth Emergency Service shelter provides food and housing to youth experiencing homelessness or family crisis. The safe, nurturing environment and therapeutic services help youth and families rebound.\n\n\n\n- accommodates six girls and six boys, ages 11 to 19\n\n\n\n- Typical challenges include family conflict, homelessness, abuse and school issues\n\n\n- The program includes individual, group and family counseling, attendance at community schools or GED programs\n\n\n- A licensed therapist and highly trained youth advisors work with the child and family\n\n\n- Program accepts pregnant females up to 26 weeks pregnant\n\n\n\n\nThe YES Helpline operates 365 days a year/24 hours a day. Call for assistance.\n\n"
  },
  {
    "addressLine1": "P.O. Box 1390",
    "city": "Elgin",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60121",
    "name": "Community Crisis Center Domestic Violence Shelter",
    "organization": "Community Crisis Center Domestic Violence Shelter",
    "phone": "(847) 697-2380",
    "website": "http://www.crisiscenter.org/",
    "description": "Domestic Violence and Homeless ShelterWhether you need safety due to a domestic violence situation or find yourself without housing due to an economic crisis, the Community Crisis Center can help. We provide emergency shelter for women and their children needing a safe place to stay. Our 40-bed shelter provides services to women and their children. In addition, we provide meals, professional case management, counseling and material assistance. Everyone deserves to have a safe place to sleep, eat, and plan. A case manager will work with you while you are here to help resolve your situation. Feel free to phone our 24 hour hotline."
  },
  {
    "addressLine1": "1730 Berkley Street",
    "city": "Elgin",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60123",
    "name": "PADS of Elgin",
    "organization": "PADS of Elgin",
    "phone": "(847) 608-9744",
    "website": "http://padsofelgin.org/",
    "description": "The shelter opens nightly at 7:00 p.m. and closes each morning at 7:00 a.m. Each day PADS of Elgin operates a safe overnight emergency shelter, which provides a filling evening meal, breakfast, laundry/shower facilities as well as connections with support services, including mental health, housing, healthcare, recovery and education.\n\nWinter Shelter Operation Hours\nWhen temperatures outside dip to 15 degrees and below our shelter is open 24 hours a day 7 days a week. We work with Wayside Cross Ministries, a separate organization from PADS of Elgin, that operates a day program (Monday-Saturday) in the same building to ensure guests do not have to be outside in extreme weather conditions. The ability to be open 24/7 is only possible because of generous time and care given by volunteers, board members and staff to ensure coverage at all hours.\n\nServices Provided\nThe shelter is staffed with trained site coordinators, case managers and volunteers. Mental health professionals and volunteer advocates are available to assist guests with basic needs and to connect them with additional services. Case management staff is currently available during business hours, M-F, 9am-4pm and every night of the week from 7 pm-9:30pm. We encourage those needing information on shelter services and requirements to first call the office and ask to speak with a case manager."
  },
  {
    "addressLine1": "453 Fremont St",
    "city": "Elgin",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60120",
    "name": "Wayside Cross Ministries Day Shelter",
    "organization": "Wayside Cross Ministries Day Shelter",
    "phone": "(847) 695-4405",
    "website": "https://www.waysidecross.org/",
    "description": "Day Shelter: Monday to Saturday from 8 a.m. to 2:30 p.m., with some programs running until 4 p.m. free daily lunch, laundry, showers and clothes. There's also Bible study for women and movies twice a week."
  },
  {
    "addressLine1": "514 S. Chicago Ave.",
    "city": "Freeport",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61032",
    "name": "Chicago Ave Mission",
    "organization": "Chicago Ave Mission",
    "phone": "(815) 233-0435",
    "website": "https://www.faccfreeport.com/",
    "description": "The Chicago Avenue Mission is a 16 bed emergency homeless shelter whose mission is to give homeless adult men and women a safe and warm place to stay. Our goal is to help all of our homeless guests attain the skills, tools, and resources they need to become permanently housed once again.\n\nThe Mission is open daily from 6 p.m. to 8 a.m. from October 1st through May 31st each year and serves 50 to 60 unduplicated homeless men and women each year. Evening meal at 6:30 p.m. and breakfast every morning. Shower and laundry facilities also available.\n\n"
  },
  {
    "addressLine1": "715 West State Street",
    "city": "Rockford",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61102",
    "name": "Rockford Rescue Mission",
    "organization": "Rockford Rescue Mission",
    "phone": "(815) 965-5332",
    "website": "https://www.rockfordrescuemission.org/",
    "description": "We provide emergency shelter, addiction recovery and 3 meals every day free of charge to anyone,not just those who are staying with us.\n \n\nMen's Crisis Center\nThe Men's Crisis Center offers short-term housing for up to 130 homeless men and is located at 715 West State Street, and the entrance is located on the east side of the building off Rockton Avenue. The Center provides safe shelter, food and clothing, as well as case management, community resources and medical services. Check-in is immediately following dinner at 7 p.m.\n\nWomen's Crisis Center\nThe Women's Crisis Center allows the Mission to offer short-term housing for up to 48 homeless women and mothers with children and is located at 809 Cedar Street. The Center provides safe shelter, food and clothing, as well as case management, life-skills training, community resources and medical services.  We help coordinate services for children, including public schooling and emergency daycare.  Breakfast and lunch is available at the Mission's main facility, Hope Place, but dinner is provided at the Women's Crisis Center each evening. Check-in is at 6 p.m., and dinner is served at 7 p.m."
  },
  {
    "addressLine1": "620 Kishwaukee Street",
    "city": "Rockford",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61104",
    "name": "MELD at Trinity House Shelter",
    "organization": "MELD at Trinity House Shelter",
    "phone": "(815) 963-3369",
    "website": "http://www.rockfordmeld.org/",
    "description": "Emergency homeless shelter for young moms, pregnant or parenting, between the ages of 17 and 21, and their children.MELD at Trinity House Homeless Shelter provides housing for homeless pregnant or parenting young mothers and their children. The shelter is located at 620 Kishwaukee Street.\n\nEmergency beds for pregnant or parenting young mothers and their children\n\nMust be homeless and between 16 and 21 years of age\n120 day maximum stay\nComprehensive programming and services include:\nThree daily nutritionally balanced meals\nNeeds assessment\nCase management\nEducational assessment\nLife Skills Education\nParenting Education\nReferral to mental health nd substance abuse resources\nReferrals to primary health care services\nTransportation\n"
  },
  {
    "addressLine1": "413 N. Court St.",
    "city": "Rockford",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61103",
    "name": "Shelter Care Ministries - Jubilee Center",
    "organization": "Shelter Care Ministries - Jubilee Center",
    "phone": "(815) 964-5520",
    "website": "https://shelter-care.org/",
    "description": "Provides shelter for families.\nPrograms:\nSupportive housing\nThe Jubilee Center: Day SHELTER program for adults with chronic mental illness, homeless or at risk of homelessness.\n\n\n\n\n"
  },
  {
    "addressLine1": "1149 Railroad Avenue",
    "city": "Rockford",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61104",
    "name": "Carpenter's Place Outreach Center",
    "organization": "Carpenter's Place Outreach Center",
    "phone": "(815) 964-4105",
    "website": "https://www.carpentersplace.org/",
    "description": "The Day Room is open Monday through Friday from 8:30 a.m. until 3:30 p.m.\n\nCarpenters Place operates a Day Room with an open door policy as the first step to engaging a homeless person in the process of improving their life situation. As long as individuals are not violent or intoxicated, anyone who is homeless may come into the Day Room and receive a lunch ticket for 7 days. To continue receiving a lunch ticket after 7 days, they must meet with a case manager if they have not already done so.\n\n\nThe Day Room is a safe, structured space where people who live on the street can seek shelter for the day in a positive environment. An average of 90 100 guests per day make use of the Day Room. Practical and essential basic services are coordinated by Day Room staff and include: a comfortable common gathering area with tables and chairs, breakfast and lunch, a shower, a change of clothing, telephone for appropriate local calls, a message service for appropriate messages, referrals, and positive conversation.\n\nBy first meeting these most basic human needs, CP provides an atmosphere that allows the homeless person to focus on something other than moment-to-moment survival. Through the encouragement of Day Room staff and seeing their peers attain levels of success, guests are encouraged to actively participate with case managers and develop their own individualized Life Recovery Plan for success.\n\nSupportive Transitional Housing\nThe main CP transitional housing program occupies a 12-unit apartment building composed of one-bedroom apartments. This program is funded by HUD through the Mayor's Homeless Task Force on Homelessness.\nParticipants in this program reside in a 12-unit, one bedroom apartment building, and may remain up to two years. There are two participants per unit. Participants share the apartment with a roommate to increase accountability and to avoid isolating behavior and loneliness. The number of participants at any point in time will be between 18 and 22.\n\nThis project is located in a healthy community neighborhood, on the bus route, close to shopping, hospital, addiction and mental health services, educational, employment, spiritual, and recreational opportunities.\nA full time, Case Manager is responsible for the well-being and continued progress of current participants as well as for participants transitioning into or out of the program. The project's Case Manager assumes the primary role of relationship building and case management, including periodic assessment, monitoring, and advocacy for participants. The Case Manager meets weekly with all participants one-on-one, and holds group meetings for all program participants a minimum of once per week. Individual inspections of all rooms is performed weekly.\n\nWoman's Housing Program\nA housing and support services program for homeless women that have demonstrated a commitment to positive life changes.\n\nPermanent Supportive Housing\nThis CP program received initial funding from HUD for a three-year period to provide Permanent Supported Housing for the Chronically Homeless. This project provides maximum flexibility in Permanent Supportive Housing options and Chronically Homeless participant mix to meet priorities as determined by the local Rockford, Winnebago, Boone Continuum of Care Gap analysis.\nThe project leases a mixture of available open market housing units consisting of twelve (12) one bedroom units that are utilized as Permanent Supportive Housing for Chronically Homeless adults.\nThis program allows for a focus on specific Chronically Homeless sub-populations in need in the community such as: persons with mental illness, substance abuse problems, or dual diagnosis; veterans; HIV/AIDS.\nThe program includes professional comprehensive and holistic Case Management services.\n\nVeteran's Transitional Housing\nThrough a special Veteran's Administration program and private donations, CP was able to purchase a 3-bedroom brick ranch located in a northwest Rockford neighborhood for half the market price. This home provides transitional housing for three honorably discharged homeless Veterans, giving them a safe, secure place to call home, a place to get a fresh start and rebuild their lives here at home in Rockford, Illinois!\nFamily Services ProgramThe Carpenters Place Family Services program is based in accountability and full engagement of the family in rebuilding their lives.\n\n\n    The immediate goal is to address any crisis situation, especially where safety is involved, such as a family living in a car.\n    The intermediate goal is to identify and access services needed to help the family gain stability.\n    The long-term goal is to have families be self-supporting, contributing members of our community.\n\nTo maximize the collective impact of local organizations for the benefit of families in the Rock River Valley, Carpenters Place Family Services provides comprehensive case management. Through this case management program, sixteen areas of life are addressed for parents and children, and tracked on a database program. The initial step is a meeting with the family to identify needs, and work with them to set goals and steps for reaching those milestones. Although the needs are identified through our program, Carpenters Place is not the end provider for all services. We partner with local organizations who are experts in their field. By doing this, we avoid duplication of services and maximize the community resources targeted to help families in need of assistance. In addition to what is provided by Carpenters Place, resolution of need may be accomplished through referrals and telephone advocacy or by accompanying families to their appointments with other community agencies.\n"
  },
  {
    "addressLine1": "632 N. Jackson Street",
    "city": "Harrisburg",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62946",
    "name": "Christian Community Compassion Center 4C's",
    "organization": "Christian Community Compassion Center 4C's",
    "phone": "(618) 252-3931",
    "website": "http://www.harrisburgpresbyterian.org/",
    "description": ""
  },
  {
    "addressLine1": "350 East Washington Street",
    "city": "Joliet",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60433",
    "name": "MorningStar Mission Ministries Inc.",
    "organization": "MorningStar Mission Ministries Inc.",
    "phone": "(815) 722-5780",
    "website": "https://morningstarmission.org/",
    "description": ""
  },
  {
    "addressLine1": "1550 Plainfield Road",
    "city": "Joliet",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60436",
    "name": "Groundwork",
    "organization": "Groundwork",
    "phone": "(815) 729-1228",
    "website": "http://www.guardianangelhome.org/",
    "description": "Groundwork Domestic Violence Program.\nDOMESTIC VIOLENCE\n24-HOUR HOTLINE:\n(815) 729-1228\nGroundwork Provides:\n\n    24-hour Confidential Hotline\n    Emergency Shelter\n    Individual Counseling for Adults & Children *English & Spanish\n    Group Counseling for Adults & Children *English & Spanish\n\n    Domestic Violence Education Program (for survivors referred from child welfare or legal system) *English & Spanish\n    Legal Advocacy at the Will and Grundy Courthouses\n    Medical Advocacy at Will and Grundy area hospitals and emergency departments\n    Prevention Education\n    Community Presentations\n"
  },
  {
    "addressLine1": "611 East Cass Street",
    "city": "Joliet",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60432",
    "name": "Catholic Charities Daybreak Center",
    "organization": "Catholic Charities Daybreak Center",
    "phone": "(815) 774-4663",
    "website": "http://catholiccharitiesjoliet.org/",
    "description": "Daybreak Center operates 24-hours a day, 365 days a year and provides emergency housing, and supportive services to individuals and families who are homeless. Some participants in the program are in need of short-term housing, as a result of a situational crisis. Others need support services as they work to reestablish permanent housing.\nHomelessness prevention services are also provided to individuals and families who are at risk of losing their homes.\n\n(Youth under the age of 18 are not admitted except when accompanied by a parent or legal guardian.)\n\nAt Daybreak Center We Offer\n    A safe and clean environment\n    Comprehensive case management, coordination and assisted access of community resources\n    Educational assessments, services and assistance enrolling in educational classes (GED and ESL English as a second language)\n    Employment assessments, programs and access to employment search office equipment\n    Healthy living workshops\n    Group support meetings\n    Depending on limited available resources, individuals and families may also apply for financial assistance for rent or a mortgage, temporary housing, food, utilities, prescriptions, transportation and other miscellaneous needs\n    Referrals and access to HELP Food Pantry\n    Closed A.A. meetings at 4:00 pm Friday, non-smoking, open to the public\n    N.A. meetings at 8:00 pm Wednesday, non-smoking, open to the public\n\nShepherds Table\nFeeding members of the community who are hungry and unable to provide for themselves by offering a free mid-day meal. Shepherds Table is also used as a warming and cooling center during extreme weather. To volunteer at Shepherds Table, contact our Volunteer Coordinator at 815-774-4663 x3138.\nNew Beginnings Permanent Supportive Housing\nNew Beginnings is a permanent housing program that provides a safe living environment to chronically homeless and disabled men.  Clients reside in an independent living setting.  All tenants must meet eligibility criteria.  This program is limited to availability of housing.\nCriteria:\n    At least 18 years-old\n    Have an income (tenants pay 30% for rent)\n    Fit the HUD definition of \"chronically homeless\"\n    Must have a documented disability"
  },
  {
    "addressLine1": "364 E. Washington St",
    "city": "Joliet",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60433",
    "name": "New Day Drop-In Center",
    "organization": "New Day Drop-In Center",
    "phone": "(815) 722-5780",
    "website": "https://morningstarmission.org/drop-in-center/",
    "description": ""
  },
  {
    "addressLine1": "9601 E Ogden Ave",
    "city": "La Grange",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60558",
    "name": "BEDS Plus - La Grange Day Center",
    "organization": "BEDS Plus - La Grange Day Center",
    "phone": "(708) 354-0858",
    "website": "https://beds-plus.org/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 127",
    "city": "Libertyville",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60048",
    "name": "Lake County Haven - Shelter and Transitional Housing",
    "organization": "Lake County Haven - Shelter and Transitional Housing",
    "phone": "(847) 680-5408",
    "website": "https://www.lakecountyhaven.org/",
    "description": ""
  },
  {
    "addressLine1": "339 Lakewood Avenue",
    "city": "Waukegan",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "00000",
    "name": "Love Inc Lake County",
    "organization": "Love Inc Lake County",
    "phone": "(847) 782-8630",
    "website": "http://www.loveinclakecounty.org/",
    "description": ""
  },
  {
    "addressLine1": "123 Marshall St",
    "city": "Burlington",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "52601",
    "name": "Burlington Area Homeless Shelter",
    "organization": "Burlington Area Homeless Shelter",
    "phone": "(319) 754-6791",
    "website": "https://burlingtonareahomelessshelter.wordpress.com/",
    "description": ""
  },
  {
    "addressLine1": "1812 Western Ave",
    "city": "Mattoon",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61938",
    "name": "The Haven",
    "organization": "The Haven",
    "phone": "(217) 234-7237",
    "website": "https://mattoonhaven.org/",
    "description": "Lunch:\nMonday - Thursday: 11am - Noon\nFriday: 11am (sack lunch)\nSaturday: 11am - Noon\nSunday: Noon - 1pm\n\nDinner:\nEvery Night: 7pm - 8pm\n\n\n\nHours:\n\nDoors open at 7pm\n\nPlease arrive before 10pm\n\n\n\n\nThe Mattoon Haven a not for profit organization, provides safe and hospitable shelter, supportive services, and advocacy in order to assist homeless or at risk individuals and families to achieve a higher level of self sufficiency in collaboration with religious and community groups.\n\nProgram Aspects:\nEmergency Shelter: Providing 30 days of shelter with extensions based on goal attainment.\nHours: Doors open at 7pm\nPlease arrive before 10pm\n\nSoup Kitchen: Serving three meals a day to anyone that is in need of food.\nLunch:\nMonday - Thursday: 11am - Noon\nFriday: 11am (sack lunch)\nSaturday: 11am - Noon\nSunday: Noon - 1pm\n\nDinner:\nEvery Night: 7pm - 8pm\n\nCase Management: We meet with each individual staying at our location minimally once a week to provide counseling, life coaching, and advocacy.\n\nDay Program: Partnering with other community agencies, classes and volunteer opportunities are provided for those staying at the shelter to develop their workforce skills and increase their self-sufficiency."
  },
  {
    "addressLine1": "1805 S. Illinois Route 31",
    "city": "McHenry",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60050",
    "name": "McHenry County PADS",
    "organization": "McHenry County PADS",
    "phone": "(815) 759-7284",
    "website": "https://www.pioneercenter.org/",
    "description": "McHenry County PADS is a program of Pioneer Center for Human Services, McHenry Countys provider of the broadest range of human services.\n\nMcHenry County PADS offers emergency and transitional housing coupled with support services in order to help individuals who have become homeless work toward becoming self-sufficient.\n\n\nThese support services enables individual to receive case management, access to vocational programs, life skills training, and counseling, as well as day-to-day services including access to showers, laundry facilities, transportation, computers and an address at which to receive mail. The program is specifically designed to address the root causes of homelessness and not just treat the symptoms.\n\nThe organization's Day Center is the first and only year-round daytime facility in McHenry County for homeless men, women and children. The Center provides an array of services including crisis intervention and case management, needs assessment along with benefits and documentation acquirement, coordination of services, an address to receive mail, lockers for temporary storage, hot meals, life skills building classes on budgeting, anger management, grooming, shopping and more, and job training and counseling. In addition, individuals who are working their way out of homelessness benefit from a stable living environment.\n\nOur transitional home has the ability to host up to 20 homeless individuals who can stay at the home for up to two years. Occupants of the home may include single individuals, intact families and single parent families. The goal of transitional home is to build a homelike setting and provide the residents with the life skills needed to succeed. Skills taught include budgeting, goal planning, job training and time management. The layout of the home includes a community kitchen, living room, dining room, laundry facilities and a resource room that contains a computer used for job searches and research. Lack of reliable transportation is often a barrier to people working their way out of homelessness.\n\n\nMcHenry County PADS provides transportation assistance in two forms--travel vouchers, train tickets or bus passes can be provided to individuals that have access to public transportation.\n\nIn addition, two 15-passenger vans offer rides to the Day Center, emergency shelter sites, job interviews, social service agencies or medical appointments McHenry County PADS is open seven days a week from 7:00 am to 6:30 pm.  With transportation available every day."
  },
  {
    "addressLine1": "217 W. 3rd Street",
    "city": "Mount Carmel",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62863",
    "name": "Safe Haven of Mount Carmel",
    "organization": "Safe Haven of Mount Carmel",
    "phone": "(618) 262-2677",
    "website": "mailto:office.safehaven.mtcarmel@gmail.com",
    "description": "Safe Haven of Mt. Carmel Illinois, Inc. is a private (non-state funded) temporary Emergency Shelter for homeless women and their children in the greater Wabash County Area of Southeastern Illinois.\n\nThe following are requirements for individuals seeking temporary emergency shelter at Save Haven of Mount Carmel.\n\n\nAn applicant must be in one of the following categories:\n\nA female over the age of 18.\nA female over the 18 and her minor children under the age of 17.\nAn emancipated female minor with or .without children.\n"
  },
  {
    "addressLine1": "9 N 5th Street",
    "city": "Vincennes",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "47591",
    "name": "Another Chance Christ Ministries",
    "organization": "Another Chance Christ Ministries",
    "phone": "(812) 886-5304",
    "website": "https://anotherchancechristministries.wordpress.com/",
    "description": "Christ centered facility for men only, We can not accept registered violent or sexual offenders.\n\nThis is not a FREE program.\nProgram Information:\n    The program last for 1 to 3 years.\n    You must be 18 or older.\n    We do not accept registered sex or violent offenders to protect our neighboring community\n    The program cost is $120/week or 30% of your income. Exceptions can be made.\n\n    Application for residency and Policy and Procedures Packet must be completed.\n\nThis program is a 1 to 3 year transitional housing program.\nThere will be an application process for every potential resident in this program.  "
  },
  {
    "addressLine1": "111 East 29th Street",
    "city": "Sterling",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61081",
    "name": "Twin Cities PADS",
    "organization": "Twin Cities PADS",
    "phone": "(815) 626-2210",
    "website": "http://www.twincitiespads.org/",
    "description": "Our Hours\nWe are open 7:00 P.M. to 7:00 A.M. October 1st thru April 30th. Please call ahead prior to visiting.\n\nThis is an emergency shelter and entry point into other outreach programs. From here the individuals are directed to organizations like the following...\n\n    Tri County Opportunities\n    Northwestern Illinois Center for Independent Living\n    YWCA\n    Sinnissippi Mental Health\n\nClick here to see information for the Homeless for the Holidays Donation.\n\nWe are very proud of the Shelter on many levels. We do a lot with a little and this fundraiser represents nearly half of our annual budgets. We a primarily funded through the community. The shelter is also primarily run by volunteers, and always has a constant level of supervision and over site.\n\n\nWe are one of many great organizations and the competition for money is tough. Our mission is to help people and be a light to those lost in the darkness. Please help us keep the lights on!"
  },
  {
    "addressLine1": "100 S Fayette St",
    "city": "Jacksonville ",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62650",
    "name": "New Directions Heating and Cooling Center",
    "organization": "New Directions Heating and Cooling Center",
    "phone": "(217) 271-1014",
    "website": "https://www.facebook.com/NewDirectionsWarmingAndCoolingCenterForTheHomeless",
    "description": "Overnight heating and cooling center, where homeless individuals and families can stay from 7:00 p.m. until 7:00 a.m.\n\n"
  },
  {
    "addressLine1": "501 Broadway St",
    "city": "Quincy",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62301",
    "name": "Salvation Army Shelter Quincy",
    "organization": "Salvation Army Shelter Quincy",
    "phone": "(217) 222-8655",
    "website": "http://www.salvationarmyquincy.org/emergency-shelter/",
    "description": "Hours: 24 hours/day, 7 days/week. The Shelter is located across the street from the Salvation Army Kroc Community Center.\n\nThe new shelter area of the building can house up to 16 people with rooms dedicated to single men and women as well as families. The building also houses our Family Services operation & Food Pantry. This shelter is the only one within a 100 mile radius that serves this population.\n\n\nDuring their stay, residents will be required to look for a job, if they are unemployed, save money to move into a place of their own, and meet with a caseworker on a regular basis. Our goal is to provide a comfortable, safe environment for our residents. Meals, laundry facilities, phone calls and other needed items are all provided for those staying in the shelter. A normal stay in the Emergency Shelter is 30 days, but could be longer or shorter depending on the client's situation.\n\nThe Salvation Army Emergency Shelter serves the greater Adams County area as well as transients who have come to our community and find themselves in a homeless situation. It is the goal of our program to equip our residents with the knowledge and life skills training needed to find employment and suitable, affordable housing that they might become self-sufficient individuals.\n\nShelter Purpose\nTo provide services necessary to help remove existing barriers in the area of housing, employment, health care, and adequate nutrition\nTo make appropriate referrals to community resources/services in order to assist residents in their efforts to become more stable by obtaining housing, employment, training, etc.\n\nTo provide volunteer opportunities for members of the community\nTo create an environment based on respect for the inherent dignity and value for each person who comes to The Salvation Army Emergency Shelter for services\nTo provide assistance to residents in their efforts to identify and achieve personal goals and targets\nTo base all interactions with clients and the community within the moral and ethical framework established by The Salvation Army"
  },
  {
    "addressLine1": "2710 17th Street",
    "city": "Zion",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60099",
    "name": "A Safe Place",
    "organization": "A Safe Place",
    "phone": "(847) 731-7165",
    "website": "https://asafeplaceforhelp.org/",
    "description": "24 HOUR TOLL FREE HOTLINE 1-800-600-SAFE\n\nOur Emergency Hotline is open 24 hours a day/7 days a week.\nWe provide services to men, women, children, the elderly, LGBT community members, and teens.\n\n\n\nA Safe Place provides emergency shelter, transitional housing, scattered-site transitional housing, and permanent supportive housing for survivors of domestic violence men, women, and children who have been physically, verbally, or emotionally abused.\nEmergency Shelter\nTransitional Housing\nScattered-Site Transitional Housing\nPermanent Supportive Housing\n\n\nEmergency shelter stays of up to three months are available to families who must seek safety from their abusers while they develop plans that will lead to violence-free lives. The location of the shelter is confidential for the safety of our clients.\n\nWhen our modern, 33-bed home is at capacity, we find safe accommodations nearby so survivors can continue to receive services until room becomes available in the shelter.\n\n\nA Safe Place shelter program is designed to address basic needs and provide professional support to help set goals for the future. Our focus is always on safety and empowerment of our clients.\n\nA stay at A Safe Place allows survivors of domestic abuse to assess the resources and options available for setting up new and safe lives for their families while they begin rebuilding their shattered self images. While residing at the shelter, families receive assistance with referrals, advocacy, safety planning, individual counseling, group support, and case management from a team of professional domestic violence advocates."
  },
  {
    "addressLine1": "P. O. Box 176",
    "city": "Olney",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "62450",
    "name": "Stopping Woman Abuse Now SWAN",
    "organization": "Stopping Woman Abuse Now SWAN",
    "phone": "(888) 715-6260",
    "website": "https://swandvhl.org/",
    "description": "The purpose of SWAN is to provide a residential and walk-in program of services. This will include domestic violence victims, their children, the abuser, elderly who are abused in their home and in institutional settings, as well as those who are homeless. This provision of services includes a 24 hour telephone crisis line, counseling, legal advocacy, information/referrals, room and board, financial assistance with rent and utilities, food bank, public education, tranpsortation, outreach, social service advocacy, crisis intervention and emergency medical care. The purpose provides for the clients the abilitiy to make choices, learn alternatives, find options for a violence-free lifestyle, protect and intervene, solve problems and make positive changes in their lives.\n"
  },
  {
    "addressLine1": "1120 Canal Street",
    "city": "Ottawa",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61350",
    "name": "Ottawa PADS",
    "organization": "Ottawa PADS",
    "phone": "(815) 433-1292",
    "website": "http://ivpads.com/",
    "description": "This is an Emergency shelter for men, women, and children that provides some case management to local resources.\nShelter opens Open August 15th - May 31st. Check In is 5 to 7pm, Hot dinner served approximately 6:30pm, Breakfast served until 9am, Bagged Lunches distributed for the day when shelter is closed from 9am-5pm.\n\n\nServices:\n53 beds\n3 meals a day\nIndividual service plans designed by clients and staff.\nEducational programs"
  },
  {
    "addressLine1": "1320 Menards Dr.",
    "city": "Peru",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61354",
    "name": "Peru Pads",
    "organization": "Peru Pads",
    "phone": "(815) 224-3047",
    "website": "http://ivpads.com/",
    "description": "This is an emergency shelter for men, women, and children providing some case management to local resources.\n\nIVPADS opens Sept 1st and closes May 31st yearly.\nOpen 7 days a week from 5pm to 9pm daily during the months above.\n\nServices:\n24 beds\n3 meals a day\n"
  },
  {
    "addressLine1": "1140 E. Northwest Highway",
    "city": "Palatine",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60074",
    "name": "JOURNEYS - The Road Home",
    "organization": "JOURNEYS - The Road Home",
    "phone": "(847) 963-9163",
    "website": "https://www.journeystheroadhome.org/",
    "description": "Scattered Site Emergency Shelter Program serving the northwest suburban area of Cook County.\n\nDaycenter supportive services M-F 7:30am - 4PM\nServices\nAt JOURNEYS  The Road Home, we serve people from all walks of life.  Homelessness does not discriminate and can be chronic or situational. It affects a variety of people including families with children, young adults, and senior citizens. The causes for homelessness can range from a lack of affordable housing to mental illness or chemical dependency. Family problems, domestic violence and abuse, disability, poverty and even a series of insurmountable bad luck can lead to homelessness. At Journeys, we work to provide intervention and support to address the root cause of homelessness, and lead people back to a stable environment.\n\nHOPE Center\nThe HOPE Center is a day resource center that provides free services to the homeless and those at risk of becoming homeless.\nM-F 7:30am - 4PM.\nPADS Emergency Shelter Program\nThe goal of the PADS Emergency Shelter Program is to provide hospitality, food, and overnight emergency shelter to the homeless between October 1 and April 30, seven days a week (including holidays). PADS Emergency Shelter sites are open from 7:00 pm until 7:00 am. Guests may not arrive prior to 6:45 pm or later than 9:00 pm, and must depart prior to 7:00 am.\n\nPathway Housing Readiness Program\nThe shortage of affordable housing in northwest suburban Cook County was the driving force behind the creation of JOURNEYS Pathway Housing Readiness Program."
  },
  {
    "addressLine1": "1440 Renaissance Drive Suite 240",
    "city": "Park Ridge",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60068",
    "name": "The Harbour",
    "organization": "The Harbour",
    "phone": "(847) 297-8541",
    "website": "https://theharbour.org/",
    "description": "Shelter and transitional housing for youth"
  },
  {
    "addressLine1": "2209 3rd ave",
    "city": "Rock Island",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "61201",
    "name": "Christian Family Care Center",
    "organization": "Christian Family Care Center",
    "phone": "(309) 786-5734",
    "website": "http://www.christiancareqc.org/",
    "description": "We operate a 24/7 Crisis Hotline that primarily receives calls from those who are homeless, those in danger of being beaten or killed, and those contemplating suicide.\nIf you or someone you know is in any kind of danger, please don't hesitate to give us a call at 309.788.2273. We have resources readily available and will be able to assist you in any way that we can.\n\nWe have both a men's rescue mission providing meals, clothing, and housing as well as a women and children's domestic violence shelter.\n\nWe primarily provide care to residents of the Quad Cities, but we also have taken in individuals from other states and even other countries.\nWe serve:\nHomeless individuals\nVictims of Domestic Violence\nVictims of Sexual Assault\nChildren and Adolescents\nIndividuals struggling with mental illness\nMen and Women transitioning out of prison\nVeterans\n\nThe Rescue Mission provides shelter for homeless men. Our facility is an alcohol and drug free environment. Although many of our residents are recovering from substance abuse, not every man who stays with us is a drug addict or an alcoholic. Many of our men suffer from mental health issues, some are developmentally challenged, and some have recently been released from jail or prison. Many of our men have experienced hard times--loss of a job, health issues, divorce, etc. All are experiencing circumstances beyond their control and desperately want their lives to return to normal.\nResidents have access to skill-building groups, job searches, personal counseling, and case management. They can attend chapel services nightly, meditate daily and participate in Bible studies each week night.\n\nCommunity Meals\nWe provide three meals a day most days, not only for our residents but also for any hungry person who comes to our door. Last year we served well over 60,000 meals to the community.\nHere is our schedule:\nBreakfast: Daily at 6:30 a.m.\nLunch: Monday Friday at 12:15 p.m.\nDinner: Daily at 6:30 p.m."
  },
  {
    "addressLine1": "824 West 3rd Street",
    "city": "Davenport",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "52802",
    "name": "King's Harvest Ministries Homeless Shelter - Cold Weather Shelter",
    "organization": "King's Harvest Ministries Homeless Shelter - Cold Weather Shelter",
    "phone": "(319) 800-4169",
    "website": "http://www.kingsharvest.net/",
    "description": "We are open every night From December 1 through April 15. Doors are open from 9 PM until 10 PM for check-in.\n\nWe serve a light meal at 9:15 PM each night. Guests must be checked in to eat.\n\nWe serve lunch on Wednesday and Friday from 12 PM to 1 PM.\nWe serve a weekly brunch on Saturday from 9 AM to 10 AM.Food Pantry - Kings Harvest is currently giving groceries to needy and homeless families twice a month.\nThe second and fourth Saturdays at 9:30am.\nThe monthly giveaway is open to the community the 2nd Saturday of the month from 8:30 till 10:00 a.m.Kings Harvest is able to provide toiletry items, jackets, socks and underwear, and bedding for those in need.Pet Food Distribution - 1st and 3rd Saturday from 9-10 am and Wednesday and Friday from 12-1 pm.King's Harvest Ministries Mission - To serve the poor and homeless in the Quad Cities.Providing for the community, by meeting their physical, emotional and spiritual needs.Showing them who Jesus is, through compassion, unconditional love and relationships."
  },
  {
    "addressLine1": "1016 West 5th Street",
    "city": "Davenport",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "52802",
    "name": "Humility of Mary Shelter, Inc.",
    "organization": "Humility of Mary Shelter, Inc.",
    "phone": "(563) 322-8065",
    "website": "http://humilityofmaryshelter.com/",
    "description": "The Humility of Mary Shelter, Inc. provides emergency shelter 24 hours a day / 7 days a week / 365 days a year for adult men and women.The Humility of Mary Shelter is located in Davenport, IA. Our Mission is to provide emergency shelter, transitional and permanent supportive housing programs that offer opportunities for men and women experiencing homelessness to become emotionally, mentally and physically more stable.\n\nHumility of Mary Shelter, Inc. offers services to its program participants to facilitate their desired transition into housing of their own choosing.\n\nGuidelines for those in need of emergency shelter:\nHumility of Mary Shelter, Inc. accepts new participants as space allows on a first come, first served basis. If you or someone you know needs emergency housing help, the procedures on this page will assist you. We do not make reservations, but receive new participants as beds become available.\n    Intakes for emergency shelter are completed Monday-Thursday starting at 7AM at HMSI. Alternate entry times are the decision of the Director of Services/Operations.\n\n    Participants seeking shelter should arrive at shelter at 7AM.\n    If there are more people seeking shelter than available openings, an assessment tool will be used to determine an individuals vulnerability and HMSI will prioritize those with the highest level of need.\n    Once a participant has entered HMSI's emergency shelter they are eligible to stay up to 90 days in a calendar year. If a person does not return to shelter for 3 nights, they will lose their place and must follow the above procedure for re-entry.\nIt is HMSI's goal to provide emergency shelter to any adult experiencing homelessness. When that is not possible, because we are full, we want to communicate clearly the next possible opportunity for checking in. In addition, we want people to have the opportunity to speak with someone who can help provide appropriate referrals or connection to resources until more stable housing is identified.\nWomen and mens accommodations are on separate floors. Due to restricted storage space, participants must limit belongings to two bags or suitcases. No weapons are allowed on the premises.\n\nParking is available for vehicles in the lot directly in front of the shelter entrance.\n\n\nMental Health Assistance\nThe stresses of homelessness strain those who deal every day with housing insecurity. Some also deal with medical health problems, mental health problems, difficulties due to their legal history and substance abuse issues.\nHumility of Mary Shelter, Inc. contracts with professionals in the community to ensure participants have ready access to mental health services. HMSI also utilizes the outreach of the Vera French Community Mental Health Clinic.\n\nLife Skills Classes\nRegularly scheduled small group classes provide opportunities for participants to acquire skills that will help them gain employment and strengthen their abilities.\n\nSupportive Services\n\nClothing Room\nAdult clothing is available free of charge on Mondays and Wednesdays from 9 AM until 11 AM. This is used clothing that has been donated from members of the community and sorted, sized and arranged by volunteers. Volunteer help is welcome each Monday and Wednesday to oversee the clothing distribution. Contact Shelter if youre available to assist.\n\nDonation Room\nWe organize and store donations of clothing and personal necessities that we have received from the community. This makes emergency assistance available on site for those in urgent need."
  },
  {
    "addressLine1": "100 Kirkwood Blvd",
    "city": "Davenport",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "52801",
    "name": "The Salvation Army of The Quad Cities",
    "organization": "The Salvation Army of The Quad Cities",
    "phone": "(563) 324-4808",
    "website": "https://centralusa.salvationarmy.org/quadcities/",
    "description": "The Salvation Army Quad Cities Family Services provides homeless prevention and shelter services to families in Scott and Rock Island Counties"
  },
  {
    "addressLine1": "642 S. Martin Luther King Jr. Ave.",
    "city": "Waukegan",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60085",
    "name": "Marys' Mission",
    "organization": "Marys' Mission",
    "phone": "(847) 623-2136",
    "website": "mailto:rmcfann1@gmail.com",
    "description": "We provide transitional housing for men and women who are physically able to take care of themselves receiving a pension or on disability (SSI). We have 25 beds, food and phone are also included. We use a sliding scale for rent starting at $500.00 a month and lower based on amount of income. We are a 501 c 3 facility. Pleas call us at your convienence to let us know your position with refering clients to Marys' Mission."
  },
  {
    "addressLine1": "1800 Grand Avenue",
    "city": "Waukegan",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "00000",
    "name": "Pads Lake County",
    "organization": "Pads Lake County",
    "phone": "(847) 689-4357",
    "website": "https://www.padslakecounty.org/",
    "description": "Come to our Resource Center at 1800 Grand Avenue between 8:00am and 5:00pm, Monday through Friday to complete an intake and start to get help\nEmergency Overnight ShelterPADS is the only non-restrictive overnight emergency shelter system in Lake County. Our 15 rotating shelter sites are open every night from 7:00 pm 7:00 am, between October 1 and April 30.  From May 1 through September 30, a single shelter site is open every night for a limited number of persons.  Through this network, persons experiencing homelessness can have a safe, warm place to sleep 365 days a year.\n\nDay Resource Center\nPADS Day Resource Center is the point of entry for persons experiencing homelessness. Upon falling into homelessness, individuals and families can come to PADS to get assessed and receive the assistance they need.  At the Day Resource Center we:\n    Orient our new clients on how to utilize our emergency shelter system;\n\n    Assess clients for need and appropriateness for other programs and services;\n    Provide access to basic needs; and\n    Provide case management and counseling services to get out of homelessness.\n\nFamily Shelter\nThe Family Shelter is a complement to our traditional emergency shelter system that meets the unique needs of families with children and provides them the dignity and respect they deserve while working to overcome their barriers and get out of homelessness and back into housing.\n\nOutreach\nPADS Outreach Program seeks to find and engage persons experiencing homelessness out in the community, sleeping in cars, tents, or elsewhere.  We literally meet them where they are, and help engage them into services.  These are often the most vulnerable of the homeless population, and have some resistance to services.  The Outreach Program helps them receive those services in an environment in which they are comfortable.\nSupportive Housing\nPADS' Supportive Housing program is  for individuals experiencing a longer term of homelessness as a result of their disability (referred to as chronically homeless).  This disability is usually some form of mental illness.\n\n"
  },
  {
    "addressLine1": "800 West Glen Flora Avenue",
    "city": "Waukegan",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "00000",
    "name": "COOL MINISTRIES - Family Housing Program",
    "organization": "COOL MINISTRIES - Family Housing Program",
    "phone": "(847) 662-1340",
    "website": "http://coolministries.org/our-ministries/family-housing-program/",
    "description": "Family Housing Program\n\nThe COOL Family/Transitional Housing Program has been in operation since 1988. This program provides services and programs including life skills training along with rent and utilities paid homes for homeless families, many of whom are struggling single parents. COOL guest families benefit from the opportunity to complete educational training, secure better employment and save for first and last months rent or a down payment on a home. While living in COOL housing,  families will work with a case manager who will help to ensure that each family is financially stable and equipped for a long lasting transition to self-sufficiency upon leaving COOL.\nWhere are COOL Family Housing homes located?\n\nCOOL owns a 4 unit apartment building in the downtown Waukegan area where 4 families live year round while they work on their goal of becoming self sufficient independent, working moms, dads and couples.  COOL also houses two families at a duplex home in the northern suburbs of Waukegan. Four more families are housed at two different sites in Zion, Illinois. All COOL Housing guest\"  families live in scattered sites throughout Waukegan and Zion and though they live independently they are closely monitored for compliance with program rules and progress toward goals set.\n\nNo families are housed, sheltered, or receive housing services at 800 Glen Flora. That location is the home of only the COOL Food Pantry East and offices for COOL executive and support staff."
  },
  {
    "addressLine1": "705 West Liberty",
    "city": "Wheaton",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60187",
    "name": "Dupage PADS Overnight Housing Assistance Program",
    "organization": "Dupage PADS Overnight Housing Assistance Program",
    "phone": "(630) 682-3846",
    "website": "https://dupagepads.org/",
    "description": "Interim (Overnight) Housing Program\n\nThe Interim Overnight Housing Program offers families and individuals a safe environment. The spirit of hospitality is a priority, as well as respect for each person. Volunteers assist staff in providing dinner, breakfast, and a bag lunch; sleeping space; and support activities.\n\nDuPagePads case managers work to engage individuals to move from crisis to self-sufficiency, including providing parenting, self-esteem and other groups/workshops and opportunities for education and employment services.  Thirty sites throughout DuPage County provide shelter 365 nights a year on a seasonal basis with support from congregational and community volunteers.\n\n\nBasic Information:\n\n    Interim (Overnight) Housing Sites are open 365 days a year and located throughout Northern, Central and Southern parts of DuPage County\n    Interim Housing Sites are at a different location each night with support from volunteers\n\n    Families can arrive at 5:30pm and doors open at 6:00pm at designated sites.  Individuals can arrive at 6:30pm and doors open at 7:00pm.  All Interim Housing sites close nightly at 9:30pm.\n    Most locations can by reached by public transportation\n    Professional staff will register people who are new to the program each night\n    Family friendly sites are available from October through April in the Southern part of DuPage County\n\n\nBasic Need Services:MarianKrausPhoto_MKP5967\n\n    Meals (dinner, breakfast and bag lunch)\n    Sleeping arrangements (pad, pillow and bedding)\n    Laundry (at limited locations)\n    Showers (at limited locations)\n    Hair cuts (at limited locations)\n    On site medical services at selected sites (October through April)"
  },
  {
    "addressLine1": "605 E Roosevelt Rd",
    "city": "Wheaton",
    "state": "Illinois",
    "stateAbbreviation": "IL",
    "postal": "60187",
    "name": "Family Shelter Service",
    "organization": "Family Shelter Service",
    "phone": "(630) 221-8290",
    "website": "https://www.metrofamily.org/",
    "description": ""
  }
]