[
	{
		"addressLine1": "427 W Maumee St",
		"city": "Adrian",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49221",
		"name": "Share the Warmth of Lenawee Shelter",
		"organization": "Share the Warmth of Lenawee Shelter",
		"phone": "(517) 759-3223",
		"website": "https://sharethewarmthoflenawee.org/",
		"description": "Emergency homeless shelter with 62 bed, low barrier, serving all persons over the age of 18 year-round.\nThey participate with local Continuum of Care to help provide rapid rehousing services for their guests.\n"
	},
	{
		"addressLine1": "220 North Main St.",
		"city": "Adrian",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49221",
		"name": "Family Counseling & Children's Services",
		"organization": "Family Counseling & Children's Services",
		"phone": "(517) 265-5352",
		"website": "http://www.fccsoflenawee.org/",
		"description": ""
	},
	{
		"addressLine1": "307 East Church Street",
		"city": "Adrian",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "00000",
		"name": "Housing Help of Lenawee County",
		"organization": "Housing Help of Lenawee County",
		"phone": "(517) 264-0782",
		"website": "http://www.h2lenawee.org/",
		"description": "Emergency Shelter\nH2Lenawee provides emergency shelter (ES) programs for homeless families. In addition to emergency shelter, H2Lenawee provides daily case management, life skills training, and support services, such as laundry facilities, transportation assistance and much more. The ES program is provided at no cost to the family. The goal of the ES program is to assist homeless families in overcoming barriers on a successful journey to permanent housing.\n\nShort-term motel sheltering may be provided for persons that cannot be served by current Lenawee County shelter programs. State funds and Lenawee Good Samaritan Fund are utilized.\n\nHousing First Program\nH2Lenawee partners with our Lenawee County community with proactive measures to prevent homelessness from occurring and to aid those who are faced with homelessness. H2Lenawee may assist with first month's rent, past due rent and mortgage foreclosure. An in-depth assessment is made regarding a clients financial and housing situation. Case management, client outreach, landlord mediation, budgeting, housing search and referrals along with other support services are provided in this program. The goal of this program is to prevent or reduce the amount of time a household is homeless.    \n\nTransitional Housing (For families with minor children.)\n\nH2Lenawee has units of transitional housing (TH) for families who have children in the household. The TH program provides affordable housing for up to two (2) years as well as support services, life skills training, and weekly case management. The goal of the TH program is to stabilize each family and assist them with overcoming barriers to permanent housing and therefore encouraging lifelong self sufficiency.\n\nPermanent Supportive Housing Program (For chronically homeless individuals.)\n\nThe Permanent Housing (PH) program is H2Lenawee's newest program and is for individuals who have an extensive history of homelessness and who have significant barriers to housing, such as a long term disability. The PH program offers ongoing case management, support services and in some situations a rental subsidy. The goal of the PH program is to help stabilize individuals in permanent housing and increasing their self-sufficiency.\n\nVeterans Program\nOur Veterans Program is for Lenawee County veterans and their families. Some of the\nservices we may provide include intensive case management, housing assistance, other support services and the Veterans Dire Need Fund.  A Veterans Closet stocked with items that state benefits do not purchase may be available as well.\n\n\n\n\n"
	},
	{
		"addressLine1": "217 W Church St",
		"city": "Adrian",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49221",
		"name": "Salvation Army of Lenawee County",
		"organization": "Salvation Army of Lenawee County",
		"phone": "(517) 265-2038",
		"website": "https://twitter.com/salarmyadrianmi",
		"description": "Share The Warmth program at the Salvation Army of Lenawee County.\n\nProvides shelter from sub-freezing temperatures and also a meal to the homeless in Lenawee County."
	},
	{
		"addressLine1": "not disclosed",
		"city": "Adrian",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49221",
		"name": "Lenawee County Continuum of Care",
		"organization": "Lenawee County Continuum of Care",
		"phone": "(517) 264-0782",
		"website": "https://www.facebook.com/Lenawee-County-Continuum-of-Care-176345839124490/info/?tab=page_info",
		"description": "Our Mission is to meet the needs of housing the homeless in Lenawee County."
	},
	{
		"addressLine1": "436 West Delaware Avenue",
		"city": "Toledo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "43607",
		"name": "The Sparrow's Nest",
		"organization": "The Sparrow's Nest",
		"phone": "(419) 321-1835",
		"website": "",
		"description": "24/7 facilities where we serve women who come to us at all hours of the day for help.\n\nThe Sparrow's Nest is a 54 bed facility. The first floor is primarily used in service to those who are in emergency need or are candidates for our Ready For Life (RFL) Program. The second floor is used for the women in our RFL."
	},
	{
		"addressLine1": "4290 Jackson Road",
		"city": "Ann Arbor",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48103",
		"name": "Alpha House",
		"organization": "Alpha House",
		"phone": "(734) 822-0220",
		"website": "http://alphahouse-ihn.org/",
		"description": "Emergency Shelter Famiies Only.\n\nProvides temporary shelter, food, support services. Alpha House is an emergency shelter for children and their families experiencing homelessness. We are located in Washtenaw County, Michigan. The impact of our programs is simple families gain housing and remain together as a family. With our ongoing support and advocacy as needed, families remain securely housed, better able to cope with ongoing challenges and more connected to community resources.\n\nIHN provides intensive support services to address each family's individual needs and barriers to securing permanent housing. The Wraparound Program, our approach to case management, promotes the success of every family by pulling together an array of needed resources including: job training, budgeting, children's services, parenting support, housing relocation services and connection to health care."
	},
	{
		"addressLine1": "809 Henry Street",
		"city": "Ann Arbor",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48104",
		"name": "Salvation Army",
		"organization": "Salvation Army",
		"phone": "(734) 761-7750",
		"website": "https://www.facebook.com/SalvationArmyIHQ",
		"description": "Emergency Shelter"
	},
	{
		"addressLine1": "669 Indiana Ave.",
		"city": "Toledo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "43604",
		"name": "Family House Toledo",
		"organization": "Family House Toledo",
		"phone": "(419) 242-5505",
		"website": "https://familyhousetoledo.org/",
		"description": "Largest shelter for families who are homeless in northwest Ohio. Shelter and food provided, as well as intensive, individualized case management and supportive services.\n\nThe goal at Family House is to help families in crisis to find permanent housing, to regain control over their lives, and reclaim their independence. Help from Family House is a hand up not a hand out.\n\n\nFamily House admits residents 24 hours a day, whether in an emergency situation women experiencing domestic abuse; flood, fire or tornado victims, or victims of unemployment or financial burden. We take in families appearing at our door and those from other relief organizations, including Job & Family Services, Lucas County Children Services, Toledo Police or the American Red Cross.\n\nFamily House exists to provide shelter, food and basic needs to homeless families, and to lead residents to the appropriate resources for their situation. We pride ourselves on teaching residents and those in need how to get their own needs met.\n\nAre you or do you know a family in crisis? If you are a married couple with or without children; an unmarried couple with children; a same-sex, cohabiting couple with or without children; a single parent; or a single pregnant woman, please call 419-242-5505 to find out more about our programs or to schedule an intake appointment.\n\nWe offer a structured program with restrictions for the safety of all our residents in a secured, drug/alcohol/weapon-free facility.\nTo enroll in our program, you need a state-issued photographic ID and a birth certificate for each child, and you must not be a registered sex offender, have an open felony warrant or have been convicted of any crime against children."
	},
	{
		"addressLine1": "1040 Martin Luther King Drive",
		"city": "Jackson",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49203",
		"name": "Grace Haven Center",
		"organization": "Grace Haven Center",
		"phone": "(517) 416-5297",
		"website": "https://www.homelessshelterdirectory.org/shelter/www.gracehavencenter.org",
		"description": ""
	},
	{
		"addressLine1": "1917 Jefferson Ave",
		"city": "Toledo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "43604",
		"name": "Toledo Gospel Rescue Mission",
		"organization": "Toledo Gospel Rescue Mission",
		"phone": "(419) 242-6642",
		"website": "https://tgrm.org/",
		"description": "Men's Shelter: 419-242-6642\n\nRebekah's Haven: 419-243-0403\n\nOutreach Center: 419-478-1005\nMen's Shelter. At the men's shelter we provide night-to-night shelter for homeless men who are over eighteen years of age.\nMen desiring to stay in the shelter must be sober & cooperative and in by 6:00PM.\n\nEach night they receive a message of hope in a chapel service, eat a nutritious balanced meal, shower, and sleep in a clean, warm bed. In the morning, they eat a solid breakfast before they leave.\n\nAlso offered is the Work Skills Program under which selected men receive life skills training, work ethics training, and work therapy. Men involved in this program also have midday devotions offered to them throughout the week in conjunction with their lunch.\n"
	},
	{
		"addressLine1": "703 Phillips Ave",
		"city": "Toledo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "43612",
		"name": "Rebekah's Haven Women's and Children's Shelter",
		"organization": "Rebekah's Haven Women's and Children's Shelter",
		"phone": "(419) 243-0403",
		"website": "https://tgrm.org/rebekahs-haven-1",
		"description": ""
	},
	{
		"addressLine1": "1501 Monroe St",
		"city": "Toledo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "43614",
		"name": "Cherry Street Mission Toledo",
		"organization": "Cherry Street Mission Toledo",
		"phone": "(419) 214-3007",
		"website": "https://cherrystreetmission.org/",
		"description": "Mission: Cherry Street Mission Ministries (Cherry Street) mission serves all who come to us in need, and provides purposeful discipleship by rescuing the downtrodden, restoring hope to the hopeless, and releasing God's greatness to our communities. Cherry Street has been a guiding light for thousands upon thousands of the most vulnerable in our community since 1947, rescuing them from dire circumstances, restoring their self-respect and self-sufficiency, and releasing them back to the community as active, contributing members of society.\n\n \nServices: Since 1947 Cherry Street Mission Ministries (Cherry Street), located in Toledo, Ohio, has provided to our homeless and poor community members free shelter, food, clothing, biblical support, recovery services, educational and vocational programs and services. Anyone can take part in most of Cherry Street's services.\n\n\nEach night, Cherry Street provides safe, free shelter for nearly 230 men and women who would otherwise sleep on the street or remain in an abusive situation. For some, it's the first night they've slept safely in a very long time.\n\n\nWe provide in-take at any time of day or night. We serve all who come to us so we do not have a waiting list.\n\nMen's Housing\n105 17th Street\nToledo, OH 43604\nPhone: 419.242.0068\nFax: 419.321.1831\n\nWomen's Housing\nSparrow's Nest\n436 W. Delaware Street\nToledo, OH 43610\nPhone: 419.321.1835\nFax: 419.321.1837\nMAC STREET CAFE\n\n1501 Monroe Street (Inside the Life Revitalization Center)\nToledo, OH 43604\n\nMeals served daily\nBreakfast 7 8:30 a.m.\nLunch 12 1:30 p.m.\nDinner 5:00 6:30 p.m.\nPhone: 419.214.3007\n\n"
	},
	{
		"addressLine1": "312 W. Huron St",
		"city": "Ann Arbor",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48103",
		"name": "Shelter Association of Washtenaw County",
		"organization": "Shelter Association of Washtenaw County",
		"phone": "(734) 662-2829",
		"website": "http://www.annarborshelter.org/",
		"description": "Shelter Association of Washtenaw County at the Delonis Center\nHours of Operation:\nAdministration: 8:00 am - 4:30 pm Monday - Friday\nPrograming: 24/7 365 day per year\n\nThe Shelter Association is housed at the Robert J. Delonis center on the edge of downtown Ann Arbor and operates 24 hours a day, 365 days a year.\n\nResidential Program\nUp to 75 individuals can be enrolled in the Residential Program at any one time. Residential Program residents have full access to our Non-Residential Program services and participate in intensive case management to help them overcome individual barriers.\n\nNon Residential Program\nFor people who are experiencing homelessness but who are not participating in our Residential Program, the Non-Residential Program provides a wide range of services on a walk-in or appointment basis.\nWe offer temporary housing and supportive services in a safe, caring environment."
	},
	{
		"addressLine1": "230 13th street",
		"city": "Toledo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "43604",
		"name": "St. Paul's Community Center",
		"organization": "St. Paul's Community Center",
		"phone": "(419) 255-5520",
		"website": "https://spccdev.stpaulscommunitycenter.org/",
		"description": "St. Paul's offers a variety of programs targeted to helping individuals in need. For the Shelter, call 211 and follow the prompts, for the Lunch Program and Supportive Services, just walk-in during designated hours, for the Payee Program, call 419 255 5520 ext. 215\n\nSt. Paul's specializes in servicing adults and/or individuals with severe mental illness\n\n\nSt. Paul's aims at shortening the length of stay at St. Paul's as we believe that every individual is entitled to housing. The maximum length of stay is 90 days\n\n\nShelter\nOur Shelter program provides more than 12,000 nights of shelter to the homeless each year. 90% of shelter residents are severely and persistently mentally ill.\nBeyond food, shelter and basic needs, we also provide case management focused on permanent housing solutions and guidance on how to navigate community resources.\nOur 35 Bed Facility provides:\nSafe temporary/emergency shelter for men and women.\nAssistance in resolving issues related to homelessness\nStaff with links to treatment, support services and permanent housing\n\nPriority is given to homeless individuals with severe and persistent mental illness\n\n\nTransitional Housing\nThe Dwelling Place is a 12-one bedroom apartment complex that provides transitional housing for up to 24 months. With the assistance of staff, residents learn the necessary skills to live in-dependently and become self-sufficient\n\nSupportive housing program\nHome Base:\n16-apartment facility accommodating single men and women.\nMedication monitoring assisting clients with treatment compliance.\n\nSupport services helping residents acquire necessary life skills and resources to maintain independent living."
	},
	{
		"addressLine1": "1705 Washtenaw Avenue",
		"city": "Ann Arbor",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48104",
		"name": "Ozone House",
		"organization": "Ozone House",
		"phone": "(734) 662-2265",
		"website": "http://ozonehouse.org/",
		"description": "Temporary shelter for youth, ages 10-17. Longer term transitional living 17-21.\nOther services available.\n\nWe offer 24 Hour support and resources for youth, and those who care about youth, any time, day or night, at (734) 662-2222.\n\nDrop-In Center\nIf you are 13-20 years old, you are welcome here if you want or need to:\nHang out at a safe place\nEat a hot meal\nMeet people\nTalk to someone\nGet food from the pantry\nDo laundry\nTake a shower\nUse computers & phones\nPlay games\nGet toiletries\nGet more info or help\nTalk to a job coach\nJust drop in when were open.\n\nDrop-In Center Hours:\nMonday 4-6pm\nTuesday 4-6 pm\nWednesday 4-6 pm (Pride Zone: 6-8pm)\nThursday 4-8 pm\nFriday 4-6 pm\nMeals: served between 4 and 4:30 every weekday.\nCall 734-485-2222 for more information about the Drop-In Center."
	},
	{
		"addressLine1": "414 S. Blackstone",
		"city": "Jackson",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49201",
		"name": "Jackson Interfaith Shelter",
		"organization": "Jackson Interfaith Shelter",
		"phone": "(517) 789-8735",
		"website": "http://www.springarborfm.org/serve/community/our_agency_partners/jackson_interfaith_shelter/",
		"description": "The Jackson Interfaith Shelter is a 90 day emergency shelter for men, women and children. The men's dorm has 32 beds and the women & children's dorm has 44 beds.\n\nClients may reside at the shelter for 90 days. Wake up time is 7am and the curfew is 10 pm. Clients who are employed will be granted late passes. All clients are expected to complete two hours of chores daily and assist with meal clean up. There is no fee to reside at the shelter. Clients are expected to meet with management to formulate a discharge plan for permanent housing."
	},
	{
		"addressLine1": "915 North Erie St",
		"city": "Toledo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "43604",
		"name": "Beach House Family Shelter",
		"organization": "Beach House Family Shelter",
		"phone": "(419) 241-9277",
		"website": "http://www.lfhtoledo.org/",
		"description": ""
	},
	{
		"addressLine1": "435 Eastern Ave",
		"city": "Toledo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "43609",
		"name": "La Posada Family Emergency Shelter",
		"organization": "La Posada Family Emergency Shelter",
		"phone": "(419) 244-5931",
		"website": "https://catholiccharitiesnwo.org/la-posada/",
		"description": ""
	},
	{
		"addressLine1": "706 West Michigan Ave",
		"city": "Jackson",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49204",
		"name": "Aware Shelter",
		"organization": "Aware Shelter",
		"phone": "(517) 783-2861",
		"website": "https://www.awareshelter.org/",
		"description": "Services:\n- Emergency shelter\n- Domestic violence shelter\n- Advocacy and counseling\n- 24 hour crisis services\n- Safety planning\n- Kids Club\n- Sexual Assault Response Team\n\n\n"
	},
	{
		"addressLine1": "122nd Avenue",
		"city": "Allegan",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "00000",
		"name": "HARA Allegan, MI",
		"organization": "HARA Allegan, MI",
		"phone": "(269) 686-4703",
		"website": "",
		"description": "ALLEGAN COUNTY COMMUNITY MENTAL HEALTH SERVICES provides a HARA contact: Housing Assessment and Resource Agency.\n\nOffice hours: Mondays through Fridays 8am to 5pm.\n\nThose experiencing homelessness in Allegan County. Can provide rent and security deposits to those who qualify: must be homeless living on the streets or in a shelter, or facing an eviction with 14 days or less to vacate the unit, and have income less than 30% Area Median Income."
	},
	{
		"addressLine1": "1215 W. North Street",
		"city": "Kalamazoo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49006",
		"name": "Open Doors Shelter For Women",
		"organization": "Open Doors Shelter For Women",
		"phone": "(269) 349-2119",
		"website": "https://twitter.com/OpenDoorShelter",
		"description": "Emergency Shelter for single women only. Between ages 17 and 35. Call, 24 hours a day.  (If answering machine picks up, follow instructions)"
	},
	{
		"addressLine1": "448 N. Burdick Street",
		"city": "Kalamazoo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49007",
		"name": "Kalamazoo Gospel Mission",
		"organization": "Kalamazoo Gospel Mission",
		"phone": "(269) 345-2974",
		"website": "https://www.kzoogospel.org/",
		"description": "Women's Shelter\nGood Samaritan\nThe Good Samaritan program is the first level of our shelter services. It offers any woman a safe place to sleep for the evening. In addition to a place to sleep, we offer three meals a day, laundry services, hygiene products and clothing vouchers to the Rescued Treasures store.\n \nShelter\nThe second level of our the women's shelter is our general Shelter, which is divided into three parts: Single's Dorm, Women's Dorm and Family Shelter. This program offers more stability and is a short term solution for women, children and families looking for emergency housing. This program offers the basic needs of Good Samaritan, along with one-on-one staff support, free childcare and job and housing assistance.\n\nMen's Shelter\nGood Samaritan\nThe Good Samaritan program is the first level of our shelter services. It offers any man a safe place to sleep for the evening. In addition to a place to sleep, we offer three meals a day, laundry services, hygiene products and clothing vouchers to the Rescued Treasures store.\n \nShelter\nThe second level of our men's shelter is our general Shelter. This is an army-style sleeping arrangement, large enough for 88 men. This program offers more stability and is a short term solution for men looking for emergency housing or a fresh start. This program offers the basic needs of Good Samaritan, along with one-on-one staff support and job and housing assistance.\n"
	},
	{
		"addressLine1": "500 N. Edwards",
		"city": "Kalamazoo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49007",
		"name": "Ministry with Community Day Shelter",
		"organization": "Ministry with Community Day Shelter",
		"phone": "(269) 343-6073",
		"website": "http://www.ministrywithcommunity.com/",
		"description": ""
	},
	{
		"addressLine1": "353 East Michigan Avenue",
		"city": "Kalamazoo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49007",
		"name": "YWCA Domestic Assault Program",
		"organization": "YWCA Domestic Assault Program",
		"phone": "(269) 385-3587",
		"website": "http://ywcakalamazoo.org/",
		"description": "Emergency Shelter Domestic Violence Victims Only.\n\nVictims with or without dependent children who have experienced domestic violence from a partner or ex-partner in an intimate relationship. Call or Walk-in, M-F, business hours.  Shelter available 24 hours a day through crisis line."
	},
	{
		"addressLine1": "356 Fairbanks Avenue",
		"city": "Holland",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49423",
		"name": "Holland Rescue Mission",
		"organization": "Holland Rescue Mission",
		"phone": "(616) 396-2200",
		"website": "https://www.hopefoundhere.org/",
		"description": "Emergency Shelter Families/Singles"
	},
	{
		"addressLine1": "990 W. Kilgore",
		"city": "Kalamazoo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49008",
		"name": "Ark-For Youth",
		"organization": "Ark-For Youth",
		"phone": "269-343-8765",
		"website": "http://www.catholicfamilyservices.org/",
		"description": "The Ark Shelter is open 24 hours a day, 7 days a week. No fee for services.\n\n24/7 voluntary short-term (21-day maximum) crisis intervention shelter for youth ages 10-17 who are homeless, have run away from home or are experiencing a crisis in their lives.\nService Area:\nResidents of Allegan, Barry, Berrien, Branch, Calhoun, Cass, Kalamazoo, St. Joseph and Van Buren counties.\n\nIf you or someone you know is homeless, has run away from home or needs immediate help, call the 24 hour crisis hotline at 1-800-873-8336.\n\n\n\n"
	},
	{
		"addressLine1": "1207 Oakland Dr",
		"city": "Kalamazoo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49007",
		"name": "Kalamazoo Overnight shelter - Oakland House Shelter",
		"organization": "Kalamazoo Overnight shelter - Oakland House Shelter",
		"phone": "(269) 532-1270",
		"website": "http://kazoocmh.org/",
		"description": "Short Term Emergency Shelter for hard to serve homeless. Call or walk in.\n\nKalamazoo Community Mental Health and Substance Abuse Services\n\n\nThe KCMHSAS Housing Recovery Center (HRC) functions to assist individuals with finding and maintaining safe, accessible, and affordable housing. The HRC provides a broad array of housing related services focused on individuals with a mental health and/or substance use issue.\n \nServices Available Include:\n    Outreach to individuals living in an emergency shelter or places not meant for human habitation\n    Initial connections and relationship building using a peer support model\n    Short term \"shelter\" at the Oakland House\n    Referrals to mainstream services including mental and physical health services, social services, transportation, expedited application for disability status, and permanent housing assistance\n    Direct assistance with setting housing goals and seeking and accessing all potential housing resources\n    Rental assistance payments\n    Post housing supports\nContact Us\nFor access to the Outreach Team, Oakland House Shelter, please  (269) 532-1270.\nFor information related to KCMHSAS supportive permanent housing programs please contact Main Housing Line at (269) 364-6945."
	},
	{
		"addressLine1": "416 Ranney Street",
		"city": "Kalamazoo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49001",
		"name": "The Open Door Shelter for Men",
		"organization": "The Open Door Shelter for Men",
		"phone": "(269) 345-1431",
		"website": "http://www.opendoorskalamazoo.org/",
		"description": "Men only. Must be 17  years old to 35 years old. Call, 24 hours a day.  (If answering machine picks up, follow instructions).\n\nThe Open Door is a residential program for men who have nowhere to live.\nMen in the program concentrate on becoming financially stable and self-supporting.  Men who do not have jobs search full time for employment.  Those who do have jobs save one-third of every paycheck for their future housing costs.  Men who are struggling with substance abuse or addiction make and keep a personal recovery plan involving 12-step groups.  Men who have not completed high school get connected with a program to earn a GED.\n\nAt the Open Door, men are assigned a bed and dresser.  Food and personal hygiene supplies are provided free of charge.  Bus tokens are provided free of charge to men who are looking for work.\n\nEvery man is expected to do one daily chore assigned by the staff to keep the house clean and in good order.  Curfew, seven days a week, is 9:30 pm.  Men must be out of the house working or looking for work every weekday from 9 am to 3 pm.\n\nIf you are homeless and interested in doing the hard work to become self-supporting, we would like to support you in your efforts."
	},
	{
		"addressLine1": "1001 W. Washington St.",
		"city": "St. Louis",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48880",
		"name": "Gratiot County Hope House",
		"organization": "Gratiot County Hope House",
		"phone": "(989) 948-0404",
		"website": "https://www.gchopehouse.org/",
		"description": "Currently open for 2019 season.. 11/5/2019.\n\nGuests can begin checking in at 6 p.m. All are required to go through background checks.\n\nThey have the use of a common area between 1 and 5:30 p.m. Those who are not currently working are encouraged to seek employment, permanent living quarters and other services during the day.\n\n\nHope House officials conduct a review of guests every 30 days and they can be asked to leave depending on their circumstances.\n"
	},
	{
		"addressLine1": "3022 US 23 South Suite D",
		"city": "Alpena",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49707",
		"name": "Hope Shores Alliance",
		"organization": "Hope Shores Alliance",
		"phone": "(989) 356-2560",
		"website": "http://hopeshores.org/",
		"description": ""
	},
	{
		"addressLine1": "622 W. Chisholm",
		"city": "Alpena",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49707",
		"name": "Sunrise Mission",
		"organization": "Sunrise Mission",
		"phone": "(989) 356-1277",
		"website": "https://www.facebook.com/Sunrise-Mission-112595327110058/",
		"description": "Emergency Shelter"
	},
	{
		"addressLine1": "115 Deyarmond Rd",
		"city": "Mio",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48647",
		"name": "Lydia's Gate Mio",
		"organization": "Lydia's Gate Mio",
		"phone": "(989) 826-5588",
		"website": "http://www.lydiasgate.org/",
		"description": "Lydia's Gate is a faith-based emergency shelter for women and children in Northern Michigan without a place to stay. We provide temporary housing, help with navigating community services, and emotional and spiritual support.\n\n11 beds, emergency shelter for women and children."
	},
	{
		"addressLine1": "219 W River Rd",
		"city": "Oscoda",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48750",
		"name": "Emmanuel Mission",
		"organization": "Emmanuel Mission",
		"phone": "(989) 739-5751",
		"website": "https://www.facebook.com/oscodamission/",
		"description": "This is a ten bed facility in back of a church that is for ages 18 and over. Men, women, and families are welcomed if there is room. Overnight only. Open 5PM to 8AM. OVERNIGHT STAFF. Full Gospel Church at 115th Street is now closed. This is the new location run by a different church."
	},
	{
		"addressLine1": "101 South Huron Street",
		"city": "Ypsilanti",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48197",
		"name": "SOS Community Services - Family Shelter Program",
		"organization": "SOS Community Services - Family Shelter Program",
		"phone": "(734) 485-8730",
		"website": "http://www.soscs.org/",
		"description": "SOS gives special attention to the needs of homeless women, men and their children - the largest segment of the homeless population. In Washtenaw County alone, an estimated 1,500 families are homeless. Every year, our Prospect Place Family Shelter program provides warm, safe temporary housing (up to 120 days) for more than 25 of those families, including close to 100 children. We provide distressed families with concrete help today and hope for tomorrow.\n\nEvery family in the SOS shelter program has access to intensive case management and supportive services, including support groups, employability and educational supports, child care, therapeutic services, and substance abuse treatment - all at no cost. As part of our intensive case management, adults meet with SOS case managers who help them to identify barriers to self-sufficiency and develop concrete plans for addressing those barriers. Families also gain access to other community resources that help them to avoid further homelessness.\n\n"
	},
	{
		"addressLine1": "120 East 32nd Street",
		"city": "New York City",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "10016",
		"name": "Grand Central Neighborhood Social Services Corporation (GCNSSC)",
		"organization": "Grand Central Neighborhood Social Services Corporation (GCNSSC)",
		"phone": "(212) 883-0680",
		"website": "http://www.nycservice.org/organizations/25",
		"description": "The Grand Central Neighborhood Social Services Corporation's Multi-Service Drop-in Center serves a street homeless population of single adults.\nThose who use our center range from 18 to 75 years of age.\n\nGCNSSC currently provides services to over 300 homeless adults each day, on average. These include: basic services, perhaps the most important of which are food, clothing, showers, a place to sit, and basic medical services. Beyond that we provide a wide range of social services that include assessment and referral to treatment programs; outreach through street contacts and Network Fairs; shelter and housing placement; job-training and job placement programs; yoga; chiropractic care and much more.\nAdditionally, our kitchen serves 3 meals a day, 7 days a week and the doors to our center are always open to those in need.\n\nPart of our mission is to help the homeless expand their own resources and build networks and skills to achieve their goals.\nWe also work to expand the institutional resources dedicated to helping the homeless by networking with members of our community and local providers as well as educational institutions."
	},
	{
		"addressLine1": "296 9th Avenue",
		"city": "New York City",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "10001",
		"name": "Soup Soul - Holy Apostles Soup Kitchen",
		"organization": "Soup Soul - Holy Apostles Soup Kitchen",
		"phone": "(212) 924-0167",
		"website": "https://holyapostlessoupkitchen.org/",
		"description": ""
	},
	{
		"addressLine1": "400 E 30th St",
		"city": "Manhattan",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "10016",
		"name": "New York City 30th Street Intake For Homeless Men",
		"organization": "New York City 30th Street Intake For Homeless Men",
		"phone": "(718) 557-1399",
		"website": "https://www.coalitionforthehomeless.org/resources/30th-street-mens-shelter/",
		"description": "Intake facility for Homeless men in New York City.  Intake is open 24 hours a day.\n\nHomeless individuals who have been in a shelter in New York City within the past 12 months should go to that shelter where they stayed. If not, they need to go to this intake facility.\n\n\nThe intake facilities for single adults are open 24 hours, seven days a week, including holidays. Bringing ID is strongly suggested, though not required. The following forms of ID are very helpful during the intake process:\n\nAny form of ID with a picture and proof of age - such as a driver's license, state-issued ID, passport or visa, welfare card or green card\nSocial Security card\nMedicaid card, if available\nIf working, your most recent pay stub\n\nInterpreter assistance will be made available for people who do not speak English.\n\nDial 311 to receive directions and other information on this intake center.\n\nHow to Get There:\nSubway: Take the 6 train to 28th Street. Walk east to 1st Avenue, turn left, and go north to 30th Street. Entrance is now at 30th Street and 1st Avenue.\n\nAfter visiting an intake center, trained social services and professional staff will assess your unique needs and assign you to a shelter with expertise in addressing those needs. All programs are designed to help clients overcome homelessness.\n\n\nSome of DHS programs include counseling, case management, employment training, mental health rehabilitation, specialized services for veterans, substance abuse treatment, and various programs for the elderly. Social workers, employment specialists, housing/vocational counselors, and health coordinators work closely with clients in an individualized approach that aims to provide clients with the skills needed to achieve the highest level of self-sufficiency."
	},
	{
		"addressLine1": "127 West 25th Street, 6th to 9th Floors",
		"city": "New York",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "10001",
		"name": "Jack Ryan Residence (Chelsea, Manhattan)",
		"organization": "Jack Ryan Residence (Chelsea, Manhattan)",
		"phone": "(212) 803-5700",
		"website": "https://www.brc.org/transitional-housing-shelter",
		"description": ""
	},
	{
		"addressLine1": "148 East Michigan",
		"city": "Battle Creek",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49017",
		"name": "Haven of Rest Rescue Mission",
		"organization": "Haven of Rest Rescue Mission",
		"phone": "(269) 788-0960",
		"website": "http://www.thehavenbc.org/mensshelter.html",
		"description": "Haven of Rest provides emergency food and shelter to homeless men. It provides temporary emergency shelter where individuals stay between 30 to 60 days.\n\nServices provided:\nChance for a new startFood and ShelterLife Skills ClassesOn-Site Case Management For:            - Permanent Housing\n            - Employment Assistance\n            - GED Training\n            - Obtain a Michigan ID or Driver's License\n            - Social Security Card\n            - Finance and Budget Training\n            - Spiritual Connection\n            - Re-establishing Relationships\n            - Referral Services for: Medical, Psychological and Legal Assistance\n\n\nPlease contact (269)788-0969 for additional information or if you have further questions.\n\n"
	},
	{
		"addressLine1": "11 Green Street",
		"city": "Battle Creek",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49014",
		"name": "Inasmuch House Haven of Rest",
		"organization": "Inasmuch House Haven of Rest",
		"phone": "(269) 965-1148",
		"website": "http://www.thehavenbc.org/inasmuch.html",
		"description": ""
	},
	{
		"addressLine1": "P.O. Box 199",
		"city": "Battle Creek",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49016",
		"name": "S.A.F.E. Place Shelter",
		"organization": "S.A.F.E. Place Shelter",
		"phone": "(269) 966-7233",
		"website": "http://www.safeplaceshelter.org/",
		"description": "S.A.F.E. Place is committed to helping victims of domestic violence and their families in Calhoun, Barry, and Eaton Counties. We offer a range of social intervention and advocacy services. S.A.F.E. Place stresses early intervention, strengthening families, and providing a continuum of care through community resources and referrals.\n\nS.A.F.E. Place provides shelter, court advocacy, referrals and comprehensive counseling programs for victims of domestic violence and their children who have been physically, verbally, or emotionally abused\n\nShelter\nS.A.F.E. Place is a 56-bed emergency domestic violence shelter located in Battle Creek, Michigan. Our shelter is open and a crisis line is in operation 365 days a year, 24 hours a day. We provide all services free of charge.\nShelter advocates offer support services which help survivors to make informed choices in an environment of support and security. Participation in any or all programming is optional.\n\nDuring a shelter stay, we will provide food, clothing, and other basic needs.\n\nCounseling\nCounseling services are offered to all survivors of domestic violence and their dependent children. This includes shelter guests as well as those living elsewhere. Our program provides one-on-one and group counseling.\n\nLegal Advocacy\nS.A.F.E. Place's Legal Advocates assist victims with obtaining Personal Protection Orders (PPO's), understanding the court process, providing court accompaniment, assisting with filing for crime victim's compensation, and making appropriate legal referrals.\n\nSTOP Program\nThe Calhoun County STOP program is a partnership with the Calhoun County Prosecutors Office, law enforcement, the court and service providers that works to strengthen existing support systems serving battered individuals and their children. This is done by developing and sustaining a coordinated, broad-based community response committed to enhancing and improving the prevention, intervention, and elimination of domestic violence.\n\nSupportive Housing\nS.A.F.E. Place's CLASS (Climbing the Ladder to Achieve Self-Sufficiency) Program assists survivors of domestic violence and their children to maintain safe and affordable housing. The program serves approximately 7 families at a time."
	},
	{
		"addressLine1": "3408 Miller Road",
		"city": "Kalamazoo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49001",
		"name": "Pagans In Need - SW Michigan",
		"organization": "Pagans In Need - SW Michigan",
		"phone": "(269) 340-1101",
		"website": "https://pagansinneed.org/",
		"description": "Operating hours are 9:30 am - 12:30 pm on the 1st and 3rd Saturdays of the month. ELIGIBILITY: Self-Declaration of Need.We will have a selection of canned and dry goods pre-bagged to keep everyone healthy and safe. EVERYONE IS WELCOME, REGARDLESS OF RELIGION. Please register online and make us aware of any allergies in the preference section of the form: https://pagansinneed.org/service-request"
	},
	{
		"addressLine1": "713 9th Street",
		"city": "Bay City",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48708",
		"name": "Good Samaritan Rescue Mission Bay City",
		"organization": "Good Samaritan Rescue Mission Bay City",
		"phone": "(989) 893-5973",
		"website": "http://gsrmbaycity.org/",
		"description": "The Rescue Mission is a channel of Christian charity through which temporary shelter, meals, clothing, and discipleship is provided.\n\nMen's Shelter extension: 211\nWomen's Shelter extension: 210\n\nEmergency Shelter\nOur facility is equipped to house men, veterans, and women/children. We are diligent at providing a safe and clean environment for each guest, being confident that this will aide them in transitioning into independence.\n\nThe rescue mission serves men, women, and children from all walks of life. The recovering substance abuser can find assistance for their addiction, temporary shelter is provided for the single parent in their time of crisis.\n\nIn addition to emergency shelter, meals, and clothing, the Rescue Mission provides one-on-one assistance. Women staff provide personal guidance to female guests who often come from traumatic situations. Likewise, male staff provide guidance for male guests. Our program is tailored to the individual."
	},
	{
		"addressLine1": "1205 Norman St",
		"city": "Saginaw",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48601",
		"name": "Restoration Community Outreach",
		"organization": "Restoration Community Outreach",
		"phone": "(989) 753-1886",
		"website": "mailto:d.shuell@yahoo.com",
		"description": "Established in 1990 by Betty J. Martin RCO is a 24-7 facility for homeless men. We provide alternative housing for up to two years along with counseling and proper guidance for men to re-establish themselves in society."
	},
	{
		"addressLine1": "1205 Norman St",
		"city": "Saginaw",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48602",
		"name": "Safe Haven",
		"organization": "Safe Haven",
		"phone": "(989) 753-1886",
		"website": "http://www.rcoshelter.org/safe-haven",
		"description": "Safe Haven\n\nThe Safe Haven program provides immediate emergency shelter to individuals with severe mental disabilities and chronic drug abuse issues.  There are 3, 2 bed units for a total of 6 beds dedicated to this program. This form of support serves hard to reach homeless persons who are on the street and have been unable or unwilling to participate in housing or supportive services.\n\n \nSafe Havens serve as a portal of entry providing basic needs such as food, showers and clothing as well as a safe and decent residential alternative for homeless people with severe mental illness who need time to adjust to life off the streets and to develop a willingness and trust to accept services in order to transition to permanent housing."
	},
	{
		"addressLine1": "1021 Burt St.",
		"city": "Saginaw",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "00000",
		"name": "City Rescue Mission Of Saginaw",
		"organization": "City Rescue Mission Of Saginaw",
		"phone": "(989) 752-6051",
		"website": "https://www.twitter.com/saginawthrift",
		"description": "City Rescue Mission Of Saginaw is a food pantry. .\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
	},
	{
		"addressLine1": "645 Pipestone Street",
		"city": "Benton Harbor",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49022",
		"name": "Emergency Shelter Services Inc.",
		"organization": "Emergency Shelter Services Inc.",
		"phone": "(269) 925-1131",
		"website": "https://www.essberrien.org/shelter",
		"description": ""
	},
	{
		"addressLine1": "233 Michigan Street",
		"city": "Benton Harbor",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49022",
		"name": "Salvation Army Men's Shelter",
		"organization": "Salvation Army Men's Shelter",
		"phone": "(269) 927-1353",
		"website": "https://www.twitter.com/SA_BentonHarbor",
		"description": "They offer meals and clothing for men only."
	},
	{
		"addressLine1": "185 E Main Street",
		"city": "Benton Harbor",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49022",
		"name": "Southwest Michigan Community Action Agency",
		"organization": "Southwest Michigan Community Action Agency",
		"phone": "(616) 925-9077",
		"website": "https://www.facebook.com/swmicaa",
		"description": "Emergency Shelter Days only"
	},
	{
		"addressLine1": "813 S. Michigan Street",
		"city": "South Bend",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "46601",
		"name": "Center for the Homeless",
		"organization": "Center for the Homeless",
		"phone": "(219) 282-8700",
		"website": "https://www.cfh.net/",
		"description": "Our Programs\n1. Emergency Shelter:\nWhen a guest first comes to the Center Crisis Intervention, Orientation and Assessment are provided.\nGuests who will go on to programming at the Center have a Coach who assists in developing and implementing a self-sufficiency plan. The following services are available as needed throughout the stay: Adult Basic Education, Relationship Counseling, Mental Health and Substance Abuse Treatment, Peer Mentoring, Abuse Counseling, Debt Reconciliation and Budgeting.\n\n\n2. Personal Development and Education: Starting Over/Stepping Higher Program (SOSH)\nCurriculum includes: stress management, living an integrated life, team leadership, goal setting and daily programming addressing the whole person (mental, emotional, physical and spiritual).\n\n\n3. Job Training and Placement: STAR (Skilled, Trained, Able and Ready)\nCurriculum includes: job readiness, externships, job retention and job search.\n\n4. Transitional Housing: On-site\nOpportunities Include: After Five and Breakfast Club (peer support groups), job search and retention, saving 75% of income, debt reduction.\n\n5. Housing in the Community\nGuests secure affordable housing, participate in outreach case management, volunteer in the community and mentor guests at the Center.\n\n6. Homeownership\nGuests move into stable neighborhoods with low mortgage payments and serve as community volunteers and mentors."
	},
	{
		"addressLine1": "1717 W 13 Mile Rd",
		"city": "Royal Oak",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48073",
		"name": "Welcome Inn Day Center - South Oakland Citizens for the Homeless",
		"organization": "Welcome Inn Day Center - South Oakland Citizens for the Homeless",
		"phone": "(248) 850-3219",
		"website": "http://www.sochwi.org/",
		"description": "Hours:\nWelcome Inn: Monday - Friday, 7:00am - 7:00pm\nOvernight Hosts: 7-days a week, 7:00pm - 7:00am\nTuesdays 10:00AM - 3:00PM, for showers, food, clothing referrals etc.\n"
	},
	{
		"addressLine1": "18505 W 12 Mile Road",
		"city": "Lathrup Village",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48073",
		"name": "South Oakland Shelter (SOS)",
		"organization": "South Oakland Shelter (SOS)",
		"phone": "(248) 809-3773",
		"website": "http://www.southoaklandshelter.org/",
		"description": "SOS's Emergency Shelter Program for women, men, and children.\nWhile SOS recognizes that emergency shelter is not a permanent solution to homelessness, we believe providing emergency shelter services is a critical part of the process. With over 3,000 individuals homeless in Oakland County on any given night, our emergency rotating shelter remains an essential program and a cornerstone of our work.\n\nThanks to partnerships with over 60 Oakland County congregations, SOS successfully operates a year-round rotating emergency shelter servicing individuals and families struggling with homelessness. Each week, a different congregation takes on the responsibility of hosting SOS's shelter guests. The congregations open their doors and provide our guests with overnight accommodations, three daily meals, transportation, and meaningful interactions with caring volunteers. Since our founding, SOS's emergency shelter has cared for over 10,650 adults and 1,360 children. Annually, over 8,000 SOS volunteers commit approximately 42,000 hours of in-kind support to provide over 34,000 meals and 11,000 nights of shelter.\nIn Need of Emergency Shelter?\nWe take calls for shelter Sunday through Friday at 10:00 a.m. For a list of other emergency shelter in our area\n\n\nSOS helps displaced community members break free from the cycle of homelessness.\nMission\nTo reduce the prevalence and impact of homelessness in the communities of Southeast Michigan\nDescription\nFor over 25 years, South Oakland Shelter (SOS) has worked with its 67 partner congregations to provide temporary lodging and supportive services that help homeless individuals and families break the cycle of homelessness, and live independently. With an emphasis on homeless prevention, sustainable housing solutions, and career development, SOS implements strategies and programs that provide realistic options for homeless and at-risk individuals and families seeking stabilization and self-sufficiency."
	},
	{
		"addressLine1": "405 South 3rd Ave",
		"city": "Big Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49307",
		"name": "Our Brothers Keeper Shelter",
		"organization": "Our Brothers Keeper Shelter",
		"phone": "231-629-8160",
		"website": "https://www.obkshelter.org/",
		"description": "Open all year long and 24/7.\nNew guests may check in 7 days a week between 8:00 am - 8:00 pm.\nProvides temporary housing for the homeless looking for safety or a place to stay as they transition into permanent housing.\nAmenities:\nClean bedding\nLimited storage for personal belongings\nAccess to a fridge and microwave,\n3 meals a day,\nSitting area for computer use\nHousing, employment, and health services access\nNotes:\n8:00 pm curfew for current guests\nSeparate sleeping facilities for women and men\n3 rooms for homeless families\nBe sure to check the website listed and/or call to see if they are open before visiting.\n"
	},
	{
		"addressLine1": "118 Osceola ledge",
		"city": "Leroy",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49655",
		"name": "Helping Hand of Christ of Christ",
		"organization": "Helping Hand of Christ of Christ",
		"phone": "(231) 388-0997",
		"website": "mailto:Zoecourtemanche@Gmail.com",
		"description": "4 bed shelter for transgenders and women smoking allowed"
	},
	{
		"addressLine1": "3337 1st St.",
		"city": "Weidman",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48893",
		"name": "Robert Griffus Ministries",
		"organization": "Robert Griffus Ministries",
		"phone": "989-317-6366",
		"website": "http://www.openarmsministrycenter.webs.com/",
		"description": "We still are needing a building and were working on funding to get a place of establishment. We are still helping out with food and clothing and other resources as needed."
	},
	{
		"addressLine1": "4874 Meyer Ave",
		"city": "Cadillac",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49601",
		"name": "New Hope Center",
		"organization": "New Hope Center",
		"phone": "(231) 468-2022",
		"website": "http://www.newhopecadillac.org/",
		"description": "Tel: 231.468.2022 - Women's Shelter\nTel: 231.775.3702 - Men's Shelter\n"
	},
	{
		"addressLine1": "601 Chestnut Street",
		"city": "Cadillac",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49601",
		"name": "Oasis Shelter and Family Resource Center",
		"organization": "Oasis Shelter and Family Resource Center",
		"phone": "(231) 775-7299",
		"website": "https://www.facebook.com/OASISFRC/",
		"description": "Emergency Shelter"
	},
	{
		"addressLine1": "801 State Street",
		"city": "Charlevoix",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49720",
		"name": "Joppa House",
		"organization": "Joppa House",
		"phone": "(231) 330-2643",
		"website": "https://joppahouseministries.org/",
		"description": "Joppa House is a transitional house model for women in recovery and their families by providing them a safe, rehabilitative environment. Women will learn about sober living skills, and peer-to-peer fellowship. Also, they will have the support needed to gain strength to transition back into the community along with their families. The main goal is to empower them so that they can sustain a life free from addiction.\n\n\nRequirements for women to be considered for residence:\n18 years or older\nNo longer be in high schoolIn active recovery for substance abuse disordersClear of pending court sentencing.Able to show a negative drug test upon intake\n\nPlease note that an application must be filled out. Contact the office for additional information.\n"
	},
	{
		"addressLine1": "423 Porter Street",
		"city": "Petoskey",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49770",
		"name": "Women's Resource Center",
		"organization": "Women's Resource Center",
		"phone": "(231) 347-0067",
		"website": "http://www.wrcnm.org/",
		"description": "Domestic Violence Victims Only Domestic violence safehouse shelter for women and children."
	},
	{
		"addressLine1": "36 Bridge St.",
		"city": "Petoskey",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49770",
		"name": "Nehemiah Project Shelter",
		"organization": "Nehemiah Project Shelter",
		"phone": "(231) 347-0363",
		"website": "http://www.nehemiahshelters.org/",
		"description": ""
	},
	{
		"addressLine1": "10100 S. Clare Ave",
		"city": "Clare ",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48625",
		"name": "Oakbridge Inn LLC",
		"organization": "Oakbridge Inn LLC",
		"phone": "(989) 798-3338",
		"website": "mailto:davidhoman3050@gmail.com",
		"description": "We are here to help Veterans with all their needs\nWe accommodate only males at this time, we have 4 beds per room, in each room is one restroom."
	},
	{
		"addressLine1": "508 E. 5th Street",
		"city": "Clare",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48617",
		"name": "Joshua's House - Maternity Home",
		"organization": "Joshua's House - Maternity Home",
		"phone": "(833) 424-2229",
		"website": "http://www.joshuashouseint.org/",
		"description": "Maternity Home\n\n"
	},
	{
		"addressLine1": "63 W. Washington St.",
		"city": "Coldwater",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49036",
		"name": "Family Promise of Branch County",
		"organization": "Family Promise of Branch County",
		"phone": "(517) 278-0928",
		"website": "https://www.facebook.com/pages/Family-Promise-of-Branch-County/490897424259290",
		"description": "Family Promise of Branch County works with 11 host churches and more than 12 partner churches to provide a meal and overnight housing to the homeless."
	},
	{
		"addressLine1": "600 Williams Street",
		"city": "Angola",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "46703",
		"name": "Turning Point of Steuben County",
		"organization": "Turning Point of Steuben County",
		"phone": "(260) 665-9191",
		"website": "https://www.turningpointsteuben.org/",
		"description": "Men and Women's shelter. Serves the transient population, domestic violence clients. Two kitchens, outdoor area, laundry facilities, stocked pantry.\n\nMust live in Steuben County and not have a sexual or violent crime offense conviction.\n\nCall to check availability.\n\nCan stay up to 60 days.\n\nTurning Point is currently in use every day with occupancy ranging from 1 to 40 people per night. Individuals or families may be referred to Turning Point by local Clergy, Social Service Agencies, or Area Law Enforcement Departments. Before any individual can enter Turning Point, he or she must pass a Police Security Check. Each individual's stay at Turning Point is evaluated on a daily basis. The expectation is that residents are to be employed or actively seeking employment. The operation of Turning Point is conducted under specific rules for occupants. Failure to follow the rules will result in dismissal from the facility.\n"
	},
	{
		"addressLine1": "11745 Rosa Parks Boulevard",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48206",
		"name": "Cass Community Social Services",
		"organization": "Cass Community Social Services",
		"phone": "(313) 883-2277",
		"website": "https://casscommunity.org/",
		"description": "If you are experiencing homelessness or know of someone who needs help, Cass has an emergency outreach line to assist. Please call 885-9-HOMELESS (855-9-46635377).\n\nHousing\n Cass provides every type of housing in continuum care. We offer:\nWarming center: open to women and children nightly from November 15 to April 1.\n\nEmergency shelter: open year round to women and children for up to 90 days.\nRotating Shelters: open for adults between November and April. Local organizations, usually churches, host Cass clients for a week. The church provides dinner, a clean place to sleep, breakfast, and a bagged lunch. If you would like to be a shelter, please contact Polly McCalister at (313) 883-2277 ext. 501.\n\nTransitional housing: residents can stay for up to 2 years.\nPermanent supported housing: individuals can stay in an apartment indefinitely."
	},
	{
		"addressLine1": "2959 Luther King Jr. Blvd.",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48208",
		"name": "Covenant House Michigan",
		"organization": "Covenant House Michigan",
		"phone": "(313) 463-2000",
		"website": "http://www.covenanthousemi.org/",
		"description": "Emergency Shelter Teens only.\nCovenant House Michigan offers unconditional love, respect and hope to youth ages 13-22.\n\nThe kids and young adults we serve feel unloved and unwanted. They have been abused, neglected and abandoned. We find them on the streets, living in abandoned houses, cars, sleeping on friends couches, among other places. They come from all over Michigan searching for a way out of their desperate situations. Their stories are heart-breaking yet admirable. They are survivors."
	},
	{
		"addressLine1": "3535 Third Street",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48201",
		"name": "DRMM Detroit Rescue Mission Ministries Emergency Shelter and Transitional Housing",
		"organization": "DRMM Detroit Rescue Mission Ministries Emergency Shelter and Transitional Housing",
		"phone": "(313) 993-4700",
		"website": "https://drmm.org/",
		"description": ""
	},
	{
		"addressLine1": "150 Stimson Street",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48231",
		"name": "Detroit Rescue Mission",
		"organization": "Detroit Rescue Mission",
		"phone": "(313) 993-4700",
		"website": "http://www.drmm.org/",
		"description": "Emergency Shelter. Founded in 1909, The Detroit Rescue Mission Ministries has embarked upon its 100th year of continued service providing food, shelter and services to intervene upon homelessness and substance addiction throughout Detroit and its surrounding metropolitan communities.\n\nDetroit Rescue Mission Ministries provides services ranging from emergency shelter to job training. Every day, the services we provide touch the lives of more than 1,400 men, women and children in the Detroit community. The DRMM is much more than a homeless shelter or soup kitchen. Our evidence-based services address the needs of the whole individual. We assist those who are addicted to drugs and alcohol toward their goal of obtaining sobriety. We help teen mothers finish high school and learn critical parenting skills. We help those recently released from prison obtain employability skills, and find housing and gainful employment. We work with S.A.Y. Detroit/DRMM Family Health Clinic to provide free medical care to children and families. Yet, there is more that can be done\n\n\nShelter Residents stay overnight and are provided meals and the opportunity to shower and receive new clothing items. Shelter Counselors do an assessment with each resident, encourage and help residents apply for services and take steps to help them meet long term needs, and assure that clients receive emergency medical or counseling needs.\nCampus: Detroit Rescue Mission - Number: 100*\nTarget Population: Men, many of whom experience chronic homelessness and addictions.\nCampus: Genesis House III - Number: 24*\nTarget Population: Women, single and with children. Many of the women struggle with addictions or the impact of addiction in those with whom they are close.\nCampus: The Oasis - Number: 45*\nTarget Population: Men, many of whom experience chronic homelessness and addictions.\n*The numbers above represent the funded bed capacity. On many nights, the actual number staying in our shelter programs doubles."
	},
	{
		"addressLine1": "5075 Chalmers Ave",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48213",
		"name": "Eastside Emergency Center",
		"organization": "Eastside Emergency Center",
		"phone": "",
		"website": "",
		"description": "Emergency Shelter Transitional Housing - Family"
	},
	{
		"addressLine1": "10100 Harper Avenue",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48213",
		"name": "Operation Get Down",
		"organization": "Operation Get Down",
		"phone": "(313) 921-9422",
		"website": "",
		"description": "Transitional Housing - Family"
	},
	{
		"addressLine1": "1760 Mt. Elliott Ave.",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48207",
		"name": "Visions of the Sacred Capuchin Soup Kitchen",
		"organization": "Visions of the Sacred Capuchin Soup Kitchen",
		"phone": "(313) 579-2100",
		"website": "https://twitter.com/capsoupkitchen/",
		"description": "Soup Kitchen for Community"
	},
	{
		"addressLine1": "PO Box 32494",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48232",
		"name": "Transition 1.2.3. Inc.",
		"organization": "Transition 1.2.3. Inc.",
		"phone": "(877) 463-2269",
		"website": "http://www.transition123inc.org/",
		"description": ""
	},
	{
		"addressLine1": "14353 EAST CANFIELD STREET",
		"city": "DETROIT",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48224",
		"name": "GENESIS ONE TRANSITIONAL YOUTH CENTER",
		"organization": "GENESIS ONE TRANSITIONAL YOUTH CENTER",
		"phone": "(313) 459-4168",
		"website": "mailto:reniascott@aol.com",
		"description": "SHELTER FOR HOMRLESS YOUTH RANGING FROM 8-24"
	},
	{
		"addressLine1": "26 Peterboro Street Suite 100",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48201",
		"name": "COTS",
		"organization": "COTS",
		"phone": "(313) 831-3777",
		"website": "https://cotsdetroit.org/",
		"description": "Provides an array of services that enable people to achieve self-sufficiency and obtain quality affordable housing. COTS also exists to advocate for long-term solutions to the problems of homelessness.\n\nCOTS Helps Homeless People Help Themselves.\n\nCOTS exists to alleviate homelessness by providing an array of services that enable people to achieve self-sufficiency and obtain quality affordable housing. COTS also exists to advocate for long-term solutions to the problems of homelessness."
	},
	{
		"addressLine1": "2541 Lamothe St",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48206",
		"name": "Coffer Adult Foster Care Home",
		"organization": "Coffer Adult Foster Care Home",
		"phone": "(313) 320-2646",
		"website": "https://coffershousingsolutions.com/",
		"description": ""
	},
	{
		"addressLine1": "3442 McDougall",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48207",
		"name": "Open Door Rescue Mission Ministries",
		"organization": "Open Door Rescue Mission Ministries",
		"phone": "(313) 579-1825",
		"website": "http://fatherdalton.com/open-door-rescue-mission/www.opendoorrescuemission.com",
		"description": "Assistance for: Homeless; Addicted; Mentally or Emotionally Challenged."
	},
	{
		"addressLine1": "11850 Woodrow Wilson St.",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48206",
		"name": "Cass Community Social Services, Inc.",
		"organization": "Cass Community Social Services, Inc.",
		"phone": "(313) 883-2277",
		"website": "https://casscommunity.org/",
		"description": "Cass provides emergency shelter, transitional and permanent supportive housing for all populations. Supportive Services are available to hundreds of homeless persons and families each night.\n\nCass Community Social Services is Detroit-based agency dedicated to providing food, housing, health services, and job programs.\n\n\nWarming center: open to women and children nightly from November 15 to April 1.\n\nEmergency shelter: open year round to women and children for up to 90 days.\n\nRotating Shelters: open for adults between November and April. Local organizations, usually churches, host Cass clients for a week. The church provides dinner, a clean place to sleep, breakfast, and a bagged lunch. If you would like to be a shelter, please contact us at (313) 883-2277.\n\nPermanent supported housing: individuals can stay in an apartment indefinitely.\n\nTo inquire about housing, contact Deb Bracey at 313-883-2277 ext. 205.\n\nIf you are experiencing homelessness or know of someone who needs help, Cass has an emergency outreach line to assist. Please call 885-9-HOMELESS (855-9-46635377)."
	},
	{
		"addressLine1": "2015 Webb Street",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48206",
		"name": "Rescue Mission Genesis II",
		"organization": "Rescue Mission Genesis II",
		"phone": "(313) 471-1097",
		"website": "http://www.drmm.org/",
		"description": "48 women and 14 children. Women in this program often are working on substance abuse aftercare issues, addressing legal issues, and attend school and training programs to give them a future."
	},
	{
		"addressLine1": "445 Ledyard",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48201",
		"name": "Mariners Inn",
		"organization": "Mariners Inn",
		"phone": "(313) 962-9446",
		"website": "http://www.marinersinn.org/",
		"description": "The Transitional Housing (TH) Program is a supportive, semi-independent living experience available to men who have successfully completed the Mariners Inn Residential Treatment Program.\n\nThe Transitional Housing Program offers living space and meals in a recovering community of sober men for a period of usually six months and up to two years. For the clients who successfully completed the Residential Treatment Program, Transitional Housing offers the opportunity to work on all aspects of their total recovery from substance abuse and homelessness. Each individual works on his own specific goals (i.e. his particular way of being self-sufficient) established with the assistance of the TH staff.\n\nEligibility Criteria:\nHomeless\nAble to achieve self-sufficiency / independence\nSuccessful completion of a residential substance abuse treatment program\nEmployment ready\n\nCapacity: Thirty-six men\n\nResident Obligations:\nRemain completely abstinent from alcohol and other drugs\nSpend at least six hours per day seeking employment\n\nBe employed or actively seeking employment. Clients are able to enroll in school or training program but still have to be employed.\nRegularly attend NA / AA meetings (3 if employed / 5 if unemployed)\n\nAttend at least one group counseling session per week\nAttend one vocational class per week if unemployed\nBe a positive influence to the Inn's recovering community\nPay fee-for-services. Generate savings for independent living.\nMake continuing progress toward independent, sober living\n90-day probationary period to assist in transition from residential treatment program"
	},
	{
		"addressLine1": "400 Renaissance Center",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48243",
		"name": "New Path Homeless Shelter",
		"organization": "New Path Homeless Shelter",
		"phone": "(313) 924-4141",
		"website": "http://www.newpathhomelessshelter.org/",
		"description": ""
	},
	{
		"addressLine1": "5063 Van Dyke Ave.",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48213",
		"name": "Bethlehem House",
		"organization": "Bethlehem House",
		"phone": "(313) 923-6435",
		"website": "http://www.bethhouse.org/",
		"description": "Shelter for homeless working-women without children. Ages from 35-65. Must be employed and homeless. Counseling, money management and bible study. Drug and alcohol rehabilitation not available."
	},
	{
		"addressLine1": "4885 Ivanhoe",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48204",
		"name": "Derrick's Adult Foster Care",
		"organization": "Derrick's Adult Foster Care",
		"phone": "(313) 895-4405",
		"website": "mailto:dafc4885@gmail.com",
		"description": "Nice rooms with cable and storage space. Three well balanced meals, medication assistance, home doctors visits, and activities."
	},
	{
		"addressLine1": "3430 Third St.",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48201",
		"name": "NSO Tumaini Center",
		"organization": "NSO Tumaini Center",
		"phone": "(313) 832-3100",
		"website": "http://www.nso-mi.org/programs.php",
		"description": "The Tumaini Center,is a crisis support center for chronically homeless individuals. Established in 1975, we have provided services to all who enter our doors including substance abuse treatment, mental health assessment and referral, case management, emergency food, and clothing storage."
	},
	{
		"addressLine1": "7720 Grandville",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48223",
		"name": "Refuge Interntaional Inc.",
		"organization": "Refuge Interntaional Inc.",
		"phone": "(248) 430-6697",
		"website": "http://www.refugeglobalservices.org/",
		"description": "We are a link creating, and providing housing for Metro Detroit. Homes available for veterans, seniors, displaced seniors, HIV victims, and others."
	},
	{
		"addressLine1": "18701 Grand River Ste 245",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48223",
		"name": "Skyline Outreach",
		"organization": "Skyline Outreach",
		"phone": "(313) 515-6072",
		"website": "mailto:skboles19@comcast.net",
		"description": "Private rooms, shared rooms, fully furnished, kitchen, bath, laundry"
	},
	{
		"addressLine1": "18066 James Couzens Hwy",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48235",
		"name": "The Philip House Mission",
		"organization": "The Philip House Mission",
		"phone": "(313) 828-2202",
		"website": "http://www.thephiliphousemission.org/",
		"description": "emergency shelter, transitional housing, independent / supportive housing, men and women facilities, job assistance, domestic training, substance abuse prevention, case management, application/intake process,counseling.\n\nTPHM is a 501(c)3 non-profit community development corporation (CDC) that provide programs, offer services and engage in other activities that promote and support community development."
	},
	{
		"addressLine1": "7556 Wheeler St.",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48210",
		"name": "Mighty Voices of Hope Inc.",
		"organization": "Mighty Voices of Hope Inc.",
		"phone": "(313) 842-4931",
		"website": "http://www.nonprofitlist.org/cgi-bin/id/nonprofit.cgi?nonprofit=74263",
		"description": "Mighty Voices of Hope is an organization that brings awareness of the homeless situation in the metro Detroit area. Our purpose is two-fold. We currently feed and house local homeless men who used to live in vacant homes or on the street. We assist them until they can do for themselves. We also include these gentlemen in our community choir \"Mighty Voices of Hope\". We sing at many different venues around the city for donations. (We are actually very, very good!) Our audiences are very surprised to know that some of our choir members were once homeless."
	},
	{
		"addressLine1": "680 Virginia Park St",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48202",
		"name": "Matrix Off The Streets - For Homeless Teens",
		"organization": "Matrix Off The Streets - For Homeless Teens",
		"phone": "(313) 873-0678",
		"website": "https://www.matrixhumanservices.org/",
		"description": "Are you a homeless teen or thinking about running away from home?\nPlease do not hesitate to reach out to us for shelter & other services: (313) 873-0678\n\n\nMatrix Off The Streets (MOTS) (est 1986) Provides voluntary crisis intervention and supports to families and youth.\n\nShelter and Transitional Living services include safe stay, counseling, case management, transportation to and from school, life skills and opportunities for recreation. Non-residential, Street Outreach and other prevention-oriented supports are also available. Matrix Off The Streets offers services 24 hours a day, 7 days a week, to youth who are runaways, potential runaways, homeless or facing possible at-risk and crisis situations.Matrix Off The Streets, is Detroit's only voluntary, licensed, community-based, short-term emergency shelter program for youth. Services are available to both males and females between the ages of 12 and 17 who are runaway, potential runaway, homeless and throwaway youth. All services are provided by trained professional staff at no cost to the youth or their families."
	},
	{
		"addressLine1": "4813 Devonshire",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48224",
		"name": "Great Oaks Transitional Home LLC.",
		"organization": "Great Oaks Transitional Home LLC.",
		"phone": "(586) 298-2286",
		"website": "http://www.greatoaksth.org/",
		"description": "Clean, Safe, Low-Cost Supportive Housing\n\nResidency with Great Oaks is meant to bridge the gap from homelessnessto permanent housing. We assist individuals in becoming economicallyself-sufficient and stable by providing providing low barrier,emergency housing with a variety of supportive services.\n\nWe offer:\nFully furnished single and double occupancy rooms\nBed Linens/Towels\nSupportive resources for education, goal planning, employment, house/money manage, assistance with permanent housing\n24 hour staff available\nMeals\nFully equipped kitchen\nWasher/Dryer\nCable television\nLandline phone\nTransportation for mental/medical health\n\nOur goal is to help eliminate homelessness and recidivism.\n\nEligibility and Guidelines for Transitional Housing\n\nApplication Process\nAttend an orientation detailing the program requirements.\n\n\nOrientations are offered on Wednesdays at 1pm; Individuals need to call to register and confirm that an orientation is scheduled.\n\n\nSubmit a completed residency application.\n\nApplications can be downloaded online and submitted via email or in-person.\n\n\nApplicants will be interviewed.\n\nDuring the interview, any client questions will be answered and the housing application information will be confirmed.\n\nRooms are assigned based upon acceptance and availability.\n\n\n\nBasic Rules for Transitional Living Program Residents\n\n\nWith an open heart and open mind, we accept individuals as they are.\n\nRules are set up to ensure that the group living situation in our Transitional Living Program runs smoothly, safely and effectively.\n\nAll residents must agree to abide by the rules before they are accepted into the program.  Residents may not bring weapons, alcohol, or drugs into the home or onto the grounds.  Also, residents may not smoke inside the home, engage in sexual activity, or  gamble, steal, threaten, or be physically violent toward others.  Violation of these rules can result in suspension or termination."
	},
	{
		"addressLine1": "903 West Grand Blvd",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48208",
		"name": "Alternatives For Girls",
		"organization": "Alternatives For Girls",
		"phone": "(313) 361-4000",
		"website": "https://alternativesforgirls.org/",
		"description": "Alternatives For Girls (AFG) shelter services are open 24 hours/day, 365 days/year.\nProgramming consists of:Runaway and Homeless emergency shelter services for girls, 15-17 years old (Stepping Stones);Homeless Emergency/Crisis shelter services for young women 18-21, including young women who are pregnant/parenting; Aftercare services for all of those served in any of the above residential programs.Intakes of minors are possible 24 hours/day. Intakes for young adult women are possible through the City of Detroit's CoC/CAM (313-305-0311)."
	},
	{
		"addressLine1": "400 Renaissance",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48243",
		"name": "National Homeless Shelter",
		"organization": "National Homeless Shelter",
		"phone": "877-747-1494",
		"website": "https://national-homeless-shelter-homeless-shelter.business.site/?m=true",
		"description": "We are National Homeless Shelter we service the entire state of Michigan. We provide temporary and permanent housing for families in need . We accept Men, women, teen and families,"
	},
	{
		"addressLine1": "150 Stimson Street",
		"city": "Detroit",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48201",
		"name": "Detroit Rescue Mission Ministries (Oasis)",
		"organization": "Detroit Rescue Mission Ministries (Oasis)",
		"phone": "(313) 993-4700",
		"website": "http://www.drmm.org/",
		"description": "Abuse and Treatment Center, Emergency Shelter, Transitional Housing, & Permanent Housing. Men, many of whom are struggling with addiction, debt, and difficulty finding employment. 25 men are homeless veterans of the armed forces and 25 are men with mental health or substance abuse disabilities, in addition to being homeless.\n\n90 day residential treatment facility for 86 chemically addicted adult men.  The Center also provides transitional housing for men.   Outpatient services for 30 men & women who have completed residential services is also offered for 30 to 90 days. "
	},
	{
		"addressLine1": "2216 S Cedar St",
		"city": "Lansing",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48910",
		"name": "City Rescue Mission of Lansing",
		"organization": "City Rescue Mission of Lansing",
		"phone": "(517) 485-0145",
		"website": "https://www.bearescuer.org/",
		"description": "Women and Children's Shelter\nFor women or female guardians with children\nCall for Availability: 517.485.0145\n2216 S. Cedar St., Lansing\nFacility has 24 hour security."
	},
	{
		"addressLine1": "419 N. Martin Luther King Blvd.",
		"city": "Lansing",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48915",
		"name": "Glass House",
		"organization": "Glass House",
		"phone": "(517) 482-2028",
		"website": "mailto:info@mmrsinc.org",
		"description": ""
	},
	{
		"addressLine1": "121 Whitehills Drive",
		"city": "East Lansing",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48823",
		"name": "Haven House",
		"organization": "Haven House",
		"phone": "(517) 337-2731",
		"website": "https://www.havenhouseel.org/",
		"description": "Haven House provides emergency housing and support services for single parent and two-parent families with children that are homeless. The main goal is to prepare these families for permanent housing through the development and promotion of self-sufficiency, stability, and financial responsibility.\n\nHaven House provides its residents with basic needs such as shelter, food, clothing, and personal needs items. Additionally, Haven House has developed programs that will make an impact on the families lives after leaving the shelter. The purpose of these programs is to give the Haven House residents the opportunity of improving their lives through setting goals, training, and education so that they can become more productive and have a lesser change of becoming homeless in the future.\nPrograms Offered:\n\nRapid Rehousing programFamily Life program\n\nAdditional Services Provided:\n\nCrisis counselingAssistance with goal setting Referrals to other agencies if needed\n\n\nPlease contact the office for more details.\n"
	},
	{
		"addressLine1": "831 N. Sycamore Street",
		"city": "Lansing",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48906",
		"name": "Loaves and Fishes Overnight Shelter",
		"organization": "Loaves and Fishes Overnight Shelter",
		"phone": "(517) 482-2099",
		"website": "https://www.facebook.com/loavesandfisheslansing/",
		"description": "Emergency Shelter Families/Singles"
	},
	{
		"addressLine1": "1803 Maplewood Avenue",
		"city": "Lansing",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48910",
		"name": "Sisters Crisis Pregnancy Ministry",
		"organization": "Sisters Crisis Pregnancy Ministry",
		"phone": "(517) 371-3128",
		"website": "",
		"description": "Clothing Referrals"
	},
	{
		"addressLine1": "430 North Larch Street",
		"city": "Lansing",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48912",
		"name": "Volunteers of America",
		"organization": "Volunteers of America",
		"phone": "(517) 484-4414",
		"website": "http://www.voami.org/",
		"description": "Meals Separate shelters for men and for women and children"
	},
	{
		"addressLine1": "2875 Northwind Drive Ste 105",
		"city": "East Lansing",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48823",
		"name": "Gateway Community Services",
		"organization": "Gateway Community Services",
		"phone": "(517) 351-4000",
		"website": "http://www.childandfamily.org/",
		"description": "Gateway Youth Services helps youth ages 12 through 20 who lack safe, stable, and age-appropriately supervised housing. This includes youth who:\n    Have expressed thoughts of running away\n    Have a history of running away from home\n    Are experiencing family conflict, abuse, neglect, family poverty, or improper supervision and/or care\n    Have been asked to leave home or have been \"kicked out\" by their parent, legal guardian, or other adult caretaker\n\n    Are \"couch-surfing\" or moving around from home to home\n    Are living on the streets, in camps, or in other places not meant for human habitation including vehicles, abandoned buildings, garages, etc.\n    Have parents or legal guardians who are also experiencing homelessness and may be staying in emergency shelters or \"doubled up\" with other families in overcrowded homes\n\n    Have been unable to maintain independent housing, have been or are being evicted by a landlord or roommate, and do not have the means to secure a safe and stable alternative permanent living location\nGateway Youth Services primary goals are:\n    To prevent youth from running away from home by providing supportive services to resolve family conflict.\n    To reunify youth who have run away from home with their families whenever family conflict can be safely remedied.\n\n    To identify safe living alternatives for youth when family reunification is not possible or in the best interest of the youth or family.\n    To help young people successfully transition from adolescence to independence."
	},
	{
		"addressLine1": "607 E. Michigan Avenue",
		"city": "Lansing",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48912",
		"name": "City Rescue Mission Lansing Men's Shelter",
		"organization": "City Rescue Mission Lansing Men's Shelter",
		"phone": "(517) 485-0145",
		"website": "http://www.bearescuer.com/",
		"description": "Men's Shelter\n607 E. Michigan Avenue Sign-In: 6:30 p.m. to 6:55 p.m. ID Required\n\nBreakfast\nServed to overnight shelter guests only\n\nLunch\nServed Daily, 607 E. Michigan\nSign-In: 11 a.m. to 11:55 a.m.\nID Required\n\nDinner\nServed Daily, 607 E. Michigan\nSign-In: 6:30 p.m. to 6:55 p.m.\nID Required"
	},
	{
		"addressLine1": "520 Robinson Street",
		"city": "Charlotte",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48813",
		"name": "Siren Eaton Shelter",
		"organization": "Siren Eaton Shelter",
		"phone": "(517) 543-0748",
		"website": "https://sireneatonshelter.org/",
		"description": "Services:\nShelterMeals Clothing Support servicesAdvocacy\nRequirements:\nMust be 18+ years old if unaccompanied by parent\nHomeless population\nDomestic violence survivors\n\n"
	},
	{
		"addressLine1": "15115 Deerfield Ave.",
		"city": "Eastpointe",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48021",
		"name": "New Breed CDC M25 Mobile Food Pantry",
		"organization": "New Breed CDC M25 Mobile Food Pantry",
		"phone": "(586) 217-5052",
		"website": "http://www.newbreedcdc.com/",
		"description": "New Breed Community Development Corporation's M25 Mobile Food Pantry gives out free bulk food items every week on Thursdays at 2pm. NBCDC's M25 Mobile Food Pantry services low to moderate income households throughout the Metro Detroit area. The bulk food items consist of produce, frozen food, bread and other type foods for families and individuals. In addition, New Breed CDC provide hot meals on holidays like Thanksgiving and Christmas along with gifts for children."
	},
	{
		"addressLine1": "21357 Redmond Avenue",
		"city": "Eastpointe",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48021",
		"name": "Gianna House (Residential Program for Pregnant Teens)",
		"organization": "Gianna House (Residential Program for Pregnant Teens)",
		"phone": "(586) 445-0440",
		"website": "https://giannahouse.org/",
		"description": "We are a residential program for pregnant teens ages 13-19. Upon entering the program the teens must be pregnant but, are encouraged to stay in the program for a year postpartum. We offer support to teen moms during their transition into motherhood. We focus on their interpersonal life skills, their parenting skills, their education and their overall well being. Our establishment is staffed 24/7 therefore, someone is always here to take calls regarding pregnant teens in need."
	},
	{
		"addressLine1": "17525 E. Ten Mile Rd",
		"city": "Roseville",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48066",
		"name": "Outstretched Arms",
		"organization": "Outstretched Arms",
		"phone": "(248) 224-0824",
		"website": "http://www.outstretched-arms.net/",
		"description": "We are a 12-18 month Christian residential discipleship program for men battling substance abuse and other life struggling issues. NOT A REHAB. Required daily Bible classes; structure; discipline; Biblical counseling, etc. 12 months of study; 6 months of transitioning.\n\nFor further information on becoming a student of Outstretched Arms, or making a tax deductible donation, please contact us by phone, e-mail, or regular mail.\n\n\nWe thank you for any and all support, in assisting us in providing basic necessities for our students. As GOD restores the lives of the men and women, we are grateful for your partnership and prayers."
	},
	{
		"addressLine1": "905 1st Avenue South",
		"city": "Escanaba",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49829",
		"name": "Delta County Alliance Against Violence & Abuse",
		"organization": "Delta County Alliance Against Violence & Abuse",
		"phone": "(906) 789-9207",
		"website": "https://safe3c.com/",
		"description": ""
	},
	{
		"addressLine1": "3001 Fifth Avenue, South",
		"city": "Escanaba",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49829",
		"name": "Hope at the Inn (HATI)",
		"organization": "Hope at the Inn (HATI)",
		"phone": "(906) 280-6779",
		"website": "http://www.hopeattheinn.org/",
		"description": "Hope At The Inn c/o The Salvation Army & Hope for the Day\n3001 Fifth Avenue, South\nEscanaba, MI   49829\nPhone: (906) 786-0590\n(9 am - 5 pm M-F)\n \nShelter:  (906) 280-6779\n(6 pm - 8 am)\n"
	},
	{
		"addressLine1": "1406 10th Ave",
		"city": "Menominee",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49858",
		"name": "Abundant Life Mission Center",
		"organization": "Abundant Life Mission Center",
		"phone": "(906) 424-4429",
		"website": "http://www.alcmission.org/",
		"description": "Abundant Life Mission is a Faith-based shelter located in Menominee, MI. We accept anyone in need but you must be have proper state issued identification and be able to pass a background check and not be on the sexual registry."
	},
	{
		"addressLine1": "603 Mann St.",
		"city": "Marinette",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "54143",
		"name": "Haven of Hope",
		"organization": "Haven of Hope",
		"phone": "(715) 735-3684",
		"website": "https://www.homelessshelterdirectory.org/shelter/none",
		"description": "This is a shelter to help single homeless people. Our mission is to reach out to people who are in need of a safe place to stay and guidance to a better way of life."
	},
	{
		"addressLine1": "605 Garland Street",
		"city": "Flint",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48503",
		"name": "Carriage Town Ministries Men's Shelter",
		"organization": "Carriage Town Ministries Men's Shelter",
		"phone": "(810) 233-8787",
		"website": "https://www.carriagetown.org/",
		"description": "Carriage Town provides a 24 hour emergency shelter for men 18 years and older. The mens shelter is located in the main building. Three meals a day are provided to individuals staying at the shelter. \nPlease call (810) 233-8787 if you have additional questions and/or intake information. \n\nAdditionally, dinner is served everyday to individuals (non-residents) in need.\n\nCurrently provided as meals-to-go. Please arrive at 4:50p.m.\n"
	},
	{
		"addressLine1": "914 Church Street",
		"city": "Flint",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48502",
		"name": "R.E.A.C.H. Runaway Program",
		"organization": "R.E.A.C.H. Runaway Program",
		"phone": "(810) 233-8700",
		"website": "https://www.facebook.com/Reach-Runaway-Program-1644561792450910/",
		"description": "Teens only Meals Clothing"
	},
	{
		"addressLine1": "2200 North Dort Highway",
		"city": "Flint",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48506",
		"name": "Salvation Army Adult Rehabilitation Center (ARC)",
		"organization": "Salvation Army Adult Rehabilitation Center (ARC)",
		"phone": "(810) 234-2678",
		"website": "https://www.facebook.com/salvationarmyflint/",
		"description": "Men Only Direct Substance Abuse Service"
	},
	{
		"addressLine1": "1917 Delaware Avenue",
		"city": "Flint",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48506",
		"name": "Shelter of Flint Inc.",
		"organization": "Shelter of Flint Inc.",
		"phone": "(810) 239-5433",
		"website": "http://www.shelterofflint.com/",
		"description": "Emergency Shelter"
	},
	{
		"addressLine1": "801 Saginaw St",
		"city": "Flint",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48501",
		"name": "YWCA of Greater Flint/SAFE House",
		"organization": "YWCA of Greater Flint/SAFE House",
		"phone": "(810) 238-7621",
		"website": "http://www.ywcaflint.org/safehouse-shelter.html",
		"description": ""
	},
	{
		"addressLine1": "432 N Saginaw St #207",
		"city": "Flint",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "04850",
		"name": "Our Home Transitional",
		"organization": "Our Home Transitional",
		"phone": "(810) 309-9822",
		"website": "mailto:ourhometransitionalgenco@hotmail.com",
		"description": "Our Home Transitional provides various types of assistance to female veterans:\nJob training and placement, educational training, home placement assistance, and mental and physical healthcare.\n\nThey provide this services through other local and national organizations in efforts to help them transition to self-sufficiency in civilian society.\n\nThese programs will be offered by Our Home Transitional, along with partnering organizations, such as the VA, VetBiz Central, Land Bank, SV MAP, Workforce Development Veterans Division, LearnKey Veterans Division, VetQuest, Cars4Vets, National Education Alliance, MI Talent bank and many more!\n\n"
	},
	{
		"addressLine1": "101 N. Grand Traverse",
		"city": "Flint",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48503",
		"name": "My Brother's Keeper of Genesee County, Inc.",
		"organization": "My Brother's Keeper of Genesee County, Inc.",
		"phone": "(810) 234-1163",
		"website": "mailto:debrahayes1.mbk@gmail.com",
		"description": "My Brothers Keeper of Genesee County, Inc., is unique in that we are a mens only homeless shelter in Flint and the surrounding areas of Genesee County.\n\nCurrently, we are serving an average of 26 to 30 men and the capacity to house 19 homeless veteran men daily.\n\n\nMy Brothers Keeper takes pride in providing essential care items, food, clothing, laundry, haircuts, transportation, peer-to-peer, mentor-ship and job readiness training to our guest as well as anyone in the community. To ensure the integrity of our mission, these services are provided with an air of respect and dignity for each individual.\n\nMy Brother's Keeper is open from 8 to 4pm for Administrative Purposes and 5pm to 7am for emergency shelter.\n\n\nLunch is served Mon-Wed-Thur 11am-12:30pm open to the community. NA Tue-Thur-Sat 2pm to 4pm.\n\n\nHomeless Veterans call 810-234-1163 if you are seeking shelter."
	},
	{
		"addressLine1": "2300 E. Grand River Avenue Suite 107",
		"city": "Howell",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48843",
		"name": "OLHSA Livingston Human Service Agency",
		"organization": "OLHSA Livingston Human Service Agency",
		"phone": "(517) 546-8500",
		"website": "https://twitter.com/olhsacommaction",
		"description": ""
	},
	{
		"addressLine1": "249 Baldwin Avenue",
		"city": "Pontiac",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48342",
		"name": "HOPE Hospitality & Warming Center",
		"organization": "HOPE Hospitality & Warming Center",
		"phone": "(248) 499-7345",
		"website": "https://www.hopeshelters.org/",
		"description": "HOPE provides safe and judgment-free shelter, innovative programs and public advocacy to end homelessness\n\nHOPE's  adult shelter is open from 5 PM until 9 AM providing dinner, triage healthcare, showers, overnight shelter and access to resources that can be a pathway out of homelessness. \n\n\nHOPE is a low barrier shelter, meaning that we do not require ID documents, we do not require sobriety (substances may not be brought onto the HOPE property) and no transportation barrier (because we bring most service-providers to the shelter).\n\nEach year, more than 250 HOPE guests exit the shelter to a place they can call home and keep as their home.\n\n\nwhich means that  while we have a zero tolerance for bringing drugs and/or alcohol on the premises, sobriety is not a condition for entry to the shelter.  We do, however, expect and strictly enforce that shelter guests will follow staff directions and exhibit good behavior.\nNo previous registration is needed to spend the night at HOPE."
	},
	{
		"addressLine1": "137 Commerce St",
		"city": "Gladwin",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48624",
		"name": "New Dawn Shelter of Gladwin County",
		"organization": "New Dawn Shelter of Gladwin County",
		"phone": "(989) 709-6089",
		"website": "http://newdawnshelter.com/",
		"description": "Emergency homeless shelter. Assistance programs are also provided.\n\nShelter Hours for Residents\nIn order to ensure that the shelter runs smoothly, there are expectations regarding the times in which certain activities are to occur.\nWake-up time is 6:30 am on Monday through Friday, 8:00 am on Saturday and 7:00 am on Sunday.\n\nAt 6:00 p.m. all guests are expected to be at the shelter. During the Summer these hours will be extended until 8:00 pm.\nPersons working after curfew or attending meetings after hours will be allowed to be out late with an approved Late Entry Pass. This pass must be requested before 4:00 pm directly to the Shelter Director.\nGuests without a Late Entry Pass and who have not returned to the shelter by 6:00 p.m. may lose their bed. At the very least they will receive a written warning.\nSpending the night away from the shelter is excusable only with prior approval of the Shelter Director. Guests will be drug tested when they return from an overnight stay.\nLength of Stay\nNDS offers temporary services. Program participation consists of a 90 day maximum stay and is contingent upon space and program constraints. An extension of time is available under certain circumstances. The circumstances will vary with each individual and should be discussed with the Shelter Director.\nMeal Hours\n- Breakfast 6:30 am - 8:00 am\n- Lunch 12:00 pm  -1:00 pm\n- Dinner 4:30 pm- 6:30 pm\n- If Guests are in the building during a scheduled meal time, they must be present in the dining room. Guests may not remain in their room while other Guests go to a meal.\n- Guests must be fully dressed in modest apparel. No pajamas or nightwear are allowed.\n- Shoes or other footwear shall be worn.\n- Guests shall be on time for meals.\n- Food and drink are to be consumed in the dining room only. Water only is allowed in the bedrooms.\n\nCase Management Hours\nCase Management staff is available to assist Guests with their case management plan, and to develop their assets and resources at the following times: Tuesday, Thursday & Friday 9:00 am to 4:00 pm or by appointment. During the first week of a new Guests stay, a Case Management Intake form (5 Pages) will be completed with the Guest. An appointment will then be set with the Case Management Committee to discuss and define goals for the Guest while staying at NDS. The Guests continued stay at the shelter will depend on the development of a plan and continual implementation of that plan.\nThe Guest will develop the plan with staff assistance and approval, and sign the form indicating their cooperation in the plan. On a weekly basis (by Monday) they will fill out a Weekly Progress Report and turn it in to the Case Manager with discussion about progress, barriers, needs, and prayer requests. Once a month the Case Management Committee will review all case plans and will hold a meeting with those who are struggling or not progressing with their plan. At that review meeting it will be determined if the Guest is working sufficiently on their plan, what might help them to move forward through a barrier or if not they need to leave the shelter for non-compliance with their Case Plan.\n\nIf a Guest or Case Manager wishes to change the Case Plan it can be done only with Case Management Committee approval.\nTelephone Use\n\n\n\n We are committed to helping provide: shelter, food, access to clothing and other material goods, as well as access to specialized services and individualized support, in a manner that enables individuals and families that seek our assistance to experience our guiding principles.\nDiapers, wipes, and baby formula are provided when Guests with children enter the shelter and until income is obtained. At that time Guests must buy their own items. Laundry soap, softener and comfort supplies (shampoo, soap, toothpaste, etc.) are provided when Guests enter the shelter and until they obtain income at that time Guests must buy their own.\nWhile you are here, we want to assist you to secure permanent housing and help you to eliminate the conditions that have led to your homelessness. Please let staff know of any concerns or needs which you may have while here so that we can best assist you.\n\nNDS provides emergency temporary shelter for persons, who for one reason or another, have no place to stay. Our shelter consists of 4 rooms with 10 beds, which can house a total of 10 persons. Guests staying at our shelter are encouraged to take advantage of the staffs assistance and to utilize any other community resources that might be helpful. NDS can provide and connect Guests to a variety of services. We can assist and advocate for individuals who need help filling out applications for housing and income maintenance forms. Referral help is available for persons needing other community services. The staff at NDS attempts to help Guests meet their needs and will assist persons staying at the Shelter so that their stay will be a period of growth and a step toward a better tomorrow and greater interdependence. Although the staff of NDS assists Guests in obtaining permanent alternative housing, we cannot assure that this will occur. Staff is on duty to provide a safe environment for all Guests. All staff will be responsible for overseeing and implementing the Policies and Procedures contained in this handbook.\n\nGuests staying at NDS may be referred to programs in other communities that could better meet their needs.\n\nLaundry Hours\nNO laundry is to be left in the washer or dryer while you are out of the building and is to be removed by 10:00 pm even if you are not finished. Last load can be put in at 9:00 pm No Exception. Ironing is to be completed in the laundry room only. Irons are not to be taken into the sleeping rooms.\nDaily hours are every day, except Friday, are 10:00 a.m. to 10:00 p.m. On Friday, the washers are kept available for former guests.\nUse care when operating equipment. For example, proper water level for load size, correct settings for washer and dryer, proper amount of soap, etc.\nIf you need assistance with use of the washer and/or dryer, please ask staff for assistance.\nClean equipment and filter after each use.\nLaundry facilities are to be used for Guests clothing, towels, wash clothes and bed linens.\nHouse Chores\nGuests are expected to assist with necessary chores around the shelter.\nPlease review the chore list daily and volunteer to assist in completing assigned chores.\nThe Shelter Director or designee will be assigning and re-assigning chores as needed.\nChores are to be completed by 10:00 am or 8:00 pm as appropriate for your assignment.\nYou are responsible for completing the chore(s) assigned to you.\nChores may include:\nCleaning Meal Preparation\nBathrooms Cooking\nLaundry room Serving\nCommon area-Lobby, Hallways, Office Dishwashing\nKitchen, Dining Area Clean-up Outside of Building\nIt is the responsibility of each Guest to keep his/her own sleeping area, dining area and common areas clean at all times.\nReport anything broken, missing or damaged to the staff.\nDo not put grease or garbage down the drain.\nDo not dispose of sanitary napkins or other bulky items down the toilet.\nDo not remove window screens.\nTurn off lights, radios, televisions, and other appliances when not in use.\nShowers are to be cleaned after each use.\nFloors are to be swept and mopped daily or more often if necessary.\nLaundry equipment should be wiped off after each use. Dryer filters should be cleaned after each use.\n\nPlease remember that parking is always at your own risk. Only shelter Guests may park in designated areas on the property.\nGuests may not park a non-operational vehicle on NDS property without permission of the shelter director. Leaving a non-working car sitting on the premises will result in the car being towed away at the Guests expense.\n\n\n"
	},
	{
		"addressLine1": "255 South Division",
		"city": "Grand Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49503",
		"name": "Guiding Light Mission for Men",
		"organization": "Guiding Light Mission for Men",
		"phone": "(616) 451-0236",
		"website": "https://guidinglightworks.org/",
		"description": ""
	},
	{
		"addressLine1": "1204 Grandville Ave SW",
		"city": "Grand Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49503",
		"name": "Hispanic Center of Western Michigan",
		"organization": "Hispanic Center of Western Michigan",
		"phone": "(616) 742-0200",
		"website": "https://hispanic-center.org/",
		"description": "The Hispanic Center of Western Michigan provides assistance to any individual that might need guidance on how to navigate through the different community resources available with the main goal of achieving self-sufficiency. The staff at the Center is bilingual and multi-cultural.\n\n\nDifferent Programs:\nBasic Needs Services: For additional information, please contact Alejandra Meza, Community Navigation Coordinator at(616) 742-0200 ext. 113 or email ameza@hispanic-center.org\n- Health & Wellness Needs\n- Prevention Education\n- Referrals to health resources\n- Referrals to victim support\n- Working with the Department of Human Services (DHS)\n- Assistance with Food Stamp paperwork\n- Assistance with Medicare/Medicaid paperwork\n- Assistance with other vital records & paperwork\n\n\nComprando Rico y Sano Program:For additional information, please contact Paola Carlson at(616) 834-0948\n- Provides individuals the knowledge needed to make smart food choices and cost saving strategies while promoting health conscious shopping. It also helps individuals enroll in the commonly known SNAP (Supplemental Nutrition Assistance Program) program, and provides healthy food recipes.\n\n\n\nCivil and Human Rights Services:For more information, please contact Olga Martinez, Civil & Human Rights Advocate at (616) 742-0200 ext. 112 or email omartinez@hispanic-center.org\n-Power of Attorney Letters\n- US Passport Applications\n- US Birth Certificate information\n- Monthly bus trips to Mexican Consulate in Detroit, MI\n- Referrals to basic immigration-related concerns\n- Outreach about services in and outside of Kent County\n- Two in-house notaries\n- Share client testimonials with state legislators and house representatives\n- Participate in local, state, and national rallies\n- Offer Voter and Census education\n- Host elected officials to come hear our community's voice\n\n\nFor additional information, please contact the office.\n"
	},
	{
		"addressLine1": "701 Prospect Ave SE",
		"city": "Grand Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49503",
		"name": "ICCF Family Haven",
		"organization": "ICCF Family Haven",
		"phone": "(616) 247-4949",
		"website": "http://iccf.org/",
		"description": "Office Hours\nMonday     9 am - 5 pm\nTuesday     9 am - 5 pm\nWednesday     9 am - 5 pm\nThursday     9 am - 5 pm\nFriday     9 am - 5 pm\nSaturday     Closed\nSunday     Closed\n\nFamily Haven is a five-unit emergency shelter for families experiencing homelessness in the Grand Rapids area. The shelter keeps mothers, fathers, sons, and daughters entire families together in clean and private housing units, with the hope of moving them to permanent housing in 30 days.  ICCF believes all persons are created in Gods image and exist in the light of His love. Because of this, all families are treated with respect and dignity.\n\nServices\nOur staff comes alongside families during their stay to identify the barriers that lead to homelessness, while also helping them secure permanent housing, employment, transportation, and educational opportunities. ICCFs team of Housing Resource Specialists also help families develop personal goals, encouraging them to identify and utilize their own strengths to achieve goals.\n\nSupport\nFamilies that leave Family Haven for permanent housing still have access to ICCF support. Housing Resource Specialists remain available for up to six months as they transition to more stable housing. These individuals are meant to be advocates and accountability partners, ensuring a smooth transition to stable housing."
	},
	{
		"addressLine1": "415 MLK. Jr St SE suite 100",
		"city": "Grand Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49507",
		"name": "ICCF Community Homes Family Shelter",
		"organization": "ICCF Community Homes Family Shelter",
		"phone": "(616) 336-9333",
		"website": "https://iccf.org/",
		"description": "Family Haven is a six-unit shelter for families experiencing homelessness in the Grand Rapids area. The shelter keeps mothers, fathers, sons, and daughters entire families together in clean and private housing units, with the hope of moving them to permanent housing in 30 days.\n"
	},
	{
		"addressLine1": "1115 Ball Ave NE Building B",
		"city": "Grand Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49505",
		"name": "The Bridge of Arbor Circle Shelter Program for Youth",
		"organization": "The Bridge of Arbor Circle Shelter Program for Youth",
		"phone": "(616) 456-6571",
		"website": "https://arborcircle.org/",
		"description": ""
	},
	{
		"addressLine1": "225 Commerce Ave Sw",
		"city": "Grand Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49503",
		"name": "Mel Trotter Ministries Men's Shelter",
		"organization": "Mel Trotter Ministries Men's Shelter",
		"phone": "(616) 454-8249",
		"website": "http://www.meltrotter.org/",
		"description": ""
	},
	{
		"addressLine1": "3501 Lake Eastbrook Blvd. SE Suite 335",
		"city": "Grand Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49506",
		"name": "Safe Haven Ministries",
		"organization": "Safe Haven Ministries",
		"phone": "(616) 452-6664",
		"website": "http://www.safehavenministries.org/",
		"description": ""
	},
	{
		"addressLine1": "144 S. Division Ave.",
		"city": "Grand Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49503",
		"name": "Degage Ministries Open Door",
		"organization": "Degage Ministries Open Door",
		"phone": "(616) 454-1661",
		"website": "http://www.degageministries.org/",
		"description": "Who is eligible to stay in the Open Door?\nThe Open Door provides services for female residents of Kent County who are eighteen years of age and older and in need of shelter. The Open Door has a capacity of 40 women.\nMen and children are not permitted.\n\nAre there requirements to staying in the shelter?\nWomen intending to stay at the Open Door longer than 3 days must sign an agreement with a staff member which requires them to set goals and report on progress in a weekly meeting.\nDrug testing is completed on intake and randomly going forward.\n\nWomen who are intoxicated are not allowed to stay in the Open Door.\nAll women are required to connect with the Housing Assistance Program through The Salvation Army, which is the gatekeeper for all housing services in this community.\n\nWhere is the Open Door?\nDgag is located at 144 Division Ave S., Grand Rapids, MI 49503-4216, on the corner of Cherry St. and Division Ave. The Open Door is on the 3rd floor of our facility.\n\nWhat are the hours of the Open Door?\nThe shelter opens at 7:00 p.m. Women are required to be in no later than 8 p.m.\nWomen are woken at 6:00 a.m. and leave the Open Door by 7:45 am.\nDuring the day, women may visit Dgag's Dining Room during its open hours or utilize Dgag's Services on the 2nd floor as needed.\nStaff is available to meet with the women during day time hours. Weekly meetings can be schedule during the hours of 8:00 -11:30 a.m. and 1:00-3:00 p.m., Monday-Friday.\n\nHow much does it cost?\nStaying at the Open Door is free. Dgag Dollars and cash can be used to purchase necessary items like undergarments and supplies, pay for laundry services, and cover locker rental expenses in the Open Door.\nAre reservations needed?\nYes, reservations are needed.\nWomen can make a reservation to stay in the Open Door Women's Center by coming to the 2nd floor Life Enrichment Center at Degage during open hours (8:00-11:30am and 1:00-3:00pm Monday Friday). If you have already reversed a spot for the evening, you are able to reserve a spot for the following night when signing in for the evening. You must sign up daily for a spot. Reservations for future dates are not taken.\nIf you call Degage inquiring about a stay in the Open Door Women's Center, you will need to come in person to sign up. If there are spots available, please know that our system works on a first come basis. We cannot guarantee a spot if you are inquiring over the phone. If we are full, please contact Salvation Army HAP at 616-454-5840 for other possible options for shelter.\n\nWhere do I sleep?\nMats are arranged in the common area of the Open Door.\n\nWhat can I bring?\nWomen are encouraged to bring only the essentials and limit their belongings to one bag. Linens are provided. Storage space is limited, as lockers are reserved for women who have signed an agreement and are willing to meet with staff for a weekly meeting. Food and drink are not allowed.\n\nHow long can I stay in the Open Door?\nThe length of stay varies depending on each woman's needs and is determined by staff. Women must be willing to meet with staff during day time hours and make progress towards achieving goals in order to maintain their spot in the program.\n\nDegage Ministries has created numerous programs to meet their unique needs. These programs include:\n\nOvernight shelter for women in crisis called the Open Door\nLow-cost and free meals\nHygiene facilities such as showers and laundry\nLockers to safely store belongings\ntate Identification Program\nSupportive Services to meet housing, employment and other goals\nPro-bono legal services\nSupport groups and Bible studies\nConsumer choice food pantry\n\nThe Open Door provides a safe haven during the overnight hours to adult women in crisis. Christ's love is reflected in a welcoming environment where women are encouraged to make positive lifestyle changes. The program has the following objectives:\nTo provide a safe and welcoming environment for women in need such as those fleeing domestic violence, experiencing trauma, sleeping outside or struggling with mental illness.\nWomen visiting the Drop-In Center will have emergency needs addressed such as shelter and hygiene. Showers, laundry facilities and lockers are available.\nThe problems and/or issues of women utilizing the service will be identified and addressed immediately on-site or through referrals to supporting agencies. Issues may include mental illness, substance abuse, permanent and temporary housing needs, trauma, etc.\nWomen will personally begin to address barriers to meeting their basic needs and achieving a self-sufficient and healthy lifestyle.\nWomen will be served in a welcoming and supportive environment."
	},
	{
		"addressLine1": "1014 Dunham St SE",
		"city": "Grand Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49506",
		"name": "Breakthrough Believers Supportive Housing Program",
		"organization": "Breakthrough Believers Supportive Housing Program",
		"phone": "(616) 551-3290",
		"website": "http://www.bbrhc.community.officelive.com/",
		"description": "The BBRHC supportive housing program was founded by Mrs. Pam Duvall-Bateman, sponsored by Breakthrough Believers Recovery and Healing Center, 501c3 non profit organization to offer licensed social service program assistance for women with special needs, homeless and have underlying issues of mental and substance abuse disorders. We provide services to roommate/tenants using case-management model. BBRHC supportive housing will provide a independent living atmosphere with on site case management services, in that residents will be required to take an active role in the structured curriculum, daily chores, social activities, spiritual guidance and follow house rules that is a guide for daily living to meet the unmet needs of its residence.\n\nBBRHC supportive housing will house women residents only, as well as a resident manager with the assistance of volunteer staff. Residents may have their own room or share rooms, and share facilities such as laundry, bathroom, kitchen and common living areas. Our goal is to address the real problem, only by addressing the underlying issues will we be able to place them back into society as productive individuals.\n\nMISSION STATEMENT:\nBBRHC supportive housing program mission is to facilitate the fundamental skills required for basic daily living and healthy decision making. Our mission is restoration of lives through licensed social program services, guidance, advocacy, case management services, referrals, inreach/outreach services and support networking. We focus on transformation of lives rather than just housing. Many of the individuals who require supportive housing programs they tend to lack the fundamental skills required for basic daily living and healthy lifestyle changes. (length of stay is unlimited)\n\nPROGRAM STATEMENT:\nBBRHC supportive housing program will remove women from distressed situations and provide a sense of well being and stability in a safe and nurturing environment.. BBRHC supportive housing is designed to identify women in distressed situations, offer refuge, and healing in a faith based environment."
	},
	{
		"addressLine1": "516 Cherry Street SE",
		"city": "Grand Rapids",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49503",
		"name": "Family Promise of Grand Rapids Family Shelter",
		"organization": "Family Promise of Grand Rapids Family Shelter",
		"phone": "(616) 475-5220",
		"website": "https://www.familypromisegr.org/what-we-do/emergency-services/",
		"description": "Family Promise of Grand Rapids provides emergency shelter and basic needs to families with children experiencing homelessness. While a family stays in our homeless shelter, we provide a welcoming and safe place to land and connect families with resources to help them thrive. We provide family emergency shelter through a variety of different settings and models.\n2 types of shelter:\nInterfaith Hospitality Network\nPathway Home\n\n"
	},
	{
		"addressLine1": "P.O. Box 661",
		"city": "Grayling",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49738",
		"name": "River House",
		"organization": "River House",
		"phone": "(989) 348-3169",
		"website": "http://www.riverhouseinc.org/",
		"description": "River House, Inc. domestic violence and sexual assault programs offer survivors of domestic violence and sexual assault a wide range of services. These services help each participant be safe and maintain a self-sufficient lifestyle free of violence.\n\nServices Provided:\n\nEmergency Shelter\n\nUpon entering River House, Inc., participants are welcomed by staff. Time will be taken to fill out the necessary intake forms. A bedroom is assigned and the participant is given a tour of the shelter. The shelter provides comfortable surroundings for participants and their children.Legal Advocacy Services\n\nThe Legal Advocacy Program assists domestic violence survivors throughout the legal process. While advocates do not give legal advice, they do seek to enhance the safety of women and their children by providing them with knowledge about their legal choices. Frequently this includes disseminating information, accompanying survivors in court, explaining the court process, and providing appropriate community contacts when necessary. The legal advocate provides survivors with the knowledge needed to empower them to make informed decisions.\n\nSexual Assault Services\n\nThe Sexual Violence Program at River House, Inc. provides a 24-hour hotline for immediate crisis intervention. A sexual violence advocate will stay with the survivor or their family at the hospital emergency department and provide clothing and referral information. The sexual violence advocate is available to attend police interviews and court proceedings with the survivor. In addition, individual and group counseling are available for the survivor and their family."
	},
	{
		"addressLine1": "115 N Front St. Suite 100",
		"city": "L'Anse",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49946",
		"name": "Baraga County Shelter Home",
		"organization": "Baraga County Shelter Home",
		"phone": "906-524-7078",
		"website": "https://www.bcshelter.org/",
		"description": "Services:\nEmergency ShelterSafe housingMealsPersonal care items\nMailing Address:\nP.O. Box 10\nLanse, MI 49946\nHelp and Support Line:\n(906) 524-7078\n\n"
	},
	{
		"addressLine1": "PO Box 312",
		"city": "Hastings",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49058",
		"name": "Family Promise of Barry County",
		"organization": "Family Promise of Barry County",
		"phone": "(269) 953-6189",
		"website": "http://www.familypromisebarrycounty.org/",
		"description": "The Family Promise Network Program brings shelter, meals, and support services to families without homes.\n\nDay Center:\nGuests use a local Day Center from approximately 7:30 AM to 5:00 PM, where the Family Promise Network Director, a professional social worker, provides case management services. There, guests pursue employment, tend pre-school children, shower, and do laundry. The day center provides guests with a mailing address and a base for housing and employment searches. Many guests are employed during the day, while older children attend school.\nHost/Support Congregations:\nThe hosting of families rotates weekly among the Host Congregations in the Network. In turn, each host congregation provides lodging, three meals a day, and caring hospitality 3-4 times a year. The ideal number of Hosting Congregations is 13. The Support Congregations may not have the physical space available to Host, but provide much needed volunteers, supplies and finances."
	},
	{
		"addressLine1": "5050 M-36",
		"city": "Stockbridge",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49285",
		"name": "Good Shepherd Mission",
		"organization": "Good Shepherd Mission",
		"phone": "(517) 851-9800",
		"website": "mailto:michael505040@yahoo.com",
		"description": "Private rooms available for emergency shelter available"
	},
	{
		"addressLine1": "413 West Main Street",
		"city": "Ionia",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48846",
		"name": "EightCAP Inc. Ionia/Montcaml Domestic Violence Program",
		"organization": "EightCAP Inc. Ionia/Montcaml Domestic Violence Program",
		"phone": "(616) 527-3351",
		"website": "",
		"description": ""
	},
	{
		"addressLine1": "122 N 4th Ave",
		"city": "Iron River",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49935",
		"name": "Awakenings Homeless Shelter",
		"organization": "Awakenings Homeless Shelter",
		"phone": "(906) 265-5960",
		"website": "mailto:awakeningshome@gmail.com",
		"description": "Men's Homeless Shelter."
	},
	{
		"addressLine1": "420 East Alcott Suite 200",
		"city": "Kalamazoo",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49007",
		"name": "Housing Resources Inc. - Eleanor House",
		"organization": "Housing Resources Inc. - Eleanor House",
		"phone": "(269) 382-0287",
		"website": "https://www.housingresourcesinc.org/",
		"description": "Emergency Shelter Families Only.\n\n\nServices:\nEleanor House\nThe 24 bed Eleanor House offers a homelike setting 24/7, meeting the needs of homeless families by providing a safe haven while they prepare to move to independent housing. More than 60% of its guests are children who average nine years of age. During their stays, Eleanor House residents receive referrals to vital community resources and on-site assistance in exploring their future housing options.\n\nPermanent Supportive Housing\nFor families chronically vulnerable to housing instability and repeat episodes of homelessness the combination of permanent, versus temporary, housing subsidies and supportive services is very effective.  HRI operates 55 scattered site subsidized rental units for families where the head of household has a disabling condition.  Please contact HRI directly to learn more about this program.\n\nAffordable Housing Options\nIn addition to working with area landlords to help people find affordable housing, HRI offers four options for low-income households.\n"
	},
	{
		"addressLine1": "P.O. Box 1435",
		"city": "Lapeer",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48446",
		"name": "The Refuge Homeless Shelter of Lapeer County",
		"organization": "The Refuge Homeless Shelter of Lapeer County",
		"phone": "(810) 441-9990",
		"website": "mailto:therefugehsl@gmail.com",
		"description": ""
	},
	{
		"addressLine1": "906 E. Ludington Ave.",
		"city": "Ludington",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49431",
		"name": "Communities Overcoming Violent Encounters (COVE)",
		"organization": "Communities Overcoming Violent Encounters (COVE)",
		"phone": "(231) 843-2541",
		"website": "http://callcove.com/",
		"description": ""
	},
	{
		"addressLine1": "525 Michael St",
		"city": "Manistee",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49660",
		"name": "Safe Harbor of Manistee County",
		"organization": "Safe Harbor of Manistee County",
		"phone": "(231) 723-6613",
		"website": "https://www.echohislove.org/",
		"description": ""
	},
	{
		"addressLine1": "347 Rock Street",
		"city": "Marquette",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49855",
		"name": "Room At The Inn - Marquette Homeless Shelter",
		"organization": "Room At The Inn - Marquette Homeless Shelter",
		"phone": "(906) 227-9171",
		"website": "http://roomattheinn.org/",
		"description": "Homeless Shelter\nShelter Services:\nRoom at the Inn offers nighttime shelter, opening at 6pm each evening and closing at 6am. Dinner is provided each evening to shelter guests, between the hours of 6:30 and 7:30 p.m. The Warming Center serves as an early morning shelter to guests from the hours of 6 to 8 a.m. A shower facility is also located in the Warming Center. Guests can receive mail and use the shelter address for business purposes. The Room at the Inn also assists with transportation services when the shelter is located in one the outlying churches. Room at the Inn offers referral services to existing social service agencies in the community.\n\nCriteria for staying at Room at the Inn:\nGuests must be 18 years or older.\nGuest must be Marquette County resident.\nGuests must be stable and able to self manage their behavior.\nMust have medications if needed to maintain stability.\n\nGuests must be able to manage their own medications.\nGuests must maintain their personal hygiene and care for their sleeping area while in shelter.\nGuests must be able to live in community environment.\nGuests must be able to climb stairs and get up and down from a mattress on the floor without assistance. Must be able to leave the shelter each morning for the day.\nGuest must be medically stable.\nGuest may not be on the sex offender registry.\n\nChecking In to Room at the Inn:\nGuests may check in between the hours of 6 - 9 pm.\nGuests will be required to complete an intake form on first night of stay.\nThe next day, new guest must meet with Guest Advocate to complete and sign Shelter Contract.\n\nGuests will be checked for wants and warrants through the Marquette City Police at intake.\nEach guest will be required to sign in and go through a personal search and breathalyzer test each evening.\n\nGuest must register at a 0.06 or lower on PBT reading to stay at the shelter."
	},
	{
		"addressLine1": "447 W. Washington",
		"city": "Marquette",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49855",
		"name": "Room At The Inn Marquette Warming Center",
		"organization": "Room At The Inn Marquette Warming Center",
		"phone": "225-1521",
		"website": "https://www.facebook.com/Room-at-the-Inn-1211545529022716/",
		"description": "The Warming CenterThe Warming Center provides a warm and friendly place for shelter guests to gather before heading out for the day. During the shelter season (mid-September through mid-May), the host church will have the use of the Warming Center to serve as a morning shelter location from 6am-8am. Guests can also use the shower facility located in the Warming Center during this time. The center is open from 8am-12pm for everyone in the community to enjoy a hot breakfast and lunch.During the summer months when the shelter is closed (mid-May through mid-September), the Warming Center remains open to everyone in our community Monday-Sunday from 8am-noon for a meal and fellowship. Various community agency representatives may be available at the warming center to meet with guests regarding employment, housing, health care, or any other matter that helps with regaining independence.Our Warming Center is located at 447 W. Washington in Marquette. The phone number is 225-1521."
	},
	{
		"addressLine1": "412 W. Buttles St.",
		"city": "Midland",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48641",
		"name": "Midland's Open Door",
		"organization": "Midland's Open Door",
		"phone": "(989) 835-2291",
		"website": "http://www.midlandopendoor.org/",
		"description": "Our mission is to demonstrate the love of Jesus Christ by providing a variety of free services for the homeless, the hungry and the needy:\n\n\nCrisis housing for men, women, and children\n\nHot wholesome meals daily (soup kitchen)\n\nClothing\n\nJail and prison prayer visits\n\nTransitional assistance\n\nIn our Crisis Shelters, we provide relief for crisis housing situations, not indefinite long-term shelter. During clients' stay at our facilities, we coordinate with local social service agencies, Christian ministries and churches to help our guests find long-term housing and items needed to facilitate their growth and get them back on their feet. We provide a telephone for client use, a copy of the Midland Daily News, an extensive list of resources and when available, Dial-a-Ride tickets to help them find employment, housing and travel to necessary appointments. An average of over 900 nights of crisis housing are provided each month.\nWe have one dedicated facility for men and one for women and their children. The Men's Shelter houses up to 19 men. Our Women's Shelter (the House of Mercy) houses up to 11 women and children.\n\nFor clients who need more time to restore their lives than approximately 30 days, we offer a Restoration Ministry, in which particular care is given to individual case management involving a number of local agencies. This is especially important for clients whose previous life is marked by jail sentences, long periods of homelessness or substance abuse. Eligibility for stays longer than 30 days is based on need, and the amount of engagement a client shows while at shelter. Women in the long-term (\"Restoration\") program are housed in the same facility as women who are staying only briefly."
	},
	{
		"addressLine1": "3115 Isabella Street",
		"city": "Midland",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48640",
		"name": "Shelterhouse - Domestic Violence Shelter",
		"organization": "Shelterhouse - Domestic Violence Shelter",
		"phone": "(989) 835-6771",
		"website": "http://www.shelterhousemidland.org/",
		"description": "Main Phone: 989-835-6771Crisis Hotline: 877-216-6383\n\nDomestic Violence Shelter\nServices\n    Safe shelter available 24/7\n    24-hour crisis line\n    Advocacy and counseling services, including:\n        Safety planning\n        Help with the court process and getting a PPO\n        Medical or legal emergencies\n        Housing assistance\n        Financial resource referral\n        Court accompaniment\n        In-home advocacy services through the domestic violence housing initiative program\n        School registration\n        Help with basic needs food, clothing, budgeting\n    Prevention, education and outreach\n    Community Referrals\n    Child, youth and adult therapy from masters-level therapists\n\nAt Shelterhouse, we provide our clients with free, caring and confidential support and help them live their life free from violence. Those who have survived domestic violence often struggle with the process of healing from trauma. The healing process is enhanced by one-on-one talks with a Client Advocate as well as small group discussions with those who have had similar experiences. Education and support groups for domestic violence survivors meet to learn, support each other, and work through the healing process together. In addition to counseling and support programs, we also provide empowering, respectful and compassionate services to domestic violence survivors, increasing their safety and assisting them in achieving their individually-developed goals. We offer free childcare services so that parents can attend and gain the benefits from our support groups without worrying about who will take of their children."
	},
	{
		"addressLine1": "14390 Laplaisance Road Suite 106",
		"city": "Monroe",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48161",
		"name": "Family Counseling and Shelter",
		"organization": "Family Counseling and Shelter",
		"phone": "(734) 241-0180",
		"website": "https://twitter.com/fcssmc",
		"description": "Emergency Shelter Direct Domestic Viloence Services"
	},
	{
		"addressLine1": "815 E. First St",
		"city": "Monroe",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48161",
		"name": "The Salvation Army Family Manor",
		"organization": "The Salvation Army Family Manor",
		"phone": "(734) 241-0440",
		"website": "https://www.facebook.com/monroecountysalvationarmy",
		"description": "Family Manor is a Christian based emergency shelter for families, single men with children, or single women who are in need of temporary housing for up to 11 families and 4 single women. Qualifying individuals or families are eligible for up to 90 days stay per calendar year to begin to rebuild their lives."
	},
	{
		"addressLine1": "815 East First Street",
		"city": "Monroe",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48161",
		"name": "Philadelphia House 1 – Emergency Men’s Shelter",
		"organization": "Philadelphia House 1 – Emergency Men’s Shelter",
		"phone": "(734) 242-4266",
		"website": "",
		"description": ""
	},
	{
		"addressLine1": "2 Crocker Blvd., Suite 201",
		"city": "Mt. Clemens",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48043",
		"name": "Macomb County Warming Center",
		"organization": "Macomb County Warming Center",
		"phone": "(586) 329-4046",
		"website": "https://www.warmingcenter.org/",
		"description": ""
	},
	{
		"addressLine1": "235 Cass Ave.",
		"city": "Mount Clemens",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48043",
		"name": "Family Youth Interventions Transitional Living Program",
		"organization": "Family Youth Interventions Transitional Living Program",
		"phone": "(586) 477-1855",
		"website": "http://www.familyyouth.com/",
		"description": "FYI/TLP is a 24 hour residential program designed to empower young adults to take control of their lives in positive and purposeful ways.  If you are unfamiliar with our program, please take a moment to read about the services we offer.\n\nEligibility:  Youth ages 16 through 20 who are homeless, potentially homeless or who have run away.  FYI/TLP may house up to six residents and serves males and females.  Services are available for a continuous period not to exceed 18 months.\n\nReferral Process:  Those interested in applying for FYI/TLP need to fill out an application first.  Then call (586) 477-1855 to set up an appointment for an interview.  After the interview, a decision will be made as to whether or not the applicant is eligible for the program.  At times when all beds are full, eligible applicants are put on a waiting list and are contacted when there is a space available.  Applicants are accepted based on need and eligibility.\nFYI/TLP provides help with:\n    Building positive relationships\n    Developing necessary skills for self-sufficiency\n    Obtaining employment and housing\n    Completing educational programs\n    Health related or other needs\nProgram Components include:\n    Individual Counseling\n    Family Counseling\n    Skill Building Groups\n    Case management for educational, health, employment and metal health needs\n    Aftercare (continued counseling and case management after a resident leaves)\n "
	},
	{
		"addressLine1": "20415 Erin St",
		"city": "Roseville",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48066",
		"name": "MCREST Housing and Homeless Shelter",
		"organization": "MCREST Housing and Homeless Shelter",
		"phone": "(586) 415-5101",
		"website": "http://www.mcrest.org/",
		"description": "Emergency Shelter\nMCREST provides year round safe emergency shelter for homeless individuals and families for up to 90 days in congregations across Macomb County. The congregations provide meals, shower facilities, transportation and, when able, laundry services for our guests. During our guests' stay, case managers work with each individual and family to develop and implement a personalized housing plan that concentrates on overcoming barriers to self-reliance such as lack of income, poor money management, mental health issues, substance abuse, and a broken personal support system. Throughout its 26 years, MCREST has provided emergency shelter yearly to over 500 adults and 100 children. This is our core service and definitely our strength. It is a great accomplishment to coordinate and sustain this program through a network of 90 churches for 26 years. This aligns with the goal of providing safe emergency shelter for homeless individuals and families for up to 90 days through a network of congregations across Macomb County and the goal of developing a personalized housing plan that concentrates on overcoming barriers to self-reliance through case management.\n\nSupportive Housing Programs\n\nJourney Home\nLocates safe, affordable rental housing and provides the security deposit and a portion of the first year's rent for children and their families who have income, a reasonable prospect to resume future rental payments and agree to accept case management services working towards self-reliance. Once accepted into the program, a Case Manger will assist the family to locate affordable housing based on their projected future income and MCREST will provide the security deposit and rental assistance up to three months. A Case Manager will continue to implement the Housing Plan which serves as the foundation for resource coordination to address the barriers that lead to homelessness. To participate in Journey Home, the family must agree to discuss issues/challenges that lead to homelessness and agree to focus on the implementation of solutions in the Housing Plan. Case Management may continue from 1 - 18 months until they reach self-reliance.\n\nOpen Door\nThis program is the same as Journey Home, but for individuals.\nSince 2012, MCREST assisted 53 individuals and/or families with moving into permanent housing through our supportive housing programs, Journey Home and Open Door. This aligns with the goal of providing rental assistance to help guests transition back into affordable housing as they secure income.\n\nLearning and Resource Center\nThe Learning and Resource Center open in September to provide our guests assistance with the application for government benefits, job readiness training, and job placement services. The Center helps fill the critical gap of income from employment that remains the missing link between emergency shelter and supportive housing services. The Center will accomplish this by providing an innovative approach to job readiness training and job placement services specifically designed to assist the homeless with finding employment. This approach, coupled with applying for government benefits, will address all of the key barriers identified in their housing plan while providing a resource that is essential to a successful transition to self-sufficiency. The following describes the services that will be provided by the Center.\n\nApplication for Government Benefits\nMCREST will provide access to our fifteen (12) computers in the Center for our guests to utilize the Michigan Department of Human Services MI Bridges website to apply for food assistance, cash assistance, child development and care, state emergency relief, and Medicaid health insurance. MCREST plans to also assist guests enroll in Medicaid through the Health Insurance Marketplace made available through the Affordable Care Act.\nJob Readiness Training:\nOur accessible Learning and Resource Center will provide the necessary job readiness assessments, employability skills training, interpersonal development (soft skills) that will lead to employment and affordable housing. The Learning and Resource Center Director designed the curriculum, conducts assessments, and provides instruction. The employability skills training and interpersonal development curriculum was designed specifically for the special needs of homeless individuals. Emphasis will include basic resume design and interviewing skills since many students have been unemployed or underemployed for months or even years. The Learning and Resource Center Director will focus on improving attitudes, building self-esteem, and creating the self-confidence that they can improve their quality of life and achieve beyond expectations. Intake to the emergency shelter will include job history and a financial analysis. If guests are unemployed or under employed they will be referred to the Center.\nJob Placement Services\nOnce a student, completes the job readiness training, determines what career to pursue the Center will assist in developing a personalized job search plan. Each student will learn how to search for a job in the 21st century utilizing the power of the internet, networking, and other techniques. A MCREST success coach will guide a student through this difficult process."
	},
	{
		"addressLine1": "PO Box 698",
		"city": "Mount Pleasant",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48858",
		"name": "Isabella County Restoration House",
		"organization": "Isabella County Restoration House",
		"phone": "(989) 854-0183",
		"website": "https://icrhouse.org/",
		"description": "Seasonal Shelter - During winter monthsOpen at 4:30 pm.\n\nThe ICRH Rotating Homeless Shelter provides shelter during the coldest months of the year."
	},
	{
		"addressLine1": "1691 Peck Street",
		"city": "Muskegon",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49441",
		"name": "Muskegon Rescue Mission",
		"organization": "Muskegon Rescue Mission",
		"phone": "(616) 727-6090",
		"website": "https://www.facebook.com/muskegonrescuemission",
		"description": "Emergency Shelter Families/Singles Separate men's and women/family shelter programsl"
	},
	{
		"addressLine1": "1523 Norton Shores Lane",
		"city": "Muskegon",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49444",
		"name": "DARA Ministries",
		"organization": "DARA Ministries",
		"phone": "(231) 830-6466",
		"website": "http://www.daraministries.com/",
		"description": "To serve the Lord by helping Women and Children in need. Need is based upon one or more of the following: emergencies, physical. emotional or spiritual need. Help may include but is not limited to one or more of the following: Faith based learning materials, online computer access (for job searches, housing searches, and certain informational needs at our on site location), financial assistance, food, clothing, household needs, Faith - Based/bible based Christian Family Counseling/Support/Mentoring/Guidance."
	},
	{
		"addressLine1": "2160 Crozier Ave",
		"city": "Muskegon",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49441",
		"name": "Family Promise of the Lakeshore",
		"organization": "Family Promise of the Lakeshore",
		"phone": "(231) 747-8855",
		"website": "http://www.fp-lakeshore.org/",
		"description": ""
	},
	{
		"addressLine1": "314 Truman Boulevard",
		"city": "Newberry",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49868",
		"name": "Good Samaritan House",
		"organization": "Good Samaritan House",
		"phone": "(906) 293-3180",
		"website": "",
		"description": "Emergency Shelter"
	},
	{
		"addressLine1": "246 Ferry Ln",
		"city": "Sault Saint Marie",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49781",
		"name": "Diane Peppler Resource",
		"organization": "Diane Peppler Resource",
		"phone": "(906) 643-0498",
		"website": "http://dprcenter.org/",
		"description": ""
	},
	{
		"addressLine1": "608 Pine Street",
		"city": "Sault Ste. Marie",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49783",
		"name": "SSMHC's Tri-County Safe Haven",
		"organization": "SSMHC's Tri-County Safe Haven",
		"phone": "(906) 635-5841",
		"website": "",
		"description": "Meals Clothing Funiture Referrals"
	},
	{
		"addressLine1": "35 E. Huron Street",
		"city": "Pontiac",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48342",
		"name": "Grace Centers of Hope - Closed Dec 21, 2019",
		"organization": "Grace Centers of Hope - Closed Dec 21, 2019",
		"phone": "(855) 435-7424",
		"website": "http://www.gracecentersofhope.org/",
		"description": ""
	},
	{
		"addressLine1": "P.O. Box 431045",
		"city": "Pontiac",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48343",
		"name": "HAVEN Shelter for Women and Children",
		"organization": "HAVEN Shelter for Women and Children",
		"phone": "(248) 334-1274",
		"website": "https://www.haven-oakland.org/programs/shelter",
		"description": "HAVEN's residential program is Oakland County's only 24-hour emergency shelter exclusively for domestic violence and sexual assault victims and their children.\n\nIf you need a place to go, call our Crisis and Support Line at 248-334-1274.\n\n\nEvery victim is asked to go through a screening process before coming into the shelter. Screenings for the shelter are done through the crisis and support line. Screenings ensure that the individual's needs match our mission and guiding principles. Individuals needing other types of shelter or services are assisted with referrals.\nAccess to our shelter is available only through the Crisis and Support Line at 248-334-1274.\n\nIf you have experienced domestic violence and sexual assault, you and your children may be eligible to stay at the shelter.\n    Men are allowed to stay at the shelter if they are being sexually abused or hurt by their wife, girlfriend or partner.\n    If you are a child (under 18) without a parent, you cannot stay at the shelter, but staff will help you find another place to stay.\n\n    Emancipated minors are welcome to stay at our shelter.\nVictims entering the shelter will need to live peacefully with a diverse variety of individuals who may differ in their beliefs, values and goals.\nFor safety reasons, guests may not visit residents on-site.\n\nChildren are welcome at the shelter.\nWe have special programs and activities for children in our shelter. They go to school, receive counseling, and are offered a variety of supportive groups as well as respite activities (going to the waterpark, a ball game, a playground, etc.). We make sure that all programs help children to feel safe, secure and loved even though it is a difficult time.\n\nThe shelter is a communal living environment. For single women, bedrooms may be shared. Our current bathroom and shower areas are also shared, as are TV viewing and dining areas.\nResidents are asked to help with the chores just like they would do at home.\nThree meals plus snacks are offered daily.\nResidents work with a counselor to achieve individualized goals that help move them out of crisis situations. There are a variety of group offerings to provide both support and information on meeting basic needs.\nSome transportation is available for business and medical appointments.\n\nThe average stay is about 28 days. However, you can stay longer depending on your circumstances.\n\nWhen the shelter is full, staff will help you find another place to stay.\n\n\n\n"
	},
	{
		"addressLine1": "511 Union Street",
		"city": "Port Huron",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48060",
		"name": "Pathway Homeless Shelter",
		"organization": "Pathway Homeless Shelter",
		"phone": "(810) 982-1020",
		"website": "https://drmm.org/",
		"description": "Homeless Shelter"
	},
	{
		"addressLine1": "1920 24th Street",
		"city": "Port Huron",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48060",
		"name": "Blue Water Area Rescue Mission",
		"organization": "Blue Water Area Rescue Mission",
		"phone": "(810) 956-0768",
		"website": "http://www.b-warm.org/",
		"description": "B-WARM qualifications are male, 18 years or older, county resident with a photo ID. Intake is from 4:30 pm to 5:00 pm.We have dinner between 5 pm and 6 pm. Chapel Services are Monday, Tuesday and Thursday at 6 pm. All guest leave by 7 am."
	},
	{
		"addressLine1": "929 Pine Street",
		"city": "Port Huron ",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48060",
		"name": "The Harbor - Runaway and Homeless Youth Shelter",
		"organization": "The Harbor - Runaway and Homeless Youth Shelter",
		"phone": "(810) 982-8584",
		"website": "http://www.harboryouth.com/",
		"description": "The Harbor is a runaway and homeless youth shelter for youth between the ages 9-17. The program provides up to three weeks of shelter to youth who volunteer to be in the program. The program works to reunify families and/or assist youth in finding safe, secure housing."
	},
	{
		"addressLine1": "1228 6th Street",
		"city": "Port Huron",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48060",
		"name": "Blue Water Safe Horizons Port Huron",
		"organization": "Blue Water Safe Horizons Port Huron",
		"phone": "(810) 985-5538",
		"website": "http://www.bwsh.org/",
		"description": "Blue Water Safe Horizons offers shelter and support services for survivors of domestic violence, sexual assault, elder abuse and homelessness. The services and support programs are delivered to the community in a variety of formats ranging from shelter and housing to support groups and legal advocacy."
	},
	{
		"addressLine1": "1222 South Washington",
		"city": "Royal Oak",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48061",
		"name": "Common Ground Sanctuary",
		"organization": "Common Ground Sanctuary",
		"phone": "(800) 231-1127",
		"website": "http://commongroundhelps.org/",
		"description": "The Sanctuary is a free and safe 24-hour shelter that provides 3-week residential counseling to runaways and youths in crisis between the ages of 10-17, with the goal of reuniting youths with their families. For information on how to be accepted into the program, call our 24-hour Crisis and Resource Helpline at 800-231-1127. - See more on our website."
	},
	{
		"addressLine1": "12313 19 Mile Rd.",
		"city": "Sterling Heights",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48313",
		"name": "Abigayle's Place For Single Pregnant Women",
		"organization": "Abigayle's Place For Single Pregnant Women",
		"phone": "(586) 323-1411",
		"website": "http://www.abigayleministries.org/",
		"description": "Abigayle's Place serves single pregnant women, 18 years of age and older, who are without shelter and support. The expectant mother may enter the program at any time in her pregnancy, and can remain in residence for up to three months post partum with her newborn baby.\n\nSince 1997, Abigayle Ministries, a non-profit Christian ministry, has been serving homeless, pregnant women through our residential housing program, Abigayle's Place. This program allows up to six homeless mothers to reside at our facility during their pregnancy and after the birth of their babies for up to three months. While in the program, some of the education and training these women receive includes Bible studies and spiritual guidance, training in basic life skills, parenting, childbirth infant care, nutrition, G.E.D. tutoring, and budgeting skills. The program allows mothers who choose LIFE for their babies to acquire the necessary skills they need to independently support themselves and their children.\n\n\nWe also provide support for the community through our resource center, Abby's Resource Center, which provides diapers, formula, clothing and other baby items to mothers in need. We have been honored and blessed to serve in this manner, and through God's grace, we have witnessed improvement in the quality of many lives over the years."
	},
	{
		"addressLine1": "42960 Ryan Rd",
		"city": "Sterling Heights",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48314",
		"name": "Amelia Agnes Transitional Home for Women",
		"organization": "Amelia Agnes Transitional Home for Women",
		"phone": "(586) 323-7066",
		"website": "http://perfectingcdc.org/programs-services/amelia-agnes-transitional-home/",
		"description": "Our mission is to provide quality housing and support services to homeless women (with or without children) and assist them with becoming self-sufficient.\n\nTHE AMELIA AGNES TRANSITIONAL HOME FOR WOMEN's mission is to provide quality housing and support services to women and children while assisting them with becoming self-sufficient by identifying their own strengths and solutions through: Housing Stability, Educational Advancement, Economic Independence, Parenting & Life Skills, Self- Actualization and Spiritual Growth.\n\nTHE Amelia Agnes Transitional Home is our homeless shelter program where women and children can begin again with dignity and respect. The program provides each family with a private suite and support services in efforts to assist them with becoming self-sufficient. Residents learn to combat homelessness while improving decision-making and problem solving skills along with eliminating barriers hindering educational and economic growth while gaining intervention tools for life restoration."
	},
	{
		"addressLine1": "310 S. Elm St.",
		"city": "Suttons Bay",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49682",
		"name": "Leelanau Christian Neighbors - Suttons Bay Pantry",
		"organization": "Leelanau Christian Neighbors - Suttons Bay Pantry",
		"phone": "(231) 271-0091",
		"website": "http://www.leelanauchristianneighbors.org/",
		"description": "Suttons Bay the pantry is located in the Middle School wing of Suttons Bay Public Schools, 310 Elm Street.  (north end of the school building, look for the LCN sign.)\n\nHours: open on Monday from 2:00-6:00 p.m."
	},
	{
		"addressLine1": "10767 Traverse Hwy.",
		"city": "Traverse City",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49684",
		"name": "Telamon",
		"organization": "Telamon",
		"phone": "(231) 941-5300",
		"website": "",
		"description": "Days Only Clothing Referrals"
	},
	{
		"addressLine1": "1022 E. Front St.",
		"city": "Traverse City",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49686",
		"name": "Third Level Crisis Intervention Center Street Outreach Program",
		"organization": "Third Level Crisis Intervention Center Street Outreach Program",
		"phone": "(231) 922-4800",
		"website": "http://www.thirdlevel.org/",
		"description": "Teens Only Advocacy Outreach Services.\nWe are available 24/7 every day of the year. All of our services are free, regardless of your ability to pay.\nSometimes you just need a break! Pete's Place can provide a safe place to go while you try to work things out at home or figure out what's next. Our shelter is voluntary and free (financial need is never asked) for any youth in crisis ages 14-17, both female and male, and their children. Pete's Place, which is connected to the Goodwill Inn Shelter, is run by Third Level's great staff that's well-trained, caring, and non judgmental."
	},
	{
		"addressLine1": "Various locations all winter",
		"city": "Traverse City",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49684",
		"name": "Safe Harbor of Grand Traverse",
		"organization": "Safe Harbor of Grand Traverse",
		"phone": "(231) 645-0562",
		"website": "http://gtsafeharbor.org/",
		"description": "Safe Harbor is a shelter program that attempts to create community between those in need and those who are able to help.\n\nRotating locations through the cold months.\nProviding evening and morning meals.Organizing volunteers who make themselves available to talk to, socialize with, and serve our guests.\n\nConstantly working to improve our organization and base of support."
	},
	{
		"addressLine1": "715 Beitner Street",
		"city": "Traverse City",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49684",
		"name": "St. Vincent de Paul Society",
		"organization": "St. Vincent de Paul Society",
		"phone": "(231) 947-6069",
		"website": "https://www.facebook.com/svdpgta/",
		"description": "We are a food pantry and thrift store only. We do not have a shelter."
	},
	{
		"addressLine1": "3963 Three Mile Road",
		"city": "Traverse City",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49686",
		"name": "Northwestern Michigan Human Services Agency",
		"organization": "Northwestern Michigan Human Services Agency",
		"phone": "(231) 947-3780",
		"website": "http://www.nmcaa.net/",
		"description": "NMCAA is a non-profit Community Action Agency serving ten counties of northwest lower Michigan and operates the home Weatherization program, the Senior Nutrition and Meals on Wheels programs, the Head Start/Child Development program, and the Community Services program.\n\n\nTraverse City Laundry Project\nThe Laundry Project provides assistance to individuals and/or families that have limited funds to have their laundry cleaned. Participating laundromats provides funds during specific days and times to help those families in need. The program lasts during the school year and is stopped during summer time. Individuals must inform the laundromats attendant that they want to participate in the Laundry Project and complete the sign-in sheet. For information about dates and times, please contact Allison at (231) 714-4578 or email apopa@nmcaa.net \n\n\n\nFor additional information, please contact the Toll Free number (800) 632-7334.\n"
	},
	{
		"addressLine1": "2943 Keystone Road",
		"city": "Traverse City",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "49684",
		"name": "Goodwill Inn",
		"organization": "Goodwill Inn",
		"phone": "(231) 922-4890",
		"website": "http://www.goodwillinn.org/",
		"description": "The Goodwill Inn is an 120 bed emergency shelter that is open the entire year, and it includes 11 suites for families. It provides a safe environment, supportive shelter with food and other basic needs for adults and families that are experiencing homelessness. \n\nThe Goodwill Inn have partnered with Traverse Health Clinic so that individuals, families and staff are as safe as possible and the Coalition to End Homelessness, which helps individuals and their families find housing solutions.\nPlease contact the office for addition information.\n\n\n"
	},
	{
		"addressLine1": "22395 Eureka Rd.",
		"city": "Taylor",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48180",
		"name": "ChristNet",
		"organization": "ChristNet",
		"phone": "(734) 671-1300",
		"website": "https://christnetservices.org/",
		"description": "The mission of ChristNet is to provide temporary overnight emergency housing assistance and other services to homeless men, women, and children.\n\nRegistration at the intake center is from 6:30 to 7:30 p.m. each night. Guests may begin lining up at the side door of the Taylor Church of the Nazarene at 5:00 p.m. Overnight accommodations run from 7:00 p.m. to approximately 7:00 a.m. \"Lights out\" is usually 10:00 p.m. Wake up begins at 5:00 a.m. All guests must be away from the host church by 7:00 a.m. or sooner so that there is no interference with the daytime use of the building.\n\nThe Christnet Rotating Shelter Program is a cooperative, interfaith, community-based effort to provide temporary overnight shelter to homeless men, women, and children (when accompanied by a parent or guardian). Guests may stay for up to 30 consecutive days while they seek a more permanent solution to their living situation. The Intake Center is located inside the lower level of the West Mound United Methodist Church at ChristNet Center. The address is 22395 Eureka Road in Taylor (directly across from Southland Mall). Registration at the intake center is from 6:30 to 7:30 p.m. each night. All OPEN BEDS are given on a first come first serve basis. Guests may begin lining up at the side door of West Mound at 5:30 p.m. Overnight accommodations run from 7:00 p.m. to approximately 6:30 a.m. Lights out is usually 10:00 p.m. Wake up begins at 5:00 a.m. All guests must be away from the host church by 7:00 a.m. or sooner so that there is no interference with the daytime use of the building. Daytime ProgramWe also have a Daytime Program that is located at ChristNet Center. The hours are Monday-Friday from 7am until 3pm, Saturday and Sunday hours are based on the availability of volunteers. Lunch is served at 11:30am.\n\nChristNet Services Daytime Resource Program\nBeginning in December 2008, ChristNet Services began a daytime program. The mission of ChristNet Center's daytime program is to link homeless men and women in our Downriver Detroit communities with available services and resources in a daytime setting that can help them secure appropriate health services, more stable housing, and job skill development that will facilitate employment.\nTemporally located in the lower level of\nTaylor Church of the Nazarene\n24356 Eureka Rd.\nTaylor, MI 48180\n(Located one block west of Telegraph Rd., on the north side of Eureka Rd. Guests seeking services please use the east side entrance)\nPhone 734.287.8890\nFax 734.287.8891\n\nWhere is the shelter located?\nChristNet does not have any single location. Instead, it is hosted on a rotating basis, one week at a time, by various churches and community organizations throughout the Downriver and western Wayne County suburbs. Each church hosts our guests for seven nights, from Sunday evening through the following Sunday morning. Guests are driven away from the host church each morning and return each evening via our ChristNet van.\nAlthough the physical location of the shelter changes from week to week, a central intake has been designated for those seeking nightly shelter. This gathering spot, where guests are screened remains the same throughout the warming season. ChristNet intake takes place at ChristNet Center, in the lower level of the Taylor Church of the Nazarene, 24356 Eureka Rd., Taylor, MI 48180. Transportation is provided from this site to the host church on a nightly basis. No one reporting directly to the host site church on their own will be admitted or accommodated.\nWhat are the shelter's hours of operation?\nRegistration at the intake center is from 6:30 to 7:30 p.m. each night. Guests may begin lining up at the side door of the Taylor Church of the Nazarene at 5:00 p.m. Overnight accommodations run from 7:00 p.m. to approximately 7:00 a.m. \"Lights out\" is usually 10:00 p.m. Wake up begins at 5:00 a.m. All guests must be away from the host church by 7:00 a.m. or sooner so that there is no interference with the daytime use of the building.\nHow many persons can ChristNet accommodate?\nPresently, the shelter can take up to 30 people per night depending on the physical layout of the host church. Smaller churches sign up for the beginning or end of the season when the weather is relatively mild. Only churches that can accept the maximum of 30 guests may host from October through May.\nWhat services are offered by ChristNet?\nThose staying overnight are offered a warm, clean place to stay, an evening meal, breakfast, and a bag lunch to go. Bedding consists of a mattress, pillow, sheets and pillowcase, and two blankets. Personal care items such as razor and shaving cream, soap, shampoo, toothbrush and tooth paste, etc. are offered. Some churches provide clothing. If a shower is available at the church guests are permitted to use it. Shower nights are scheduled at a nearby school gym or community building for those churches that do not have on-site showers.\nIs the shelter supervised? What are the rules?\nYes. Each church provides three to six volunteers who stay the night and supervise the guests making use of the building. ChristNet has several rules to foster the safety and comfort of both guests and volunteers.\nAlcohol is strongly discouraged and guests receive a nightly breathalyzer exam.\n\n \nDrugs and weapons are not permitted. Guests caught with either are permanently barred from the program.\n \nChristNet does not allow foul or obscene language, fighting or arguing, rough horseplay, sexual harassment or innuendo of guests or volunteers, or teasing that is demeaning in nature.\n \nGuests are never allowed to \"walk away\" from the host church under any circumstances. All guests leaving the host church must do so by vehicle.\nWhat does my church need to become a host site?\nGenerally speaking, a church does not need any \"special\" space. Some churches host in a large common room such as a gym or Fellowship Hall. Other churches use their Sunday School rooms. One Catholic church houses guests in an unused convent and another church uses its former parsonage!\nBeds are allocated \"dorm\" style with the men on one side and the women on another. Special arrangement should be made for families staying at the shelter. All of the bedding, towels and wash cloths, and related equipment is provided by ChristNet. The host site is responsible for providing all of the food and all of the volunteer workers.\n"
	},
	{
		"addressLine1": "30600 Michigan Ave",
		"city": "Westland",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48174",
		"name": "Wayne County Family Center",
		"organization": "Wayne County Family Center",
		"phone": "(734) 721-0590",
		"website": "https://www.samaritas.org/",
		"description": "A partnership of Lutheran Social Services of Michigan and Wayne County, offering transitional shelter for homeless families.\n\nOpen for telephone intake seven days a week, 24 hours a day\nWe offer:\nPrivate, locked rooms for each family\nThree balanced meals and snack each day\nLaundry room\nOn-site medical clinic\nEasy access to the SMART bus line\nHelp in finding a permanent home\nJob counseling and placement\nCase management\nEducation/GED resources\nHelp with financial planning\nLicensed child care for preschoolers\nA lending library with computers and internet access"
	},
	{
		"addressLine1": "24140 Mound Road",
		"city": "Warren",
		"state": "Michigan",
		"stateAbbreviation": "MI",
		"postal": "48091",
		"name": "The Salvation Army MATTS",
		"organization": "The Salvation Army MATTS",
		"phone": "(586) 754-7400",
		"website": "https://centralusa.salvationarmy.org/warren/",
		"description": "Macomb's Answer to Temporary Shelter (MATTS)\n\nThe Salvation Army MATTS is a goal based shelter with an average stay of 90 days. We provide housing, meals, clothing, and extensive case management.\n\nShelter for Men, Women, Children\nPriority for people with Macomb County I.D.'s.\n\nMATTS is a drug and alcohol free thirty-day emergency residential unit for men, women, and children in Macomb County.  Residents of MATTS are offered case management and counseling service, referrals, clothing, medical care, and financial assistance.\nMATTS also offers a good deal of community services including a Monday through Friday hot lunch program, AA meetings throughout the week, and referrals to other community agencies.\n To volunteer at MATTS, please call:  586-755-5191"
	}
]