[
  {
    "addressLine1": "2202 Stevens Street",
    "city": "Albert Lea",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56007",
    "name": "Freeborn County Homeless Shelter",
    "organization": "Freeborn County Homeless Shelter",
    "phone": "(507) 373-1329",
    "website": "http://www.semcac.org/",
    "description": "The homeless shelter consists of three apartments adjoining Semcac's Freeborn County Contact Center in Albert Lea, MN. A case manager meets regularly with each shelter household, helping residents work toward stability, secure permanent housing and transition back into the community. The case manager works one-on-one with the household to develop a growth plan, improve financial literacy, and access other resources such as transportation, child care, job seeking skills, medical care, food and clothing. Residents may stay at the shelter for up to 90 days."
  },
  {
    "addressLine1": "409 1st Ave NE",
    "city": "Austin",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55912",
    "name": "Salvation Army Austin Minnesota",
    "organization": "Salvation Army Austin Minnesota",
    "phone": "(507) 437-4566",
    "website": "http://salvationarmynorth.org/community/austin",
    "description": "The Salvation will provide short time housing assistance to people in crisis. Call for full details."
  },
  {
    "addressLine1": "3300 4th Avenue North #14",
    "city": "Anoka",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55303",
    "name": "Stepping Stone Emergency Housing",
    "organization": "Stepping Stone Emergency Housing",
    "phone": "(763) 323-7006",
    "website": "https://steppingstoneeh.org/",
    "description": "Stepping Stone Emergency Housing is Anoka County's only youth & adult homeless shelter, and one of Minnesota's most trustworthy non-profit organizations. In a dormitory-style setting, Stepping Stone provides a primary, yet temporary home to 66 men and women, as young as 18 years old.\n\nAll residents, regardless of their time spent at Stepping Stone, have their basic needs met. We provide a bed to sleep, linens, three meals a day, shower, laundry facilities, and clothes and toiletries, when needed.\n\n\nOn average, residents live at Stepping Stone for 90 days. However, some stay less time and some stay more, depending on their need. During their time here, our Shelter Advocates make sure that their day-to-day, shelter needs are met. On the other hand, our Case Manager meets with each resident one-on-one to develop a comprehensive Individual Goal Plan (IGP), ensuring that the resident' needs for leaving Stepping Stone are also met. The IGP determines the ultimate goal of each resident and defines the attainable goals in which to achieve their goal.\n\nEmergency Shelter\nFor individuals who are seeking temporary shelter ONLY\nAll basic needs provided for regardless of their length of stay\nInitial stay is 7 days or less with a maximum stay of 28 days within a 365 day period, which begins the first day the individual enters Emergency Shelter\nMaximum capacity of 6 men and 4 women on any given day\n\nResident must meet with Case Manager, comply with all Rules & Regulations, and complete all assigned chores\n\nBasic Needs\nRegardless of the program or length of stay, all residents of Stepping Stone are supplied their BASIC NEEDS, at all times.\nThese include:\nAccess to the facility 24/7, while an approved resident\nAssigned a room with a bed, linens, pillow, storage locker and closet\nThree meals per day, plus a snack in the evening\nShowers, including towels, soap, shampoo, conditioner, lotion, deodorant, toothbrush and toothpaste\nLaundry facility, including laundry detergent\nClothing provided thanks to community donations\n\nEmergency Housing\nFor individuals who desire and are willing to work on the issues that contributed to their homelessness\nDirectly come from Emergency Shelter program\nAll basic needs provided for regardless of their length of stay\nMaximum planned stay is 90 days, an extension in 30-day increments is allowed\nRequired development of Individual Goal Plan (IGP) with Case Manager\nResident must meet with Case Manager, comply with all Rules & Regulations, and complete all assigned chores\nEngage in making progress on IGP\nMeet with Anoka County Financial Assistance Worker\nFunding Structure: MN state funded Group Residential Housing, personal contribution, or combination of both\n\n\n"
  },
  {
    "addressLine1": "621 Elwood Avenue N",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55411",
    "name": "Homeless Shelter at Zion Baptist Church Hope Avenue North",
    "organization": "Homeless Shelter at Zion Baptist Church Hope Avenue North",
    "phone": "(612) 377-5436",
    "website": "https://www.zbcmn.net/",
    "description": ""
  },
  {
    "addressLine1": "525 North 7th St",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55405",
    "name": "Sharing and Caring Hands",
    "organization": "Sharing and Caring Hands",
    "phone": "(612) 338-4640",
    "website": "http://sharingandcaringhands.org/",
    "description": "The Sharing & Caring Hands Day Services Center, located only a few blocks from downtown Minneapolis, offers most of our day-to-day services for the poor and homeless. At the Day Services Center we offer hot meals, a Food and Clothing Shelf, Dental and Medical Clinics, and assistance with a variety of needs including transportation, beds, vouchers for eye glasses, funds to purchase State I.D's and birth certificates and many other services that help provide for the basic needs of the poor and support them in finding stability.\n\n\n\nOur support is delivered in a unique manner that is best demonstrated by Mary Jo's tradition of washing the feet of those in need. Twice each day, basins of warm water are set out and Mary Jo and the volunteers bathe and apply ointment to dozens of blistered, sore, and tired feet. Many are supplied with new socks and shoes and sent on their way knowing that at least in one place in this often difficult and heartless world, someone cares in a special way.\n\n\n\n\nEach month we serve over 20,000 meals. These meals are prepared and served completely by our volunteer partners. Often times they furnish all the ingredients. Most of these volunteers are offering their time and service with an ongoing regular monthly commitment, putting their values into a real demonstration of love and service.\n\n\n\nOur Food Shelf supplies food to hundreds of people each month. We also give out clothing, household goods, towels, and much more in an ongoing commitment to meeting the needs of the poor in our community. Each month over $500,000 is spent on the needs of those in poverty.\n\n\n\nWe offer walk-in showers for the homeless and each day over 50 showers are provided. We have a completely free dental clinic with two fully-furnished dental stations and a dental lab. The clinic is staffed entirely by volunteer dentists. We also have a medical clinic staffed by Health Care for Homeless.\n\n\n\n\nWe receive many donations of clothing, household goods, toys, and food which we give out to those in need at no charge. Hundreds of people come each day to see what is available to help them stretch their limited income.\n\n\n\nOur offices also provide numerous other services to those in need. We provide bus tokens, rent deposits, employment expenses, vouchers for state identification, co-pays, eye glass vouchers, and much more. Mary Jo personally meets with each person to determine what type of assistance we can offer. When those in need come to us and are ready to make a transition to a stable and responsible life, we are ready to support them in every way possible.\nUpdated Data: 6/2019. See below\nShelter\n\nWe have apartments for homeless families with two or more children that are minors. If you're in need of shelter, bring your entire family to Sharing & Caring Hands (525 N. 7th St.) Monday Thursday at 10:30AM or 1:30PM.\n\nPlease note that requests for shelter are considered on an individual basis and are not automatically granted.\n\nMeals\n\nHot meals are served at our Day Services Center Monday Thursday at 10:30AM, 12PM, & 3PM; Saturday and Sunday at 9:30AM & 11AM; no meals served on Fridays. All are welcome to join us for these meals.\n\nFood\n\nBags of food are given to families with children and individuals: Monday Thursday 10:30AM - 11:30AM or 1:30PM 3:00PM.\nMary Jo Copeland with a group of young boys\n\nDental\n\nDental services are available on a first-come, first-serve basis whenever a dentist is available. We provide extractions and fillings only. Please call our main number 612-338-4640 to check for dates and times to come. Dental clinic is located downstairs at our Day Services center. All services are free of charge and services are provided for those who have little to no dental coverage.\n\nBeds\n\nBeds can be ordered for those who have recently moved into an apartment/home (within the last 30 days). Beds are placed on a first-come, first-serve basis in person on Monday mornings starting at 10:30AM and end when we have an order of 50 beds. We deliver to Minneapolis and some connecting suburbs. We do not deliver to some areas of St. Paul and other metro locations. We are still able to order beds for clients not living within our delivery areas as long as clients can pick up their beds. Beds are full or twin-size and are new or gently used. We will order one bed per individual/up to two beds for families of two or more people in their households. You must bring your lease and some form of identification.\n\nOther Services at our Drop-in Center\n\nThe following services are offered, but depend upon availability and individual determination. If you need to request these services, you must wait to see Mary Jo Monday Thursday 10:30AM 11:30AM or 1:30PM 2:30PM.\n\nEye glass voucher for exams and/or glasses for uninsured or under-insured\nShoes\nVouchers to get State Identification/Birth Certificate\nVouchers for place to stay for homeless men\nBus Token\nBus Card for those with proof of recent hire in permanent position\nWe offer many other services that are provided based on an individuals situation and available funds.\n"
  },
  {
    "addressLine1": "401 North 7th St",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55405",
    "name": "Mary's Place",
    "organization": "Mary's Place",
    "phone": "(612) 338-4855",
    "website": "https://sharingandcaringhands.org/",
    "description": "Shelter\nWe have apartments for homeless families with two or more children that are minors. If you're in need of shelter, bring your entire family to Sharing & Caring Hands (525 N. 7th St.) Monday Thursday at 10:30AM or 1:30PM.\n\nPlease note that requests for shelter are considered on an individual basis and are not automatically granted.\n\nMeals\nHot meals are served at our Day Services Center Monday Thursday at 10:30AM, 12PM, & 3PM; Saturday and Sunday at 9:30AM & 11AM; no meals served on Fridays. All are welcome to join us for these meals.\n\nFood\nBags of food are given to families with children and individuals: Monday Thursday 10:30AM - 11:30AM or 1:30PM 2:30PM.\nMary Jo Copeland with a group of young boys\n \nDental\nDental services are available on a first-come, first-serve basis whenever a dentist is available. We provide extractions and fillings only. Please call our main number 612-338-4640 to check for dates and times to come. Dental clinic is located downstairs at our Day Services center. All services are free of charge and services are provided for those who have little to no dental coverage.\n\nBeds\nBeds can be ordered for those who have recently moved into an apartment/home (within the last 30 days). Beds are placed on a first-come, first-serve basis in person on Monday mornings starting at 10:30AM and end when we have an order of 50 beds. We deliver to Minneapolis and some connecting suburbs. We do not deliver to some areas of St. Paul and other metro locations. We are still able to order beds for clients not living within our delivery areas as long as clients can pick up their beds. Beds are full or twin-size and are new or gently used. We will order one bed per individual/up to two beds for families of two or more people in their households. You must bring your lease and some form of identification.\n\nOther Services at our Drop-in Center\nThe following services are offered, but depend upon availability and individual determination.  If you need to request these services, you must wait to see Mary Jo Monday Thursday 10:30AM 11:30AM or 1:30PM 2:30PM.\n\n    Eye glass voucher for exams and/or glasses for uninsured or under-insured\n    Shoes\n    Vouchers to get State Identification/Birth Certificate\n    Vouchers for place to stay for homeless men\n    Bus Token\n    Bus Card for those with proof of recent hire in permanent position\n    We offer many other services that are provided based on an individuals situation and available funds.\n"
  },
  {
    "addressLine1": "165 Glenwood Avenue",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55405",
    "name": "Catholic Charities Higher Ground Shelter Adult Shelter",
    "organization": "Catholic Charities Higher Ground Shelter Adult Shelter",
    "phone": "(612) 204-8552",
    "website": "https://www.cctwincities.org/locations/higher-ground-shelter/",
    "description": "171 shelter spaces, 80 Pay-For-Stay beds, Hennepin County social services, light evening meal, breakfast, showers, some lockers and shower facilities.\n\nAdditional services include Healthcare for the Homeless available hours limited.\n\n\nThe emergency homeless shelter is open 365 days a year near downtown Minneapolis and offers a warm place to rest and spend nighttime hours.\n\nThe Pay-for-Stay facility offers beds, lockers, linens, showers and access to employment resources to men trying to escape the streets. The money guests pay for shelter ($7 per night) is held in trust to be used as rental deposits when they move into permanent housing. Hours: Daily, 5 p.m. 10 a.m."
  },
  {
    "addressLine1": "177 Glenwood Avenue North",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55405",
    "name": "Evergreen Residence - Single Room Occupancy",
    "organization": "Evergreen Residence - Single Room Occupancy",
    "phone": "(612) 204-8406",
    "website": "https://www.cctwincities.org/locations/evergreen-residence/",
    "description": "88 units of single room occupancy, permanent housing for independent, single adults, recreational activities, with access to Narcotics Anonymous meetings."
  },
  {
    "addressLine1": "1010 Currie Ave",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55403",
    "name": "Salvation Army Harbor Light Shelter",
    "organization": "Salvation Army Harbor Light Shelter",
    "phone": "(612) 767-3100",
    "website": "http://salvationarmynorth.org/community/harbor-light/",
    "description": "We offer a wide range of basic needs and rehabilitation services to anyone in need, without discrimination. Our shelter is Minnesota's largest homeless adult outreach facility and includes a clinical treatment program for men working to beat chemical dependency.\n\nThis secure shelter offers a safe place to spend the night. The program is free and available on a first-come, first-served basis. A free hot meal is served at 6 p.m. and warm showers are available.\n\n\nThe emergency housing program provides up to three balanced meals each day and personal hygiene supplies for men and women who are eligible for county-funded shelter. Case workers provide referrals to subsidized housing, substance abuse recovery and employment services. A medical respite unit is available for those with medical needs.\n\nMen and women seeking a sober living environment may live at one of our transitional housing facilities in the Twin Cities for up to two years. Residents receive case management and gain independent living experience. Program fees are payable on a monthly basis.\n\nTwenty of our transitional housing units are set aside for veterans."
  },
  {
    "addressLine1": "614 Third Street South",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55415",
    "name": "People Serving People",
    "organization": "People Serving People",
    "phone": "(612) 332-4500",
    "website": "https://www.peopleservingpeople.org/",
    "description": "PSP's ultimate goal is to permanently end a family's homelessness with one visit to the shelter. The Family Transformation Support Services (FTSS) pilot is directly aimed at accomplishing this ambitious goal.\n\nPSP has provided emergency shelter for more than two decades and our staff has seen firsthand that making the transition from homelessness to stable housing is not easy. Participants are selected for the pilot through a screening process that targets families who are likely to be underserved by existing resources within Hennepin County and at risk for returning to shelter. PSP's FTSS program staff will provide the additional support these families need to make a successful and long-term transition from homelessness to maintaining stable housing in the community.\n\nSupportive Housing\nIn addition to providing 99 units of emergency shelter for homeless families, People Serving People has the opportunity to help families through longer-term contact with our Supportive Housing Program. People Serving People has 10 two-bedroom apartments with open-ended leases for families with multi-level barriers. Residents of these apartments pay reduced-rate rents for their space and can avail themselves of the services offered by the on-site collaborative agencies. In addition, Supportive Housing residents are provided free telephone service, laundry facilities, utilities, furniture and appliances, and are able to provide and cook their own meals and provide supplies necessary for personal needs and apartment upkeep. The purpose of the Supportive Housing Program is to help families establish a solid foundation of good rental history, employment, education, and family stability."
  },
  {
    "addressLine1": "215 South 8th Street",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55402",
    "name": "Adult Shelter Connect Minneapolis St. Olaf Church",
    "organization": "Adult Shelter Connect Minneapolis St. Olaf Church",
    "phone": "(612) 248-2350",
    "website": "https://www.simpsonhousing.org/adult-shelter-connect-simpson-shelter/",
    "description": "Location: St Olaf Church\n\nIndividuals will need to visit the Adult Shelter Connect (ASC) for an assessment and placement at one of the five Minneapolis shelters and referrals to other services.\nASC direct line: 612.248.2350\n\nThe five Minneapolis shelters serving single adults in Hennepin County have formed the Single Adult Shelter Collaborative. On October 17, 2016, the Collaborative opened the Adult Shelter Connect in order to assist single adults experiencing homelessness in accessing and navigating the single adult shelter system in a more logical and dignified way.\n\nHours:\nMondays through Fridays 9am to 5:30pm.\nSaturdays and Sundays: 1pm to 5:30pm.\nAfter hours: Call 211 or 651-291-0211\nSingle adults must visit Adult Shelter Connect in person at least one time to receive a community card and access shelter. Once you have your community card, you can access shelter over the phone.\n"
  },
  {
    "addressLine1": "510 South 8th Street",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55404",
    "name": "House of Charity",
    "organization": "House of Charity",
    "phone": "(612) 594-2000",
    "website": "https://www.houseofcharity.org/resources/housing",
    "description": "Housing Services:\n\nOn-Site Supportive Housing\nThere are two types of On-Site Supportive Housing at our 510 South 8th Street Residence:\n\nHousing Supports (formerly GRH): County-funded beds for men and women who have experienced long-term homelessness.\n\n\nVeterans Administration Beds: For homeless veterans who are referred through the V.A.\n\nOnce they move into our residential building, clients have the opportunity to meet regularly with a case manager to identify their needs, set goals, and connect with resources. Client goals typically include education, job training, family reunification, and long-term housing.\n\nAll of our residents have access to free laundry facilities and three meals a day. About one-third of our residents also participate in our Day by Day Recovery Program.\n\n\nScattered-Site Permanent Supportive Housing\nHouse of Charity is proud to partner with Hennepin County to combat homelessness through participation in the Housing First Program.\n\nWeekly visits from our case managers, or housing advocates, promote client stability. The advocates assist clients in maintaining their housing and accomplishing other goals including education, job training, volunteering, and family reunification.\n\n\nOther clients may move to sober houses, long-term care facilities, private apartments, or other housing depending on their life situation.\n\n\nVisit the website provided for documents needed to apply."
  },
  {
    "addressLine1": "2309 Nicollet Avenue South",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55404",
    "name": "St. Stephen's Street Outreach",
    "organization": "St. Stephen's Street Outreach",
    "phone": "(612) 874-0311",
    "website": "https://ststephensmpls.org/our-programs",
    "description": "St. Stephen's Street Outreach is part of St. Stephen's Human Services, which offers shelter, housing, employment, and systems change for those who are homeless.\n\nSt. Stephen's Shelter offers sober shelter to 45 adult men every night.\n\n\nOur comprehensive shelter program includes facilities such as laundry and showers, as well as an employment and savings programs and intensive advocacy to help guests attain housing.\nLocation and Hours\n\n2211 Clinton Ave South\nMinneapolis, MN 55404\n\n5:30 p.m. - 7:00 a.m. Monday-Friday\n3:00 p.m. - 7:00 a.m. Saturday\n3:00 p.m. - 9:00 a.m. Sunday"
  },
  {
    "addressLine1": "2315 Chicago Ave. So.",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55404",
    "name": "Our Saviour's Community Services",
    "organization": "Our Saviour's Community Services",
    "phone": "(612) 871-5900",
    "website": "https://oscs-mn.org/",
    "description": "Location: St. Olaf Church\n\nDuring COVID-19, all individuals still need to go through Adult Shelter Connect for placement at one of the Minneapolis adult (18+) shelters, including Our Saviours Shelter. However, all assessments are now being conducted by phone. Please call 612.248.2350 Monday-Friday, 9am-5:30pm, or Weekdays and Holidays, 1-5:30pm.\nOur Saviour's Housing\n2219 Chicago Ave. So.\nMinneapolis, MN 55404\nPhone | 612.872.4193\nFax | 612.872.4442\nOTHER AREA RESOURCES\nFamily Shelters\n612.348.9410\nCall the Hennepin County Family Shelter Team during daytime, weekday hours for access to family shelters (adults with children under the age of 18) in Hennepin County. On holidays, weekends, and evenings until 11pm, call 211 (mobile: 651.291.0211), and ask for the after-hours shelter team.\n\nDomestic Violence Shelters\n866.223.1111\nA 24-hour crisis hotline that can connect you to open beds in domestic violence shelters throughout Minnesota. Also provides advocacy from a supportive person, choices about involving law enforcement, and other resources. For anyone experiencing domestic violence, sexual assault or sexual violence, human trafficking, or simply questioning aspects of their relationship.\n\n\nMetro Shelter Hotline\n1.888.234.1329 (toll free)\nA 24-hour hotline for information about additional shelters and housing programs in the metro area (including for youth, families, and domestic violence). Helps you avoid making multiple calls.\n"
  },
  {
    "addressLine1": "2740 1st Ave S",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55404",
    "name": "Simpson Housing Services Overnight Emergency Shelter",
    "organization": "Simpson Housing Services Overnight Emergency Shelter",
    "phone": "(612) 874-0306",
    "website": "https://www.simpsonhousing.org/",
    "description": "Office Hours are Monday Friday from 3:00 p.m. to 5:00 p.m.\n* Reservations for shelter are required! Click here for information or call the Adult Shelter Connect Office at 612.248.2350\n\n\nOur mission is to house, support and advocate for people experiencing homelessness.\n\n\n\nWe know that with close, individual advocacy and support, men, women and families experiencing homelessness achieve housing stability. We are committed to Housing First: house people quickly, then provide services as needed.\n\n\n\nWe provide a full continuum of supportive housing services tot those experiencing homelessness, which is unique in the Twin Cities metro.\n\n\n\nOvernight shelter\n\nEvery night in our overnight shelter, Simpson offers a bed, a warm meal, a hot shower, laundry services, advocacy and the dignity of being addressed by name to 66 people experiencing homelessness.\n\nOvernight Shelter\n\n2740 1st Ave S\n\nMinneapolis, MN 55408\n\n612.874.0306\n\noffice hours: Mon thru Fri, 3 to 5 pm\n\n\nFamily Housing\n\nThe Simpson Family Housing program provides subsidized, supportive rental housing for families with children. Families receive assistance in finding housing and support in developing the skills to maintain stability more\n\n\n\nSingle Adult Housing\n\nOur Single Adult programs work with long-term homeless adults who are referred to us by local shelters. Through our five Collaboration of Housing Resources (COHR) teams, we serve over 200 additional people. Simpson also participates in the Currie Avenue Partnership, an initiative to house 150 adults experiencing homelessness, who have disabilities\n\n"
  },
  {
    "addressLine1": "14383 Forest Blvd. N.",
    "city": "Hugo",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55038",
    "name": "St. Andrew’s Family Shelter",
    "organization": "St. Andrew’s Family Shelter",
    "phone": "(651) 762-9124",
    "website": "https://www.saintandrews.org/serve/serve-care-locally/community-resource-center/",
    "description": ""
  },
  {
    "addressLine1": "1121 East 46th Street",
    "city": "Minneapolis",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55407",
    "name": "Hope Street Shelter - Shelter for Young Adults",
    "organization": "Hope Street Shelter - Shelter for Young Adults",
    "phone": "(612) 827-9372",
    "website": "https://www.cctwincities.org/locations/hope-street-shelter/",
    "description": "helter for homeless youth\n\n28-bed shelter for young adults ages 18-20, 30-day average stay, longer stays available if needed, basic needs; food, shelter, clothing, and laundry.\n\nAdditional services include crisis counseling and support, case management, mental health and chemical dependency counseling, on-site medical care, Independent Living Skills training , one-to-one educational assistance.\n\n\nAs of June 1, 2017 Hope Street Shelter no longer serves youth ages 16-17 years. The Bridge for Youth in Hennepin County provides services for youth ages 16-17."
  },
  {
    "addressLine1": "1088 University Ave W",
    "city": "St. Paul",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55104",
    "name": "Kingdom Pathways Freedom Outreach",
    "organization": "Kingdom Pathways Freedom Outreach",
    "phone": "(651) 387-8393",
    "website": "http://www.kingdompathways.org/",
    "description": "CTI is an empirically supported, time-limited case management model designed to prevent homelessness and other adverse outcomes in people with mental illness following discharge from hospitals, prisons and other institutions. CTI is designed to be most effective when individuals are housed in the community and helped with a long term support plan.\n\n"
  },
  {
    "addressLine1": "435 East University Avenue",
    "city": "St. Paul",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55101",
    "name": "Union Gospel Mission Twin Cities",
    "organization": "Union Gospel Mission Twin Cities",
    "phone": "(612) 292-1721",
    "website": "https://www.ugmtc.org/",
    "description": "Shelter\nUnion Gospel Mission Twin Cities offers shelter to those experiencing homelessness or addiction\nSupport that leads to self-sufficiency.\n\nHomelessness can happen to anyone. A job loss, a long-term disability, divorce, abuse the reasons for homelessness are as different as the people who come through our doors.\nAt Union Gospel Mission Twin Cities we offer more than a safe night of sleep. We provide time to heal and the tools to rebuild a life. Our Christ-centered programs care for the whole person. Like the Good Samaritan in the Gospel of Luke, we meet immediate needs and care for people until they can get back on their feet.\n\nDiscipleship\nThe Discipleship program teaches men how to rebuild their lives on biblical principles. Students attend classes to grow their faith and improve their academic skills while developing good habits in communication, conflict resolution, and problem solving. All students work at the Mission so they gain experience for re-entering the workforce.\n\nMen's Services\nAddiction\nEducation\nFood\nHealth\n"
  },
  {
    "addressLine1": "435 University Ave E",
    "city": "St. Paul",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55130",
    "name": "Bethel Hotel",
    "organization": "Bethel Hotel",
    "phone": "(651) 789-7599",
    "website": "https://www.ugmtc.org/",
    "description": "Emergency shelter for men.\n\nThe Bethel Hotel, provides 139 transitional housing and emergency shelter beds, including 52 cots in the Chapel, for up to 158 men per day.\n\nMen's Services\nAddiction\nEducation\nFood\nHealth\nShelter"
  },
  {
    "addressLine1": "435 Dorothy Day Place",
    "city": "St. Paul",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55102",
    "name": "Higher Ground Saint Paul Shelter",
    "organization": "Higher Ground Saint Paul Shelter",
    "phone": "(651) 647-2330",
    "website": "https://www.cctwincities.org/locations/higher-ground-saint-paul/",
    "description": "Overnight emergency shelter for men and women, Includes pay-for-stay overnight shelter, social services provided through collaboration with Ramsey County. Includes showers and light dinner. 172 beds for men, 60 beds for women.\n\nThere is a small fee for this overnight shelter for men, providing bunk beds, showers and lockers for $7/night, $42/week. 48 beds.\n"
  },
  {
    "addressLine1": "244 Tenth Street East",
    "city": "Saint Paul",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55101",
    "name": "The Family Place",
    "organization": "The Family Place",
    "phone": "(651) 225-9354",
    "website": "http://famplace.org/",
    "description": "Day Center for Families Living Without a Permanent Home\n\nThe Family Place guides children and their parents/caregivers from uncertainty to stability in the quest in finding a place to call home.\n\nThe Family Place staff in conjunction with Coordinated Access to Housing and Shelter (CAHS) and Ramsey County help parents/caretakers evaluate the issues that contributed to their state of  homelessness. An action plan is established to move families to stability.\nOnce a family finds suitable housing, The Family Place's Housing Program provides a move in basket with basic household cleaning supplies, bedding, dishes and cookware along with a tool kit.\nIf you are seeking shelter, please contact: Coordinated Access to Housing and Shelter (651) 215-2262."
  },
  {
    "addressLine1": "183 Old Sixth Street",
    "city": "Saint Paul",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55102",
    "name": "Dorothy Day Center Minneapolis",
    "organization": "Dorothy Day Center Minneapolis",
    "phone": "(651) 647-2350",
    "website": "https://www.cctwincities.org/locations/dorothy-day-center/",
    "description": "Nightly emergency shelter, housing services, meals, showers, veteran services, laundry, mental health assistance, mail, chemical health support groups.\nThe Dorothy Day Women's Shelter provides shelter and temporary housing to 42 single women experiencing homelessness.\n\n\nNightly emergency shelter is provided for single adult men and women on a first come, first serve basis.\nThe shelter is open every day. Nighttime services start at 8:30 p.m. and end at 6:30 a.m.\n\nCatholic Charities' Dorothy Day Center serves multiple functions. During the day, the Dorothy Day Center provides meals, mental health services and medical care, showers, and much more to help people experiencing homelessness. Catholic Charities' Housing First staff work to help guests move from Dorothy Day Center into permanent housing.\n\nAfter dinner has been served, the tables and chairs are put away to transform the building into a bedroom. At night, Dorothy Day Center becomes an emergency shelter, providing a safe place for more than 200 people to get rest on mats just inches apart."
  },
  {
    "addressLine1": "77 E 9th Street",
    "city": "St. Paul",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55101",
    "name": "Naomi Family Residence",
    "organization": "Naomi Family Residence",
    "phone": "(651) 228-1800",
    "website": "https://www.ugmtc.org/",
    "description": "The Naomi Family Residence provides a comfortable shelter for women and children who are homeless so they can start rebuilding a new life for themselves. We take a holistic approach to care by providing secure shelter; hot, nutritious meals; and courses and support services that assist women in becoming whole again in mind and spirit.\n\nServices:\nFor women only.\nAddiction\nEducation\nFood\nHealth\nShelter"
  },
  {
    "addressLine1": "2001 Van Dyke Street",
    "city": "Maplewood",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55109",
    "name": "Catholic Charities Family Service Center",
    "organization": "Catholic Charities Family Service Center",
    "phone": "(651) 291-0211",
    "website": "https://www.cctwincities.org/locations/family-service-center/",
    "description": "For Ramsey County families experiencing homelessness\n\nUp to 120 consecutive nights of shelter for families, activities for children, tutoring and resources, parenting education with life skills training.\n\n\nHousing and employment search assistance, three meals per day, transportation assistance, onsite medical and dental health services, laundry facilities, computer lab.\n\nFamilies receive housing and employment search resources and other services to help them transition from homelessness to stable housing.\n\nAs many as 65 adults and children may stay at the Family Service Center for a maximum of 120 days per year."
  },
  {
    "addressLine1": "7800 West County Road 42",
    "city": "Apple Valley",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55124",
    "name": "Matrix Emergency Shelter in Dakota County",
    "organization": "Matrix Emergency Shelter in Dakota County",
    "phone": "(651) 319-2153",
    "website": "https://graceofav.org/shelter/",
    "description": ""
  },
  {
    "addressLine1": "3430 Wescott Woodlands",
    "city": "Eagan",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55123",
    "name": "Dakota Woodlands",
    "organization": "Dakota Woodlands",
    "phone": "(651) 456-9110",
    "website": "http://www.dakotawoodlands.org/",
    "description": "Supportive Services at the Shelter\nDakota Woodlands is the parent that most residents never had or at least didn't take advantage of when they had the chance. It is impossible to quantify the value of an encouraging word when a mom ensures her child is getting to school every day on time or a child brings home an improved report card. Even a complement on appearance or for the meal they just prepared can create confidence and self-worth.\nDW has the advantage of being with the residents every day, becoming a family that cares and worries about them. This also requires tough love , residents must fulfill program requirements: attend various educational opportunities, for example financial literacy instruction, parenting classes, responsible renter course, and healthy lifestyle instruction. They must also reliably keep their appointments with their county appointed service workers such as social workers, psychologists or counselors, and medical personnel.\n\nThey need to meet with their children's teachers when asked and make sure that they tend to their children's needs at all times. DW provides childcare for the residents to make it easier for them to fulfill the social and educational requirements of the program.\nDW also provides tutors and offers to fund their GED instruction should they choose to pursue it, even after they leave the shelter.\n\nContinued Support after Leaving the Shelter\nWhen a household leaves the shelter, DW makes every attempt at keeping in contact with them, introducing them to community connections that will continue to assist them in their recovery and including them in family activities such as picnics, community arts, and school functions. DW provides transportation for these activities and admission fees.  \nFormer residents are also assisted with emergency expenses: diapers, formula, small loans, and other immediate needs that could fling them back into homelessness if unmet."
  },
  {
    "addressLine1": "525 Mississippi Avenue North West",
    "city": "Bemidji",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56601",
    "name": "Village of Hope",
    "organization": "Village of Hope",
    "phone": "(218) 751-0722",
    "website": "https://www.bemidjivillageofhope.org/",
    "description": "We promote self worth and independence through the provision of temporary shelter and supportive services for families experiencing homelessness. We will strengthen our community by assisting families in breaking the cycle of homelessness.\n\nClients or referents call the central intake number (218-751-0722). General questions are answered regarding eligibility, homelessness, and anticipated openings. Referents that are not able to be accommodated immediately are placed on an optional waiting list while every attempt is made to assist the referent in identifying an alternative shelter plan.\n\nELIGIBILITY REQUIREMENTS\n\nVILLAGE OF HOPE residents will be selected in accordance with the following eligibility criteria:\n\n    The family unit must be homeless as defined by HUD guidelines.\n\n\n    The primary applicant must be at least 18 years old and either pregnant or have primary guardianship/custody of one or more dependent children ages 17 or younger.\n\n    All qualified households whose income at the time of initial occupancy does not exceed 50% or greater of the statewide or area median household income as determined by HUD and adjusted for families of five or more.\n\n    Extended family members residing with the family prior to application for shelter at Village of Hope will be included in the definition of the \"family unit\".\n\n    The applicant must not be currently abusing alcohol or drugs.\n\n    The applicant must be stable on psychiatric medications and prescribed medications for medical conditions and be willing to take them as prescribed.\n\n\n    The applicants criminal history will be reviewed on an individual basis.  Certain offenses may result in denial of admission.  These may include sexual offenses requiring the tenant to register with local officials, violent crimes against persons or property, assault, arson or destruction of property.\n\n    The applicant must not pose a risk of serious harm to self or others.\n\n    The applicant must express a definite and informed desire to enter the emergency shelter program, including actively participating in a housing search and case management program.\n\n    The applicant must be willing to accept group living including:\n        A tolerance and respect for other shelter residents and staff,\n        A willingness to adhere to shelter rules,\n        A willingness to fully participate in maintaining the shelter and sharing cleaning and maintenance duties.\n\n    If applicant is eligible for Group Residential Housing (GRH), the applicant must be willing to assist VILLAGE OF HOPE in verifying the requirements including documentation of:\n        Disability and/or chemical dependency,\n        Income and/or asset verification confirming applicant fits the requirements of the program.\n\nIntake Procedures\n\nClients or referents call the central intake number (218-751-0722). General questions are answered regarding eligibility, homelessness, and anticipated openings.  Referents that are not able to be accommodated immediately are placed on an optional waiting list while every attempt is made to assist the referent in identifying an alternative shelter plan.\n\nUpon vacancy of a family unit the waiting list is reviewed and families with the highest level of need are invited to participate in the application process.  This process includes the opportunity to:\n\n        View the facility.\n        Review the terms of the agreement to participate in a housing search and case management.\n        Review the resident rules.\n        Sign releases of information to verify homelessness.\n        Sign releases of information to verify income.\n\nHomelessness is determined by utilizing a checklist for eligibility (see attached) and receiving the verification by a third party in writing, on the Minnesota Housing \"Housing Status Verification/Referral Form\" (see attached) whenever possible.  In cases where no written independent verification is possible from a shelter, a case manager or other 3rd party, clients must complete and sign the Minnesota Housing \"Housing Status Self-Certification Form\" (see attached).\n\nOnce homelessness is verified, in writing, on the forms provided by Village of Hope, and exclusionary criteria are determined not applicable, applicants are forwarded to the Executive Director for review.\n\n\nIf an applicant is approved, they are accepted and will be allowed to move into Village of Hope.  Once a room is available, the homeless advocates will coordinate a move-in date and time with the applicant."
  },
  {
    "addressLine1": "414 Lincoln Ave SE",
    "city": "Bemidji",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56601",
    "name": "Bemidji Churches United",
    "organization": "Bemidji Churches United",
    "phone": "(218) 444-1380",
    "website": "http://www.bemidjicu.org/",
    "description": "Hello and welcome!Services we offerEmergency Financial Assistance - for basic needs (shelter, food, utilities and emergency transportation)Referrals - to area agencies and businessesAdvocacy - for individuals, children and familiesMediating - between clients, landlords, property managers, utility companies and other vendors\n\nWho is Churches United?Churches United is a collaboration of Bemidji area churches led by the Spirit of Christ, organized to serve and meet the needs of homeless, persistently poor, and impoverished individuals and families by providing individuals and family's financial assistance and referrals in an empowering manner, while also seeking the causes of poverty with the goal to reach a solution to the current concerns.\n\n\nAll churches are welcome to join us in this ministry. If your congregation is interested, please contact us."
  },
  {
    "addressLine1": "525 Mississippi Ave NW",
    "city": "Bemidji",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56601",
    "name": "Ours to Serve House of Hospitality",
    "organization": "Ours to Serve House of Hospitality",
    "phone": "(218) 751-0722",
    "website": "http://www.villageofhopebemidji.org/",
    "description": "Ours to Serve House of Hospitality provides up to 30 days of emergency shelter for both individuals and families. For more information contact Ours to Serve House of Hospitality.\n\nELIGIBILITY REQUIREMENTS\nVILLAGE OF HOPE residents will be selected in accordance with the following eligibility criteria:\n    The family unit must be homeless as defined by HUD guidelines.\n\n    The primary applicant must be at least 18 years old and either pregnant or have primary guardianship/custody of one or more dependent children ages 17 or younger.\n    All qualified households whose income at the time of initial occupancy does not exceed 50% or greater of the statewide or area median household income as determined by HUD and adjusted for families of five or more.\n    Extended family members residing with the family prior to application for shelter at Village of Hope will be included in the definition of the family unit .\n    The applicant must not be currently abusing alcohol or drugs.\n    The applicant must be stable on psychiatric medications and prescribed medications for medical conditions and be willing to take them as prescribed.\n    The applicant's criminal history will be reviewed on an individual basis.  Certain offenses may result in denial of admission.  These may include sexual offenses requiring the tenant to register with local officials, violent crimes against persons or property, assault, arson or destruction of property.\n\n    The applicant must not pose a risk of serious harm to self or others.\n    The applicant must express a definite and informed desire to enter the emergency shelter program, including actively participating in a housing search and case management program.\n    The applicant must be willing to accept group living including:\n        A tolerance and respect for other shelter residents and staff,\n        A willingness to adhere to shelter rules,\n        A willingness to fully participate in maintaining the shelter and sharing cleaning and maintenance duties.\n    If applicant is eligible for Group Residential Housing (GRH), the applicant must be willing to assist VILLAGE OF HOPE in verifying the requirements including documentation of:\n        Disability and/or chemical dependency,\n        Income and/or asset verification confirming applicant fits the requirements of the program.\n\nIntake Procedures\nClients or referents call the central intake number (218-751-0722). General questions are answered regarding eligibility, homelessness, and anticipated openings.  Referents that are not able to be accommodated immediately are placed on an optional waiting list while every attempt is made to assist the referent in identifying an alternative shelter plan.\nUpon vacancy of a family unit the waiting list is reviewed and families with the highest level of need are invited to participate in the application process.  This process includes the opportunity to:\n        View the facility.\n        Review the terms of the agreement to participate in a housing search and case management.\n        Review the resident rules.\n        Sign releases of information to verify homelessness.\n        Sign releases of information to verify income.\nHomelessness is determined by utilizing a checklist for eligibility (see attached) and receiving the verification by a third party in writing, on the Minnesota Housing Housing Status Verification/Referral Form (see attached) whenever possible.  In cases where no written independent verification is possible from a shelter, a case manager or other 3rd party, clients must complete and sign the Minnesota Housing Housing Status Self-Certification Form (see attached).\nOnce homelessness is verified, in writing, on the forms provided by Village of Hope, and exclusionary criteria are determined not applicable, applicants are forwarded to the Executive Director for review.\n\nIf an applicant is approved, they are accepted and will be allowed to move into Village of Hope.  Once a room is available, the homeless advocates will coordinate a move-in date and time with the applicant."
  },
  {
    "addressLine1": "501 SW 1st Ave",
    "city": "Grand Rapids",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55744",
    "name": "Grace House of Itasca County",
    "organization": "Grace House of Itasca County",
    "phone": "(218) 326-2790",
    "website": "https://gracehousemn.org/",
    "description": "As Itasca Countys only homeless shelter, Grace House serves more than 200 individuals and children each year.  Guests are provided with safe stable shelter, three daily meals, bus vouchers for social service appointments and job interviews, and referrals to a variety of community support programs and services needed to overcome barriers that led them to homelessness.\n\nDescription\nGive hospitality\nRest and renewal\nAccess to appropriate resources\nCompassion\nEmpowerment for the future\nServices:\n        Private Sleeping Quarters for Individuals and Families,\n        Three Daily Meals\n        A Secure Facility Staffed 24-hours-a day, 7-days-a-week\n        Partnerships with Other Agencies\n        Agency Referrals for Housing, Employment & Assistance\n\n"
  },
  {
    "addressLine1": "310 S. Ashland St. South",
    "city": "Cambridge",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55008",
    "name": "New Pathways, Inc",
    "organization": "New Pathways, Inc",
    "phone": "(763) 691-0121",
    "website": "http://www.newpathwaysmn.com/",
    "description": "Homeless shelter for families (adults with children 17 and under) and resource center.\n90-day maximum program with on-site case management.\nOpen Monday-Sunday 8am-4:45pm.\nWe partner with surrounding churches which provide nightly meals and bedroom accommodations for each family.\n\nMust complete screening over the phone to determine eligibility.\n\nOrientations/intakes scheduled Monday-Friday 8am-2pm.\n** We serve a 5-county area including: Isanti, Chisago, Mille Lacs, Pine, and Kanabec."
  },
  {
    "addressLine1": "220 East 3rd Street",
    "city": "Crookston",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56716",
    "name": "Care & Share Center",
    "organization": "Care & Share Center",
    "phone": "(218) 281-2644",
    "website": "https://www.careandsharecrookston.org/",
    "description": "Care and Share of Crookston is an emergency homeless shelter for men, women and families.  Individuals or families who are homeless or at risk of being homeless and needing shelter should contact our facility at 218-281-2644.\n \nPlease do not come to the shelter without first contacting us, as space may not be available for you at this time.\n\n \nOur family shelter is not a domestic violence shelter, and does accept male household members.\n\nCare and Share of Crookston may be able to assist individuals and families with other needs as well.  Depending upon available resources, we may be able to help with clothing, identification, school supplies, winter gear, etc.\n \nOur dedicated social work staff assists residents and other clients with obtaining benefits, housing resources, medical appointments, employment information and other information.\n\nFood Services\nCare and Share of Crookston has a soup kitchen where people in need can come for a prepared lunch and dinner and cereal and toast for breakfast.   These meals are not restricted to residents only, but are open to the public.\nBreakfast is available from 6-8:30.\nLunch is served at noon.\nDinner is served at 6 pm.\nIndividuals and families are welcome, however, we do ask that children must be accompanied by a parent in our facility at all times."
  },
  {
    "addressLine1": "420 Division Ave",
    "city": "Grand Forks",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "58201",
    "name": "Northlands Rescue Mission",
    "organization": "Northlands Rescue Mission",
    "phone": "(701) 772-6600",
    "website": "http://northlandsrescuemission.org/",
    "description": "Homeless men's and women's shelter.\n\nOur office is open 24 hrs for check-ins, at 414 Division Ave Grand Forks ND. If you have questions about any of our services or requirements, please call our office at 701-772-6600\n\nNorthlands Rescue Mission is a Christian place of hope and transformation. We try to guide everyone who comes through our doors to rescue, rebuild and restore their lives, no matter their needs or challenges. For the homeless living on the streets, we're a hot meal, a warm bed and a second chance. For the mentally ill, we are a safe harbor that offers compassionate care. For an impoverished family in crisis, we are a source of help and hope."
  },
  {
    "addressLine1": "435 East University Avenue",
    "city": "St. Paul",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55101",
    "name": "Union Gospel Mission",
    "organization": "Union Gospel Mission",
    "phone": "(651) 292-1721",
    "website": "https://twitter.com/ugmtc",
    "description": ""
  },
  {
    "addressLine1": "125 North 1st Avenue West",
    "city": "Duluth",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55802",
    "name": "CHUM Center & Emergency Shelter",
    "organization": "CHUM Center & Emergency Shelter",
    "phone": "(218) 726-0153",
    "website": "https://www.chumduluth.org/",
    "description": "Emergency shelter: 4pm - 8am\nChum Center Office hours: 8am - 4pm.\nCHUM provides Emergency Shelter services for Duluth residents at two locations in downtown Duluth. The Congregate Shelter provides dormitory-style shelter for single people while the Family Shelter offers a homeless families 24-hour apartments. Shelter stay length is dependent upon the needs and cooperation of the guest. Each shelter resident is required to meet daily with a Housing Stabilization Adavocate to work toward a resolution of their housing issues. Residents are also required to be sober and non violent.\n\nFamily Shelter space if limited, therefore families are welcome to stay in our Congregate Shelter.\n\n\nIf you are homeless and looking for shelter, come to the CHUM Center at 125 N. 1st Ave. West by 4 p.m. The staff will work with you to determine where you will stay.\n\nTransitional Housing\nIn cooperation with CHUM member congregation First Lutheran Church, CHUM provides Housing Advocacy support to a three-apartment Transitional Housing Facility. This program provides participant families with up to two years of housing assistance, during which time the family can work to stabilize their lives and find permanent shelter. Residents are required to meet weekly with an assigned Housing Advocate.Permanent Supportive Housing\nThe benevolent support of the Benedictine Sisters of St. Scholastica Monastery allowed CHUM to open the RUAH Permanent Supportive Housing facility in the fall of 2007. RUAH (Rehabilitating Urban Affordable Housing) was designed to create affordable housing in Duluth's Central Hillside through the renovation of existing building stock. As Permanent Supportive Housing, RUAH provides apartment living for families who need long-term support in order to stay off the streets. Residents are responsible for paying their own rent and meeting weekly with a CHUM Housing Advocate for support. RUAH residents are expected to work through the issues that caused them to become homeless.\n\n\nCHUM working in conjunction with other local agencies opened the Steve O'Neil Apartments with 44 units of Permanent Supportive Housing in December of 2015. The building is owned and operated by Center City Housing, DW Jones is the management company and CHUM provides the permanent supportive housing services to those living there.\n\nRUAH and Steve O'Neil Apartment residents can stay on as long as they choose."
  },
  {
    "addressLine1": "3010 W 78th St",
    "city": "Excelsior",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55331",
    "name": "Hope House",
    "organization": "Hope House",
    "phone": "(612) 900-0277",
    "website": "https://www.180degrees.org/hope-house.html",
    "description": "Hope House is a six bed, short term emergency shelter for youth ages 14 to19 who are experiencing or at risk of experiencing homelessness. Hope House is the only youth shelter located West of Highway 100 in the Greater Twin Cities.\n\nWe are a 24/7/365 operating shelter that offers trauma-informed care that staff help youth and young adults work through , secure community resources, and plan for the next step on their journey.\n\n\nWorking  one-to-one with a case manager, youth identify and develop their own strength-based plans. At Hope House, youth gain self-sufficiency and independence. Whenever possible, goals include family reconciliation and reunification. Referral process is simple, just give us a call at 612-900-0277 or text at 612-916-3977 at anytime day or night, and there will be someone to assist and help!"
  },
  {
    "addressLine1": "419 S. Broad Street",
    "city": "Mankato",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56001",
    "name": "Welcome Inn",
    "organization": "Welcome Inn",
    "phone": "(507) 387-4061",
    "website": "https://partnersforhousing.org/tag/welcome-inn/",
    "description": "Short term emergency shelter.\n\nProvides emergency and short-term transitional housing for homeless and near-homeless individuals and families. Guests at the shelter have access to a social worker and enjoy the security of a facility that is staffed 24/7 with on-site paid employees.\n\nBetween our two shelters, we can accommodate up to 30 individuals or 11 families. Guests are provided simple bedrooms with a shared kitchen, bathroom and living space. Some small, private apartments are also available for families."
  },
  {
    "addressLine1": "423 S. Broad St",
    "city": "Mankato",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56001",
    "name": "Theresa House Short Term Shelter",
    "organization": "Theresa House Short Term Shelter",
    "phone": "(507) 387-8189",
    "website": "http://partnersforhousing.org/programs-services/emergency-shelters/",
    "description": "Short term emergency shelter.\n\nProvides emergency and short-term transitional housing for homeless and near-homeless individuals and families. Guests at the shelter have access to a social worker and enjoy the security of a facility that is staffed 24/7 with on-site paid employees.\n\nBetween our two shelters, we can accommodate up to 30 individuals or 11 families. Guests are provided simple bedrooms with a shared kitchen, bathroom and living space. Some small, private apartments are also available for families."
  },
  {
    "addressLine1": "606 Center St",
    "city": "New Ulm",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56073",
    "name": "NUMAS Haus",
    "organization": "NUMAS Haus",
    "phone": "(507) 359-2202",
    "website": "https://numashaus.org/",
    "description": "NUMAS Haus provides emergency shelter and support services to homeless single mother families with school age children from the New Ulm, Minnesota area.\n\nThe program is designed to help these families find permanent housing within 90 days, while addressing the root causes of homelessness for each family through counseling, educational programs and case management. The goal is to allow children to remain enrolled in New Ulm schools while their families become established."
  },
  {
    "addressLine1": "1901 1st Ave N",
    "city": "Moorhead",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56560",
    "name": "Churches United for the Homeless - Micah's Mission",
    "organization": "Churches United for the Homeless - Micah's Mission",
    "phone": "(218) 236-0372",
    "website": "http://www.churches-united.org/",
    "description": ""
  },
  {
    "addressLine1": "714 8th Street, S.",
    "city": "Moorhead",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56560",
    "name": "Dorothy Day House",
    "organization": "Dorothy Day House",
    "phone": "(218) 233-5763",
    "website": "https://www.churches-united.org/",
    "description": "The emergency shelter has the capacity to house 13 men who are homeless. We are unique because we operate out of a house and try to maintain a home-like environment for those who walk through our doors. Recognizing that the people we serve have experienced a tremendous amount of trauma, homelessness is traumatic, and many people are coming to us straight from the streets, we allow our guests time to adjust to the shelter environment and our program. After this time, we ask that they set goals for themselves with a housing plan being one of them. Each guest meets with our leadership staff who does an assessment, called the VI-SPDAT, to determine acuity for housing placement. Barriers are addressed at this time, and we visit with guests about increasing income, social support, issues relating to physical health, mental illness, and chemical dependency, transportation needs, and financial or legal concerns. We offer a holistic approach and try to meet people where they are at by using motivational interviewing techniques and practicing trauma informed care. We hold guests accountable by having them fill out an extension worksheet every other week, where they discuss progress made towards their goals, and this is then reviewed as a staff team. At this time, we provide positive reinforcement, offer suggestions, and address concerns. We do not have a set length of stay; rather, the guest has to be willing to set a housing goal and show overall progress. We have found this approach to be very effective, as the individual is driving his success while we keep that person on track by providing support and resources. In addition, we offer visitor services, where men, women, and children experiencing homelessness can come Monday - Friday and weekends (for showers only) from 10a - 5p to take showers, do laundry, and receive other support services. From 2010 - 2014, the number of visits increased an astounding 541%. Based on the philosophy of Dorothy Day, we believe that everyone has worth and deserves to have their basic needs met."
  },
  {
    "addressLine1": "316 S. University Drive",
    "city": "Fargo",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "58103",
    "name": "Youthworks",
    "organization": "Youthworks",
    "phone": "(701) 232-8558",
    "website": "http://www.youthworksnd.org/",
    "description": "Youthworks Runaway Centers provide comprehensive emergency services to runaway youth and their families, as well as, youth experiencing significant parent/child conflict and provide one-time drop-in, and crisis line services to youth who may be contemplating running away and require or seek only a minimal level of service (such as information and referral to other services providers). The Youthworks runaway centers are the only programs in their respective communities providing runaway services outside of the juvenile justice, social services and law enforcement systems. Runaway centers can provide an alternative to jail for law enforcement/juvenile justice when they choose to divert and/or deinstitutionalize runaways, status offenders, delinquents and other high-risk youth. Services provided to runaway and homeless youth include individual, family counseling and mediation; group counseling; attendant care; juvenile diversion; transitional housing; support groups; emergency food, clothing and shelter; advocacy; crisis intervention and emancipation preparation.\n\nYouthworks newest program in the Fargo metro area is a youth shelter and short-term care center. The facility opened in the summer of 2010 as a safe shelter for runaway youth who have left their homes for a variety of reasons and also serves as a short-term housing alternative for families and youth facing parent/child conflict and anger management issues.The 4-bed facility is off-site from the main Youthworks office. Full reunification services are available including individual and family counseling, anger management, mediation, mentoring, and personalized aftercare services. For both runaway and short-term care situations parents or guardians retain custody and reunification is intended to happen within 96 hours, or sooner if possible. Professional assessment is available 7 days a week.\n\n\nFamily Counseling is also available through Youthworks' Family Counseling Program."
  },
  {
    "addressLine1": "1519 1st Ave S",
    "city": "Fargo",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "58103",
    "name": "Gladys Ray Shelter",
    "organization": "Gladys Ray Shelter",
    "phone": "(701) 364-0116",
    "website": "http://www.cityoffargo.com/homelessness",
    "description": "The Gladys Ray Shelter is a 35 bed shelter serving adult men and women that have no other options for shelter in the Fargo-Moorhead community. Referrals are made to other shelters if the option exists. GRS opens for shelter services at 6:00 PM and closes at 8:00 AM. The Gladys Ray Veterans Drop-in Center is open 7 days a week for all services, 9:00 AM to 3:00 PM. Please call 701-364-0116 for more information.\n\n\nDay time office hours vary Monday through Friday. Please call ahead to ensure that someone is available before visiting the shelter during these times."
  },
  {
    "addressLine1": "1902 3rd Avenue North",
    "city": "Fargo",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "58102",
    "name": "New Life Center",
    "organization": "New Life Center",
    "phone": "(701) 235-4453",
    "website": "https://www.fargonlc.org/",
    "description": "Emergency shelter is available to men, 18 years of age or older. We start screening for beds at 7 AM. Please call 701-235-4453 for more information.\nFor your protection and for those who we serve, we are limiting access to the building. If you are coming for a meal, they are still available. Please come in, ask at the window, and we will see that you get a meal to go.\n\nTimes are listed below:\n\nLunch: 12 - 12:30 PM (Everyday)\nDinner: 5 - 5:30 PM (Everyday)\n"
  },
  {
    "addressLine1": "3000 S. University Dr",
    "city": "Fargo",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "58103",
    "name": "YWCA Cass Clay",
    "organization": "YWCA Cass Clay",
    "phone": "(701) 232-3449",
    "website": "https://twitter.com/ywcacassclay",
    "description": "Emergency shelter for women and children. This is a locked facility open 24 hours a day."
  },
  {
    "addressLine1": "250 East Main Street",
    "city": "Owatonna",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55060",
    "name": "Hospitality House of Owatonna",
    "organization": "Hospitality House of Owatonna",
    "phone": "(507) 444-4042",
    "website": "https://www.hospitalityhouseofowatonna.org/",
    "description": "Hospitality House of Owatonna, Inc. is a temporary shelter for men who are transitioning through homelessness. We are a non-profit 501(c)3 agency whose purpose is to provide a house of hospitality that is safe, clean and warm. We strive to be a home free of judgment where men can find respite. Hospitality House works with guests to locate and access the resources each individual needs to progress towards self-sufficiency and independent living."
  },
  {
    "addressLine1": "703 1st SW",
    "city": "Rochester",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55902",
    "name": "Dorothy Day Hospitality House Temporary Homeless Shelter",
    "organization": "Dorothy Day Hospitality House Temporary Homeless Shelter",
    "phone": "(507) 282-5172",
    "website": "http://dorothydayrochestermn.org/",
    "description": ""
  },
  {
    "addressLine1": "811 7th Street NW",
    "city": "Rochester",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "00000",
    "name": "Interfaith Hospitality Network of Greater Rochester",
    "organization": "Interfaith Hospitality Network of Greater Rochester",
    "phone": "(507) 281-3122",
    "website": "http://www.ihn-greater-rochester.org/",
    "description": "IHN for short, is a network of volunteers from 49 faith communities who offer food and shelter to families who find themselves homeless.IHN offers these families the basic necessities of life food, shelter and security while they are going through their personal crisis. We give them a chance to regroup, rejuvenate and then get back on their feet with dignity.The network operates 365 days a year and has room for 14 people. Host churches host families for a week at a time. Buddy and support churches supply volunteers to help serve the families.\n\nFamilies arrive at the host site at 5:00 pm every day. They are served a meal, enjoy some social time then go to sleep. Every family has their own room where they sleep on air mattresses for their beds. They wake up early in the morning, have breakfast and then leave for the Day Center via the IHN van.\n\n\nThe IHN Day Center is the base of operation for families while they search for jobs and permanent housing. The Day Center provides the family with an address and phone number for their applications. The families meet with the Stabilizer Counselor daily to work on their plan to stabilize their family. The children go off to school from the Day Center house; buses pick them up and drop them off at their school."
  },
  {
    "addressLine1": "529 16th Avenue, North",
    "city": "St. Cloud",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56303",
    "name": "Overcomers International Fellowship - Dream Center",
    "organization": "Overcomers International Fellowship - Dream Center",
    "phone": "(320) 656-1550",
    "website": "http://www.dreamcenterstcloud.org/",
    "description": "Our mission is to help men, eighteen years and older, to face their problems, find wholeness, and successfully integrate back into society.\n\nA Bridge to the future for men that need services to help them overcome their current issues. The goal of the Overcomers Program is to help people face their problems, find wholeness, and successfully integrate back into society We are a Minnesota Licensed Board & Lodging program with 42 beds on a four buildings campus in St. Cloud, Minnesota and twelve beds in a two building campus in Willmar, Minnesota. We Provide these services for men, 18 and older, that need care, that are struggling with mental health issues, mental illness, chemical dependency, traumatic brain injury, learning disabilities and/or physical disabilities who may may lack adequate housing or even have corrections housing issues. We provide three meals a day, personal care, medication management, support groups, accountability, transportation to care providers & aftercare programs and job & education coaching. We also network with social workers, probation officers, and aftercare providers. Our staff is trained to provide a loving safe environment that is supportive for each resident."
  },
  {
    "addressLine1": "400 U.S. Highway 10 S.",
    "city": "Saint Cloud",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "56304",
    "name": "St Cloud Salvation Army - Emergency shelter",
    "organization": "St Cloud Salvation Army - Emergency shelter",
    "phone": "(320) 252-4552",
    "website": "https://centralusa.salvationarmy.org/northern/StCloud/",
    "description": "Provides relief for homeless.\nServices Includes:\nCounseling, emergency food, shelter or clothing.\nThe emergency shelter is located on the south side of the building.\n\n\nWaiting List:\nUsually there are 12 to 15 families on the shelter waiting list at the St. Cloud Salvation Army.\n\nLocal programs and services include:\nFood shelf and free bread program\nWeekday lunch program\nUtility assistance HeatShare program\nEmergency shelter\nHomeless veterans program\nMens and womens ministries\nYouth ministries\nBackpacks and school supplies\nWarm Coat program\nTax preparation\nChristmas toy program\n\n\n"
  },
  {
    "addressLine1": "802 W Broadway St",
    "city": "Winona",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "55987",
    "name": "Winona Catholic Worker Transitional Housing",
    "organization": "Winona Catholic Worker Transitional Housing",
    "phone": "(507) 454-8094",
    "website": "http://www.winonacatholicworker.org/",
    "description": "Monday-Fridays from 4-7 p.m. we have \"open hospitality\" at Bethany House.\nDinner is served at 6 p.m.;\nAll are welcome. Use the shower, do laundry, and drink coffee and play games as well!\n\nEvery Monday night at 5:15 p.m., join us for a simple prayer service in the Dan Corcoran House prayer room (in the \"garage\").\n\nBethany House\n832 W. Broadway\n(507) 454-8094\n\nDan Corcoran House\n802 W. Broadway\n(507) 457-3451\n\nThe Winona Catholic Worker is a diverse faith community that serves people experiencing homelessness in the tradition of Peter Maurin and Dorothy Day. We operate two houses of hospitality (Bethany House has a meal program and Dan Corcoran House provides overnight hospitality for single women). We have open community meals five times a week."
  },
  {
    "addressLine1": "919 Hood Street",
    "city": "La Crosse",
    "state": "Minnesota",
    "stateAbbreviation": "MN",
    "postal": "54601",
    "name": "A Place of Grace Catholic Worker House Day Shelter",
    "organization": "A Place of Grace Catholic Worker House Day Shelter",
    "phone": "(608) 782-6224",
    "website": "mailto:placeofgrace.cw@gmail.com",
    "description": ""
  }
]