[
  {
    "addressLine1": "310 N. 2nd Street",
    "city": "Bardstown",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40004",
    "name": "Room In The Inn Nelson County",
    "organization": "Room In The Inn Nelson County",
    "phone": "(502) 343-7000",
    "website": "https://www.facebook.com/pg/RITINelsonCounty/about/?ref=page_internal",
    "description": ""
  },
  {
    "addressLine1": "8311 Preston HWY",
    "city": "Louisville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40219",
    "name": "Interlink Counseling Services INC.",
    "organization": "Interlink Counseling Services INC.",
    "phone": "(502) 964-7147",
    "website": "https://interlinkservices.org/",
    "description": "Landing Zone\n\nWhat Is the Landing Zone Safe Off The Street Program?\n\nLanding Zone is Interlinks safe-off-the-streets program for homeless men. Along with providing a safe facility from alcohol and/or drugs, Landing Zone has five beds, is open all day every day, and has constant staff supervision. This inpatient center is located on the Interlink Counseling Services campus in Louisville, Kentucky.\n\n\nSafe and Comfortable Alcohol and Drug Detoxification\n\nDrug or alcohol detoxification initially begins when an individual stops consuming a substance on which the body has become dependent. Even though the full recovery process from alcohol or drug addiction does not really begin until the detox or withdrawal period has ended, detoxification is the first step in the healing process. Drug and alcohol detoxification should only be attempted in a safe, comfortable environment at a licensed detox center.\n\nAlcohol and Drug Withdrawal Symptoms\n\nDetox from alcohol or drug addiction can produce withdrawal symptoms that range from mild to severe. Some acute drug and alcohol withdrawal symptoms can even be fatal if not treated medically. Some of these withdrawal symptoms are sweating, shaking, headaches, cravings, depression, insomnia, loss of appetite, vomiting, cramping, diarrhea, seizures, and convulsions. Often, without medical help, the more severe withdrawal symptoms can become so unbearable that the person experiencing them will begin using again to seek relief from their suffering instead of completing their detoxification.\n\nRegardless of the substance(s) from which a person is detoxifying themselves, there are several factors that should always be considered when deciding on whether to attend a non-medical detox center. The persons age, current physical condition, how long the person had been addicted to the substance(s), and how much he or she has been consuming on a regular basis is always a concern. Finally, any serious illnesses or conditions that could cause serious complications should be noted before beginning the detoxification.\n\n\nAlthough withdrawal symptoms are uncomfortable and irritating, they are not necessarily dangerous. However, they are often accompanied by the \"craving\" for more drugs or alcohol, which makes the decision to continue abstinence much more difficult without professional counseling or support. Landing Zone staff is able to decide which level of care is needed. If it is determined that medical detox is needed, the client will be referred to a local hospital.\n\nIm Ready To Enter Detox! Now What?\n\nPlease call Interlink Counseling Services at (502) 964-7147, and let the receptionist know that you are interested in the Landing Zone program, and your call will be directed to an intake coordinator. The intake coordinator will inform you if there are any available beds, or place your name on a waiting list and let you know when one becomes vacant.\n\nWhat Should I Not Bring?\n\nConsidering that Landing Zone is a transitional, homeless shelter program for men in recovery, you must not bring any weapons; this includes any cutting instrument like a straight razor, knife, hatchet, machete, hunting knife, etc. You must not bring any alcohol or drugs; the only exception is medications that are prescribed by a doctor. All medications must be in their original container and labeled appropriately.\nInpatient Services\n\nHarmony House Residential Treatment\n\nClients assigned to Harmony House participate in an intensive, 3 to 6 month recovery program. During this period, clients do not have employment outside of Interlink. They attend daily education sessions on chemical dependency, relapse prevention, and specific life skills. Stabilization of physical and mental health issues is the objective for these residents along with a focus on accepting their level of addiction. Intensive case management supports their journey toward a stable recovery lifestyle. Upon completion, most Harmony House clients are enrolled in the Genesis House Transitional Living Center Phase II program.\n\n \n\nGenesis House Transitional Living\n\nGenesis House offers transitional housing for up to 24 months. Clients in Genesis House have access to similar education programs like Harmony House clients, but they receive classes over a longer period of time; many Genesis House clients hold jobs off-campus. Life skills education sessions focus on reintegration with classes that include budget planning, anger management, coping skills, self-worth, goal setting, relationships, and others that assist clients in achieving self-sufficiency. While in Genesis House, relapse prevention sessions help clients identify specific triggers that can lead to setbacks in their recovery. Chemical dependency oriented education seeks to reinforce what each resident has learned about himself and his addiction. Small group and counseling sessions are held after work hours so that ongoing issues are addressed as they arise, which further ensures stability and long-term sobriety. When the clients have completed their rehabilitation, they move into permanent housing within the community. However, they still have an established aftercare plan for follow-up case management in place.\n\n"
  },
  {
    "addressLine1": "P.O. Box 1941",
    "city": "Bowling Green",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42102",
    "name": "Barren River Area Safe Spa ce (BRASS), Inc.",
    "organization": "Barren River Area Safe Spa ce (BRASS), Inc.",
    "phone": "(800) 928-1183",
    "website": "https://www.brassinc.org/",
    "description": "The Barren River Area Safe Space, Inc. is a regional domestic violence 26-bed shelter and program, founded in 1980 by a group of seven Warren County Citizens, to serve the community's need to provide emergency shelter and support services to victims of domestic violence and their children. The Barren River Area Safe Space, Inc. is accredited by the Kentucky Domestic Violence Association, and was one of the first six Kentucky domestic violence shelters to form the Kentucky Domestic Violence Association. The agency provides services to residents of the ten county Barren River Area Development District, and serves a large rural population. Counties of service include Allen, Barren, Butler, Edmonson, Hart, Logan, Metcalfe, Monroe, Simpson and Warren. BRASS, Inc. also accepts referrals from across the state and nation.\n\nProgram services include:\nEmergency shelter\nCrisis intervention\nTwo 24-hour crisis lines\nComprehensive children's services\nCase management\nIndividual and group support counseling\nMental health counseling\nHomeless and housing advocacy\nImmigration and language advocacy\nLegal advocacy\nAgency advocacy\nMedical advocacy\nReferrals\nEmergency financial assistance\nUSDA approved food pantry\nFederal feeding program\nPermanent Housing\nFinancial literacy/economic justice program\nRural Individual Development Account\nAsset Building Coalition\nHomeownership program\nCommunity awareness program\nPublic education programs\nProfessional trainings\n\n"
  },
  {
    "addressLine1": "400 W. Main Ave",
    "city": "Bowling Green",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42102",
    "name": "Salvation Army Emergency Shelter Bowling Green",
    "organization": "Salvation Army Emergency Shelter Bowling Green",
    "phone": "(270) 843-3485",
    "website": "http://salvationarmybowlinggreen.org/",
    "description": "Office hours: Mondays through Fridays 9am - 4pm.\n\nServices: Emergency shelter, food boxes, soup kitchen, atmos energy assistance, disaster services."
  },
  {
    "addressLine1": "1608 West Stockton Street",
    "city": "Edmonton",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42129",
    "name": "Bowling Park Homeless Shelter",
    "organization": "Bowling Park Homeless Shelter",
    "phone": "(270) 432-7204",
    "website": "mailto:socialservicemanager@bowlingpark.org",
    "description": "Shelter for homeless with 9 beds. Food program and service referrals.\n\nWe have 9 beds total with 5 bedrooms.  It is coed with a maximum of a 30 day stay.  Residents are expected to work in the park two hours each day and groceries are provided through our food pantry.  Referrals are provided for jobs, housing, etc."
  },
  {
    "addressLine1": "431 Standard Ave",
    "city": "Corbin",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40701",
    "name": "The Everlasting Arm Homeless Shelter",
    "organization": "The Everlasting Arm Homeless Shelter",
    "phone": "(606) 261-2009",
    "website": "mailto:theeverlastingarminc@gmail.com",
    "description": ""
  },
  {
    "addressLine1": "630 US-25W S,",
    "city": "Williamsburg",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40769",
    "name": "Emergency Christian Ministries",
    "organization": "Emergency Christian Ministries",
    "phone": "606-400-1464",
    "website": "https://www.facebook.com/pages/Emergency-Christian-Ministries/195304827237175",
    "description": "Food, Clothing, Transportation Assistance, Shelter\nCheck in and intake start at 6:30pm. Come at 6pm to ensure a spot.Capacity 25 people.\n\nOpen to men and women, the shelter's main barrier to entry is if someone is a registered sex offender\nMust provide ID.\n\n"
  },
  {
    "addressLine1": "260 West Pike Street",
    "city": "Covington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "41012",
    "name": "Fairhaven Rescue Mission",
    "organization": "Fairhaven Rescue Mission",
    "phone": "(859) 491-1027",
    "website": "https://www.fairhavenmission.org/",
    "description": ""
  },
  {
    "addressLine1": "13-15 East 20th St",
    "city": "Covington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "41014",
    "name": "Homeward Bound Shelter",
    "organization": "Homeward Bound Shelter",
    "phone": "(859) 581-1111",
    "website": "https://www.brightoncenter.com/",
    "description": "Emergency shelter for runaways ages 11 - 17 years old.\nHomeward Bound Shelter is a 24-hour emergency shelter location in Covington, KY, that provides a safe environment and short-term services for runaway, homeless, abused, neglected, and dependent youth ages 11-17.\n\n\nIntakes are conducted to gather information for eligibility, appropriateness and development of initial service plan\n\nProvide basic support that includes shelter, food and clothing\nA bio-psycho-social assessment is completed to identify issues\nTreatment Team meets weekly to discuss new admissions, bio-psycho-social, and goals to be addressed in the service plan\nIndividual counseling is conducted weekly for each youth\nCrisis Intervention and Referral Services are offered for local non-residential youth and families\nRecreation activities are offered weekly for community recreational activities\n\nLife skills are taught daily and groups held weekly\nWe use Positive Youth Development and Trauma-Informed best practices in our approach with youth.\n\n"
  },
  {
    "addressLine1": "205 West Pike St.",
    "city": "Covington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "41011",
    "name": "Welcome House Shelter",
    "organization": "Welcome House Shelter",
    "phone": "(859) 431-8717",
    "website": "https://www.welcomehouseky.org/",
    "description": "The Welcome House Emergency Shelter provides a safe place for approximately 30 homeless women and children. Guests of the shelter work with Service Coordinators and other Welcome House staff to increase income and access affordable housing while removing any challenges or barriers to success.\n\nWhile working toward greater stability, clients are offered a safe place to live, warm meals, any needed hygiene supplies, and extra assistance (such as help with transportation and referrals to area resources). Shelter residents benefit from the caring support of a 24 hour staff member, various volunteers, and donors who help meet their needs.\n\n\nIn 2015, 135 children were part of the many individuals who stayed in Shelter. Fifty-two percent of the children served were under six years of age. Children who stay in the shelter (as well as those of other families working with Welcome House) have the support of a staff member dedicated to meeting their needs and protecting their rights. Mothers are offered assistance in enrolling children into school and daycare, and in meeting the material needs of their school-aged children.\n\nThe average length of stay at the shelter was 35 days. During their shelter stays in 2015:\n\n    100% of shelter clients accessed support services while at the shelter, such as the care of visiting nurses, mental health and substance abuse referrals, and parenting and life skills coaching.\n     73% of our clients exited shelter to positive housing outcomes\n\n     68% of 185 households had income at exit (and more residents accessed non-cash benefits such as WIC, SNAPS benefits, and health insurance enrollment while in shelter).\n"
  },
  {
    "addressLine1": "634 Scott St.",
    "city": "COVINGTON",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "41011",
    "name": "Emergency Shelter of Northern Kentucky",
    "organization": "Emergency Shelter of Northern Kentucky",
    "phone": "(859) 291-4555",
    "website": "http://emergencyshelternky.org/",
    "description": ""
  },
  {
    "addressLine1": "411 Gest Street",
    "city": "Cincinnati",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45202",
    "name": "David and Rebecca Barron Center for Men",
    "organization": "David and Rebecca Barron Center for Men",
    "phone": "(513) 721-0643",
    "website": "https://www.shelterhousecincy.org/mens-center/",
    "description": "Shelterhouse offers the essentials: housing, help, hope to people experiencing homelessness. We provide a refuge of unconditional care and compassionate assistance for both men and women,  reaching out our hand to encourage and empower those without resources to move from homelessness and destitution to shelter and stability.\n\nMen's Center:\n\n\nThe David and Rebecca Barron Center for Men ensures homeless men in Cincinnati have access to basic human needs such as shelter, food, emergency clothing items, basic toiletries, and safety.\n    150 beds for homeless men 18+\n    Non-dormitory sleeping quarters\n    Serving three daily meals\n    State of the art kitchen facilities\n    Individualized Case Management Support Services\n    Full day treatment services tailored to each mans specific needs\n    Fully operational on site medical and dental clinics\n    Daytime Programming\n    Full Laundry Services\n    3,600 Sq. Foot Private Outdoor Courtyard\n    10,000 Sq. Foot Winter Shelter operating December to February.\n\nGOAL\nTransition into permanent housing in 30 days or less with an increase in income."
  },
  {
    "addressLine1": "336 West",
    "city": "Newport",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "41071",
    "name": "Family Promise of Northern Kentucky, Inc.",
    "organization": "Family Promise of Northern Kentucky, Inc.",
    "phone": "(859) 360-0905",
    "website": "https://www.nkyfamilypromise.org/",
    "description": ""
  },
  {
    "addressLine1": "898 Walnut Street",
    "city": "Cincinnati",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45202",
    "name": "YWCA of Greater Cincinnati (Women) Shelter and Transitional Housing",
    "organization": "YWCA of Greater Cincinnati (Women) Shelter and Transitional Housing",
    "phone": "513-241-7090",
    "website": "https://www.ywcacincinnati.org/",
    "description": "Domestic Violence Shelter and Crisis Hotline\nThe YWCA provides safe protective shelter, crisis line assistance and necessary supportive services for adults and their children to move them toward self-sufficiency, independence and freedom from abuse.\n\nYWCA hotline advocates can provide: peer counseling and moral support, assistance with creating a safety plan and determining if shelter is appropriate for you, and information about restraining orders.\n\nHamilton County - YWCA Domestic Violence Shelter\nYWCA Domestic Violence Hotline:\nLocal: 513-872-9259\nToll-Free: 888-872-9259\n24-hour Hotline Assistance\n\nTTY Accessible\n    Only domestic violence shelter in Hamilton County\n    Shelters up to 72 adults and children\n    Case management, advocacy and referral\n    24-hour crisis hotline including TTY services and an International Language Line\n    Services for immigrant women\n    Employment Resource Program\n    Children's Program\n    Pet protection services"
  },
  {
    "addressLine1": "27 West 12th Street",
    "city": "Cincinnati",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45210",
    "name": "Tender Mercies",
    "organization": "Tender Mercies",
    "phone": "(513) 721-8666",
    "website": "https://www.tendermerciesinc.org/",
    "description": "Permanent Housing and Caring Support\n\nTender Mercies provides more than housing. Each resident has his/her own room with a key. All buildings have round the clock staffing and residents are provided with ongoing support from compassionate and experienced staff. Living in a welcoming community with security & dignity is essential for recovery.\n\nHousing Services Outreach Services.\nWe accept referrals from anyone. The first step is to meet with one of our helpful Outreach Workers and complete an application for services. Applicants must be homeless with a history of mental illness.\n\nResidency Details\n149 single-occupancy rooms with 24-hour staff coverage at these locations:\nHaven Hall\n27 West 12th Street\n13 Female\n26 Male\n30% of income\nDana Hotel\n15 West 12th Street\n41 rooms - Coed\n30% of income\nHarkavy Hall\n24 West 12th Street\n29 targeted toward Males\n30% of income\nTransitional Housing\n29 West 12th Street\n16 rooms - Coed\n30% of income\nThese locations have staff support available (not 24-hour support):\nRace Street Residence\n1214 Race Street\n12 targeted toward Females\n$215-225 a month\n\nNew Morning House\n1209 Elm Street\n11 targeted toward Males\n$205-245 a month\n\nAll of our rooms include a twin bed, a dresser or wardrobe and a small refrigerator. Shared bathroom facilities are available on each floor. Shared kitchen and laundry facilities are also available.\n\nAlthough Tender Mercies does not serve 3 meals a day, on most days at least one meal is provided by community volunteers. There are often donated food items available and residents are provided with information about local pantries and soup kitchens.\n\n\nUpon moving in, residents can be provided with some basic assistance (sheets, towels, clothing, hygiene items) if needed. There is a $50 security deposit for all buildings.\n"
  },
  {
    "addressLine1": "113 E 12th St",
    "city": "Cincinnati",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45202",
    "name": "Cincinnati Homeless Coalition",
    "organization": "Cincinnati Homeless Coalition",
    "phone": "(513) 421-7803",
    "website": "https://cincihomeless.org/",
    "description": "Office Hours: Mondays through Fridays 9am to 5pm.\n\nNeed Help?\nAre you currently homeless or are you on the edge of homelessness? If so, there are a number of agencies in the Greater Cincinnati area that may be able to help you get out of homelessness or prevent you from becoming homeless.\n\nCAP Line/Intake Process\nIf you need shelter, call the Cincinnati shelter hotline (513) 381-SAFE (7233). This is the Central Access Point (CAP) a centralized intake system for families and individuals who are currently experiencing homelessness or who are at risk of becoming homeless.\nIntake Specialists screen callers based on their immediacy of need and make appropriate referrals into a partner agencys program. Be prepared for a wait time. Unfortunately, due to the high need, Greater Cincinnati shelters are frequently full.\n\n\nCAP accepts call from 9:00 AM to 8:00 PM Monday through Friday and 10:00 AM to 2:00 PM Saturday and Sunday.\nThe only way to get in to the following shelters is through this hotline: Bethany House Services, Interfaith Hospitality Network, Mercy Franciscan at St. John, the Salvation Army, Mt. Airy Center (to see if you qualify for these shelters)"
  },
  {
    "addressLine1": "1805 Dalton Avenue",
    "city": "Cincinnati",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45214",
    "name": "City Gospel Mission",
    "organization": "City Gospel Mission",
    "phone": "(513) 241-5525",
    "website": "https://www.citygospelmission.org/",
    "description": "City Gospel Mission is a food pantry. .\n\n* Make sure you check by\ncalling the food pantry to confirm that they still are in operation and\nthe hours have not changed.\n\nSince 1924, City Gospel Mission Has Served Hurting, Needy, And Homeless People, Providing Help And Hope In Ever-Increasing Numbers Through The Years. The Mission Provides A Caring, Supportive Environment Where Homeless And Hurting People Are Treated With Respect And Encouraged To Accept Responsibility For Rebuilding Their Lives In An Atmosphere Of Love And Acceptance. Our Services Help Meet The Physical, Spiritual, And Emotional Needs Of People Who Have Lost Hope And Are Least Able To Meet Their Own Needs. The Daily Meals, Clothing Days, Safe Overnight Shelter, Recovery Programs, And Other Need-Based Services All Have This In Common: God'S Love And His Message Of Hope Are Shared In Practical, Christ-Like Ways. This Has Been Changing The Lives Of Those In Need At City Gospel Mission For More Than Eighty Years."
  },
  {
    "addressLine1": "1841 Fairmount Avenue",
    "city": "Cincinnati",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45214",
    "name": "Bethany House Services",
    "organization": "Bethany House Services",
    "phone": "(513) 381-7233",
    "website": "https://bethanyhouseservices.org/",
    "description": "We provide emergency shelter, mental health assessments, transitional housing, and permanent housing.\n\nEmergency Shelter\n\nBHS provides a sanctuary for desperate homeless families in need of help to achieve stable housing and income. Our shelters meet each familys immediate needs for safety, housing, food and other necessities. While in shelter, parents receive the resources and information needed to help them obtain a living income, organize a comfortable home, and provide a nurturing environment for their children. Perhaps most important, parents themselves feel cared for and realize that they will develop a realistic plan for a better future for themselves and their children while they are guests of BHS.\n\n\n\nHousing\n\n\n\n\n\n\n\n\n\nRapid Re-Housing programs, considered by the Department of Housing\n& Urban Development (HUD) to be the best housing practice for\n\nalleviating homelessness, provides financial assistance and supportive\nservices to families experiencing homelessness. The goal of the program\nis to expedite housing and stabilization of the family as quickly as\npossible. It is easier and more efficient for families to sign up for\nbenefits or apply for jobs when they have the stability that a home\nprovides. They are also less stressed and better organized at home than\nwhen in shelter.\n\nThe program provides several forms of assistance, including:\nidentification of affordable housing suitable for the familys needs;\nshort-term or medium-term rental assistance and housing relocation and\n\nstabilization services, including such activities as mediation, credit\ncounseling, security or utility deposits, utility payments, moving cost\nassistance, and case management. Housing case managers and a housing\nspecialist assist each family to develop a housing plan, serve as\nliaison between family and landlord, and manage complex issues such as\nlease options, contracts and apartment inspections.\n\n\nShelter DiversionShelter diversion programs are identified by the National Alliance to\nEnd Homelessness as best practice for prevention of homelessness for\nfamilies seeking to enter a shelter. This strategy avoids the trauma of\nhomelessness for families by helping them to identify immediate\nalternative housing arrangements while connecting them with the services\nand financial resources needed to achieve permanent housing. The case\nmanager guides the family through the process of developing a\n\ncomprehensive, reality-based plan for ensuring a secure future in stable\nhousing.\nThis program conserves shelter beds and assistance for those who\ntruly have no resources of their own and no options other than a\nhomeless shelter or the streets.\n"
  },
  {
    "addressLine1": "2314 Iowa Ave",
    "city": "Cincinnati",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45206",
    "name": "Lighthouse Sheakley Center for Youth",
    "organization": "Lighthouse Sheakley Center for Youth",
    "phone": "(513) 569-9500",
    "website": "https://www.lys.org/services/shelter-and-resources-for-homeless-young-adults-18-24/sheakley-center-f",
    "description": "Lighthouse offers shelter to young adults ages 18-24 who are motivated to move from homelessness to safe and stable housing.\n- Shelter where homeless young adults learn self-reliance and life skills\n\n- Each young adult works with a case manager who helps the young adult develop a case plan and implement it.\n- The goal: move young adults from the center into safe and stable housing within 30 days\n\nWhen homeless young adults enter the Lighthouse Sheakley Center for Youth, they often experience their first sense of hope for a better future. Young people who live on the streets lack the guidance and support so many of us take for granted. Thats why Lighthouse has a dedicated and trained team of case managers who provide consistent, personalized, and comprehensive case management services. They assess each young persons needs, provide crisis intervention if needed, coordinate the necessary care, and develop an individualized plan to provide support. Our end goal is to guide young people off the streets and into secure housing."
  },
  {
    "addressLine1": "2499 Reading Road",
    "city": "Cincinnati",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45202",
    "name": "Esther Marie Hatton Center for Women",
    "organization": "Esther Marie Hatton Center for Women",
    "phone": "(513) 562-1980",
    "website": "http://www.shelterhousecincy.org/",
    "description": "Shelterhouse offers the essentials: housing, help, hope to people\nexperiencing homelessness. We provide a refuge of unconditional care and\n\ncompassionate assistance for both men and women reaching out our hand\nto encourage and empower those without resources to move from\nhomelessness and destitution to shelter and stability.\n\nWomen's Center\n\nThe Esther Marie Hatton Center for Women ensures homeless women in Cincinnati have access to basic human needs such as shelter, food, emergency clothing items, basic toiletries, and safety.\n60 beds for homeless women 18+\nNon-dormitory sleeping quarters\nServing three daily meals\nState of the art kitchen facilities\nIndividualized Case Management Support Services\nFull day treatment services tailored to each womans specific needs\nFully operational on site medical clinic\nDaytime Programming\nFull Laundry Services\n9,000 Sq. Foot Private Outdoor Courtyard\nGOAL\nTransition into permanent housing in 30 days or less with an increase in income.\n"
  },
  {
    "addressLine1": "311 West Second St.",
    "city": "Frankfort",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40601",
    "name": "Access - Shelter for Men and Soup Kitchen",
    "organization": "Access - Shelter for Men and Soup Kitchen",
    "phone": "(502) 223-5179",
    "website": "http://www.accesssoupkitchen.com/",
    "description": ""
  },
  {
    "addressLine1": "208 W Campbell St",
    "city": "Frankfort",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40601",
    "name": "Simon House, Inc - For Pregnant Women",
    "organization": "Simon House, Inc - For Pregnant Women",
    "phone": "(502) 223-2138",
    "website": "http://www.simonhouseonline.org/",
    "description": "Simon House is a homeless shelter for homeless pregnant women and single mothers in Frankfort Kentucky and surrounding counties.\n\nSimon House is a nonprofit transitional living facility for homeless adult women who are pregnant or have children. In collaboration with other agencies and organizations, we provide a safe, stable, and healthy environment that encourages, educates, and empowers residents to become self-sufficient and productive members of our community and the larger society."
  },
  {
    "addressLine1": "303 East Third Street",
    "city": "Frankfort",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40601",
    "name": "Franklin County Women and Family Shelter",
    "organization": "Franklin County Women and Family Shelter",
    "phone": "(502) 352-2843",
    "website": "http://www.fcwomenandfamilyshelter.org/",
    "description": "FCWFS operates a shelter for single women with 13 beds and a separate duplex with two 2 bedroom apartments as a family shelter with a total of 8 beds.\n\nOffice hours: Monday through Friday 9:00 a.m. to 5:00 p.m.\n\n24 hour hotline: 502-320-3620.\n\nThe Franklin County Women and Family Shelter (FCWFS) is located in Frankfort, KY.\n\nShelter and community support services are provided to single women, 18 years and older and families with children, including couples with children, men with children and blended families with children.\n\n\nOur shelter currently serves single-parent and intact families and single women.  For couples without children, the female may reside at the shelter, but the male will need to stay elsewhere (we suggest the Access Soup Kitchen and Men's Shelter located nearby at 311 W. Second St) and, if approved by staff, can visit in the community room during office hours.\n\nRegarding Pets\nWe do not permit personal pets to remain with clients while they are residing at our shelter."
  },
  {
    "addressLine1": "110 E. Main Street",
    "city": "Georgetown",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40324",
    "name": "Elizabeth's Village",
    "organization": "Elizabeth's Village",
    "phone": "(502) 863-0800",
    "website": "http://www.elizabethsvillage.org/",
    "description": "Elizabeth's Transitional Home\n\nElizabeth's Transitional Home opened its doors in January of 2013 with a mission to serve as a transitional home for single women and women with minor children. This home is a place where women can come and receive assistance during their journey to self-sufficiency. We have eight open beds for long term residents. The average stay lasts between 6-12 months. During their stay, we provide case management to help them work weekly on reaching long term goals. In our case management we work on financial literacy, time management, healthy boundaries and relationships, and other relevant topics. We also refer to additional support services. A major part of our program is the social support that is provided by volunteers. Graduates go on to be positive, contributing members of their community without the stress of homelessness being just around the corner.\n\n\n\nElizabeth's Homeless Prevention Outreach Program\n\nThis program reaches out into the community and meets women where they are.  Our Outreach Coordinator works with women and children who are at an imminent risk of becoming homeless.  To attempt to prevent them from losing their housing, we connect them to resources in our community.  In order to encourage change, we provide them with case management where they are at. If you need assistance and outreach services, call our Outreach Coordinator at 502-642-0125.\n\n\n\nElizabeth's Domestic Violence Program\n\nElizabeth's Village is currently undergoing a feasibility study to assess the need for domestic violence services in Scott County.  We have a desire to provide support to individuals in their own community.  Be looking out for important updates here soon!\n\n\nWe currently serve survivors through our Seeking Solace Suitcase Program.  Through a partnership with the Georgetown Police Department and PNC Foundation, we have packed suitcases with resources for survivors such as toiletries, a first aid kit, a book, and a resource guide with information on different agencies that can be of use to them when leaving an abusive partner.  If you, or someone you know, may need a suitcase then please call 502-863-0800."
  },
  {
    "addressLine1": "1400 N. Forbes Road",
    "city": "Lexington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40511",
    "name": "Volunteers of America Transitional Housing Program",
    "organization": "Volunteers of America Transitional Housing Program",
    "phone": "(859) 254-3469",
    "website": "https://www.voamid.org/kentucky",
    "description": "Provides transitional housing, job training, job search assistance and referrals to other service providers for veterans incarcerated or recently released."
  },
  {
    "addressLine1": "444 Glen Arvin Avenue",
    "city": "Lexington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40588",
    "name": "Lexington Rescue Mission",
    "organization": "Lexington Rescue Mission",
    "phone": "(859) 381-9600",
    "website": "https://lexingtonrescue.org/",
    "description": "Transitional Living\nThe Potter's House and The House of Hope are transitional homes that serve men who are homeless, completing recovery programs, or leaving incarceration who have at least 30 days of sobriety. Residents will receive help obtaining food and clothing, accessing public benefits, finding employment, maintaining sobriety, budgeting their money, and growing in their relationship with the Lord. Weekly case management will help residents set their own goals and provide support and accountability to help them achieve those goals. Applications are available on our website at: https://lexingtonrescue.org/services/.\n\nCommunity Meals\nWe provide coffee and pastries from 9 a.m. to 12 p.m. and serve hot, nutritious lunches from 12 to 1 p.m. Monday through Saturday. Breakfast and lunch are free and open to anyone in need. All meals are served at our Outreach Center at 444 Glen Arvin Avenue.\n\nWalk-In Hours\nOur resource coordinator is available to meet with anyone in need during our walk-in hours. She assists people with housing issues, helps people apply for government benefits, and connects people to community resources, including providing clothing vouchers to Goodwill, referrals to Faith Pharmacy, and setting up appointments for God's Pantry. We also keep basic supplies on-hand for guests, including hygiene products, hats, gloves, coats, socks, underwear, backpacks, sleeping bags, blankets, tents, and household supplies. Walk-in hours are 1 to 3 p.m. Tuesday through Thursday at our Outreach Center at 444 Glen Arvin Ave. For more information, please contact our Resource Coordinator, at (859) 381-9600.\n\nLaundry Ministry\nHomeless guests who do not have access to laundry services because they are not living at a shelter are welcomed to have their clothes washed and dried at our Outreach Center.  Laundry service is available on Wednesdays, and guests may sign-up for this service at our walk-in hours.\n\nHomeless Intervention Program\nThe Lexington Rescue Mission helps individuals and families who are homeless move into their own home by providing financial assistance for the first month's rent as well as individual budget counseling, resource referral, and case management. If you need help moving from homelessness into permanent housing, please come to our walk-in hours for eligibility screening and assistance. For more information, please contact our AmeriCorps Housing Counselor, at (859) 381-9600.\n\nEmployment Support\nJob-seekers can find help obtaining employment through our job placement service, Advance Lexington.  We partner with local businesses who hire workers on a temporary basis through our staffing service as well as on a permanent basis.  Our staff conducts initial employment assessments to help clients identify potential employers, and program participants receive help with their job search, including assistance with creating resumes and cover letters, filling out online job applications, obtaining IDs, procuring interview attire and work clothing, getting bus passes, and other needs. For more information, please contact our Advance Lexington Coordinator, at (859) 618-6831."
  },
  {
    "addressLine1": "360 W. Loudon Avenue",
    "city": "Lexington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40508",
    "name": "Hope Center for Men",
    "organization": "Hope Center for Men",
    "phone": "(859) 225-4673",
    "website": "https://www.hopectr.org/",
    "description": "Emergency Shelter for Men, Mental Health Program, Homeless Veterans Program, Street Outreach, Hope Mobile, Housing First, and Drug & Alcohol-Free Housing\n\n\nThe Emergency Shelter operates 24 hours a day, 365 days a year. Each month on average, the Shelter provides 6,000 nights of lodging and the Jacobs Hope Cafeteria serves 12,000 meals. Many volunteers help serve the meals, and clients also participate in work crews in the kitchen.\n\n\nTypically, homeless individuals dont have access to regular health care. That means two things: they develop health problems that become compounded by years of neglect, and their health problems help keep them homeless.\n\nThe Healthfirst staff treats an average of 500 clients each month at the Hyde Hope Health Clinic. Health Clinic nurses also educate them on health care issues, helping prevent future health problems.\n\nEach client has a Caseworker to connect them with the services they may need. It could be an assist to find a job, working through a language barrier, or just connecting them with services from which they could be receiving assistance. Caseworkers work directly with clients in the Emergency Shelter. The Hope Center Emergency Shelter is for adult males only. Women and families may obtain shelter from the Salvation Army on West Main Street.\n\n\nOur Spanish-speaking caseworker helps clients overcome the language barrier, providing Hispanic clients with assistance for all Hope Center programs, as well as with legal and cultural challenges, and classes in English as a second language (ESL)."
  },
  {
    "addressLine1": "536 West Third Street",
    "city": "Lexington ",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40508",
    "name": "M.A.S.H. Services of the Bluegrass",
    "organization": "M.A.S.H. Services of the Bluegrass",
    "phone": "(859) 254-2501",
    "website": "http://www.mashbluegrass.org/",
    "description": "MASH Services of the Bluegrass, Inc. provides safe alternatives for at-risk children, youth and their families through services and referrals that promote positive growth and development. We envision a community partnership where all at-risk children and youth are strengthened and supported to regain ties with their family, their community and other encouraging adults.\nOur Services\nMASH provides the following services to children, youth and families throughout Kentucky:\n\nEmergency Shelter\n24-Hour Crisis Intervention\nSafe Place Services\nCounseling and Case Management\nParenting Support\nIndependent Living Skills Development\nRespite Care\nInformation and Referral\nStreet Outreach\nTo learn more on how to access services or to volunteer, please contact us at 859.254.2501.\nAccreditation and Licensure\nMASH is accredited by the Council on Accreditation and licensed by the Cabinet for Health and Family Services as a Private Child Care facility. In addition, MASH is a member of United Way of the Bluegrass and National Safe Place."
  },
  {
    "addressLine1": "736 W. Main St.",
    "city": "Lexington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40508",
    "name": "Salvation Army Shelter Lexington",
    "organization": "Salvation Army Shelter Lexington",
    "phone": "(859) 252-7706",
    "website": "https://ky.salvationarmy.org/lex-kentucky",
    "description": "Emergency Shelter - Hanger Lodge for women and children. If all beds/rooms are full, residents will be accommodated on sleeper chairs or mattresses until beds/rooms become available.\n\nHousing for homeless families and single women\nCaseworker provided to each family to assist in job search or other resources\nLife skills classes\nSafe haven support group for individuals in recovery\nMental health counseling\nAssistance in obtaining housing and jobs\n\n\nBooth Units for single men with children.\nOur case managers address to root causes of homelessness by assessing the individual needs of each resident and developing an action plan. During our resident's stay they receive three meals per day, comfort supplies, access to laundry facilities and bus passes.\n\nOther vital services include:\n\n    Case management\n    Mental health counseling\n    Job training in collaboration with other agencies\n    Referral services\n    Assistance in obtaining housing and jobs\n    Life skills and computer classes\n    Transportation\n    Child care and after-school programs\n    Medical clinic through a partnership with University of Kentucky's College of Medicine\n    Safe Haven support group for individuals in recovery\n    Bible study and Spiritual counseling\n\nFor more information, please call: (859) 252-7706"
  },
  {
    "addressLine1": "224 North Martin Luther King Blvd.",
    "city": "Lexington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40507",
    "name": "New Life Day Center",
    "organization": "New Life Day Center",
    "phone": "(859) 252-3012",
    "website": "https://newlifedaycenter.org/",
    "description": "Hours of operation: Monday - Friday 8:30am - 3:30pm for homeless clients\nOpen to other guests: Monday - Friday 9am-noon & 1pm-3pm\n\nTransportation Services: Daily route begins at 10am or by appointment during guest hours\n\nNew Life Day Center is a day-time refuge for homeless clients to escape the harsh realities of life on Lexington streets. We are a \"connecting point\" for homeless by helping them find other homeless Lexington area services they require like night shelter, food, medical treatment, dental, mental health services, substance recovery, clothing, etc. We help set up appointments with those services and transport them to/from appointments. We also provide personal storage lockers for clients to store their often meager, but still vital possessions."
  },
  {
    "addressLine1": "120 Chrysalis Ct",
    "city": "Lexington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40504",
    "name": "Chrysalis House",
    "organization": "Chrysalis House",
    "phone": "(859) 255-0500",
    "website": "http://www.chrysalishouse.org/",
    "description": "Women and women with children substance abuse treatment shelter.\n\nChrysalis House is a comprehensive long-term residential program that addresses the needs of each woman to achieve and sustain sobriety. Each facility is licensed by the state of Kentucky for residential and outpatient treatment. Annually, Chrysalis House serves over 200 women and their children. Since 2003, Chrysalis House has served women from 111 of Kentuckys 120 counties. Chrysalis House provides a unique continuum of care which is defined by:\nLicensed treatment for women and their families\nIntegrated substance abuse/mental health treatment\nChildrens services\nDomestic violence counseling\nHealth and wellness assessment and treatment\nEducation and vocational training\nFinancial fitness counseling\nSupportive Housing Opportunities for Women\nLicensed daycare, STARS rated"
  },
  {
    "addressLine1": "190 Spruce St",
    "city": "Lexington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40507",
    "name": "The Lighthouse Ministries - Rachel House",
    "organization": "The Lighthouse Ministries - Rachel House",
    "phone": "(859) 259-3434",
    "website": "https://lighthouselex.org/",
    "description": "Transitional housing for women.\nOur Services\n\nAs a transitional sober living home, we offer:\n\nFaith-based program\nDrug- and alcohol-free environment\nStructured accountability\nLife skills classes\nPeer support\nCase management\nCoaching, mentoring and discipleship\nWeekly offsite and in-house meetings\n\nFacility & Fees\n\nSix beds\nLive-in house manager\nLaundry facility and linens provided\nFully-equipped kitchen\nShared bathroom\nDesignated smoking area\nBus pass\nNon-refundable deposit: $200\nWeekly Rent: $115\n\nOur Story\n\nTay Henderson has been the Executive Director of Lighthouse Ministries in Lexington, KY since 2004. She was also the director of Nehemiah House, a faith-based recovery program, for twelve years during that time. For many years, Tay has aspired to fulfill her late husbands dream of opening a transitional recovery home for women. Rachel House is a realization of that dream. Tay is a mother of five and has eight grandchildren.\n\n\n"
  },
  {
    "addressLine1": "1055 Industry Rd",
    "city": "Lexington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40505",
    "name": "Catholic Action Center",
    "organization": "Catholic Action Center",
    "phone": "(859) 514-7210",
    "website": "http://www.catholicactioncenter.net/",
    "description": "Open 24 hours a day/7 days a week. No one refused service. Three meals a day, showers, phone and mail service."
  },
  {
    "addressLine1": "5448 North US HWY 25E",
    "city": "Gray",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40734",
    "name": "KCEOC, Community Action Partnership Shelter",
    "organization": "KCEOC, Community Action Partnership Shelter",
    "phone": "606-546-3152",
    "website": "https://www.kceoc.org/",
    "description": "Program: KCEOC, CAP Inc.Emergency Support Center (KESC)The program provides temporary emergency shelter to women and their children who fall under the McKinney Act guidelines for homeless assistance.\nProvides outreach services to homeless men and intact families; provides clothing for burn out victims or other community members in need."
  },
  {
    "addressLine1": "1001 N Main St",
    "city": "Hazard",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "41701",
    "name": "Hope House",
    "organization": "Hope House",
    "phone": "(606) 436-5043",
    "website": "https://twitter.com/hazardhopehouse/",
    "description": "Emergency Shelter.\n\nOpens: 6:30 p.m. and dinner is served at 7 p.m.\nDoors at Hope House are locked at 11 p.m.\n\nGuests must leave at 7am."
  },
  {
    "addressLine1": "3770 Highway 15 South",
    "city": "Jackson",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "41339",
    "name": "Haven House",
    "organization": "Haven House",
    "phone": "(606) 438-8406",
    "website": "mailto:deborah.brown@krccnet.com",
    "description": "Open 24 hours a day and 7 days a week;\nMeals provided; Safe place to sleep;\nAccess to Showers;\nPersonal Hygiene Items;\nLaundry Facilities;\nClothing;\nAccess to Community Resources\n\nClients will receive services needed to help them regain management of their lives, live independently in the community in safe and affordable housing and individual health needs of each client will be addressed. Individuals staying at the\n\n Shelter must be able to function independently, be over the age of 18, unaccompanied by children; be cooperative and respectful of others and follow all rules of the Shelter.\n\n\nAll clients of the Shelter must participate in developing a plan identifying needed primary care and behavioral health services, and programs and services needed to live independently in the community."
  },
  {
    "addressLine1": "804 Clay Street",
    "city": "Henderson",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42420",
    "name": "Harbor House Christian Center",
    "organization": "Harbor House Christian Center",
    "phone": "(270) 827-5010",
    "website": "https://www.facebook.com/pages/Harbor-House-Christian-Center/142619852450904",
    "description": ""
  },
  {
    "addressLine1": "324 NW 6th Street",
    "city": "Evansville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "47708",
    "name": "United Caring Shelter",
    "organization": "United Caring Shelter",
    "phone": "(812) 422-0297",
    "website": "https://www.unitedcaringservices.org/",
    "description": "Day shelter: serves 3 meals a day, 7 days a week. Night Shelter: 62 beds (men only) first come, first served. Transitional Housing (men only): 2 year program, Section 8 approved, Studio Apartment, Case Worker.\nWomen's Shelter 24 beds\nHomeless Medical Respite Program 6 beds (currently) hopeful for relocation/expansion in the works this year.\n\nDay Shelter\nWe offer the only Day Shelter services in Evansville. We serve over 300 hot meals a day, all prepared by our volunteers. We provide services for elderly, disabled, near homeless and homeless men, women and children.\nUnited Caring Services offers a place for people to get out of the elements and provides shower and laundry facilities (for which UCS supplies toiletries and laundry detergent), an address for receiving mail, clothing and a Bike to Work program (providing reconditioned bicycles to anyone who is employed or searching for employment and in need of transportation).\n\nThe Day Shelter is open from 8:00 am until 6:00 pm, seven days per week.\nOur Day Shelter works in conjunction with agencies such as Aurora, Inc., ECHO Community Health Center, the Veterans Administration, and Southwestern Indiana Behavioral Services, all of which provide outreach support for case management, physical health, and behavioral health.\n\nNight Shelter\nUnited Caring Services' Men's Emergency Night Shelter provides a safe and secure overnight haven for homeless men from 7:00 p.m. until 7:00 a.m. There are bunk beds in a dorm-type atmosphere. Every guest is required to shower at night. We have a curfew of 10pm and a wake up service for those who need to get to work on time in the morning. Personal belongings are limited to one bag on the bunk and a 40 gallon plastic tote for each man. These belongings are secure during the day when the Night Shelter is closed. Each guest is breathalyzed nightly upon entry; we have zero tolerance for alcohol use and/or illegal drug use.\nThe Night Shelter is full nearly every night of the year. All of the men in the Night Shelter have work details that they are responsible for completing; cleaning the Night Shelter and the bathrooms every morning, washing sheets and towels in the evening, cleaning the Kitchen and washing dishes after each meal and cleaning the Day Shelter after closing each day.\n\nWe strongly encourage our guests to stay for 180 days or less. We hope to acquire funding soon that will allow us to provide direct Case Management for the men in the Night Shelter. This service will provide the one on one support and encouragement they need to get employed, housed, and back on their feet.\n\nRuth's House Women's Shelter\nThe UCS Ruth's House Women's Emergency Night Shelter at 321 E. Walnut, offers a safe, clean, home like overnight shelter to 26 homeless women. Guests can begin checking into the Women's Shelter at 7:00 pm and must be in by 10:00 pm unless they have verified employment that keeps them out later. The Women's Shelter is always filled to capacity. Each guest has her own bed, closet space and dresser drawers in which to store personal belongings. UCS provides pillows, sheets, blankets and towels and personal hygiene items for each guest. All guests are breathalized , each night upon entry.\n\nTransitional Housing\nThe Transitional Housing Apartment Program has 21 studio apartments located on the third and fourth floors of our facility. We provide a residential setting with intensive Case Management, support and encouragement. Each apartment has a kitchen, bathroom, bedroom and living area.\nApplicants for this Program must meet strict guidelines prior to residency, including a criminal background check. The Evansville Housing Authority supplements the low income residents' rent through Section 8 funding.\nThe Program participants work closely with the Transitional Housing Case Manager to set goals and develop an Action Plan that will allow them to achieve those goals. While each individual has a unique Action Plan, we also offer general classes such as Personal Finance and Budgeting, Basic Computer Skills, Healthy Cooking on a Budget, and others that all Program participants are required to attend. We also provide access to counseling and classes that address relational issues, coping skills, assertiveness, anger management, substance abuse, stress management and spirituality/meditation.\nOur Transitional Housing Case Manager ensures that our Program participants have the tools, techniques and disciplines that they need to renew life sustaining personal relationships, be successful in obtaining and keeping gainful, full-time employment and securing permanent housing, in a maximum time frame of two years."
  },
  {
    "addressLine1": "not disclosed",
    "city": "Evansville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "47708",
    "name": "YWCA Battered Women's Shelter",
    "organization": "YWCA Battered Women's Shelter",
    "phone": "(812) 422-1191",
    "website": "https://www.ywcaevansville.org/what-were-doing/housing-programs/",
    "description": "battered women's shelter only.\n\nDomestic Violence Shelter\nThe YWCA opened Evansvilles first Domestic Violence Shelter in 1979. We never turn away a victim of domestic violence and her children. We believe that given a supportive environment free from abuse, victims of domestic violence are capable of developing their own strengths and abilities to manage their lives and the lives of their children. We maintain a crisis line and provide safe housing, transportation, clothing, and personal care items. Our 24-hour staff provides crisis counseling, information and referrals, goal planning, and self-sufficiency counseling. A Legal Advocate provides assistance with legal issues and counseling to both on- and off-site victims. Each child is assessed by the Childrens Advocate who provides counseling, and referrals. Other services include support groups, tutoring, parenting programs, and summer day camp."
  },
  {
    "addressLine1": "500 East Walnut Street",
    "city": "Evansville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "47713",
    "name": "Evansville Rescue Mission",
    "organization": "Evansville Rescue Mission",
    "phone": "(812) 421-3800",
    "website": "https://www.evansvillerescuemission.org/",
    "description": "24 hour help desk.\nCapacity of 222 beds\nThe Evansville Rescue Mission's Residence Center is the Tri-State's oldest and largest service provider for homeless men but offers emergency services for the general public as well.\n\n\nDespite this capacity, we do not turn any male (over the age of eighteen) away during times of inclement weather; specifically, between November 1st & March 31st and during the summer months when there are periods of excessive heat.\n\n\nIf you are employed while staying at the Evansville Rescue Mission, receive money for services;\nor receive pension, SSI, SSDI you will be required to pay program fees. Workers will have 30 days to provide two paystubs or an award letter. Failure to do so will result in possible no passes being issued or dismissal from the facility.\n\n\nWe will collect $5.00 per day from individuals who are working. This will help establish a payment history for residents when the leave the PACES or work program(s) of the ERM. Residents who receive Social Security, SSDI or SSI income will be required to pay 25% of their income.\nMeal served by faithful community volunteers. Each and every day (including holidays), not only our homeless guests, but the general public have the opportunity to visit the Residence Center for a meal. Meal times are offered as follows:\nBreakfast 6:30 to 7:00 a.m. Monday through Friday\nBreakfast 7:30 to 8:00 a.m. Saturday and Sunday\nLunch 12:00 to 12:30 p.m. Monday through Saturday\nLunch 12:30 to 1 p.m. Sunday\nDinner 5:30-6:00 p.m.\n"
  },
  {
    "addressLine1": "1100 Read St",
    "city": "Evansville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "47710",
    "name": "Ozanam Family Shelter",
    "organization": "Ozanam Family Shelter",
    "phone": "(812) 422-2214",
    "website": "https://www.ozanamfamilyshelter.org/",
    "description": "The Ozanam Family Shelter Corporation is a 501(c)3 non-for-profit organization providing families and single women with emergency temporary shelter.  Our programs are designed to provide residents with the necessary tools to aid in their struggle to identify and overcome the barriers that attribute to homelessness.  We also strive to assist residents in building and maintaining stronger support systems for themselves and their families as they regain their independence.\n\n\nSERVICES PROVIDED:\n    A Safe Bed to Sleep in\n    Case Management\n    Three Meals and Two Snacks Daily\n    Laundry Facilities\n    Computer Access\n    On-Site Agency Presentations\n        WorkOne\n        Purdue Extension\n        ECHO Healthcare\n        ARG"
  },
  {
    "addressLine1": "220 East 4th ST",
    "city": "London",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40741",
    "name": "Good Samaritan House Homeless Shelter",
    "organization": "Good Samaritan House Homeless Shelter",
    "phone": "(606) 862-2872",
    "website": "http://www.goodsamaritanhouseinc.com/",
    "description": "Christian Shelter for the Homeless was founded as a ministry dedicated to serving the homeless by being Christ's liaison- reaching out to people where they are, extending God's love in practical ways through the improvements of physical, mental, emotional, and financial needs, as well as promoting self-efficiency beyond these basic human needs by addressing social, moral, and educational conditions of persons who temporarily reside in our home place.\n\nFAQ\nHow long can people stay at the Shelter? The Christian Shelter does not currently put a time limit on how long individuals or families stay. On average, an individual will stay 2-3 months; a family will stay 3-4 months. People arrive at the Shelter with a variety of needs so the number and intensity of services provided are specific to their issues.\n\nAre the people who stay at the Shelter just from Laurel County? No. However, the majority of our Residents are from here, or from the surrounding counties. The closest shelters that provide services similar to us are located in Williamsburg and Lexington. Here are some statistics from the recent Point In Time Count: on January 28, 2010, our census showed 29 adults and 8 children. Of the 29 adults, 42% were from Laurel County and 37% were from adjoining counties. Two Residents came from Tennessee and 4 came from other States.\nWhat are the requirements for admission to the Shelter? The Shelter can house 20 single men, 6 single women, and 7 families. Every adult must get a warrant check from the London City Police. This warrant check is to ensure that the potential Resident is not using the Shelter to hide from the police. In addition, every adult is checked on the National Sex Offender Registry. While we realize that we are all God's children and that second chances are critical to everyone's success, we simply are not equipped to handle sex offenders. Couples staying in the family apartments must show proof of marriage. School-age children must be registered in the local school system or provide state-approved documentation for home-schooling.\nIs the Shelter safe? The Shelter has been open for over two years. In that time we have had no serious incidents regarding the safety of our residents, staff, or the community, and certainly it is our goal to maintain this track record if at all possible. We have a lot of rules at the Shelter, which brings us to...\n\nWhat kind of rules does the Shelter have? We have rules for just about everything! Our Residents all have assigned chores and are expected to perform them without complaint. Since we through the community's generous donations provide for all of our resident's needs, they are not permitted to panhandle or approach community members for assistance. The Shelter performs random drug screens and the City Police are always available when a breathalyzer is needed. Smoking is only permitted at certain times of the day and men and women have different schedules. In general, less than major rule infractions are handled with a write-up system: three strikes and you're out. Drug/alcohol use; possession of a weapon; violence or the threat of violence; criminal activity; are all causes for immediate dismissal from the Shelter.\nWhat type of funding does the Shelter receive? Financially, the Shelter runs almost entirely on private donations from churches, individuals, and community organizations. From time to time, we also receive small grants from local business entities and from local and regional foundations. These grants are always for specific projects such as our commercial stove, high-efficiency washer and dryers, and new furniture for the dining room.\nHow are financial donations utilized? Money pays the bills: electric, water, insurance, phone, three full-time and two part-time staff. Unlike many similar organizations, our administrative costs are currently very low, ensuring more of your contributions go directly toward resident care versus being spent on staffing, travel, bonuses, etc. Donations are what keeps our mission and our residents going.\nDid you know? The Shelter has a full-time kitchen manager, volunteer coordinator, administrative assistant, and two part-time case managers? By the way, they are all 100% volunteer. This doesn't include the many volunteers that come and go on a daily, weekly, or monthly basis that help in the kitchen, the office, or sorting clothing donations.\nDid you also know? The Shelter's food bill is less than $100 a month for approximately 4,200 meals each month? That's because local individuals, churches, and businesses help by preparing and serving meals; donating bread, cakes, and produce; dropping off coffee and creamer that we go through so much of!\n\nWhat can I do to help? For financial donations in support of our ministry, click the donate now button on our website. To volunteer your time, call the Shelter at 606.330.0785 and ask for the date of our next volunteer orientation. You may also call to schedule a date to provide a meal, bring your choir for a sing-a-long, or to conduct a Bible study. We also love to visit other organizations, so if you'd like us to speak or host a program, we'd love to be invited! We're always open to new faces and new ideas! We hope to see or speak with you soon!"
  },
  {
    "addressLine1": "1020 W Market St",
    "city": "Louisville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40202",
    "name": "The Healing Place",
    "organization": "The Healing Place",
    "phone": "(502) 585-4848",
    "website": "http://www.thehealingplace.org/",
    "description": "Now a nationally-recognized recovery program for men and women, The Healing Place was founded in 1989 as a homeless shelter and medical clinic for men. Every day we provide food, clothing, and shelter at no cost to more than 600 clients seeking help for their addictions.\n\nDetox\nThe primary purpose of Detox is to detoxify and stabilize the individual from drugs and/or alcohol.\nThe secondary function of Detox is to prepare him or her to participate in the Recovery Program and to a life in recovery. Here they begin to identify a common problem and a common solution.\n\nDuring their stay, we supply clients with food, shelter and clothing; familiarize them with the Twelve Steps of Alcoholics Anonymous and Narcotics Anonymous; talk to them about withdrawal; and orient them to The Healing Places unique program.\n\nOff the Streets\nClients accepted into The Healing Place's Recovery Program begin their Off the Streets (OTS) expeirence in the OTS - Safe Haven portion of the program. During this 14 day period, clients feel more protected by remaining on The Healing Place property, except for court dates and medical appointments. During this time, clients attend approximately 80 classes and 12 Step meetings while they become acclimated to The Healing Place environment. OTS Safe Haven clients are housed with OTS clients and begin bonding with those who have already begun the motivational phase of The Healing Place Recovery Program.\n\nOTS is the motivational phase of the recovery program of The Healing Place. Once in the long-term residential program, clients work with peers in similar circumstances to motivate one another to adopt social skills and to learn core principles central to Alcoholics Anonymous and Narcotics Anonymous programs.\n\n\nOur OTS program is where clients come to understand the concept of the physical allergy. Day classes are held off campus at the Healing Centers at 4th and St. Catherine (men) as well as 15th and Kentucky (women). These classes are where clients begin accepting their self-centered-disease problem and its spiritual solution. Our clients also learn the basics of responsibility and move away from a \"street\" mentality. Along the way, they make a commitment to the solution.\n\nThe Recovery Stage\nThe Recovery Stage (Phase I) is where clients learn how to apply the 12 Steps of Alcoholics Anonymous and Narcotics Anonymous in their lives with the program curriculum. This curriculum consists of classes and written assignments. All clients are assisted through the process by Peer Mentors, which are men and women who have completed the program.\nThe first part of this stage stresses personal accountability being on time for classes and meetings, completing job assignments, etc. and encourages clients to look at their own behavior. This is facilitated at the Community meeting.\nThe second part focuses on interpersonal skills, stressing concern and accountability for others in the program. This is achieved through role modeling, holding peers accountable for their actions, and by giving support to others.\n\nPeer Mentors\nPeer Mentors are men and women who have completed the program.\nThey volunteer to serve as leaders and role models for those who are newer in the program. Peer mentors teach classes, monitor assignments, coordinate job assignments and work one-on-one with people who are moving through the recovery process. Peer mentors demonstrate The Healing Place philosophy that the best solution is one alcoholic/addict reaching back to help another along the journey to recovery.\n\nOvernight Shelter\nThe Overnight Shelter provides meals and a safe place for homeless men and women. It is designed with few barriers and rules in order to allow as many overnight guests as possible. Both men's and women's overnight shelters are \"wet,\" i.e. a man or woman may spend the night while under the influence of alcohol and/or drugs.\nEmphasis is placed on role modeling positive change for the overnight guests to demonstrate that people can change their lives and get off the streets."
  },
  {
    "addressLine1": "432 E. Jefferson Street",
    "city": "Louisville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40202",
    "name": "Wayside Christian Mission Shelter",
    "organization": "Wayside Christian Mission Shelter",
    "phone": "(502) 584-3711",
    "website": "http://www.waysidechristianmission.org/",
    "description": "Men's Adult Day Shelter\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711\nHours: 7:00 am - 6:30 pm\nAccommodations: 75 person capacity\n\nMen's Emergency Shelter\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711\nAccommodations: 331 spaces for single males\n \nMen's Permanent Supportive Housing\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711     Accommodations: 30 private apartments for homeless, men with mental or physical disabilities.\n\nSingle Women's Emergency, Transitional and Day Shelter\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711     (8:00 am - 5:00 pm, Day Shelter Only)\nAccommodations: 106 emergency beds, 11 transitional beds\n\nFamily Emergency Shelter\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711     Accommodations: 50 beds\n\nSafe Haven for Women\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711\nAccommodations: 10 emergency beds for homeless, mentally ill women.\n\nWomen's Permanent Supportive Housing\n432 East Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711\n"
  },
  {
    "addressLine1": "927 South 2nd Street",
    "city": "Louisville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40201",
    "name": "The Center For Women and Families MD Campus",
    "organization": "The Center For Women and Families MD Campus",
    "phone": "(502) 581-7200",
    "website": "https://www.thecenteronline.org/",
    "description": "The Center for Women and Families provides services for victims of domestic abuse, sexual assault, spousal abuse, dating violence, and offers family therapy in Louisville, Kentucky and Southern Indiana. The Center for Women and Families helps survivors through supportive services, community education and cooperative partnerships that foster hope, promote self-sufficiency and rebuild lives.\n\nOriginally part of the YWCA, The Center for Women and Families has been serving our community since 1912. Today The Center is a private nonprofit organization with 6 regional locations serving 10 Kentuckiana counties: Bullitt, Henry, Jefferson, Oldham, Shelby, Spencer and Trimble counties in Kentucky and Clark, Floyd and Harrison counties in Indiana."
  },
  {
    "addressLine1": "927 S 2nd St",
    "city": "Louisville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40203",
    "name": "The Center for Women and Families",
    "organization": "The Center for Women and Families",
    "phone": "(502) 581-7200",
    "website": "https://www.thecenteronline.org/",
    "description": "Emergency shelter is for people who ultimately lack a safe place away from an intimate partner abusing them or their families.\n\n    People (women/men/non-binary) and their dependent children who are fleeing an abusive situation are eligible for shelter as it is available.\n\n    We do not deny services or emergency shelter on the basis of gender identity, sexual orientation, disabilities, citizen status, or religious affiliation. We will do our absolute best to accommodate each persons specific needs.\n    You DO NOT need to file an emergency protective order in order to be eligible for emergency shelter."
  },
  {
    "addressLine1": "733 E Jefferson St",
    "city": "Louisville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40202",
    "name": "Re-Center Ministries Louisville Campus",
    "organization": "Re-Center Ministries Louisville Campus",
    "phone": "(502) 583-6543",
    "website": "https://recenterministries.org/",
    "description": "Drop-In Program\n"
  },
  {
    "addressLine1": "710 S. 31st Street",
    "city": "Louisville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40211",
    "name": "Rhonda's Another Chance, Inc. - Transitional Housing",
    "organization": "Rhonda's Another Chance, Inc. - Transitional Housing",
    "phone": "(502) 776-8830",
    "website": "mailto:rhondahouse710@att.net",
    "description": "Transitional home; accommodates four single, homeless women who may reside at Rhonda's for six months to a year.\n\nWomen are accepted from any life-change situation: recovery from drugs/alcohol, job lost or a painful experience of divorce. Mission is to guide women toward permanent lifestyle change and self-dependency and to lend a hand to any woman who requests our assistance."
  },
  {
    "addressLine1": "1624 South Preston Street",
    "city": "Louisville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40217",
    "name": "Women In Circle",
    "organization": "Women In Circle",
    "phone": "(502) 690-2010",
    "website": "http://mindfuldirection.net/womenincircle/",
    "description": ""
  },
  {
    "addressLine1": "1436 South Shelby Street",
    "city": "Louisville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40217",
    "name": "Halfway Back Men's Addiction Recovery Program - Louisville",
    "organization": "Halfway Back Men's Addiction Recovery Program - Louisville",
    "phone": "(502) 635-4530",
    "website": "https://www.voamid.org/halfwayback",
    "description": ""
  },
  {
    "addressLine1": "911 South Brook Street",
    "city": "Louisville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40203",
    "name": "The Salvation Army Center of Hope Shelter",
    "organization": "The Salvation Army Center of Hope Shelter",
    "phone": "(502) 671-4904",
    "website": "https://www.salvationarmylouisville.org/",
    "description": "We offer a Day Shelter and an Overnight Shelter. Shelter Reservations in the Louisville Community for overnight are done with one point of entry via the Coalition for the Homeless (502) 637-2337 (https://louhomeless.org/contacts/) The Single Point of Entry staff takes calls seven days a week from 10 a.m. to 4 p.m.\nCheck in is at 5:15 p.m. for women and 6:00 p.m. for men each night.\n"
  },
  {
    "addressLine1": "1727 DL Motley Way",
    "city": "Jeffersonville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "47130",
    "name": "Catalyst Rescue Mission",
    "organization": "Catalyst Rescue Mission",
    "phone": "(812) 285-1197",
    "website": "https://catalystrescuemission.org/",
    "description": "We provide fresh coffee, hot showers, a place for our clients to receive personal mail and phone calls, and hygiene products.\n\nThose who seek emergency shelter at Catalyst are encouraged to take the next step on the road to permanent housing. Job and housing counselors connect our clients to new opportunities, help them identify barriers to self-sufficiency, and connect them to our case management team as they move forward.\n\n\nOur mission at Catalyst is to identify barriers to housing and to eliminate them. This means that our case manager will be working with our clients on getting identification cards, birth certificates, and social security cards. Our goal is to work through past evictions and help our clients pay the debts they owe. This means obtaining disability, SSI, a part-time job, or a full-time job is a must.\n\nCatalyst will work with potential landlords to match our clients with the housing options that are best for them. Through our partnerships with the New Albany Housing Authority and Jeffersonville Housing Authority, we seek housing permanency for all our clients."
  },
  {
    "addressLine1": "702 E Market Street",
    "city": "New Albany",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "47150",
    "name": "St. Elizabeth Catholic Charities",
    "organization": "St. Elizabeth Catholic Charities",
    "phone": "(812) 949-7305",
    "website": "https://www.stecharities.org/",
    "description": ""
  },
  {
    "addressLine1": "644 Kentucky Highway 122",
    "city": "Martin",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "41649",
    "name": "East Kentucky House of Hope",
    "organization": "East Kentucky House of Hope",
    "phone": "(606) 949-2018",
    "website": "https://ekyhouseofhope.com/",
    "description": ""
  },
  {
    "addressLine1": "173 Redale Road",
    "city": "Pikeville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "41501",
    "name": "WestCare Emergency Shelter",
    "organization": "WestCare Emergency Shelter",
    "phone": "(606) 432-9442",
    "website": "https://www.westcare.com/",
    "description": "Emergency Homeless Shelter.\n\nProvides housing, substance abuse services and independent living skills for the homeless.\nWarming Station\nDuring cold weather times, shelter opens its doors for anyone who needs to stay warm or have a shower.\nFrom 7am to 7pm if temps drop below 32 degrees.\n\n"
  },
  {
    "addressLine1": "P.O. Box 5375",
    "city": "Mayfield",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42066",
    "name": "The Lighthouse - A Healing Place",
    "organization": "The Lighthouse - A Healing Place",
    "phone": "(270) 247-9226",
    "website": "https://mayfieldlighthouse.org/",
    "description": "The Lighthouse is a shelter for women and children or women who are victims to domestic violence.\n\n"
  },
  {
    "addressLine1": "402 Legion Drive",
    "city": "Paducah",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42003",
    "name": "Paducah Cooperative Ministry",
    "organization": "Paducah Cooperative Ministry",
    "phone": "(270) 442-6795",
    "website": "http://paducahcoopministry.org/",
    "description": "Homeless Services & Fresh Start Village\n\nPCM began operating a shelter in 1990, offering on-site care by our Homeless Shelter Director and our part-time shelter supervisor. Today, PCM operates the newly opened Fresh Start Village for homeless women and children.\n\n"
  },
  {
    "addressLine1": "695 Flemingsburg Rd.",
    "city": "Morehead",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40351",
    "name": "Gateway Homeless Coalition",
    "organization": "Gateway Homeless Coalition",
    "phone": "(606) 784-2668",
    "website": "http://www.gatewayhouseky.org/",
    "description": "Business Office Hours:\nMonday-Thursday: 8AM - 6PM\nFriday: 8AM - 5PM\nWe are closed for lunch daily from 12PM-1PM\n\nCurrently, Gateway House can provide shelter for up to 22 persons at maximum capacity. Shelter residents receive shelter, food, personal care and hygiene items as well as case management, advocacy, referral services and assistance in securing long-term housing. In addition, our program offers in-house training to help with life-skills, job readiness, financial and budgeting skills, and more. GHC also works closely with other service providers in the area to ensure that residents have access to all programs necessary to help them rebuild their lives.\n\nEmergency transitional housing facility serving Bath, Carter, Elliott, Fleming, Menifee, Montgomery, Morgan and Rowan Counties in Eastern Kentucky.\n\n\nSix bedroom shelter one floor with basement. Residents are allowed ninety days of shelter after that if they have a job or the possibility of housing we work with them and give them extenions if needed."
  },
  {
    "addressLine1": "1034 East Main Street, Level 2",
    "city": "Morehead",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40351",
    "name": "Mountain Haven Emergency Shelter",
    "organization": "Mountain Haven Emergency Shelter",
    "phone": "(606) 784-3337",
    "website": "http://www.mtcomp.org/youthshelter.html",
    "description": "We are a 24/7 emergency housing facility for youth ages 12-17, offering a host of resources such as counseling, life skills training, and community supports.\n\nWalk-ins are welcome, and we are a LGBTQIA friendly facility."
  },
  {
    "addressLine1": "11483 State Route 41",
    "city": "West Union",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45693",
    "name": "Adams County Ohio Shelter for the Homeless",
    "organization": "Adams County Ohio Shelter for the Homeless",
    "phone": "(937) 544-8164",
    "website": "mailto:charbrown@adamscountyhomeless.org",
    "description": ""
  },
  {
    "addressLine1": "P O Box 508",
    "city": "Mount Washington",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40047",
    "name": "Room in the Inn - Bullitt County",
    "organization": "Room in the Inn - Bullitt County",
    "phone": "(502) 714-3742",
    "website": "https://heartofmycity.org/",
    "description": "We offer overnight shelter to pre-approved applicants. Must apply by 3 pm in order to be picked up for transport to nightly shelter location. Based on the national Room in the Inn model, we partner with area churches and civic groups who provide a secure, safe overnight location as well as an evening meal, a light breakfast and encouraging conversation. We provide the bedding (cots & linens) and overnight essentials. We then depart early (6 a.m. ish) for Shepherdsville, where most of our 'guests' have found jobs or spend the day looking for jobs. Our guests agree to accept a \"hand up\" and not ask for a \"hand-out\". We expect them to be employed and able to be back on their feet within six to eight weeks. We are NOT a permanent shelter."
  },
  {
    "addressLine1": "1836 Brewster Avenue",
    "city": "Cincinnati",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45207",
    "name": "The Swan House",
    "organization": "The Swan House",
    "phone": "(513) 531-9111",
    "website": "http://www.iamsomebodyministries.org/",
    "description": "This home houses women who have been battered and abused, homeless women, and women that need a new start in life.\n\nThe women that come through these doors have an opportunity for resurrection wholeness in Christ with the leading of the Holy Spirit, and the assistance of the Swan House personnel and the I Am Somebody Ministries.\n\n\nThe Swan House along with a network of faith-based and other support organizations provides the residents with a home, where they receive everything from the emotional, physical and spiritual needs, food, clothing and shelter, job training, employment/vocational opportunities, and one on one mentoring/coaching to assistance with court proceedings, when necessary. The women are allowed to stay in the Swan House for up to 2 years and upon successful completion of the program, after care services will be provided."
  },
  {
    "addressLine1": "4230 Hamilton Ave",
    "city": "Cincinnati",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "45223",
    "name": "Grace Place Cincinnati",
    "organization": "Grace Place Cincinnati",
    "phone": "(513) 591-2246",
    "website": "http://www.cainministry.org/graceplace.html",
    "description": ""
  },
  {
    "addressLine1": "501 Walnut Street",
    "city": "Owensboro",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42301",
    "name": "The Daniel Pitino Shelter Family Shelter",
    "organization": "The Daniel Pitino Shelter Family Shelter",
    "phone": "(270) 688-9000",
    "website": "https://pitinoshelter.org/",
    "description": "Women's and Married couples and family shelter only. Can stay up to 2 years based on need.\n\n"
  },
  {
    "addressLine1": "609 Wing Avenue",
    "city": "Owensboro",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42303",
    "name": "Boulware Mission",
    "organization": "Boulware Mission",
    "phone": "(270) 683-8267",
    "website": "https://www.boulwaremission.org/",
    "description": "Boulware Mission is a faith-based shelter that has been serving Owensboro and its surrounding counties since 1921.\n\nBoulware is a shelter for displaced men who are trying to change their situation and start over. We understand that combating the host of problems our clients are facing is not just about providing a bed to sleep in at night. Each client is different and the definition of success is different for each person. Physical health issues, addictions, low educational achievements, family disintegration, poor coping and problem solving skills, lack of affordable housing and jobs, and lack of necessary life skills are among some of the issues that contribute to hopelessness and lowered life expectations for those we serve.\n\n\nDrug & Alcohol Treatment Program\n\nBoulware Mission's Intensive Outpatient Alcohol and Drug Abuse Treatment Program emphasizes the whole person, not just the addiction.  We do this by addressing the spiritual, emotional, and physical effects of substance abuse.  The program includes group counseling, drug and alcohol education, relapse prevention, introduction to the 12-step program, and aftercare planning.  Treatment sessions are held twice weekly for 3 hours.\n\n    Licensed by the State of Kentucky, Division of Mental Health and Substance Abuse\n\n\n    Member NAAP (National Association of Addiction Providers)\n\n    Certified Alcohol and Drug Counselors on site\n\n    Confidential admission assessments conducted by trained professionals\n\n    4-6 week duration based on individual needs\n\n    Appropriate for mild to moderate addiction treatment"
  },
  {
    "addressLine1": "1001 W. 7th Street",
    "city": "Owensboro",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42301",
    "name": "St. Benedict's Shelter Men's Shelter",
    "organization": "St. Benedict's Shelter Men's Shelter",
    "phone": "(270) 541-1003",
    "website": "http://stbenedictsowensboro.org/",
    "description": "Shelter is open year-round from 8 p.m. til 8 a.m.Men only emergency shelter. Two meals daily. Laundry and showers available to overnight guests.\n\nSt. Benedict Emergency Homeless Shelter is a temporary refuge for the homeless men in our community. We provide our guests with a safe, non-judgmental, warm place to sleep, take a shower, eat and wash personal laundry in a Christian atmosphere.\n\n\nWe need to help our homeless so that they can be provided with a place to sleep, a hot meal, a warm shower and a place to launder their clothing. Please consider what you can give so that our community may continue to operate its only walk-in homeless shelter. Without your generosity many will find no shelter from the weather, no food to fill their stomach and no loving community away from the streets.\n\nTransitional Housing Services\nThe primary purpose or mission of transitional housing environments is to help the resident become a productive member of society while also helping the resident to establish a valid rental history. Our transitional homes provide a drug free environment and foster a peer driven atmosphere.\nWe currently operate two Transitional Homes for the men of St. Benedicts transitioning from the facility, to the outside world. These two homes, the Good Samaritan Home and the Foundation Home, house seven men each at a time, and require monitored random drug screening while also providing a 2-year transition period. These homes also provide low-cost rent and help establish credible rental history. This, then allows our men to overcome financial barriers, save money, obtain vehicles, strengthen sobriety, return to school, overcome legal situations, learn accountability and responsibility, and thus, creates an independent member of society. "
  },
  {
    "addressLine1": "4301 Veach Rd",
    "city": "Owensboro",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42303",
    "name": "Owensboro Regional Recovery",
    "organization": "Owensboro Regional Recovery",
    "phone": "(270) 689-0905",
    "website": "http://www.owensbororegionalrecovery.org/",
    "description": "Owensboro Regional Recovery (ORR) is a Recovery Kentucky mens substance abuse recovery program modeled after Louisvilles Healing Place. Our program usually takes between 6 and 9 months to complete. The peer-driven community model is the greatest contribution to our clients success. Our goal is to simultaneously reduce the states drug problem and homeless issues. We help people recover from addiction, gain control of their lives, and eventually reside in permanent housing.\nHow To Apply\nIf someone wishes to apply for admission, they need to call (270) 689-0905, ext 2117. A staff member is available 24/7 and will do a phone screen. If a loved one calls for someone that is incarcerated, we would need a *complete* criminal history sent to us by fax, mail or in person. Our fax number is (270) 689-0903\n"
  },
  {
    "addressLine1": "820 Anderson Street",
    "city": "Sikeston",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "63801",
    "name": "DAEOC Homeless Services",
    "organization": "DAEOC Homeless Services",
    "phone": "(573) 471-6014",
    "website": "https://www.daeoc.com/",
    "description": "Non profit organization that operates an emergency homeless shelter. Call for more information.Open 24 hours.\n"
  },
  {
    "addressLine1": "103 E Calvert",
    "city": "Marion",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "62959",
    "name": "Marion Ministerial Alliance",
    "organization": "Marion Ministerial Alliance",
    "phone": "(618) 993-8419",
    "website": "https://www.facebook.com/MarionMinisterialAlliance/",
    "description": "Utility Assistance, Rent Assistance, Temporary Shelter, Hygiene Kits, Etc.\nAssistance Office\nOpen Monday Friday\n9:00 am 1:00 pm\n\nDo you need a meal?\nSoup Kitchen\nOpen Monday-Friday\n11:30 am 12:30 pm\n\nDo you need groceries?\nProject Manna Food Pantry\nOpen Tuesday Only\n8:30 am 11:30 am"
  },
  {
    "addressLine1": "632 N. Jackson Street",
    "city": "Harrisburg",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "62946",
    "name": "Christian Community Compassion Center 4C's",
    "organization": "Christian Community Compassion Center 4C's",
    "phone": "(618) 252-3931",
    "website": "http://www.harrisburgpresbyterian.org/",
    "description": ""
  },
  {
    "addressLine1": "not disclosed",
    "city": "Cape Girardeau",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "63701",
    "name": "Safe House For Women",
    "organization": "Safe House For Women",
    "phone": "(800) 341-1830",
    "website": "http://www.semosafehouse.org/",
    "description": "The Safe House for Women, Inc. is a 24-Hour emergency shelter for women and their dependents who are victims of domestic violence. Our shelter can accommodate 22 women and children at anytime. It is a communal living situation with a large living room, kitchen, laundry facilities, outside play area and 5 bedrooms. Our location is confidential and monitored by security cameras for safety reasons.\nAll services are FREE and CONFIDENTIAL\nWe provide residents with all of the items necessary to sustain everyday life while they reside in the shelter such as hygiene items, towels, bedding and some food.\n\nSafe House for Women 24-Hour Hotline: 573-651-1614 or 1-800-341-1830"
  },
  {
    "addressLine1": "152 Douglas Parkway",
    "city": "Pikeville ",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "41501",
    "name": "Veterans Transitional Housing Center",
    "organization": "Veterans Transitional Housing Center",
    "phone": "(606) 639-3178",
    "website": "http://www.mtcomp.org/",
    "description": ""
  },
  {
    "addressLine1": "117 Pine Street",
    "city": "Pineville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40977",
    "name": "Safe Haven Shelter - Battered Women and Children's Center",
    "organization": "Safe Haven Shelter - Battered Women and Children's Center",
    "phone": "(606) 337-9736",
    "website": "http://lighthouseministriesky.org/",
    "description": "The Safe Haven homeless shelter to provide a positive community service for those less fortunate. The shelter is open 24/7 and accommodates 18+ residents. The facility has a lounge and fully equipped kitchen along with bedrooms and a laundry room.\n\nServices Provided:\n- Temporary Housing\n- Food\n- Assistance in acquiring permanent housing"
  },
  {
    "addressLine1": "123 Pine Street",
    "city": "Richmond",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40475",
    "name": "New Liberty Family Shelter",
    "organization": "New Liberty Family Shelter",
    "phone": "(859) 623-4564",
    "website": "http://www.foothillscap.org/",
    "description": ""
  },
  {
    "addressLine1": "1675 E Main St",
    "city": "Richmond",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40475",
    "name": "Emergency Shelter at The Salvation Army Richmond KY",
    "organization": "Emergency Shelter at The Salvation Army Richmond KY",
    "phone": "(859) 624-5826",
    "website": "http://salvationarmykentucky.org/richmond/",
    "description": "The Emergency Shelter at The Salvation Army helps people in time of crisis to stabilize their lives and then assists them to restore a productive lifestyle. The shelter provides a clean, safe living environment, shower and laundry facilities, and two healthy meals per day.\n\nOpen 7 days a week, the shelter can accommodate 8 men and 8 women in separate dorm areas. Beds are first come, first serve and cots are available for emergency overflow conditions. Shelter intake is between 6 PM and 10 PM daily. A government issued picture ID is required for admission.\n\n\nShelter clients are provided with clean sheets, towels and personal hygiene products. An evening meal is served at 6:30 PM. Following dinner clients can relax or socialize in the common area with television, books, games or conversation. Curfew is at 10:00 PM. Wake up is at 6:00 AM and breakfast is served at 6:30 AM. The shelter closes for the day at 7:00 AM but frequently life enrichment programs are offered from 7:00 to 8:00 AM."
  },
  {
    "addressLine1": "19 Wainscott Ave",
    "city": "Winchester",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40391",
    "name": "Clark County Homeless Coalition",
    "organization": "Clark County Homeless Coalition",
    "phone": "(859) 744-8733",
    "website": "http://www.helphomelessfamilies.org/",
    "description": "Wainscott Hall is a transitional home serving men, women and families. We provide intensive case management, life skills classes, and numerous services to assist in achieving independence.\n\nWe provide a variety of services, including:\n   Transitional Housing\n   Intensive Case Management\n   Employment search assistance\n   Life Skills Training\n   Financial Literacy\n   Referrals to community organizations\n   Advocacy\n   Veterans Expanded Services Program\n\n\n\nVolunteer Opportunities:\nChild Care Provider:  Care for the children of residents while they attend classes or case management appointments.  Contact us for specific days and times.  Child care is usually needed for only an hour or two at a time.\nHandyman:  Perform basic repairs and maintenance on the shelter.  Will need to provide most of your own tools.  An hour or two per week or less.\n\nOffice Assistant: Work in the office, assisting with correspondence, filing, organizing and some help with resident check in and exit. An hour or more Monday through Friday, 9-5.\nEvents: Help plan, organize, and work special events.  Hours vary.\n             Call 859-744-8733 to discuss ways you can help!"
  },
  {
    "addressLine1": "850 Bypass Road",
    "city": "Winchester",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40391",
    "name": "The Beacon of Hope Emergency Shelter",
    "organization": "The Beacon of Hope Emergency Shelter",
    "phone": "(859) 644-5171",
    "website": "http://www.ccbeaconofhope.wixsite.com/beacon-of-hope",
    "description": "We are a 24/7 Emergency shelter, 3 meals a day, 90 day shelter,Picture ID is required.\n\nWe offer GED classes, budgeting classes,help finding employment.\n\nHow We Help\nBeacon of Hope Emergency Shelter provides homeless families and individuals access to overnight and short-term shelter, access to safety net support services, nutritious meals throughout day, access to crisis intervention counseling, help with employment and life-skills training, housing search and placement assistance, individual and family therapy."
  },
  {
    "addressLine1": "500 Main St",
    "city": "Shelbyville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40065",
    "name": "The Center for Women and Families Shelbyville Office",
    "organization": "The Center for Women and Families Shelbyville Office",
    "phone": "(502) 581-7222",
    "website": "https://www.thecenteronline.org/about-cfw/us/",
    "description": "The Center for Women and Families provides services for victims of domestic abuse, sexual assault, spousal abuse, dating violence, and offers family therapy. The Center for Women and Families helps survivors through supportive services, community education and cooperative partnerships that foster hope, promote self-sufficiency and rebuild lives.\n\n\n\nThis office serves: Shelby, Henry, Oldham Trimble and Spencer Counties.\n\n\nOriginally part of the YWCA, The Center for Women and Families has been serving our community since 1912. Today The Center is a private nonprofit organization with 6 regional locations serving 10 Kentuckiana counties: Bullitt, Henry, Jefferson, Oldham, Shelby, Spencer and Trimble counties in Kentucky and Clark, Floyd and Harrison counties in Indiana."
  },
  {
    "addressLine1": "211 8th street",
    "city": "Shelbyville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40065",
    "name": "Open Door of Hope",
    "organization": "Open Door of Hope",
    "phone": "(502) 647-5566",
    "website": "https://awakeky.org/",
    "description": "30 day men's night shelter 7pm-7a.m. must be 18 yrs old.\n\n\n\nServices Offered:\n\nOvernight Shelter\n\nSleeping and Shower Facilities\n\nHot Meals\n\nBible Study\n\nReferrals to Other Services\n\nTransportation to Jobs and Other Appointments\n\n\n\nTransitional Housing\n\nLong Term, Fee-Based Housing (6 to 9 months)\n\nCase Management\n\nFinancial Management Counseling\n\nRoutine Drug and Alcohol Testing"
  },
  {
    "addressLine1": "708 Main St",
    "city": "Shelbyville",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "40065",
    "name": "Operation Care",
    "organization": "Operation Care",
    "phone": "(502) 633-1965",
    "website": "https://www.operationcareky.org/",
    "description": "Transitional Housing Program\nOmega House\nHall Manor\nHope House\n502-633-1965\n\nOur housing program addresses the physical, spiritual, emotional, and social issues faced by the women and children we serve.\n\n    We engage in case management and financial planning with each family in our program.\n\n    We partner with local mental health agencies and Christian counselors to address psychological needs.\n    We coordinate with a team of pro bono attorneys to handle legal issues.\n    We match each woman in our program with a volunteer Friend in Christ to help build a social network of support, encouragement, accountability, and friendship.\n    We align volunteer mentors with the women in our program to teach parenting and domestic skills.\n    We partner with local churches to ensure that our residents are engaged in a Christian community.\n    We help women and children meet educational goals by coordinating with state and local educational institutions\n\n    We provide tutoring by certified teachers who volunteer to work with the children in our program.\n    We offer our children weekly lessons in voice, guitar, and piano by a certified music teacher.\n    If any woman is unemployed when she enters our program, we provide job training through our Encore Shop Thrift Store.\n    We help each woman secure employment.\n\n\nEmergency Assistance\nThe Encore Shop Thrift Store\n708 Main Street\n502-633-1965\n\nThe Encore Shop thrift store provides a substantial amount of the operating capital required to administer the many programs offered by Operation Care.  The store is open to the public Monday through Saturday at the following times:\n\nEncore Shop open:  Mon., Tues., Wed., Fri., & Sat. - 10-5 * Thur. - 10-6 * Sun. - Closed\nDonations Accepted: Tues. through Fri. - 10-4 * Sat. - 10-2 or by appointment\n\nWe encourage donors and shoppers from every financial background to donate items for sale and to purchase items in the Encore Shop.  Help us turn donated merchandise into funds to help people in need.\n\nThe Encore Shop also administers Operation Care's Helps Program.  Through that program, we distribute the following items to qualifying individuals in crisis:  non-perishable food from the Operation Care food pantry, clothing, household furnishings, personal hygiene products, book bags and school supplies.\n\n\nOperation Care offers free Bibles and a community Bible study every Friday morning at 9 a.m. in the Encore Shop Community Room.  We welcome you to join us in learning more about God from His Word.\n\nIf you would like to volunteer in the Encore Shop, please call us at 502-633-1965.\n\n\n"
  },
  {
    "addressLine1": "P.O. Box 864",
    "city": "Somerset",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "42501",
    "name": "Bethany House Spouse Abuse Center",
    "organization": "Bethany House Spouse Abuse Center",
    "phone": "(606) 679-1553",
    "website": "https://www.facebook.com/pg/BethanyHouseAbuseShelter/about/?ref=page_internal",
    "description": ""
  },
  {
    "addressLine1": "105 East Main Street",
    "city": "Mt. Vernon",
    "state": "Kentucky",
    "stateAbbreviation": "KY",
    "postal": "67211",
    "name": "Daniel Boone Community Action Agency (Ashlee’s House Homeless Shelter)",
    "organization": "Daniel Boone Community Action Agency (Ashlee’s House Homeless Shelter)",
    "phone": "(606) 256-5315",
    "website": "http://danielboonecaa.org/",
    "description": "Homeless Shelter"
  }
]