[
  {
    "addressLine1": "509 Romero St.",
    "city": "Bisbee",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85603",
    "name": "Bisbee Coalition for the Homeless - Tin Town Shelter and Pantry",
    "organization": "Bisbee Coalition for the Homeless - Tin Town Shelter and Pantry",
    "phone": "(520) 432-7839",
    "website": "https://bisbeeshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "240 Ohara St",
    "city": "Bisbee",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85603",
    "name": "Renaissance House Transitional Housing",
    "organization": "Renaissance House Transitional Housing",
    "phone": "(520) 432-1771",
    "website": "",
    "description": "Women's Shelter\n\nRenaissance House is a Level 2* behavioral health facility that serves homeless women in recovery from drug and alcohol dependence, victims of domestic violence, women getting out of jail or prison, women with mental illness, and women who are working to reunite their families. Renaissance House provides residents food, shelter, clothing, transportation, and childcare while offering a comprehensive array of services, treatment and training."
  },
  {
    "addressLine1": "not disclosed",
    "city": "Sierra Vista",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85636",
    "name": "Forgach House - Domestic Crisis Shelter",
    "organization": "Forgach House - Domestic Crisis Shelter",
    "phone": "(520) 458-9096",
    "website": "http://www.ccs-soaz.org/services/detail/domestic-violence-programs",
    "description": "Can provide transitional living where case managers work to ensure needed resources remain in place while residents build the confidence to succeed on their own. This program is vital to break the generational cycle of violence and empower survivors to build the skills and supports necessary to thrive long-term."
  },
  {
    "addressLine1": "420 N 7th St",
    "city": "Sierra Vista",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85635",
    "name": "Good Neighbor Alliance - Samaritan Station",
    "organization": "Good Neighbor Alliance - Samaritan Station",
    "phone": "(520) 439-0776",
    "website": "http://svshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "2105 N Washington Ave",
    "city": "Douglas",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85603",
    "name": "House of Hope",
    "organization": "House of Hope",
    "phone": "(520) 364-2465",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "721 Gonzales Blvd",
    "city": "Huachuca City",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85616",
    "name": "Cochise County Children's Crisis Center",
    "organization": "Cochise County Children's Crisis Center",
    "phone": "(877) 520-8336",
    "website": "https://www.cochise.az.gov/",
    "description": "This is an emergency shelter in Cochise County for children under 17 years of age."
  },
  {
    "addressLine1": "P.O. Box 20205",
    "city": "Bullhead City",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86439",
    "name": "Safehouse - A Project of West Care, Inc.",
    "organization": "Safehouse - A Project of West Care, Inc.",
    "phone": "(702) 385-2090",
    "website": "https://www.westcare.com/",
    "description": "20 emergency beds for victims of domestic violence; counseling; shelter for homeless women and children.\nSince 1992, WestCare Arizona has been providing a full continuum of community-based, family-oriented social service and behavioral health programming to youth; adults and families in the rural, tri-state are of Arizona, California, and Nevada. Our team of multi-cultural, experienced and credentialed staff is dedicated to providing the best care to everyone who enters our doors. Our goal is to uplift the human spirit by providing the skills and support for individuals to achieve their dreams and transform their lives."
  },
  {
    "addressLine1": "1770 Airway Ave.",
    "city": "Kingman",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86401",
    "name": "Kingman Aid to Abused People",
    "organization": "Kingman Aid to Abused People",
    "phone": "(928) 753-6222",
    "website": "http://mykaap.org/",
    "description": "20 emergency beds for domestic violence victims; counseling; homeless beds when available; clothing; advocates in court; some monetary assistance to shelter clients.\n24 Hour Crisis Line 928-753-4242\nNational Domestic Violence Hotline 1-800-799-SAFE\nEmergency Shelter\nResidential Program\nOutreach Program\nCrisis Counseling\nAdvocacy (Legal and Personal)\nChildren's Program\nPet Friendly Facility\nHandicap Accessible\nTDD equipment for the Hearing Impaired\nAlternative methods for the Visually Impaired\nNo Fees For Services\n\nKAAP understands that people are not the only victims in a bad situation and strives to make sure family pets are also taken care and remain with the family.\n"
  },
  {
    "addressLine1": "3049 Sycamore Ave",
    "city": "Kingman",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86409",
    "name": "Cornerstone Mission Project, Inc.",
    "organization": "Cornerstone Mission Project, Inc.",
    "phone": "(928) 757-1535",
    "website": "http://www.cornerstonemissionaz.org/",
    "description": ""
  },
  {
    "addressLine1": "345 S California St",
    "city": "Chandler",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "00000",
    "name": "I-HELP Chandler",
    "organization": "I-HELP Chandler",
    "phone": "(480) 963-1423",
    "website": "https://azcend.org/",
    "description": "Provides emergency shelter for adults without children experiencing homelessness. Clients receive evening and morning meals, case management, and referrals to available community resources.\nAll new guests must complete a pre-screening interview before entering I-HELP.  Please call for bed availability and to schedule pre-screening.\n"
  },
  {
    "addressLine1": "2254 W Main St",
    "city": "Mesa",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85201",
    "name": "La Mesita Apartments",
    "organization": "La Mesita Apartments",
    "phone": "(602) 595-8700",
    "website": "https://www.turnanewleaf.org/",
    "description": "La Mesita Apartments are a long-term solution for low-income families to have a safe place to call home. Consisting of 110 apartments including studios through multiple bedroom units. 50 affordable housing units serve households at or below 60% of the area median income. 58 units serve households at or below 30% of the area median income for those transitioning from homelessness that are in need of support services through the City of Mesa Project Based Voucher (PBV) program. The 58 PBV units have a veteran preference.\n\nServices include:\n\nAccess Point for Arizona@Work\nA Community Room, Computer Room, Health and Wellness Center\nHead Start Program\nAfter School and Summer Program\nCounseling Services\nEducational Classes"
  },
  {
    "addressLine1": "2245 W Ella St",
    "city": "Mesa",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85201",
    "name": "La Mesita Family Homeless Shelter",
    "organization": "La Mesita Family Homeless Shelter",
    "phone": "(602) 595-8700",
    "website": "https://www.turnanewleaf.org/",
    "description": "A New Leafs La Mesita Family Homeless Shelter is a 16-unit family shelter providing a broad array of services to help homeless families with minor-aged children become self-reliant. Families stay up to 120 days in 1 or 2 bedroom apartments with basic needs provided upon entry including food, clothing, hygiene and household items.\n\nServices include:\nTemporary Emergency Housing\nCase Management\nOnsite Resident Services\nPermanent Housing"
  },
  {
    "addressLine1": "confidential not provided",
    "city": "Mesa",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85201",
    "name": "A New Leaf Women's Domestic Violence Shelters",
    "organization": "A New Leaf Women's Domestic Violence Shelters",
    "phone": "(480) 890-3039",
    "website": "https://www.turnanewleaf.org/",
    "description": ""
  },
  {
    "addressLine1": "125 E. University Dr.",
    "city": "Mesa",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85201",
    "name": "Save the Family",
    "organization": "Save the Family",
    "phone": "(480) 898-0228",
    "website": "https://savethefamily.org/",
    "description": "As news outlets share more about the growing crisis of COVID-19 and its impact on our community, we wanted to connect as we navigate through the uncertainty together. We are taking every precaution here at our offices and in our work throughout the community to ensure that we all stay healthy and safe.\n\nOur offices are closed to outside visitors and volunteer groups, but we continue to deliver quality housing and support services to families in need. Our families need help now more than ever! Below are some ways YOU can help the families we serve during this difficult time:\n\n\n1) Drop off donations like shelf-stable food items or hygiene products at Save the Family's Donation Center, located at 444 N. Country Club Drive, Mesa, AZ 85201, between 8 am and 1 pm, 2 pm to 5 pm. Just like everyone else, our families are in need of toilet paper, paper towels, and pantry necessities. However, in many cases our families are limited by SNAP benefit allowances and are additionally burdened by school and youth program closures that typically help meet nutritional needs for little ones.\n\n2) Stay social while staying safe. Follow us on Facebook, Twitter, LinkedIn, and Instagram! We want to stay connected to you despite fewer chances to meet in person."
  },
  {
    "addressLine1": "2345 N. Country Club Drive",
    "city": "Mesa",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85201",
    "name": "A New Leaf's East Valley Men's Center (EVMC) Shelter",
    "organization": "A New Leaf's East Valley Men's Center (EVMC) Shelter",
    "phone": "(480) 610-6722",
    "website": "http://www.turnanewleaf.org/",
    "description": "The East Valley Men's Center (EVMC) is an emergency shelter for up to 76 homeless men who make the commitment to become self-sufficient and move back into the community.  There are 18 transitional housing beds.\n\nEVMC provides:\nFood, shelter and basic needs\nTraining and work assistance\nCounseling and educational classes\n\nResidents are prescreened before enrollment and as ked to be candid about the problems that resulted in their homelessness. Once at the facility, staff ensure that each resident comply with established rules. During their stay, all residents must work full time and save 85% of their income."
  },
  {
    "addressLine1": "7447 E. Earll Dr.",
    "city": "Scottsdal",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85257",
    "name": "Family Promise of Greater Phoenix",
    "organization": "Family Promise of Greater Phoenix",
    "phone": "(480) 659-5227",
    "website": "https://familypromiseaz.org/",
    "description": "Need Shelter?\nFamily Promise is an interfaith network shelter for homeless families. This means that families are provided their evening meal and the lodging at congregations across the Valley. Never more than five families at a time will stay with the hosting congregation for 7 nights in a row, coming back to the day center daily for resources, job searching, housing applications and case management. Maximum stay is 60 days, with a 70% success rate of securing sustainable housing for families who enter the program.\n\n3 Steps to Shelter with Family Promise\n \nSTEP 1: Meet minimum Criteria:\n     At least 1 parent and 1 child\n     Drug and alcohol free,\n     Ability and desire to secure employment\n     No active domestic violence\n     No violent felonies\n\nSTEP 2: Call to check space availability:  480-659-5227\n    If full, call housing hub for waiting list (211)\n\nSTEP 3:  Schedule intake appointment, subject to:\n    Criminal background check will be done in all 50 states\n    On-site drug test will be done prior to acceptance\n    On-site interview for final decision\n    Invitation to move in to the shelter\n\n\nFamily Promises mission is to reduce homelessness in greater Phoenix by helping homeless and low-income families with children become self-sufficient. We do this with the help of a network of interfaith congregations that are passionate about serving homeless families. Together, our goal is to provide homeless families with a safety net of services so they can become independent and sustainable as a family unit.\n\nWe provide two programs Emergency Shelter and Transitional Housing. We accept only families with children, and are dedicated to keeping the family together. We have zero tolerance for substance abuse or violence, and accept into our program only parents able to work in the U.S.\n\n\nIn our Emergency Shelter we focus on resolving the familys immediate crisis and provide food, safe shelter, clothing, and help them find daycare, schools, employment and social services. Within 60 days the family has generally stabilized and a parent is employed. Now the family may be eligible to move into one of our affordable Transitional Housing units as they continue to learn to live independently. We continue to give encouragement and case management while they transition from homelessness to self-sufficiency.\n\nThe Family Promise program is a proven model that is highly effective in helping low-income people develop skills to improve their ability to earn a living wage and support their family and we maintain a success rate over 70%. Family Promise is a non-sectarian 501(c)3 charity qualified for the Working Poor Arizona Tax Credit."
  },
  {
    "addressLine1": "6935 East Williams Field Rd",
    "city": "Mesa",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85212",
    "name": "House of Refuge",
    "organization": "House of Refuge",
    "phone": "(480) 988-9242",
    "website": "https://houseofrefuge.org/",
    "description": "House of Refuge is NOT an emergency shelter. If you are in need of immediate shelter please call the Family Housing Hub, 602-595-8700.\n\nHouse of Refuge is a social service program, providing case management services, employment support and transitional housing.\n\nTo participate in our program, you must be working or able to gain employment within 45 days from move-in. House of Refuge is a work program.\nParticipants are required to sign a lease and pay monthly rent based on 30% of the adjusted gross household income.\nTo be eligible, you must meet the following:\n    Be deemed homeless, at risk of homelessness or fleeing domestic violence\n    Be 18 years old or older\n    Have at least one dependent child or be in third trimester of pregnancy\n    Have some form of verifiable income\n    Be drug and alcohol free and able to pass a drug test (urine)\n    Not have been charged with or committed any sex offense\nEligibility does not guarantee acceptance into our program."
  },
  {
    "addressLine1": "3333 East Van Buren Street",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85008",
    "name": "UMOM New Day Centers‎",
    "organization": "UMOM New Day Centers‎",
    "phone": "(602) 275-7852",
    "website": "https://www.umom.org/",
    "description": "For Shelter Information contact:\nPlease contact the Family Housing Hub at 602-595-8700\nSingle individuals seeking shelter please call 602-759-5356\n\n\nUMOM New Day Centers\nFor families, including families of military veterans\n\nOn the UMOM New Day Centers campus, each family lives in a private room. Case managers guide families as they create an individual housing plan their unique strategy to confront and overcome the challenges that led to experiencing homelessness. Tools and resources, such as the New Day Employment Center, job readiness courses, and an onsite childcare development center, aid clients in finding and keeping a job. A licensed wellness clinic, also on-campus, helps kids and young adults stay healthy and in school.\nHalle Womens Center\nFor single women without children\n\nOpened in June 2017, the Halle Womens Center is the first Arizona shelter designed specifically for single women. Before Halle, women experiencing homelessness had a cot on the floor of a multipurpose room with more than 100 other women. Now, two or three women share a room with a private bathroom.\n\nBefore Halle, women received only two meals a day and had to leave the shelter during the day. Now, nutritious meals are served three times a day. Daytime hours are available for work with case managers to gain skills, find jobs, solve problems, and identify a path to permanent housing.\n\n\n\nOpen Hands Emergency Crisis Shelter\nFor youth ages 12-17\n\nThis six-bed residential emergency shelter in Phoenix provides a safe, home-like setting for youth experiencing homelessness, family conflict, or abuse.\n\nOpen Hands offers individual and family counseling with the goal of family reunification. Youth who arent able to safely return home may stay for a longer term; learning life skills and receiving workforce and job readiness training.\n\n\nApproximately 200 youth are served each year through Open Hands. Nearly all who complete the program exit to safe, permanent housing.\n\n\nYouth Shelters: The Transitional Independent Living Program\nFor teens and young adults, ages 16 21\n\nOften, teens experience homeless because they are:\n\nEscaping violence\nSuffering due to substance abuse of their own or by a parent\nRejected because of gender identity\nAging out of the foster care system.\n\nUMOM's Youth Program at Earll provides hope and a safe place to stay. Youth work with case managers and counselors to regain a sense of safety, finish high school, look for a job, learn how to use public transportation, and more. Perhaps most significantly, they are able to meet other young people, make friends, and have fun something that they may not have experienced otherwise.\n\n\n\nYouth Resource Center and Street Outreach Engagement Team\nFor youth ages 18 24\n\nFree supportive services are available for young adults who are experiencing homelessness. Services include: food, water, showers, hygiene and personal care items, and clothing. Case management, housing navigation, as well as the coordinated entry point for HUD housing programs such as Rapid Rehousing and Permanent Supportive Housing are also available at the Youth Resource Center.\n\nThe center is located at Tempe First United Methodist Church, 215 E. University Drive, Tempe, AZ 85281.\n\n\nHours: Monday - Friday, 12:00 pm 3:30 pm, Phone: 480-868-7527.\n\nFree medical care through Phoenix Children's Hospital Healthmobile is available Monday's and Thursday's from 2:00 5:00 pm.\n"
  },
  {
    "addressLine1": "5514 E Thomas Rd",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85018",
    "name": "Life House -Lifeology Az Emergency Shelter for Youth",
    "organization": "Life House -Lifeology Az Emergency Shelter for Youth",
    "phone": "(602) 612-3990",
    "website": "https://www.lifeology-az.com/",
    "description": ""
  },
  {
    "addressLine1": "2707 E Van Buren St",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "00000",
    "name": "Kaiser Family Crisis Shelter",
    "organization": "Kaiser Family Crisis Shelter",
    "phone": "(602) 267-4130",
    "website": "http://www.salvationarmysouthwest.org/",
    "description": "Open 24 hours a day.\n\nThe Kaiser Family Crisis Center is a 120-day work program, which enables families to get back on their feet and learn skills that will help them cope with crises in the future. Using an empowerment philosophy, families who have experienced crises such as eviction or loss of a job are assisted in gaining employment, meeting targeted goals, and developing positive family dynamics.\n\nClients in this program must adhere to strict requirements. They must remain drug-free and sober during their stay, attend case management sessions, life skills classes, and substance abuse or mental health therapy. Additionally, they must meet regularly with the employment specialist, find employment within a specific time frame, and save 60% of any incoming money. This structure assists clients in becoming responsible and accountable for themselves and their families. The Family Crisis Center staff takes pride in our program.\n\n\nThe stability provided by the program also allows children to thrive as they experience knowing where they will eat, sleep, and have a consistent opportunity to bond with their parents, possibly for the first time. Many of the children have moved so frequently that they live in a constant state of stress and chaos. In addition to attending the same school regularly, they are able to participate in a structured after-school program."
  },
  {
    "addressLine1": "2707 E. Van Buren St.",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85008",
    "name": "Elim House Shelter",
    "organization": "Elim House Shelter",
    "phone": "(602) 267-4111",
    "website": "http://www.salvationarmysouthwest.org/",
    "description": "Salvation Army Domestic violence Shelter.\n\nElim House Domestic Violence Shelter provides a 30-day safe haven for women and their children who have experienced abuse.If circumstances require a longer stay, clients and their advocate develop a plan for extension up to 120 days. During an individual's stay, they receive case management/advocacy services, which focus on the development of a safety plan and personal goals. Clients are referred for services that extend beyond those provided by the shelter. Individual empowerment counseling is also offered to residents."
  },
  {
    "addressLine1": "5946 E University Dr",
    "city": "Mesa",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85205",
    "name": "Mesa I HELP",
    "organization": "Mesa I HELP",
    "phone": "(480) 654-4539",
    "website": "https://azcend.org/i-help/",
    "description": "Interfaith Homeless Emergency Lodging Program (I-HELP). I-HELP provides a safe place to sleep and a hot meal for adults experiencing homelessness every night of the week. I-HELP also offers case management services to connect individuals to the vital resources needed to regain stability and break the vicious cycle of homelessness. The mobile shower unit, the \"Chandler Clean Machine,\" provides guests with ready access to a warm shower.\nEmergency Shelter\n\nFor more information about all I-HELP services, contact priscilla@azcend.org or 480-963-1423 x 116.  All new guests must complete a pre-screening interview before entering I-HELP.  Please call for bed availability and to schedule pre-screening."
  },
  {
    "addressLine1": "213 S 11th Ave",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85007",
    "name": "Andre House",
    "organization": "Andre House",
    "phone": "(602) 255-0580",
    "website": "https://andrehouse.org/",
    "description": ""
  },
  {
    "addressLine1": "1125 W Jackson",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85007",
    "name": "Lodestar Day Resource Center",
    "organization": "Lodestar Day Resource Center",
    "phone": "(602) 393-9930",
    "website": "https://twitter.com/lodestardrc",
    "description": ""
  },
  {
    "addressLine1": "1001 West Jefferson",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85007",
    "name": "Justa Center Day Shelter",
    "organization": "Justa Center Day Shelter",
    "phone": "(602) 254-6524",
    "website": "http://www.justacenter.org/",
    "description": "Justa Center is a day resource center for homeless adults 55+.\n\n"
  },
  {
    "addressLine1": "206 S 12th Ave",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85007",
    "name": "Brian Garcia Welcome Center - Single Adult Shelter",
    "organization": "Brian Garcia Welcome Center - Single Adult Shelter",
    "phone": "(602) 229-5155",
    "website": "http://www.cassaz.org/",
    "description": "Single Adult Homeless Shelter.\n\nPeople who are homeless often face more paramount and complex barriers beyond their homelessness. Providing a meal and a safe place to sleep is just the first step in the healing process.\n\nThe Single Adult facility shelters over 400 homeless men and women each night and over 4,100 people annually in its downtown Phoenix location on the Human Service Campus.\n\nPersonal hygiene supplies are provided including soap, shampoo, toothpaste and tooth brushes, razors and shaving cream, sunscreen, towels, blankets, sheets and clothing.\n\n"
  },
  {
    "addressLine1": "206 S 12th Ave",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85007",
    "name": "Homeless ID Project",
    "organization": "Homeless ID Project",
    "phone": "(602) 223-3427",
    "website": "http://azhomeless.org/",
    "description": "This is not a homeless shelter. This is a ID replacement program.\n\nLocated in the Brian Garcia Welcome Center, we assist in providing replacement identification services as a first step to empower the homeless to rebuild their lives. We see clients at 7:30 and 9:00 am Monday through Friday. We are also available for outreach programs with community partners."
  },
  {
    "addressLine1": "206 S. 12th Avenue",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85007",
    "name": "Brian Garcia Welcome Center",
    "organization": "Brian Garcia Welcome Center",
    "phone": "(602) 229-5155",
    "website": "https://hsc-az.org/",
    "description": ""
  },
  {
    "addressLine1": "230 S 12th Ave",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85007",
    "name": "Central AZ Shelter Services",
    "organization": "Central AZ Shelter Services",
    "phone": "(602) 256-6945",
    "website": "http://www.cassaz.org/",
    "description": "CASS provides shelter and supportive services to men, women and children experiencing homelessness. Our clients have diverse backgrounds and needs. Many factors lead to homelessness; however, common factors include the following:\n    Financial crisis brought on by unemployment, high medical bills, underemployment, lack of affordable childcare, or incarceration\n\n    Difficulty reengaging with society after serving in the military\n    Refuge from an unsafe environment, such as domestic violence\n    Undiagnosed/untreated mental illness\n    Substance abuse  \nWhile the circumstances vary, the ultimate factors that lead to homelessness are a lack of resources and/or support. CASS connects people to the appropriate resources so they can rebuild their lives and permanently end their homelessness.\nFor more information on CASS shelters and supportive services please call or email info@cassaz.org."
  },
  {
    "addressLine1": "141 E Palm Ln Ste 105",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85004",
    "name": "Arizona Coalition to End Homelessness",
    "organization": "Arizona Coalition to End Homelessness",
    "phone": "(602) 340-9393",
    "website": "https://arizonahousingcoalition.wildapricot.org/needhelp",
    "description": "Provides services and shelter for homeless."
  },
  {
    "addressLine1": "2014 W Monroe St",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85009",
    "name": "SET FREE AZ",
    "organization": "SET FREE AZ",
    "phone": "(602) 777-2801",
    "website": "mailto:locotaco789@gmail.com",
    "description": "We are a christian faith based ministry and have a 8 mnh program to help rebuild your lives through jesus christ. there is no cost to stay it if a free program we take anyone homeless, men released from prison. please feel free to call number above for more information."
  },
  {
    "addressLine1": "931 East Devonshire Avenue",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85014",
    "name": "Homebase Youth Services - Shelter for Youth",
    "organization": "Homebase Youth Services - Shelter for Youth",
    "phone": "(602) 263-5531",
    "website": "https://www.nativeconnections.org/housing",
    "description": "Day Outreach Center\nThe Day Resource Center is a facility where homeless youth can come Monday through Friday to wash their clothes, take a shower, have a hot meal and meet with case managers and receive referrals for medical and mental health professionals as they work toward entering the Transitional Living Program.\n\nTransitional Living\nA program designed specifically to help homeless young adults prepare for healthy independent living. Services include housing, employment training and assistance, financial literacy courses, educational training and assistance and referrals for legal assistance, medical and mental health services, substance abuse services, social services and assistance with social/developmental challenges. The goal of this program is to provide youth with the necessary support for them to be ready for a better future."
  },
  {
    "addressLine1": "3118 W. CLARENDON AVENUE",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85017",
    "name": "Church on the Street - COTS - Homeless Assistance",
    "organization": "Church on the Street - COTS - Homeless Assistance",
    "phone": "(602) 257-8918",
    "website": "http://cotsphoenix.org/",
    "description": "Church on the Street, a Non-Denominational Church, offers many services to residents as well as the community-at-large including, but not limited to: 15 Month Discipleship Training, Outreaches around the Valley assisting the Homeless & Disadvantaged. Church on the Street is part of the Dreamcenter.\n\n\nChurch On The Street is a Christian Discipleship Program (or 'Bible' Boot Camp) where a believer in Jesus Christ can spend six months in our 180 day residential program immersed in the Word of God. One can spend this time to build a stable foundation for their life. Very intense; very structured with a curriculum based in the Life of Christ. Lots of rules to incorporate discipline into one's character; this life recovery school is the stepping stone to finding the purpose for your life that the Lord has for you. We accept all donations & are in need of hygiene, finances, clothes, furniture and vehicles. We are a state approved facility for probation & parole."
  },
  {
    "addressLine1": "7000 N Central Avenue",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85020",
    "name": "The Respite Shelter for Homeless Men",
    "organization": "The Respite Shelter for Homeless Men",
    "phone": "(602) 870-4353",
    "website": "mailto:respiteshelter@yahoo.com",
    "description": "The Respite Shelter is one a kind shelter. We provide shelter and supportive services to homeless men after they have been discharged from a health care facility and need a place to heal.\n\nThe Respite Shelter is a nine bed 24 hour emergency shelter for homeless Men who are being released from the hospital following injury, accident or illness"
  },
  {
    "addressLine1": "2302 W. Colter",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85015",
    "name": "Homeward Bound",
    "organization": "Homeward Bound",
    "phone": "(602) 263-7654",
    "website": "https://homewardboundaz.org/",
    "description": "We provide transitional housing and social service facility for families with children fleeing domestic violence and/or homelessness.\n\nHomeward Bound is NOT an Emergency Shelter. If you need emergency assistancecall CONTACS - Community Network for Accessing Shelter at 602.263.8900\n\nEligibility for Homeward Bound\nTo be eligible for participation in the Homeward Bound program, a family must:\n    Have children under the age of 18**\n    Be homeless, facing eviction, or fleeing a domestic violence situation\n    Be earning less than 50% of the area median income\n    Be employed or actively seeking employment\n    Be free of drug and alcohol abuse\n    Be motivated to change patterns of behavior\nHomeward Bound is a one (1) year program.\nSteps to Apply:\n1. Complete Pre-Screen Eligibility Questionnaire with Homeward Bound representative.  Upon meeting eligibility requirements, a Program Application will be given.\n2. Upon completion of the Program Application and required supporting documentation an applicant appointment will be set to meet with program representative.\n\n3. Following the appointment, determination will be made for acceptance into the Homeward Bound Program or referral to another service provider.\n**Limited shared-housing resources may be available for single Veterans without children."
  },
  {
    "addressLine1": "9844 N 7th St",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85020",
    "name": "House Of Refuge Sunnyslope",
    "organization": "House Of Refuge Sunnyslope",
    "phone": "(602) 678-0223",
    "website": "https://refugesunnyslope.com/",
    "description": ""
  },
  {
    "addressLine1": "1050 W Mountain View Rd",
    "city": "Phoenix",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85021",
    "name": "Vista Colina Emergency Family Shelter",
    "organization": "Vista Colina Emergency Family Shelter",
    "phone": "(602) 944-0960",
    "website": "https://www.azhousinginc.org/vista-colina.html",
    "description": "Vista Colina is an apartment complex with 12 one bedroom and 18 two bedroom units and is currently leased to Central Arizona Shelter Services (CASS) for the operation of an Emergency Family Shelter. CASS provides homeless families with children under 18 years of age with shelter for up to 90 days."
  },
  {
    "addressLine1": "7115 North 55th Avenue",
    "city": "Glendale",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85301",
    "name": "Family Promise - Glendale",
    "organization": "Family Promise - Glendale",
    "phone": "(480) 659-5227",
    "website": "https://familypromiseaz.org/",
    "description": ""
  },
  {
    "addressLine1": "P. O. Box 4484",
    "city": "Cottonwood",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86326",
    "name": "Angie's House",
    "organization": "Angie's House",
    "phone": "(928) 301-2169",
    "website": "https://angieshouseaz.com/",
    "description": "Angie's House provides immediate Recovery and Transitional housing for qualified individuals impacted by addiction, mental illness and/or homelessness.\nTransitional housing for men, women and children. There is an affordable program fee per week. Alcohol/drug free safe environment. Private rooms."
  },
  {
    "addressLine1": "736 N Main St",
    "city": "Cottonwood",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "96326",
    "name": "Catholic Charities Shelter Cottonwood",
    "organization": "Catholic Charities Shelter Cottonwood",
    "phone": "(928) 634-4254",
    "website": "https://www.catholiccharitiesaz.org/",
    "description": "Our emergency housing provides homeless families with shelter, support services and case management for up to 120 days as we help them work towards independence and permanent housing.\n\n\n\nIn Northern Arizona, because other agencies provide shelter to single mothers with children or to single men and women, we focus on two-parent or single-father-with-children families. We are the only shelter in Northern Arizona that allows fathers to stay with their families as they seek assistance.\n\n\n\n\nThere is no charge to clients during their stay, however, they are required to begin and maintain a savings plan while in the program. Clients may then move into their own permanent housing or, if they still require supportive services, into affordable or Permanent Supportive Housing.\n\n\n\nEmpowering Our Clients\n\nWe empower our families by teaching them how to advocate for themselves, set their own goals and build the resources to reach those goals. In addition, we provide life-skills classes, case management and transportation to appointments and interviews."
  },
  {
    "addressLine1": "336 N. Rush Street",
    "city": "Prescott",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86301",
    "name": "Prescott Area Women's Shelter",
    "organization": "Prescott Area Women's Shelter",
    "phone": "(928) 778-5933",
    "website": "https://prescottshelters.org/",
    "description": "Emergency drop in homeless shelter for women and women with children.Office Hours:Monday through Friday 8am - 12pm Prescott Area Shelter Services has two programs. The Prescott Area Women's Shelter, serving homeless women and their children since 2008. The Family Shelter, serving families of any make- up, since 2012.PAWS provides the following year- round:Emergency Shelter services including:\n- food (a hot meal at night, breakfast, and snacks during the day)\n- dormitory- style shelter with personal lockers\n- community room with access to internet/phone use\n- hygiene products and access to showers\n- clothing (winter coats, sweat suits, socks, etc)\n\nCase Management services including:\n- information on local social service agencies\n- affordable housing options\n- signing up for government subsidies\n- computer classes\n- substance abuse program information\n- goal sheets to determine guest length of stay and progress towards self- sufficiency\n\nMost importantly, we strive to ensure that every woman and child feels safe, nurtured and rested at PAWS."
  },
  {
    "addressLine1": "602 Lincoln Avenue",
    "city": "Prescott",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86301",
    "name": "Yavapai Territorial Gospel Rescue Mission",
    "organization": "Yavapai Territorial Gospel Rescue Mission",
    "phone": "(928) 443-8779",
    "website": "https://www.ytgrm.com/",
    "description": "Transitional housing to women and their young children.\nThe Yavapai Territorial Gospel Rescue Mission women and children's shelter is located in Prescott and serves women and their children who need short term housing. Part of the Gospel Rescue Mission network, the YTGRM is a Gospel-centric shelter offering help, hope, and healing.\nWhat We Do\n    Care for the homeless, poor, and at-risk families and individuals of Yavapai County by working to meet the physical, spiritual, and social needs.\n    Reach out to the \"least, last, and lost\" with the truth of the Gospel of Jesus Christ and His love for them.\n\n    Offer opportunities for the Body of Christ to serve, minister, and live out eh Biblical mandate to \"go and make disciples\" in a safe and controlled environment.\n    Serve the Lord in the church and the community in all we do.\n    Share the blessings of God with all who come to \"The Mission,\" regardless of needing help or providing service."
  },
  {
    "addressLine1": "531 Madison Ave",
    "city": "Prescott",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "00000",
    "name": "CCJ - Stagger Straight Community Emergency Shelter",
    "organization": "CCJ - Stagger Straight Community Emergency Shelter",
    "phone": "(928) 445-8382",
    "website": "http://www.yavapaiccj.org/",
    "description": ""
  },
  {
    "addressLine1": "217 LeRoux Street",
    "city": "Prescott",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86303",
    "name": "Project Aware Men's Shelter",
    "organization": "Project Aware Men's Shelter",
    "phone": "(928) 778-7744",
    "website": "mailto:allisonebita@gmail.com",
    "description": ""
  },
  {
    "addressLine1": "124 S. San Francisco",
    "city": "Flagstaff",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86001",
    "name": "Sunshine Rescue Mission",
    "organization": "Sunshine Rescue Mission",
    "phone": "(928) 774-3512",
    "website": "https://srm-hc.org/",
    "description": ""
  },
  {
    "addressLine1": "2211 E Johnson Ave",
    "city": "Flagstaff",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86004",
    "name": "Hope Cottage",
    "organization": "Hope Cottage",
    "phone": "928-774-9270",
    "website": "https://www.srm-hc.org/hope-cottage",
    "description": "We provide shelter, meals, clothing, accountable goal planning and productivity. Daily, we have Christ-centered classes, chapel services and case management for spiritual growth.\n\nLife skills, parenting, jobs and computer skills courses.Counseling, The Genesis Process (an accredited relapse prevention course) and group activities are also a part of the restoration components at the Mission and Hope.\n\n\nWe have Christ-centered tools to work through the internal hardships that our residents have encountered. We also provide educational classes and skills to move out of homelessness completely (Budgeting, Job Training, Jobs for Life, One-step Recovery)."
  },
  {
    "addressLine1": "2532 N 4th St #506",
    "city": "Flagstaff",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86004",
    "name": "Northland Family Help Center",
    "organization": "Northland Family Help Center",
    "phone": "(928) 527-1900",
    "website": "http://northlandfamily.org/",
    "description": ""
  },
  {
    "addressLine1": "2101 N 4th St",
    "city": "Flagstaff",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "00000",
    "name": "Catholic Charities Community Services Emergency Shelter",
    "organization": "Catholic Charities Community Services Emergency Shelter",
    "phone": "(928) 774-9125",
    "website": "http://www.catholiccharitiesaz.org/flagstaff/emergency-shelter",
    "description": ""
  },
  {
    "addressLine1": "4185 E. Huntington Drive",
    "city": "Flagstaff",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86004",
    "name": "Flagstaff Shelter Services",
    "organization": "Flagstaff Shelter Services",
    "phone": "(928) 225-2533",
    "website": "https://flagshelter.org/",
    "description": "Day drop-in center featuring a phone with long distance, agency referrals, showers, laundry, computers, on-site nurse, and case management. Shelter Hours: 5pm-6:30am (arrive 4:30-5pm).\n\n\nProvides emergency shelter to homeless men during the winter months and a year round Day Shelter for men and women. We have 30 beds and give preference to local homeless residents, the disabled, veterans, and most vulnerable. We have partnered with the Flagstaff Family Food Center to provide nightly meals to shelter clients. We also have limited case management services for individuals working toward overcoming the condition of homelessness.\nWe provide:\n    Emergency Shelter to anyone experiencing homelessness\n    Housing Focused Case Management\n    Access to meals provided by Flagstaff Family Food\n    Shower Services, Hygiene Supplies, and access to new clothing\n    Laundry Service\n    Computer and Internet Access / Job Search assistance\n    Mail and Home Address Service / Storage for belongings\n\n    Counseling support and resource for referral for Domestic Violence, Substance Abuse, and Debt Management"
  },
  {
    "addressLine1": "885 Hermosa Drive",
    "city": "Holbrook",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86025",
    "name": "Bread of Life Mission of Holbrook - BOLMAZ - Emergency Shelter",
    "organization": "Bread of Life Mission of Holbrook - BOLMAZ - Emergency Shelter",
    "phone": "(928) 524-3874",
    "website": "http://www.bolmaz.com/",
    "description": "Separate shelters for men and for women/families\n\nWe are staffed 24 hours a day, 7 days a week.\n\nBread of Life Mission is a 34 bed emergency shelter for men, women, and children. We have a Recovery/Intern/Discipleship Program for a limited number. There are only 34 beds, so everyone else is on a mat on the floor.\n\nOur Mission is to provide spiritual guidance and physical assistance including shelter, food and vocational training to people in need, in the name of our Lord Jesus Christ, to help them recognize and deal with their problems in a life changing manner."
  },
  {
    "addressLine1": "P.O. Box 1589",
    "city": "Saint Johns",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85924",
    "name": "New Hope Ranch",
    "organization": "New Hope Ranch",
    "phone": "(928) 337-5060",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "338 N. Morley Ave.",
    "city": "Nogales",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85621",
    "name": "Crossroad Mission Family Center and Shelter",
    "organization": "Crossroad Mission Family Center and Shelter",
    "phone": "(520) 287-5828",
    "website": "https://www.valleypresbyterian.net/crossroads-nogales-mission.html",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 1202",
    "city": "Safford",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85548",
    "name": "Mt. Graham Safe House",
    "organization": "Mt. Graham Safe House",
    "phone": "(928) 348-9104",
    "website": "http://www.mtgrahamsh.org/",
    "description": "Shelter for victims of domestic violence. 20 beds, 2 cribs. Five days crisis stay plus may extend to leave violent environment.\nThe safe house program will provide crisis intervention, assessment, advocacy and referral as needed, conducted in a safe, secure and confidential environment.\n\nMGSH provides advocacy, emergency housing, transitional housing, clothing, food, school supplies, text books for college classes, furniture, local transportation, self help groups, parenting classes, job skills classes and a children's domestic violence education program to both resident and non-resident clients. Prevention in the schools is also covered by a component of MGSH that teaches Healthy Relationships in both middle and high schools in all areas served. MGSH Battered Immigrant Women Coordinator organizes local agencies to provide training on the issues battered immigrant women face.\n\nServices We Provide\n    Advocacy- Mobile and In-House\n    Court Escort\n    Lay Legal Services\n    Emergency housing\n    Transitional housing\n    Clothing\n    Food\n    School supplies\n    Furniture\n    Local transportation\n    Self help groups\n    Parenting classes\n    Job skills classes\n    Childrens domestic violence education program to both resident and non-resident clients.  \n    MGSH Battered Immigrant Women Coordinator organizes local agencies to provide\n\n    training on the issues battered immigrant women face.\n    Other services as needed on a case by case basis-we think outside the box"
  },
  {
    "addressLine1": "2590 N Alvernon Way",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85712",
    "name": "Our Family Services",
    "organization": "Our Family Services",
    "phone": "(520) 323-1708",
    "website": "http://www.ourfamilyservices.org/",
    "description": "Are you 12-17 and need a safe place to stay? Call our homeless youth hotline 1-800-537-8696.\n\nHelps homeless and near-homeless youth 13-21 stay in school and gain the skills they need through case management, counseling, education and career planning, housing, and help with basic needs.\n\n\nTransitional Housing: We have a number of apartments designed to provide housing for up to two years for qualified youth ages 18-21. This housing program is designed for youth to work, complete educational or vocational goals, save money and transition into a permanent living situation. All youth in this program have access to case-management services. In collaboration with other agencies, we assure that youth find a stable living situation and receive the support services they need.\n\nServices\nAffordable Apartments: For low-income families and individuals who qualify.\n\nEmergency Shelter Services: Emergency shelter for families, couples and singles.\n\nHomeless Youth Services: Helps homeless and near-homeless youth 18-24 stay in school and gain the skills they need through case management, counseling, education and career planning, housing, and help with basic needs.\n\n\nReunion House: 20-bed brief-stay shelter and family reunification services for youth ages 12-17\n\nPathways HOME: Integrated housing resource for families, couples, and individuals who are homeless.\n\nSafe Place: for youth ages 12-17 that are in need of a Safe Place.\n\nStreet Outreach: Meets runaway, homeless and street-dependent youth where they congregate, and helps them come off the streets."
  },
  {
    "addressLine1": "3830 E. Bellevue Street",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85716",
    "name": "New Beginnings For Women",
    "organization": "New Beginnings For Women",
    "phone": "(520) 323-1708",
    "website": "https://www.ourfamilyservices.org/",
    "description": "Hours of Operation\n\nMonday Thursday 9 a.m. to 5 p.m.\nFriday 9 a.m. to 4 p.m.\nSaturday, Sunday & Holidays Closed\nEmergency Shelter ServicesNew Beginnings Emergency Shelter Services are for families, couples and singles who are experiencing homelessness. The program includes intensive case management and provides job search guidance.All of the clients staying in scattered site shelter work closely with their case manager to develop family goal plans that identify short- and long-term objectives with timelines for overcoming barriers to self-sufficiency. Clients coming into the program must be willing and able to work, or be able to attain sufficient income to move towards independence. Preference is given to families with a minor child in their custody\n\nTransitional Housing\nTwo and three-bedroom units are available for up to two years to families who are homeless or near homeless. Case management is required in this program, which gives families more time and supportive services so they can save money and improve their earnings ability before having to support their families in a market-rate environment. Our children's program addresses the special developmental, social and academic needs of children who have been homeless. The cost of rent is based on income.\n\nQualifications:\nYou must be able to work legally in the United States and have income.\nFor Emergency Shelter Services and Transitional Living, you must be homeless by HUD standards.\n\nHousing Assessment\nOur Family Services participates in the community wide Coordinated Entry assessment and referral system to fill openings in our homeless housing programs. That system includes a general assessment of housing needs and resources and prioritizes completing VI-SPADT (Vulnerability Index - Service Prioritization Decision Assistance Tool) assessment application tools for households that:\n1) are literally homeless (on streets, in vehicle, at emergency shelter, etc.); or\n\n2) are imminently at risk of homelessness with no place to stay within 1 or 2 days; or\n3) are in a dangerous situation (e.g., trafficking, high-risk domestic violence, etc.); or\n4) include head of households who are youth/young adults ages 18 to 24 years old.\n\nSuch households complete the VI-SPADT assessment application tool and the and HMIS system consent form.\n\nTo initiate an assessment of housing resources and options, please visit our office during our drop-in hours:\n2590 N. Alvernon Way\nTucson, Arizona 85712\nTuesdays 10:00 a.m. to 1:00 p.m.\nWednesdays 1:00 p.m. to 4:00 p.m.\nThursdays 10:00 a.m. to 1:00 p.m.\nOr, you can come to our office any time between 10:00 a.m. and 4:00 p.m to fill out a Homeless Housing Information Sheet that we will use to contact you to set up an assessment appointment."
  },
  {
    "addressLine1": "P.O.Box 1411",
    "city": "Sedona",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "86336",
    "name": "Sedona Area Homeless Alliance",
    "organization": "Sedona Area Homeless Alliance",
    "phone": "(928) 978-9387",
    "website": "https://www.sedonahomeless.org/",
    "description": ""
  },
  {
    "addressLine1": "4550 S Palo Verde Road",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85714",
    "name": "Gospel Rescue Mission - Mens Center",
    "organization": "Gospel Rescue Mission - Mens Center",
    "phone": "(520) 740-1501",
    "website": "https://www.grmtucson.com/",
    "description": "BED AVAILABILITY & PROGRAM INFO\nFor questions regarding bed availability, recovery programs, or for any other shelter related questions, please contact:\nMen's Shelter Front Office:\n(520) 740-1501\n* This is the former Radisson hotel. 350 beds available and 1,000 hot meals served a day.\n\nShelter guests must be sober and are accepted based on bed availability, need and willingness to commit to the hard work of recovery without regard to age, education, ethnicity or religion, with the single exception being that we cannot take any sex offenders.\n\n\nOur shelter is wheelchair accessible however, shelter guests must be able to care for their own basic daily needs (dress, shower, get around) and their prescribed medications must not reduce their mental alertness.\nShelter guests must be sober and are accepted based on bed availability, need and willingness to commit to the hard work of recovery without regard to age, education, ethnicity or religion, with the single exception being that we cannot take any sex offenders.\n\nOur shelter is wheelchair accessible however, shelter guests must be able to care for their own basic daily needs (dress, shower, get around) and their prescribed medications must not reduce their mental alertness.\n\n\nEmergency Shelter Program\nThe Emergency Shelter Program provides an emergency 4-day shelter stay for men.\nEvery shelter guest receives:\nHot meals\nShower\nChange of clothes\nToiletries\nOver the counter medications\nCase Management\nExtended Shelter Program\nThe Extended Shelter Program is a 90-day program for men.\nDuring this time, the men receive:\nA bed for 90 days\nNutritious meals\nClothing\nToiletries\nChapel services\nDiscipleship training\nCase management\nCounseling\nMedical Assistance\nEmployment assistance\nBasic computer skills\nAffordable housing placement referrals\nLife skills classes for men who:\n- have medical issues\n- are unemployed\n- transitioning from prison"
  },
  {
    "addressLine1": "707 W. Miracle Mile",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85705",
    "name": "Gospel Rescue Mission: Women's Recovery Center",
    "organization": "Gospel Rescue Mission: Women's Recovery Center",
    "phone": "(520) 740-1501",
    "website": "https://grmtucson.com/",
    "description": "Office Hours: Daily 10am-5pm\nShelter guests must be sober, and are accepted based on bed availability and need, without regard to age, ethnicity, or religion.\n\nOur shelter is wheelchair accessible. However, shelter guests must be able to care for their own daily needs (dress, shower, get around, etc).\n\nBethany House Women's and Children's Center\nWomen & children shelter. 24 emergency beds (5 rooms) for women and children; 14 beds (3 rooms) for single women; clothing, showers, meals, counseling. Transitional (9-18 month) rehab program beds (24 women and children, 6 single women).\n\nWomen and Children's Center - please call 520-740-1501 x7101 or visit the front desk at 707 W. Miracle Mile, Tucson, AZ 85705\n\nOur faith-based recovery program helps guests struggling with addiction uncover underlying issues that led them to their homelessness. We work with each person individually because every persons journey is unique. For some this is a quick process and for others, rewriting their future takes several months or years. Our goal is to achieve lasting restoration and peace so that they are able to lead fulfilling, productive lives.\n"
  },
  {
    "addressLine1": "3028 North Geronimo Avenue",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85705",
    "name": "Joshua House Transitional Housing",
    "organization": "Joshua House Transitional Housing",
    "phone": "(520) 512-8448",
    "website": "http://joshuahouse2415.com/",
    "description": "Transitional housing for men only.\nJoshua House is one of many transitional living facilities in Tucson, our program is unique, as it offers its residents a safe place to live without crowding, on-site self-help meetings, with a Christian environment promoting an inner spiritual growth and faith which we believe is the center of a successful recovery.\n\nLetting Go and Letting God, as they commit themselves to aiming towards a new life is the basis on which we operate daily. Our residents are taught to forgive themselves, leave the past behind and move forward to find peace and serenity in who they are, today, as they work their program from their hearts.\n\n\nNot a drop in emergency shelter, this transitional living facility hasa  weekly program fee of $165 and a monthly fee of $550 to be part of their program, as well as a 'Move In' charge of $150. Call for updated rates as they are subject to change."
  },
  {
    "addressLine1": "702 South 6th Avenue",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85701",
    "name": "The Primavera Foundation Shelter for families",
    "organization": "The Primavera Foundation Shelter for families",
    "phone": "(520) 882-5383",
    "website": "http://www.primavera.org/",
    "description": ""
  },
  {
    "addressLine1": "1002 N. Main Avenue",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85705",
    "name": "The Salvation Army Hospitality House",
    "organization": "The Salvation Army Hospitality House",
    "phone": "520-795-9671",
    "website": "https://www.salvationarmytucson.org/",
    "description": "The Salvation Army Hospitality House is open 24 hours a day, seven days a week, providing emergency shelter for those in need. The facility, located near downtown Tucson, features a 91 bed facility with separate accommodations for men and women, while motel vouchers may be available to assist housing families with special needs. In addition to safe, clean lodging, the facility features a laundry, showers, playground, television, dining and activity areas. Guests receive two meals per day and access to vital programs and services.Programs are targeted to emergency housing needs, as well as options for both short term- 7-day emergency shelter & long term-4-month transitional assistance."
  },
  {
    "addressLine1": "200 E. Benson Highway",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85713",
    "name": "Primavera Men's Shelter",
    "organization": "Primavera Men's Shelter",
    "phone": "(520) 623-4300",
    "website": "https://www.primavera.org/",
    "description": "Shelter Intake: Call (520) 623-4300 at 9:00 am to reserve a bed for that evening.\n\nMen's Shelter Services:\nDinner, breakfast, showers, hygiene supplies, clothes, and laundry\nFive night stay for everyone with extensions up to 90 days for those who qualify\n\nCase management support for those who are working or looking for work\nCase management support for those qualifying for medical, out-patient substance abuse treatment, or mental health concerns\nReferrals to Primavera employment programs\nYou are eligible to stay at the Men's Shelter if you meet the following criteria:\nAre an unaccompanied male 18 years or older\nHave your TB card (Men staying for the first time may obtain their card during the first 5 days of their stay)\nStay clean and sober while on premises\nDo NOT have a level 3 sex offense conviction\nAre willing to participate in case management\nHave a social security number (or 9 digit number)\n\nEligibility\nYou are eligible to stay at the Men's Shelter if you meet the following criteria:\n    Are an unaccompanied male 18 years or older\n    Stay clean and sober while on premises\n    Do NOT have a level 3 sex offense conviction\n    Are willing to participate in case management\n    Have a social security number (or 9 digit number)\n"
  },
  {
    "addressLine1": "2545 E. Adams Street",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85716",
    "name": "Emerge! Center Against Domestic Abuse",
    "organization": "Emerge! Center Against Domestic Abuse",
    "phone": "(520) 795-4266",
    "website": "https://emergecenter.org/",
    "description": "Office Hours:\nMondays, Wednesdays, Thursdays: 9am to 5pm.\n\nThe Jim & Shirley Lipsey CenterEmerge! Center Against Domestic Abuse provides domestic abuse crisis intervention and housing, prevention, education, support, and advocacy services to anyone experiencing domestic abuse. While the majority of the people seeking our services are women and their children, our services are available to anyone regardless of gender.\n\nWere here to answer your questions. 24 Hour Bilingual Crisis Line and Shelter\n(520) 795-4266\n(888) 428-0101"
  },
  {
    "addressLine1": "601 E. Fort Lowell Rd.",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85705",
    "name": "St Francis Men's Shelter",
    "organization": "St Francis Men's Shelter",
    "phone": "(570) 406-5300",
    "website": "https://stfrancisshelteraz.com/",
    "description": "Shelter Hours: 8pm to 8am.\n\nWe serve a meal, coffee in the morning and a sack lunch to take with you.\n\n"
  },
  {
    "addressLine1": "702 S. 6th Ave.",
    "city": "Tucson",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85701",
    "name": "Casa Paloma Women's Residence",
    "organization": "Casa Paloma Women's Residence",
    "phone": "(520) 623-5111",
    "website": "https://www.primavera.org/",
    "description": ""
  },
  {
    "addressLine1": "944 South Arizona Ave.",
    "city": "Yuma",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85364",
    "name": "Crossroads Mission",
    "organization": "Crossroads Mission",
    "phone": "(928) 783-9362",
    "website": "http://crossroadsmission.org/",
    "description": "Emergency housing (homeless, less than 6-month stay).\nOpen 365 days a year, 24 hours a day.The Family Shelter provides a stable, safe environment for married couples, single parents with children, or single women. Women who are participants in the New Life Recovery Program also live in the shelter. This shelters main objective is to provide emergency shelter to those women and families who find themselves homeless and often without hope. Crossroads is in the business of restoring hope through the services offered to anyone seeking help.\n\n\nOur mission is to improve the well being of homeless children by providing them with case management and the opportunity to access community services which may help them improve the quality of their lives. The shelter helps the children get through a tough time by building memories in an environment of love and caring staff members. Parents are given the opportunity to access services from Crossroads or other agencies and continue to work or to look for work.\n\nWe offer all of the same services as the Men's Emergency Shelter. We try hard to help women and families achieve an independent lifestyle. We also serve as a refuge for families or women who are escaping an abusive environment. Our case managers work with each family on a case-by-case basis to try to determine which course of action will best help the family. We help with everything from enrolling children in school or daycare to referrals to agencies. Our goal is to provide services that make the least disruption for the children but the most helpful for the parents. Families are important. Crossroads philosophy includes family reunification, support, and functionality.\n\n\nHomeless women can access services by apply at the Family Shelter. The friendly, helpful, and knowledgeable case managers will assist guests with obtaining identification, apply for food stamps or AHCCCS and other important connections to restoring their life to normal.\n\nMeals at Crossroads Mission\nThe kitchen and dining room are the hub of the Mission.  There is non stop activity from 4:00 AM to 7:00 PM.  Over 400 meals are cooked and served each day to hundreds of program participants, overnight guests, and needy people.\n\nOur dinners are always free and open to the public!\n\nEveryday our dining room is visited by hundreds of people.  Some are homeless men, women, and children that will eat their only meal of the day at our table.  Others are individuals and families that have a home but for some reason are not able to make ends meet.\n\nWeekdays:\nBreakfast\n5:30 to 6:30 AM\n\nLunch\n11:30 AM to 12:00 PM\n \nDinner\n5:00 to 6:00 PM\n\nWeekends and Holidays:\nBreakfast\n6:00 to 7:00 AM\n\nLunch\n12:00 to 1:00 PM\n\nDinner\n5:00 to 6:00 PM\n\nAll meals are open to everyone at Crossroads Mission and to the general public.  Anyone can come and eat with us.\n"
  },
  {
    "addressLine1": "690 E. 32nd Street",
    "city": "Yuma",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85364",
    "name": "Catholic Community Services of Western Arizona",
    "organization": "Catholic Community Services of Western Arizona",
    "phone": "(928) 726-4400",
    "website": "http://www.ccs-soaz.org/",
    "description": "Emergency housing for homeless women and their homeless children due to domestic violenceTransitional housing for women from six months to 2 years.\n\nAll servicesCatholic Community Services in Western Arizona provides a range of human services in Yuma and La Paz Counties:\n* Safe House Domestic Violence Shelter\n* Senior Nutrition Program\nHome Delivered Meals\nCongregate\n* Counseling\n* Daybreak - Adult Day Health Care\n"
  },
  {
    "addressLine1": "944 S. Arizona Avenue",
    "city": "Yuma",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "85364",
    "name": "Crossroads Missions Men's Homeless Shelter",
    "organization": "Crossroads Missions Men's Homeless Shelter",
    "phone": "(928) 783-9362",
    "website": "https://crossroadsmission.org/",
    "description": ""
  },
  {
    "addressLine1": "1006 East Fifth St",
    "city": "Calexico",
    "state": "Arizona",
    "stateAbbreviation": "AZ",
    "postal": "92231",
    "name": "Calexico Housing Authority Transitional Homeless Housing",
    "organization": "Calexico Housing Authority Transitional Homeless Housing",
    "phone": "(760) 357-3013",
    "website": "",
    "description": "Provides a traditional housing program for homeless individuals working toward self-sufficiency. Provides housing for 1 to 2 years for homeless people who are looking for work or going to school. Program pays rent and utilities. Offers referrals to shelters and motel vouchers until transitional housing is available (usually 2 weeks 3 months).\n\nHours of operation: 8am - 5pm, Monday - Friday."
  }
]