[
  {
    "addressLine1": "619 Ninth Avenue",
    "city": "Albany",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97322",
    "name": "Albany Helping Hands",
    "organization": "Albany Helping Hands",
    "phone": "(541) 926-4036",
    "website": "http://www.albanyhelpinghands.com/",
    "description": "EMERGENCY HOUSING\nShelter Guest Check  in time:\n8:00 am to 8:00 pm daily\nCapacity:  100 beds\n\nWe are filled or close to our capacity of one hundred persons during periods throughout the year, especially during seasonal cold and wet weather.\n\nStage 1- Homeless Emergency Shelter  \n(Up to 30 days)\n    Temporary Shelter\n    3 meals daily, snacks\n    Medical and mental health care on site\n    Reestablishing identification support (if necessary)\n    Provisions: Soap and other toiletries, clothing, bedding, laundry services, haircuts\n    Mail access\n    Phone access\n    Computer and Internet access for utilization in guest education, job training, job and housing searches, and email.  \n    GED Completion Program (if necessary)\n \n \nHelping Hands is the only stable, on-going emergency shelter in the area. As more people fall into homelessness, the consequences to the community are severe. It is our goal to continue to support the homeless during this very critical time. Linn and Benton County residents are very dependent on the emergency housing and meals we provide. We want to offer them more. We want to offer them a way out of homelessness.\n\nTRANSITIONAL HOUSING\nWe only have one transitional house at the moment.  We are still in the experimental stages of the program.  However our main goals and objectives for this program is to put homeless people with incomes into transitional housing. \n   \nEligibility \n    Homeless\n    18 years or older\n    Employed, collecting benefits or enrolled in or awaiting enrollment in an educational or job training program.\n    Be able to participate in and contribute to communal living.\n    A minimum of 30-days of sobriety\n    Have an ability to live independently or with a group in a group home. "
  },
  {
    "addressLine1": "145 West Ash St",
    "city": "Lebanon",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97355",
    "name": "ChristWalk Supportive Transitional Housing",
    "organization": "ChristWalk Supportive Transitional Housing",
    "phone": "(541) 409-1281",
    "website": "http://www.lebemsh.org/",
    "description": "We are helping homeless people find a place to live, shake addictions, and get a job. The ChristWalk Family Program is located in the Presbyterians' Harden Hall, 145 West Ash St., Lebanon. Hours are Monday, Tuesday, and Friday from 9:30 a.m. to 11:30 a.m."
  },
  {
    "addressLine1": "62 W. Bond",
    "city": "Astoria",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97103",
    "name": "Astoria Rescue Mission",
    "organization": "Astoria Rescue Mission",
    "phone": "(503) 325-6243",
    "website": "http://www.astoriarescuemission.com/",
    "description": ""
  },
  {
    "addressLine1": "210 South East 12th Ave",
    "city": "Hillsboro",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97214",
    "name": "Community Action Family Shelter",
    "organization": "Community Action Family Shelter",
    "phone": "(503) 640-3263",
    "website": "http://caowash.org/",
    "description": "Families may live in the Community Action Hillsboro Family Shelter for up to five weeks. During their stay, staff help residents make a plan for housing and other needs that is designed for long-term self-reliance and stability.\n\nOur family shelter is the lead partner in a three-shelter network in Washington County. The others are Good Neighbor Center in Tigard and Family Promise of Washington County Oregon in Hillsboro. Families in need of emergency shelter may call 503.640.3263 to be added to a central wait list for all three shelters. Wait time for shelter is usually two to three weeks.\n\n\nSingle homeless persons in Washington County may call Open Door Counseling Center at 503.640.6689. This is a day shelter where clients can find food, do laundry and take showers."
  },
  {
    "addressLine1": "2850 SW Cedar Hills Blvd",
    "city": "Beaverton ",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97005",
    "name": "Road to Hope Maternity Home",
    "organization": "Road to Hope Maternity Home",
    "phone": "(503) 648-4227",
    "website": "https://road2hopepdx.org/",
    "description": "Are you pregnant and in need of shelter?\n\nOur Shelter offers unsupported pregnant mothers a safe and stable home in a residential facility. Women enter the home at any point during their pregnancy and may stay up to a year after their baby is born. We offer an ongoing aftercare program to support women as they move out of the Road to Hope house and on to the next season of their life.\n\nOn a limited basis we do accept mothers with one other baby or toddler. We also accept clients with open DHS cases and provide advocacy and support.\n\n\nWe welcome young women from all cultural, ethnic, and religious backgrounds. Please answer all questions honestly and with as much detail as possible."
  },
  {
    "addressLine1": "11130 SW Greenburg Rd.",
    "city": "Tigard",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97223",
    "name": "Good Neighbor Center",
    "organization": "Good Neighbor Center",
    "phone": "(503) 443-6084",
    "website": "https://gncnw.org/",
    "description": "Are you in need of Shelter?\nTo get on the main waitlist, please call: (503) 640-3263\n\nGood Neighbor Center is more than a place for families to sleep and eat. It is a place where families are transformed and become self sufficient once more. During their six-week stay at the shelter,families navigate the resources to assistance and finding jobs.Every year we serve between 75-95 families and 250-300 individuals"
  },
  {
    "addressLine1": "6220 SE 92nd Avenue",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97266",
    "name": "Family Village Shelter",
    "organization": "Family Village Shelter",
    "phone": "(503) 915-8306",
    "website": "https://www.path-home.org/",
    "description": "The umbrella organization is Portland Homeless Family Solutions.\nEligibility:\nFamilies who are currently experiencing homelessness with children under 18 in their care.\n\nServices in-shelter families receive:\nCase management services\nEmotional support\nAssistance in finding and retaining permanent housing\nBasic need resources\nAccess to adult education classes\nIndividual private bedroom for each family\nMeals and snacks\nToiletries and supplies\nLaundry and showers\nCommunal living rooms\nComputer lab\nLibrary\nKids playroom\nRec room\nPlayground\nGarden\nPicnic area\nBasketball court.\n\n\n"
  },
  {
    "addressLine1": "627 NW 18th Avenue",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97209",
    "name": "Rose Haven Day Shelter for Women and Children",
    "organization": "Rose Haven Day Shelter for Women and Children",
    "phone": "(503) 248-6364",
    "website": "https://rosehaven.org/",
    "description": "Rose Haven is a day shelter and community center serving women and children of all ages, regardless of need.  We have an open door policy, and accept any woman in any condition who needs our help.  Staff and volunteers form a compassionate and supportive team for women who are traumatized by homelessness, abuse, and other disruptive life challenges. Rose Haven is a safe, respectful environment where change begins. We address basic needs, and help women build confidence and sustainable lives for themselves. Through reflection of trust and mutual respect, the foundation on which personal healing and healthy choice making begin.\n\nServices are provided Monday Friday from 8:30-4pm (closing at 3pm on Wednesdays to prepare for National University of Natural Medicine Community Clinic).\n\n\nWe close at 12pm the 2nd Monday of each month. Extended hours are provided on days with inclement weather. Closed daily from 12-1pm for volunteer debrief and staff lunch.\n"
  },
  {
    "addressLine1": "650 NW Irving Street",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97209",
    "name": "Transition Projects (TPI) Day Center",
    "organization": "Transition Projects (TPI) Day Center",
    "phone": "(503) 280-4700",
    "website": "https://www.tprojects.org/",
    "description": "Hours\nOpen 7 days a week from 8:00 AM - 4:00 PM\n\nTransition Projects provides services and programs to help people end their homelessness, transition to housing and maintain their housing.\n\nServices and Programs provided in our Resource Center:\n\n Showers\n\n Clothing\n\n Laundry Services\n\n Emergency Shelter\n\n Short-term Residential Programs\n\n Computer Lab\n\n Hair Salon\n\n Housing Assistance\n\n Information and Referrals\n\n Food Box Vouchers\n\n Hygiene Kits\n\n Identification and Birth Certificate Assistance\n\n TriMet Bus Tickets\n\n Telephone and Message Service\n\n Mailing Address\n\n Notary Services\n\n Housing Search Assistance\n\n Eviction Prevention and Move-in Assistance\n\n Veteran Support Services"
  },
  {
    "addressLine1": "30 SW 2nd Ave",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97204",
    "name": "SAFES at Fairbridge - Salvation Army Female Emergency Shelter",
    "organization": "SAFES at Fairbridge - Salvation Army Female Emergency Shelter",
    "phone": "(503) 227-0810",
    "website": "http://safeshelterpdx.org/",
    "description": "Hours of operation:\n- Dormitory (residents only) open 6pm to 8am\n- Day shelter open 7am to 11pm\n\nBASIC SERVICES and SUPPORT:\nemergency shelter\nshowers & restrooms\nsnacks\nlockers\ntelephone\nresting places\nlaundry\non-site support groups, activities\nhousing case management\ninformation, referrals\nwinter shelter\nadvocacy\n"
  },
  {
    "addressLine1": "30 SW 2nd Ave.",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97204",
    "name": "VETS (Veterans Emergency Transitional Shelter)",
    "organization": "VETS (Veterans Emergency Transitional Shelter)",
    "phone": "(503) 239-1259",
    "website": "http://www.tsacascade.org/",
    "description": "Short-term case management and transitional housing for veterans. Accepts men, women, and families for up to 9 months for veterans that qualify with TB card. Informational meeting every Wednesday at 9:00a.m."
  },
  {
    "addressLine1": "30 SW 2nd Ave",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97204",
    "name": "Salvation Army Female Emergency Shelter",
    "organization": "Salvation Army Female Emergency Shelter",
    "phone": "(971) 202-5360",
    "website": "http://www.safes.salvationarmy.org/",
    "description": "SAFES is a female shelter with dorm beds that are accessible via a waitlist, mats that are available on a first come first serve basis, and day services available from 9am - 8pm daily.\n\nThe shelter is a low barrier shelter. No ID necessary.\n\nEligibility Guidelines\n    Identify as Female\n    Must be able to care for self\n\nWe serve women in the community who are experiencing homelessness or are at risk of homelessness. We provide emergency shelter, showers, restrooms, lockers, telephone, resting areas, laundry, on-site support groups, activities, case management, information, referrals, snacks and advocacy."
  },
  {
    "addressLine1": "111 W. Burnside St",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97209",
    "name": "Portland Rescue Mission",
    "organization": "Portland Rescue Mission",
    "phone": "(503) 906-7690",
    "website": "http://www.portlandrescuemission.org/",
    "description": "Services:\nFood:\nWe serve hot, nutritious meals -- up to 700 a day, 365 days a year.\n\nShelter:\nUp to 120 men have short-term shelter with us each night. Clothing and showers are available to overnight guests.\n\nRestrooms:\nWe provide safe, secure, 24-hour restrooms for men, women, and children. This restores dignity and allows us to reach people we may not otherwise meet.\n\nMail Service:\nWe provide a mailing address for hundreds of homeless individuals vital service for anyone who needs an address for job applications, family correspondence and legal issues.\n\nReferrals:\nWe refer our guests to treatment programs, medical providers, employment programs and transitional housing facilities to help get their needs met.\n\nChapel:\nWe invite our guests to hear the message of God's love and healing in our daily chapel services and Bible studies.\n\nAt our Burnside Shelter, up to 45 men participate in our residential New Life recovery programs.\n\n\nAs they begin to experience care and acceptance, these men slowly begin to see that a better life is possible. They don't have to continue to suffer for poor choices in their past.\n\n\nIn safe and grace-filled relationships with recovery counselors and fellow friends, they face the addictions, hurts and habits that have held them back from the life they've really wanted. They see that they have the power to choose a better way.\n\nShepherd's Door, our women and children's ministry center, is a refuge of safety and healing. The facility provides all they need \"nutritious meals, safe accommodations, a beautiful and nurturing environment, counseling and training\" all under one roof. Up to 37 women and their children engage in recovery during their 12 -18 month stay."
  },
  {
    "addressLine1": "526 SE Grand Ave.",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97214",
    "name": "City Team Ministries",
    "organization": "City Team Ministries",
    "phone": "(503) 231-9334",
    "website": "http://www.cityteam.org/",
    "description": "In Portland, CityTeam Ministries is carrying on the work that the Peniel Mission began, providing hot meals, safe shelter, showers, clean clothing, recovery programs and other essential care to this city's homeless population. A recovery program is in place for those men that are on a road of destruction from drugs and alcohol.\n\nCityTeam is involved in real life situations with the people that walk through our doors. The caring staff and volunteers at CityTeam reach out to those people in need and show them there is real hope in Christ. CityTeam Portland offers several different programs that reach out to those in severe need. All of these programs incorporate a chance for our staff and volunteers to consistently walk along side someone and explain God's unconditional love for them in order to formulate an everlasting real change in their lives."
  },
  {
    "addressLine1": "5432 N. Albina Ave",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97217",
    "name": "Bradley Angle House",
    "organization": "Bradley Angle House",
    "phone": "(503) 281-2442",
    "website": "https://bradleyangle.org/",
    "description": "The mission of Bradley Angle is to offer survivors of domestic and sexual violence options for safety, empowerment, healing and hope, while collaborating with our communities to create social change.\n\nEmergency Shelter provides up to 10-12 weeks of shelter and support services for nine families. Case management and advocacy providers assist residents in obtaining clothing, furnishings, transportation, employment and/or job training, financial assistance, parenting support and groups, health services, drug, alcohol and mental health services. Services are from a combination of onsite inter-agency collaborations, referrals and information.\n\n\n24-Hour Crisis Phone Line is staffed by volunteers at the Emergency Shelter, and provides immediate access to safety planning, peer counseling, resource referral, emergency bed availability and domestic violence information. We collaborate with other domestic violence providers in the area to coordinate services and access to shelter openings.\n\nYouth Programs provide group and individual support to children up to age 17 staying in our shelter or transitional facility, or whose parents attend Bradley Angle support groups in any of our programs.\n\nTransition Services provide housing and support for 20 families at a time for up to two years, and is available to survivors who are not in immediate danger and feel stable enough to begin rebuilding their lives. We also provide emotional support, advocacy, long-term housing and strives to create stability in order to build strong, healthy families. This includes access to case management, skill-based educational opportunities, domestic violence and life-skills support groups, parenting support and connections to community resources.\n\n\nCommunity Based Services provide a safe, easily accessible community space for survivors to begin or continue their healing through peer support and domestic violence education. In addition to individual advocacy, a variety of support groups are available.\n\nLGBTQ Services provide culturally specific advocacy and support groups to survivors who identify as Lesbian, Gay, Bisexual, Transgender, and/or Queer.\n\nEconomic Empowerment Program uses an economic and financial education curriculum, and builds community partnerships with financial institutions, job training and placement agencies, and other transition housing service providers to implement two 10-week trainings with 12 participants each. The goal of the project is to enhance participants financial literacy and economic self-sufficiency.\n\nAwareness Raising Bradley Angle makes domestic violence educational presentations throughout the year to churches, community service groups and businesses, and presents testimony to local government funders."
  },
  {
    "addressLine1": "4545 ne garfield ave",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97211",
    "name": "United States Mission",
    "organization": "United States Mission",
    "phone": "(503) 288-9294",
    "website": "http://usmission.org/",
    "description": "Transitional housing for homeless men. ur purpose is to provide our residents with a long term clean and sober home with quality meals and a self-help work program that provides each person with the opportunity of turning their lives around.\n\nWe have discovered, in working with the homeless since 1962, that the problem is far from confined to the mentally ill and addicted, but extends across all boundaries of age, background or race.\n\n\nOur purpose is to provide our residents with a long term clean and sober home with quality meals and a self-help work program that provides each person with the opportunity of turning their lives around.\n\n\nWe have discovered, in working with the homeless since 1962, that the problem is far from confined to the mentally ill and addicted, but extends across all boundaries of age, background or race.\n\nWhile we are a religious corporation we are strictly dedicated to service. Belief in any faith or method of worship is never a requirement for the men and women entering our program. What is required is a sincere desire to get off the streets for good and return to society in a productive and positive way."
  },
  {
    "addressLine1": "2316 SE Willard Street",
    "city": "Milwaukie",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97222",
    "name": "Northwest Housing Alternatives",
    "organization": "Northwest Housing Alternatives",
    "phone": "(503) 655-8575",
    "website": "http://www.nwhousing.org/homeless-services/annie_ross_house.shtml",
    "description": "The Annie Ross House family shelter.\n\nThe Annie Ross House helps families move from the crisis of homelessness to stable and secure lives in permanent and affordable homes. To meet this objective, Annie Ross program participants receive access to housing enriched with case management assistance provided by Family Support Specialists. Family Support Specialists guide parents through the tough times, and help them break the cycle of poverty to give their children the best opportunity to succeed in school and throughout their lives. Staff works with each family to determine their needs, and helps them develop a strengths-based plan of action.\n\nIf you are a family with children in need of emergency shelter, please contact Coordinated Housing Access at (503) 655-8575."
  },
  {
    "addressLine1": "3705 N Hwy 97",
    "city": "Bend",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97701",
    "name": "Bethlehem Inn",
    "organization": "Bethlehem Inn",
    "phone": "(541) 322-8768",
    "website": "http://www.bethleheminn.org/",
    "description": "Largest Central Oregon Shelter serving men, women and families. Central Oregon's only emergency shelter serving the homeless families, men and women of our community."
  },
  {
    "addressLine1": "PO Box 6372",
    "city": "Bend",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97708",
    "name": "Grandma's House of Central Oregon",
    "organization": "Grandma's House of Central Oregon",
    "phone": "(541) 383-3515",
    "website": "http://www.grandmashouseofcentraloregon.org/",
    "description": "Grandma's House of Central Oregon, is non-denominational, non-profit home, and outreach, providing safe, nurturing, and stable shelter to homeless and/or abused pregnant, (whether choosing adoption or parenting) and parenting teens mothers between the ages of 12 to 19 years old and their babies. We are presently the only home East of the Cascades serving the needs of this high-risk population. Grandma's House is not state or federally funded. We are proud to be a United Way Agency, but without the support & dedication of people in our community we could not exist.Grandma's House is more than a safe haven, it is a teaching home. We provide educational programs such as childbirth education, parenting, self esteem, career development and life-skills that are open to, and utilized by, all pregnant, (whether choosing adoption or parenting) and parenting teens in the tri-County area. We have comprehensive prenatal, and post-natal health care services specific to pregnant and parenting teens provided by a nurse from Deschutes County Maternal Health with a Mental Health professional available for one-on-one or in-house counseling. We have options counseling with adoption counseling referrals as requested. Our curriculum is designed to promote self-sufficiency and individual responsibility, while encouraging the pursuit of healthy, positive lifestyles. Our material is presented at the appropriate age levels and are available to all pregnant or parenting teens at no cost."
  },
  {
    "addressLine1": "780 E 1st street",
    "city": "Prineville",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97754",
    "name": "Redemption House",
    "organization": "Redemption House",
    "phone": "(541) 362-5642",
    "website": "https://www.prinevillenazarene.org/redemption-house.html",
    "description": ""
  },
  {
    "addressLine1": "1999 N. 7th St",
    "city": "Coos Bay",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97420",
    "name": "South Coast Gospel Mission",
    "organization": "South Coast Gospel Mission",
    "phone": "(541) 269-5017",
    "website": "http://www.southcoastgospelmission.org/",
    "description": "Homeless Shelter serving men, women, and children.\nSchedule\nMondays through Fridays\nPublic welcome. Breakfast 7:00 -7:30 am. Lunch 12:00-1:00 pm. Dinner 5-6:00 pm.\nNew check Ins: 1pm - 8:00 pm. Chapel 7 - 8:00 pm. Curfew 9 pm.\nSaturday\nPublic welcome. Breakfast 7:30 - 8:00 am. Dinner 3:30 -4:30 pm.\nNew check Ins: 1-8:00 pm.. Curfew 9 pm.\nSunday Residents only. Closed from 10-5:00 pm. New check-Ins from 5-8:00 pm. Curfew 9 pm.\n\n"
  },
  {
    "addressLine1": "1242 N E Spruce Ave",
    "city": "Myrtle Creek",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97457",
    "name": "Warming Center",
    "organization": "Warming Center",
    "phone": "(541) 863-3271 or 541-863-3043 a",
    "website": "mailto:allsoulsparish@gmail.com",
    "description": "The Warming Center opens on nights that are 40 degrees or below. Doors open at 5:00pm.\n\nProvides a warm meal, shower, and clothing."
  },
  {
    "addressLine1": "1995 Amazon Parkway",
    "city": "Eugene",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "00000",
    "name": "First Place Family Shelter",
    "organization": "First Place Family Shelter",
    "phone": "(541) 342-7728",
    "website": "https://twitter.com/firstplacefam",
    "description": "homeless families, pregnant women shelter, food, clothes, showers, household goods provided. transitional housing.\n\nFirst Place Family Center is a refuge and place of support for children and their families who are low income, at risk of losing their housing or are already in transition between homes due to job loss, health issues and other critical problems. We have been a safe place for people in crisis for over 20 years. Services help families meet their immediate needs as well as promoting self-sufficiency. We provide a place where people are always welcome to share their victories, ask advice, or just reconnect with staff. For many families we are the stable home base theyve never had.Office hours:\nMon through Fri: 8:00 am through 5:00 pm\n\n"
  },
  {
    "addressLine1": "931 W 7th Ave",
    "city": "Eugene",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97402",
    "name": "Looking Glass Station 7",
    "organization": "Looking Glass Station 7",
    "phone": "(541) 689-3111",
    "website": "https://www.lookingglass.us/",
    "description": "Shelter for Lane County's homeless and runaway youths.\nCounseling, overnight stays for youths 11 - 17 years old.\nServices:\nCounseling\nHomeless Youth Services\nEducation and Vocational Services\nResidential Services\n\n\n\n"
  },
  {
    "addressLine1": "499 W. 4th Ave.",
    "city": "Eugene",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97401",
    "name": "ShelterCare Center for Programs & Services",
    "organization": "ShelterCare Center for Programs & Services",
    "phone": "(541) 686-1262",
    "website": "http://www.sheltercare.org/",
    "description": "Lobby hours: Monday-Friday 8:30 a.m.- 4:30 p.m.\nThere is no housing here, but this is the location where people can get on the waiting list for housing and/or services.\n\nHousing, Health & Wellness Program\nThis program provides emergency shelter,support and advocacy for families with children who are homeless. There are also units in this facility that are part of our Supported Housing Program.\n\nHomelessness Prevention Program\nThis program keeps families from losing their housing and becoming homeless by providing small amounts of financial assistance coupled with one-on-one support and training.\nShelterCare's Homelessness Prevention Program, started in July 2006, helps families with children who are at risk of homelessness to remain in stable housing. Families facing an eviction receive financial assistance for rent or utilities, coupled with education, advocacy, support and referral to community services to ensure they maintain stable housing.\n\nFamilies who have lost their homes receive \"rapid re-housing\" case management to help them access new permanent housing quickly. Families also receive advocacy, case management services and support after they move from shelter into their own homes."
  },
  {
    "addressLine1": "1542 West 1st Avenue",
    "city": "Eugene",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97402",
    "name": "The Eugene Mission",
    "organization": "The Eugene Mission",
    "phone": "(541) 344-3251",
    "website": "http://eugenemission.org/",
    "description": "The Eugene Mission is a homeless shelter with programs for men, women, and mothers and children.\n\nThe Eugene Mission is sober 'wellness shelter' for the homeless.  All services at the Eugene Mission - food, shelter, clothing, toiletries, showers, and social service case management - are offered free of charge.  Each guest is asked to perform a one-hour daily household chore to contribute to the community living environment.  A one-year, faith-based residential relapse prevention/recovery Life Change program is also offered free of charge for those who are interested.\nOffice Hours: Monday - Friday, 8 a.m. - 4 p.m.\n\nThe Eugene Mission - A Wellness Center for the HomelessWelcome to Eugene's Mission! We are not a homeless shelter in the traditional sense. While we certainly provide the homeless with food and shelter - and do so with an abundance of God's love - the Eugene Mission's ultimate goal is to provide holistic long-term solutions that lead to the wellness of its guests. We are positive but assertive with our guests, asking as much of them as they do of us. We arm them with the skills they need to move forward, while inspiring and motivating them to do so.\n\nWho stays at the Mission? Primarily people who are homeless, whether temporarily or chronically. Guests come to us for a variety of reasons, including job loss and unemployment, eviction, mental illness, physical difficulties, domestic violence, prison release, and addiction to drugs and alcohol. Whatever the reason, we welcome our guests with open arms, eager to provide practical and loving services, hope, and a fresh start.We first offer hope by meeting of our guests' immediate practical needs. Once stabilized, the real work begins - the work of transitioning our guests out of homelessness back to productive members of society!\n\n\nThe ways of wellness:-Serving thousands of men, women and children each year-Safe and sober environment-700+ nutritious meals served per day/250,000 meals served per year-350-400 beds occupied each night/140,000 beds per year-Free clothing, toiletries, laundry, showers, household goods, furnishings-Assertive Social Services Case Management/Counseling-Life Change Relapse Prevention/Recovery Program Offered Free of Charge-Sustainable grounds - chickens, eggs, bees, gardens-The Good News of Jesus Christ shared in word and action-Faith, Hope and Love abound!"
  },
  {
    "addressLine1": "456 Hwy 99N",
    "city": "Eugene",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97402",
    "name": "Egan Warming Center - Cold Weather Shelter",
    "organization": "Egan Warming Center - Cold Weather Shelter",
    "phone": "(541) 689-6747",
    "website": "http://eganwarmingcenter.com/",
    "description": "The shelter is on call between November 15 and March 31 to open up on nights when temperatures drop to 28 degrees or below. The shelters open at 7:00pm and close at 8:00am the following morning. Coalition staff and volunteers need access to the building from 5:00 pm to 9:00am to set up and clean afterward.\n\nThe Coalition Provides:\n- Equipment to comfortably house guests including bedding and supplies.\n- Fire extinguishers and smoke alarms if needed.\n- Staff and volunteers trained in crisis response and accustomed to working with homeless individuals who will be on-site at all times the Warming Center is operating.\n- Trained volunteers to help run the warming center.\n\n- Transportation to and from the warming center for guests will be provided whenever possible."
  },
  {
    "addressLine1": "450 Highway 99 North",
    "city": "Eugene",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97402",
    "name": "Eugene Service Station",
    "organization": "Eugene Service Station",
    "phone": "(541) 461-8688",
    "website": "http://www.svdp.us/what-we-do/homeless-services/eugene-service-station/",
    "description": "ESS hours Mondays through Fridays 9am - 5pm, closed weekends.\n\nThe Eugene Service Station (ESS) provides homeless adults with a warm and welcoming place where they can meet their basic needs (food, day shelter, clothing, laundry, showers, supplies) and get assistance stabilizing their personal crises. The ESS has telephones, message services, computer access, job and housing referrals. In 2013 the Station served 6,432 adults.\n\n\nESS staff and volunteers are available for those who wish to have guidance and mentor-ship in becoming economically self-sufficient. The ESS has telephones, message services, computer access, job referral and housing assistance to help those seeking to get back on their feet. In partnership with Pro-Bone-O, we offer a free pet clinic twice a month."
  },
  {
    "addressLine1": "4488 Knoop ave.",
    "city": "Eugene",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97402",
    "name": "Bosco House",
    "organization": "Bosco House",
    "phone": "(541) 607-2005",
    "website": "https://twitter.com/boscoclub/",
    "description": "We are transitional housing for mothers between 18 and 29 years old, and their children. They have to have their children with them, or be in the process of getting their kids back if they are DHS involved, or be pregnant. The cost is $350 per month. We do not require references or deposits, and there are no other fees. We are a structured program with curfews, etc. We help the women get on low incoM housing lists, find work, etc. Anyone may call the house to set up an interview."
  },
  {
    "addressLine1": "2032 College Way",
    "city": "Forest Grove",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97116",
    "name": "Forest Grove Temporary Emergency Shelter",
    "organization": "Forest Grove Temporary Emergency Shelter",
    "phone": "(503) 357-9121",
    "website": "http://www.fgucc.org/tes/",
    "description": "The Forest Grove Temporary Emergency Shelter will open for the 2017/2018 season on Monday, November 20March 31.  Shelter is offered Monday and Tuesday nights, 7 p.m. to 7 a.m. at Forest Grove UCC (2032 College Way) and Wednesday nights, same hours, at The AlcoveForest Grove Sonrise church annex behind Safeway.\n\nOur shelter spaces can accommodate 15 single guests and up to two families with children in separate areas. Shelter includes two meals and a safe place to sleep, no other services are offered. Shower tickets are available for overnight guests through the Forest Grove Aquatic Center.\n\nOffice Hours: Monday Friday: 9 am to 4 pm\nWorship: Every Sunday, 10 AM"
  },
  {
    "addressLine1": "615 N College St",
    "city": "Newberg",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97132",
    "name": "Newberg Emergency Shelter",
    "organization": "Newberg Emergency Shelter",
    "phone": "(971) 412-2010",
    "website": "mailto:newbergemergencyshelter@gmail.com",
    "description": ""
  },
  {
    "addressLine1": "540 SW Foundry",
    "city": "Grants Pass",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97526",
    "name": "Grants Pass Gospel Rescue Mission",
    "organization": "Grants Pass Gospel Rescue Mission",
    "phone": "(541) 476-0082",
    "website": "http://www.grantspassmission.org/",
    "description": "Provides a homeless shelter and services. Shelter for men.\n\nIntake Hours: 9:00am to 5:00pm.\n\nThe 30 Day Dorm has 30 beds available for men who need a place to stay. The Gospel Rescue Mission cannot house young men under the age of 18 at Wagner Hall\n\nThere is a public bathroom for men located in Wagner Hall. In it are three showers (one is wheelchair accessible) three toilets and three sinks. It is open from 9:00 am to 5:00 pm seven days a week. Guests must check in at the front desk before using the facilities. The resident assistants and staff have the final say in who may use the facilities.\nAll meals are open. The hours are listed below.\nMonday through Friday 6:00 am, 12:00 pm and 5:00 pm\nSaturday and Sunday 7:00 am, 12:00 pm and 5:00 pm\n\nShelter for women and children.\nThe 30 Day Dorm has eight beds available for women who need a place to stay. 30 Day women have all of the same chores as women who have been at the Fikso Family Center longer."
  },
  {
    "addressLine1": "2424 N. Pacific Hwy.",
    "city": "Medford",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97501",
    "name": "St. Anthony Shelter - Shelter For Women",
    "organization": "St. Anthony Shelter - Shelter For Women",
    "phone": "(541) 772-3828",
    "website": "",
    "description": "Six single women's beds, family rooms, thirty day stay, showers, supply your own food, cook your own food, Curfew at 7 pm, out from 10 am to 4:00 pm. Laundry on site. Behind St. Vincent DePaul, they have Deposit assistance, food for pets, bathroom products, clothing vouchers for the year, tents, sleeping bags, soup kitchen 8 am to 1 pm six days a week."
  },
  {
    "addressLine1": "304 Beatty St",
    "city": "Medford",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97501",
    "name": "Salvation Army Medford",
    "organization": "Salvation Army Medford",
    "phone": "(541) 773-6965",
    "website": "https://twitter.com/salarmyrogueval",
    "description": ""
  },
  {
    "addressLine1": "125 West Jackson St",
    "city": "Medford",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97501",
    "name": "Medford Gospel Mission",
    "organization": "Medford Gospel Mission",
    "phone": "(541) 779-1597",
    "website": "http://medfordgospelmission.org/",
    "description": "The Medford Gospel Mission offers three types of shelter:\n\n1) Emergency (1-5 continuous days per month)\n2) Case Management (10 weeks while accomplishing goals)\n\n3) Discipleship (2 year transitional living program)\n\n\n\n* We also provide Emergency Shelter during inclement weather.\n\nWe provide dinner nightly in our free community restaurant called the Main Ingredient.\n\n\nOur free clothing store called the Outfit Outlet is open six days a week 9am-noon. Closed on Sunday.\n\nPrograms\nBecause people have challenges that are unique to their situation we have a variety of programs that can help enable them to conquer a wide range of obstacles:\nPrograms for Men\nPrograms for Women\n\nMen's Programs\nThe mens shelter offers two programs; one that is focused on setting and accomplishing short-term goals called the Getting Things Done (GTD) program and the other is focused on setting and accomplishing long-term goals called the Upper Room Transitional Living (URTL) program.\nThe Getting Things Done program is designed to help men that need more than a few nights shelter to get things done that will enable them to not be homeless. Men who sign up for this program are welcome to stay at the Mission for up to 10 weeks while working on things that will help them move forward. Some have jobs and need to save some money to get housing, others are awaiting to get into a program with another local social service agency, and others need assistance making a plan so they dont leave the Mission and return to homelessness. A majority of the men that stay with us through this program are able to work on solutions to their homeless problem and do not return to living on the streets after completing the program.\n\nThe Upper Room Transitional Living program is Christ Centered, Mentor Driven, and Goal Specific living in a safe and positive environment. With the help of one of our mentors, we help the individual succeed and leave the program better equipped to handle the challenges that come with everyday life.\nOur program consists of three pillars; spiritual growth, serving the community, and accomplishing personal goals. All three of these make up a well-rounded individual and member of our community. Spiritual growth comes through sitting under the preaching and teaching of the word of God. Therefore, program members are required to attend morning bible study and evening chapel services daily. They are also encouraged to find and join a local evangelical church where they can worship weekly. They also take an active part in serving the community by taking on tasks that serve our guests and help make the Mission a special place. Success comes as the individual sets personal goals and moves towards accomplishing them. These goals may be financial, relational, and/or educational.\nWe believe good things cant be rushed. That is the reason that the program is designed for a two-year stay. During this time we partner our men up with a mature Christian man to mentor them every step of the way. The first six months are spent learning to live a stable life away from destructive habits that they may have developed over the years. This is an opportunity for them to spend time caring for others and developing their spiritual life in a safe environment. During the second six months they focus on progressing in skills that will help them be successful in the future. This may include working with local agencies such as: Foundations for Recovery, Work Source Oregon, Vocational Rehab, and Rogue Community College. The final year consists of securing employment, which enables them to reduce debt and save money for future needs after they graduate and move on.\nThese steps, thoughtfully pursued coupled with the encouragement of the mentors and directors of the Medford Gospel Mission help these men succeed in their chosen, post-Mission path.\n\n\nWomen's Programs\nEmergency Shelter\nCheck in time is at 8:30pm nightly.\nPrograms\nWe do have programs designed to give women a hand-up out of the situation that they may find themselves in. We do intakes for women into these programs Monday-Thursday at 2:00pm.\nShort-Term Program:\nHelps women who are in need of more shelter than the initial ten nights that are provided and are working on solutions to their challenges.\nNew Beginnings Program:\nEnables women to live in a safe and encouraging environment while working on obligations that they may have with Childrens Services, Probation Department, or Out-Patient Programs.\nHouse of Esther:\nThis is a year-long program that is designed to help women through life-controlling issues while addressing life skills on a spiritual level through the study of the word of God.\n\n"
  },
  {
    "addressLine1": "521 Edwards St",
    "city": "Medford",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97501",
    "name": "Hearts With a Mission",
    "organization": "Hearts With a Mission",
    "phone": "(541) 646-7385",
    "website": "http://heartswithamission.org/",
    "description": "Under 18 shelter for runaway and homeless youths.\n\nHearts With A Mission is a faith-based 501(c) 3 non-profit, all services provided are confidential and free of charge. Hearts With A Mission services are available to all eligible youth in Jackson County regardless of race, color, sex, national origin, religion, sexual orientation or disability. Youth from outside of Jackson County are screened on a case-by-case basis and upon bed availability.\n\nHearts With A Mission is licensed by the State of Oregon, as a Child Caring Agency to provide services for homeless, runaway and transitional living youth, ages 10-17. We cooperate with all law enforcement agencies.\n\nMission:\nHearts With A Mission serves homeless and at-risk youth by providing shelter, education, mentoring and transition planning with a faith-based approach.\n\nVision:\nHearts With A Mission: Providing hope in God through practical loving care for homeless and at-risk youth."
  },
  {
    "addressLine1": "5003 W Powell Blvd",
    "city": "Gresham",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97030",
    "name": "My Father's House Community Shelter",
    "organization": "My Father's House Community Shelter",
    "phone": "(503) 492-3046",
    "website": "https://www.familyshelter.org/",
    "description": "If you are homeless or know someone who is, please call 503-492-3046 x231 and we'll do all we can to help you.\n\nMy Father's House Community Shelter is a family shelter located in East Multnomah County, Oregon. We provide a safe environment for 30 families, a place families can stay together as they address their spiritual, physical, emotional, and relational issues and needs.\n\n\nSince more than half of our residents are children, our family shelter provides a home-style atmosphere that encourages change, structure, and accountability, as well as life changing classes and services that are suited for the entire family. For many of these parents it is their only opportunity for a chance to get back on their feet."
  },
  {
    "addressLine1": "12350 SE Powell Blvd.",
    "city": "Portland",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97236",
    "name": "Daybreak Shelter Portland",
    "organization": "Daybreak Shelter Portland",
    "phone": "(503) 548-0200",
    "website": "http://www.humansolutions.org/homelessness-services/daybreak-shelter.php",
    "description": "At this office: Anti-Poverty Classes, Energy Assistance, Employment Programs, Family Advocacy, Administrative Offices.\n\nThe Daybreak Shelter Network is a unique collaboration between Human Solutions and 30 area faith congregations. It is one of the very few homeless family shelters that keeps families together and the only one in Mid and East County that is completely secular. Daybreak Shelter is open 7 days a week, year round, to meet the needs of homeless families in our community.Description information:\n\n- The Daybreak Shelter provides shelter for 365 days and nights each year. Last year Human Solutions provided more than 4,500 nights of shelter and13,500 meals to homeless families.\n- Daybreak houses families while providing intensive and one-on-one case management\n\n- Daybreak ensures that most families coming into shelter move directly into permanent or transitional housing in about 45 days.\n- Families of any configuration can stay including single parent, two parent, same sex parent, extended families, families headed by mothers, fathers, grandparents, etc. and the family stays together while at our shelter .\n- Families have access to Human Solutions other services: employment training, helpfulclasses, computer lab for job and home searches, access to other educational tools, and a supportive network to help the family overcome homelessness for good."
  },
  {
    "addressLine1": "P O Box 4073",
    "city": "Hillsboro",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97123",
    "name": "Family Promise Washington County Oregon",
    "organization": "Family Promise Washington County Oregon",
    "phone": "(503) 844-2919",
    "website": "http://www.familypromisewashingtoncountyoregon.org/",
    "description": "To access Shelter must be on Community Connect Waitlist. Call 211 or 503-640-3263to be on waitlist.\n\nFamily Promise is a non-profit homeless shelter program located in Hillsboro Oregon for families with children. We are supported by Volunteers and Faith Communities (congregations and churches) who PROMISE to help families return to a home of their own. With the support of Experienced Staff, empowering volunteers, and dedicated Volunteer Support at the Shelter House and Hosting Congregations we are building community, strengthening lives and ending homelessness - one family at a time. Call us us at 503-844-2919 or email us for info."
  },
  {
    "addressLine1": "975 Indian Creek Road",
    "city": "Hood River",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97031",
    "name": "Hood River Warming Shelter",
    "organization": "Hood River Warming Shelter",
    "phone": "541-386-2608",
    "website": "https://www.hoodrivervalleychristianchurch.org/",
    "description": "Hood River Warming Shelter is a temporary shelter in the Gorge area of Oregon/Washington operating during the winter months - mid November through mid March from 6pm to 8am.Guests are allowed to stay in the shelter for a total of 30 nights during the shelter season. The days that each guest stays at the shelter will be tracked and they will be notified when approaching the end of 30 days.\n\nLocation: The lower parking lot of Hood River Valley Christian Church at 975 Indian Creek Road\n\nWhen: Guests are welcome to arrive between 6:00pm and 8:00pm nightly and must depart by 8:00am each morning.\nContact us: info@hoodrivercares.org\nGuests may be allowed to stay for another 30 days if they can demonstrate they are enrolled in, or trying to enroll in, a program to effectively address the issues behind their homelessness. This may include, but not limited to:\nSubstance recovery program\nEmployment assistance\nMental health counseling\n\nA letter from a program director or counselor confirming you participation and need for additional time at the shelter is very helpful.\n\nGuests who are working but cannot afford rent will be allowed to stay at the shelter beyond 30 days as long as they remaining in compliance with standard shelter policies.\n\n\nGuests who are on a waiting list for housing will be allowed to stay at the shelter beyond 30 days as long as they remaining in compliance with standard shelter policies. If you think you that you qualify for an additional 30 days, please contact the Shelter Host to review your particular situation.\n\n\nNo matter how many days a guest has stayed at the shelter, a guest may return to the shelter on nights the shelter is operating in Emergency Mode unless they have been banned from the shelter for violent behavior or a severe infraction of shelter policy as determined by the Shelter Host."
  },
  {
    "addressLine1": "1931 Mission Avenue",
    "city": "Klamath Falls",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97601",
    "name": "Klamath Falls Gospel Mission Women with Shelter",
    "organization": "Klamath Falls Gospel Mission Women with Shelter",
    "phone": "(541) 882-4895",
    "website": "http://www.kfallsgospelmission.org/",
    "description": ""
  },
  {
    "addressLine1": "417 Lane St",
    "city": "Yreka",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "96097",
    "name": "Lane Street Effort",
    "organization": "Lane Street Effort",
    "phone": "(530) 842-7486",
    "website": "",
    "description": "Shelter for the homeless."
  },
  {
    "addressLine1": "2008 3rd St. Suite B",
    "city": "La Grande",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97850",
    "name": "Union County Warming Station",
    "organization": "Union County Warming Station",
    "phone": "(541) 786-8779",
    "website": "https://www.ucwarmingstation.org/",
    "description": ""
  },
  {
    "addressLine1": "715 SE Court Ave",
    "city": "Pendleton",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97801",
    "name": "Pendleton Warming Station",
    "organization": "Pendleton Warming Station",
    "phone": "(765) 791-8332",
    "website": "http://www.n2npendleton.org/",
    "description": ""
  },
  {
    "addressLine1": "202 W. Birch St",
    "city": "Walla Walla",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "99362",
    "name": "Walla Walla Rescue Mission",
    "organization": "Walla Walla Rescue Mission",
    "phone": "(509) 525-7153",
    "website": "http://www.christianaidcenter.org/",
    "description": "Also known as the Christian Aid Center.\nServices for Men\nProvides nightly shelter when needed, men's homeless services, spiritual assistance, addiction treatment, employment assistance, housing assistance. Maximum capacity: 23 men. Laundry services.\nCall to see if they have room and availability to assist you.\n\nFamily Services\nFamily Services currently has nine apartments which provide emergency shelter for homeless couples and families with children under the age of eighteen. In addition to our emergency shelter, Family Services has three houses which provide transitional housing for families working toward employment and educational goals who have demonstrated positive life change."
  },
  {
    "addressLine1": "5030 SE Hwy 101",
    "city": "Lincoln City",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97367",
    "name": "Family Promise of LIncoln County",
    "organization": "Family Promise of LIncoln County",
    "phone": "(541) 614-0964",
    "website": "http://www.familypromiseoflincolncounty.org/",
    "description": "Nonprofit organization that provides nightly shelter and day center for homeless families with children, 18 or under. Advocacy services, assistance finding stable housing, safety, networking, showers, kitchen, laundry,\njob search assistance.\n\n\n\nFamily Day House\n\nGuests use a local day center, space to shower, care for pre-school children, and\nseek employment. Many guests are employed during the day and go to work.\n\nDuring the school year, children go to school. The day center provides guests with\n\na mailing address and a home base from which to conduct their housing search.\n\n\nThe Network Director's office will be at the day center."
  },
  {
    "addressLine1": "715 Sw Bay St",
    "city": "Newport",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97365",
    "name": "Samaritan House Inc",
    "organization": "Samaritan House Inc",
    "phone": "(541) 574-8898",
    "website": "http://samfamshelter.org/",
    "description": "Samaritan House, Inc. is a nonprofit organization in Newport, Oregon, established in 1988 to provide emergency shelter and meals to homeless families. Since that time our program has expanded to include transitional shelter, case management and support services to assist families in achieving self sufficiency and stable housing. Ours is a program of compassion, but with expectations that our residents will be responsible for the successful outcomes of their stay with us.\n\nServices:\nInitially, families enter our program in the emergency shelter phase for up to 30 days. During this period, families are expected to apply for needed resources, address urgent health issues, locate childcare, and, if feasible, seek employment and housing.\n\nTransitional Shelter:\nMost families need additional time to re group and get back on their feet. This program is available to families who have met expectations in the first 30 days and who agree to work toward self-sufficiency by participating in educational programs, working on personal goals, and saving 60% of their income toward the costs of moving into a place of their own. Families may stay for an additional three months in the transitional shelter program.\n\nTransitional Housing\nSome families will need even more time to transition to independence. Several of our apartment units are rented to families who have successfully completed the transitional shelter program. They may need to establish a good rental history, repair credit problems, or save additional funds to obtain other housing. In this program, families may rent a one- or two-bedroom apartment for up to six months.\n\nBecause the number of homeless families is growing, we usually have a waiting list to get into the shelter. Families may contact us by phone or in person for information about our program and to get on the waiting list. We can also provide information about other available resources that may be of help."
  },
  {
    "addressLine1": "1340 NE Logan St",
    "city": "McMinnville",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97128",
    "name": "Yamhill County Gospel Rescue Mission",
    "organization": "Yamhill County Gospel Rescue Mission",
    "phone": "(503) 472-9766",
    "website": "https://www.ycgrm.org/",
    "description": ""
  },
  {
    "addressLine1": "603 12th Street",
    "city": "Oregon City",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97045",
    "name": "The Father's Heart Ministry Day Shelter",
    "organization": "The Father's Heart Ministry Day Shelter",
    "phone": "(503) 722-9780",
    "website": "http://www.tfhstreetministry.com/",
    "description": ""
  },
  {
    "addressLine1": "not disclosed",
    "city": "Oregon City",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97045",
    "name": "Clackamas Women's Services",
    "organization": "Clackamas Women's Services",
    "phone": "(503) 722-2366",
    "website": "http://www.cwsor.org/",
    "description": "Crisis: 503-654-2288 or toll free 888-654-2288\n\n(open 24 hours a day)\n\nOffice 503-722-2366\n\n\n\nIncorporated in 1985 as Clackamas County's only shelter for women & children escaping family violence, CWS has safely harbored over 7,000 women & children within the walls of our two shelters. Each night thirty-two women & children call these shelters \"home\" as they regain control of their lives and plan for their futures.\n\n\n\nIn addition to emergency shelter, CWS has responded to over 70,000 crisis calls in the last 16 years. This hotline is staffed by trained volunteers & CWS personnel who provide support, information on restraining orders, other resources, and just listen when someone needs to talk.\n\n\n\n\nClackamas Women's Services offers women & children more than a safe place to sleep. CWS provides broken families with long-term emotional and financial support, and transitional housing to ensure their successful journey from crisis to stability.\n\n\n"
  },
  {
    "addressLine1": "585 NW 1st St.",
    "city": "Ontario",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97914",
    "name": "Project DOVE",
    "organization": "Project DOVE",
    "phone": "(800) 889-2000",
    "website": "http://blog.projectdoveor.org/",
    "description": "This shelter is specifically for victims of domestic and/or sexual violence. Project DOVE offers safe refuge and support to victims of domestic and sexual violence."
  },
  {
    "addressLine1": "1508 Hope Lane",
    "city": "Caldwell",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "83605",
    "name": "Hope's Door",
    "organization": "Hope's Door",
    "phone": "(208) 459-6330",
    "website": "http://www.aafvhope.org/",
    "description": "Hope's Door is an emergency shelter for victims of domestic abuse and sexual assault. The shelter is staffed 24 hours a day, 365 days per year.\n\nHope's Door is the only domestic violence specific to women and children shelter in Canyon County.  We provide protection not only for victims in Idaho, but across the entire United States.\n\n\nWhile staying at Hope's Door Shelter, survivors are able to take part in many different educational courses that focus on healthy relationships and life skills. Our goal is to empower individuals to set the course for eliminating violence in their lives and throughout our community.\n\nHow long can I stay at Hope's Door Shelter?\nYou can stay at Hope's Door Shelter for up to 90 days. After your 90 day stay, we offer transitional affordable housing for 2 years.\n\nHow many rooms are available at Hope's Door Shelter?\n\nHope's Door Shelter has 28 private bedrooms where women and their children have the security and safety needed to begin moving forward with a violence-free future.\n\nHow can I apply for a room at Hope's Door Shelter?\nTo apply for a room at Hope's Door Shelter, please call the Shelter for a phone interview, (208) 459-6279."
  },
  {
    "addressLine1": "112 N. 2nd Avenue",
    "city": "Pasco",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "99301",
    "name": "Tri-City Union Gospel Mission",
    "organization": "Tri-City Union Gospel Mission",
    "phone": "509-380-0991",
    "website": "https://grace.kitchen/",
    "description": "Emergency Shelter.Separate shelter programs for men and for women/families."
  },
  {
    "addressLine1": "720 W Court Street",
    "city": "Pasco",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "99301",
    "name": "Benton Franklin Community Action Committee",
    "organization": "Benton Franklin Community Action Committee",
    "phone": "(509) 545-4042",
    "website": "http://www.bfcac.org/",
    "description": "Emergency Shelter, financial and emergency assistance is available.\n"
  },
  {
    "addressLine1": "2306 NE Andresen Road Suite A",
    "city": "Vancouver",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "98661",
    "name": "Council for the Homeless Temporary Emergency Shelter",
    "organization": "Council for the Homeless Temporary Emergency Shelter",
    "phone": "(360) 695-9677",
    "website": "http://www.councilforthehomeless.org/",
    "description": ""
  },
  {
    "addressLine1": "1055 Edgewater St NW",
    "city": "Salem",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97304",
    "name": "Family Promise of the Mid-Willamette Valley",
    "organization": "Family Promise of the Mid-Willamette Valley",
    "phone": "(503) 370-9752",
    "website": "https://www.familypromisemwv.org/",
    "description": "Family Shelter.\n\nSalem Interfaith Hospitality Network (IHN) serves only families who are homeless.\nIndividuals or couples  must be accompanied by their child(ren) under the age of 18. Parents entering the Network must consistently monitor their child(ren)s behavior and activity.\n\nPregnant women will be considered on a space availability basis, with medical documentation of their pregnancy.\nFamilies take responsibility for developing and then working a plan to move toward self-sufficiency with the input and help of the Family Case Manager.\nFamilies are responsible to follow Salem IHN's behavior guidelines.\nNo active alcohol/drug usage.  Past usage is on a case by case basis.\n\nEach adult entering Salem IHN will consent to a criminal background check. Past convictions will be considered on a case by case basis.\n\nPetSmart and Salem IHN: Working to Keep Families Together\nPetSmart has formed a partnership with Salem Interfaith Hospitality Network to create PetSmart Promise, a program that provides options for homeless families to keep their pets while on the road to a sustainable home. The partnership expanded the existing Salem IHN Day Center to include a facility for families who are in transition or temporarily homeless to keep their dog or cat at the shelter with them. The families are involved in caring for their pets and are able to keep their family including their four-legged members together during a difficult time."
  },
  {
    "addressLine1": "1901 Front Street NE",
    "city": "Salem",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "00000",
    "name": "Lighthouse Shelter Salem Oregon",
    "organization": "Lighthouse Shelter Salem Oregon",
    "phone": "(503) 585-6688",
    "website": "http://www.salem.kroccenter.org/",
    "description": "Since 1966, The Lighthouse Shelter has provided our community with 6-month transitional shelter to community members looking to transition to self-sufficiency.During their stay, residents have access to three meals a day, laundry facilities, showers, and a warm bed.Each resident works closely with a case manager who connects them with a community resources and helps combat barriers to self-sufficiency."
  },
  {
    "addressLine1": "777 Commercial Street NE",
    "city": "Salem",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97301",
    "name": "Union Gospel Mission of Salem Oregon",
    "organization": "Union Gospel Mission of Salem Oregon",
    "phone": "503-967-6388",
    "website": "https://ugmsalem.org/",
    "description": "Our Men's Mission offers 200 beds and serves up to 400 guests each day.\n\nGuest Services\nAnyone needing help can receive:\na hot shower\nclean clothing\npersonal care items\nnourishing meals\nsafe shelter\n\nMeal Times:\nBreakfast: 6:30am-7:00am\nLunch: 12:00pm-12:45pm\nDinner: 5:30pm-6:15pm\n\nTransitional Services\nMen whose greatest needs are stable employment and housing receive tools for long-term success:\nresume and cover letter preparation\ninterview coaching\nconnections to employers\nstable housing"
  },
  {
    "addressLine1": "4955 Oak Park Dr NE",
    "city": "Salem",
    "state": "Oregon",
    "stateAbbreviation": "OR",
    "postal": "97305",
    "name": "Moving Forward Towards Independence",
    "organization": "Moving Forward Towards Independence",
    "phone": "(971) 240-0905",
    "website": "https://www.movingforwardtosuccess.org/",
    "description": ""
  }
]