[
	{
		"addressLine1": "801 South Treadaway Blvd.",
		"city": "Abilene",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79602",
		"name": "Abilene Hope Haven",
		"organization": "Abilene Hope Haven",
		"phone": "(325) 677-4673",
		"website": "https://www.abilenehopehaven.org/",
		"description": "Abilene Hope Haven is a nonprofit organization that was created to address the needs of homeless individuals. It provides homeless adults and families with food, clothing, shelter, transportation and the tools necessary to become self-sufficient.\n\n\nAbilene Hope Haven operates two residential facilities:\n\nBridge 2 Home:\nThis program is designed to provide emergency shelter to individuals and/or families that are experiencing homelessness. The main focus is to work with neighbors to secure a safe, affordable and stable housing to individuals and families as quick as possible. Individuals and/or families that have school-age children may be prioritized. Before moving in, neighbors will participate in an assessment to determine eligibility and services needed. At move-in, neighbors sign a participant agreement that outlines Bridge 2 Home policies and procedures. Each household is provided with a private room, basic cable, internet access, and groceries. Additionally, participants may utilize the following community spaces: kitchen, dining/living space, laundry facilities, and back/patio area.\nHope Housing Services (HHS)Is a rapid re-housing program for individuals and/or families experiencing homelessness. It combines housing identification, financial assistance, and case management services so that HHS staff support neighbors in securing safe, affordable, stable housing as quickly as possible. Prior to program entry, neighbors participate in an assessment to determine services needed and placement on the Housing Priority List. Because the focus is stability, neighbors sign a standard 12 month lease in their own name prior to moving into their home. \n\n\n"
	},
	{
		"addressLine1": "233 Fannin St",
		"city": "Abilene",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79603",
		"name": "Love and Care Ministries Homeless Assistance",
		"organization": "Love and Care Ministries Homeless Assistance",
		"phone": "(325) 670-0246",
		"website": "https://www.lcmin.com/",
		"description": "Provides showers, change of clothes, hygiene kit, food, and shelter (only open during freezing weather conditions during the winter).\n\nHours of Operation: Mon, Tues, Thur 9:00 am - 11:30 am, 1:00 pm - 3:00 pm; Wed 9:00 am - 11:30 am."
	},
	{
		"addressLine1": "1726 Butternut St",
		"city": "Abilene",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79602",
		"name": "Salvation Army Abilene Homeless Shelter",
		"organization": "Salvation Army Abilene Homeless Shelter",
		"phone": "(325) 677-1408",
		"website": "https://www.facebook.com/SalArmyTX/",
		"description": ""
	},
	{
		"addressLine1": "305 Grape Street",
		"city": "Abilene",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79601",
		"name": "Harmony Family Services",
		"organization": "Harmony Family Services",
		"phone": "(325) 672-7200",
		"website": "http://www.harmonyfamilyservices.org/",
		"description": "Provides runaway homeless shelter and emergency shelter for abused, neglected children. Walk-ins accepted, referrals from Child Protective Services and local professionals working with children and youth"
	},
	{
		"addressLine1": "403 Lakeway Dr",
		"city": "Brownwood",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76801",
		"name": "Salvation Army Service Center of Brownwood",
		"organization": "Salvation Army Service Center of Brownwood",
		"phone": "(325) 646-5369",
		"website": "https://twitter.com/SalvationArmyUS/",
		"description": "Provides limited assistance with gasoline, bus tickets and/or lodging when transients are stranded in an emergency.\nMon - Fri 9:00 am - 4:00 pm."
	},
	{
		"addressLine1": "301 E 3rd St",
		"city": "Colorado City",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79512",
		"name": "Community Mission of Colorado City",
		"organization": "Community Mission of Colorado City",
		"phone": "(325) 728-5067",
		"website": "",
		"description": "Provides temporary lodging at local motel for transients, persons released from jail, or exceptional county resident need. Usually provide assistance for 2 nights depending on individual situation.\n\nHours: Mon - Thur 9:00 am - 1:00 pm."
	},
	{
		"addressLine1": "1001 Belle Plain St.",
		"city": "Brownwood",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76801",
		"name": "New Beginnings Church",
		"organization": "New Beginnings Church",
		"phone": "(325) 643-6089",
		"website": "https://www.facebook.com/New-Beginnings-Church-of-Brownwood-TX-102771269374/",
		"description": "Cold weather shelter. We open the doors to the church when it is going to be down in the freezing mark."
	},
	{
		"addressLine1": "1101 Avenue D",
		"city": "Brownwood",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76801",
		"name": "Brown County Home Solutions",
		"organization": "Brown County Home Solutions",
		"phone": "(325) 647-6447",
		"website": "https://www.bchstx.org/",
		"description": ""
	},
	{
		"addressLine1": "PO Box 1601",
		"city": "Allen",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75002",
		"name": "Family Promise Collin County",
		"organization": "Family Promise Collin County",
		"phone": "(972) 442-6966",
		"website": "http://familypromiseofcollincounty.org/",
		"description": "The Family Promise of Collin County Community Network brings shelter, meals, and support services to Collin County families without homes. Family Promise of Collin County is a cost-efficient and effective community response to family homelessness. The foundation of the program is the involvement of local host congregations who provide a safe refuge, food, and hospitality for the families in the evening on a rotation basis.\n\nHost Congregations located in Collin County provide overnight shelters, food, and loving hospitality for guest families as they rotate weekly among each of the churches in the network. Their support may also include gift cards and monetary donations.\n\nDay Center\nDuring the day our Guest are at work, school or utilizing our Day Center from 7:30 AM to 6:00 PM during the week and weekend, where a professional case worker provides case management services individualized plan to regain housing and self-sufficiency.\nIn addition, Guests pursue employment, tend pre-school children, work on financial goals, and tend to laundry and personal needs. The Day Center provides guests with a mailing address and a base for housing and employment searches during the day. The Day Center has been provided by one of our support churches.\n\nSustainable Independence Program (SIP)\nFamily Promise of Collin County's (FPOCC) Sustainable Independence Program (SIP} Provides food,shelter and support services for Collin County families with children as they regain sustainable independence: Phase I Community Services, Phase II Transitional Shelter, Phase III Affordable Housing, Phase IV Aftercare. All services are provided based on demonstrated need and available resources to a presumed population as defined by HUD: 100% of participants are below 50% of median income levels; 100% of participants fall at or below 150% of the Federal Poverty Threshold; 100% qualify for free or reduced lunch.\n\nAlmost Home is a program for Guests who have successfully completed the shelter program. This program can offer temporary, affordable housing for up to 12 months for guests who have successfully completed their case management goals. A limited number of homes are available to be used by a family to transition from the shelter to a more permanent, future residence. Additionally, for other families unable to utilize the transitional homes, financial support may be available to assist them with rental and utility deposits and application fees."
	},
	{
		"addressLine1": "902 E. 16th Street",
		"city": "Plano",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75074",
		"name": "City House",
		"organization": "City House",
		"phone": "(972) 424-4626",
		"website": "http://www.cityhouse.org/",
		"description": "City House provides emergency shelter for ages newborn - 17, and transitional living services (residential and nonresidential) to 18-21 year olds.\nNeed help now? After 5:00 pm.. Call us at 972-971-0278.\nPrograms and Services\n\nToday we serve youth ages newborn to 21 years through four primary programs:\n\nEmergency shelter for children (newborn to 17 years)\n\n\nTransitional Living Program comprised of several residential homes (18-21 years)\n\n\nYouth Resource & Community Outreach Center (16-21 years)\n\nFree Individual & Family Crisis Counseling Services\n\n"
	},
	{
		"addressLine1": "218 N 10th St.",
		"city": "Garland",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75040",
		"name": "Hope's Door New Beginning Center",
		"organization": "Hope's Door New Beginning Center",
		"phone": "(972) 276-0057",
		"website": "https://hdnbc.org/",
		"description": "At Hope's Door New Beginning Center, we help individuals and families escape and heal from domestic abuse, dating abuse and family violence through our free trauma-informed services.\n\nOur two emergency shelters offer temporary housing to survivors and their children fleeing life-threatening situations.\n\n\nClients living in our emergency shelters are provided with food, clothing and all the necessities of daily living along with case management, safety planning, counseling, legal support, and referral to other community resources.\n\nClients can stay in the emergency shelter for up to 90 days and the location of the shelter remains strictly confidential to ensure the safety of those living in the shelter.\n\nChildren living in the shelter are enrolled in schools nearby or may attend their home school if it is safe to do so.\n\n\nIn addition to temporary shelter, we offer the following services free of charge at both of our Outreach Centers in Plano and Garland: -Counseling sessions for adults and children, including individual and group therapy\n\n-Legal support including legal advice, assistance with protective orders, child custody and divorce, and possible full representation\n-Transitional housing services for clients leaving the shelter that includes rental assistance, deposit waivers, case management and life-skills classesSurvivors in need of services other than shelter or those who have left the shelter can access these services in English or Spanish.\n\nAnyone wishing to receive any of our free services are encouraged to call our 24-Hour Hotline, which is answered in English and Spanish 24 hours a day, 7 days a week. 24-Hour Hotline: 972-276-0057 If you are or think you might be in an abusive relationship, know that you are not alone, it is not your fault, and help is available."
	},
	{
		"addressLine1": "613 S. Adams",
		"city": "Amarillo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79101",
		"name": "City of Refuge (day refuge - sack lunches and clothing)",
		"organization": "City of Refuge (day refuge - sack lunches and clothing)",
		"phone": "(806) 331-1891",
		"website": "",
		"description": "They welcome people who come from all aspects of society, especially those who have felt excluded in isolation and alone.\n"
	},
	{
		"addressLine1": "409 S. Monroe St.",
		"city": "Amarillo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79101",
		"name": "Downtown Women's Center",
		"organization": "Downtown Women's Center",
		"phone": "(806) 372-3625",
		"website": "https://dwcenter.org/",
		"description": ""
	},
	{
		"addressLine1": "600 N Tyler St",
		"city": "Amarillo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79107",
		"name": "Faith City Mission",
		"organization": "Faith City Mission",
		"phone": "(806) 373-6402",
		"website": "https://www.faithcity.org/",
		"description": "Our Mission is to Feed the Hungry, Clothe the Naked, Shelter the Homeless, and Preach the Gospel.\n\nEmergency Food, Clothing, Shelter, and Showers is a daily service provided for Amarillo's homeless community. We serve 3 hot meals Monday through Saturday. We also provide emergency overnight shelter, inclement weather shelter and day room, daily showers, and Chapel services.\n\n"
	},
	{
		"addressLine1": "7136 West Interstate 40 Suite B",
		"city": "Amarillo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79101",
		"name": "Family Support Services",
		"organization": "Family Support Services",
		"phone": "(806) 342-2500",
		"website": "https://fss-ama.org/",
		"description": ""
	},
	{
		"addressLine1": "209 S. Jackson",
		"city": "Amarillo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79101",
		"name": "Another Chance House",
		"organization": "Another Chance House",
		"phone": "(806) 372-3344",
		"website": "https://anotherchancehouse.org/",
		"description": "Homeless shelter for men fighting alcoholism and drug addiction.\n\nNonprofit provider of emergency shelter and permanent, low-income rental housing to homeless males. ACH is unique and innovative because it offers several types of housing for long-term efforts toward self-sufficiency. Currently, housing is available for 55.\n\n\nACH is continually expanding its housing services by acquiring more properties that can be offered as low-income housing. It has expanded its role in the Amarillo community by collaborating with other organizations to assist more men, eliminate drug neighborhoods and minimize poverty.\n\n\nProgram Services include case management, Alcoholics Anonymous, Narcotics Anonymous, recovery programs, respect programs, family orientation, employment referral, vocational training and transportation.\n\nAnother Chance House reserves a select number of beds for America's veterans. This program is a collaboration between ACH and the Veteran's Administration."
	},
	{
		"addressLine1": "1204 W. 18th Ave.",
		"city": "Amarillo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79102",
		"name": "Martha's Home Inc.",
		"organization": "Martha's Home Inc.",
		"phone": "(806) 372-4035",
		"website": "https://www.marthashome.org/",
		"description": "Martha's Home provides homeless women and their children with shelter and support while guiding them towards a lifestyle of self-sufficiency.\nServices offered to the women and their children in need:\n\n\n- Case Management services with individualized assistance\n\n- GED tutoring and access to academic programs at Amarillo College, WTAMU\n\n- Assistance with scholarship opportunities and grant applications\n\n- Vocational training and job placement through the Panhandle Workforce Solutions\n\n\n- Life skills training where women learn budgeting, job interviewing skills, stress management, and conflict resolution\n\n- Legal matters through Legal Aid of Northwest Texas\n\n- Medical problems and completing medical forms\n\n- Childcare through local and government funded programs\n\n- Parenting classes taught at Family Support Services\n\n\n- Spiritual support and regularly scheduled Bible study\n\n- Mentoring by former Marthas Home clients\n\n- Establishment of permanent housing through City of Amarillo Rental Assistance, Shelter Plus Care, etc.\n"
	},
	{
		"addressLine1": "200 South Tyler St.",
		"city": "Amarillo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79101",
		"name": "Guyon Saunders Resource Center - Community Day Room",
		"organization": "Guyon Saunders Resource Center - Community Day Room",
		"phone": "(806) 373-0704",
		"website": "http://www.guyonsaunders.com/",
		"description": ""
	},
	{
		"addressLine1": "400 S. Harrison St.",
		"city": "Amarillo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79101",
		"name": "Salvation Army of Amarillo Shelter",
		"organization": "Salvation Army of Amarillo Shelter",
		"phone": "(409) 935-1190",
		"website": "https://www.salvationarmytexas.org/amarillo/",
		"description": ""
	},
	{
		"addressLine1": "PO Box 7160",
		"city": "Amarillo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79114",
		"name": "Patsy's Place Transitional Home",
		"organization": "Patsy's Place Transitional Home",
		"phone": "(806) 418-2480",
		"website": "https://www.sharinghopeministry.org/",
		"description": "Patsy's Place is a Christ-centered transitional home in Amarillo, Texas. The volunteers and staff nurture and mentor women as they struggle to cope with the overwhelming obstacles they face almost immediately upon release from county jail or prison."
	},
	{
		"addressLine1": "109 Commercial Circle",
		"city": "Conroe",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77301",
		"name": "Family Promise of Montgomery County",
		"organization": "Family Promise of Montgomery County",
		"phone": "(936) 441-8778",
		"website": "https://www.familypromiseofmc.org/",
		"description": "Day Center\nLocated near Downtown Conroe, the Family Promise Day Center is a safe haven for families when they enter the program.  While local congregations host the families in the evenings and on weekends, the Day Center is where the families conduct job searches, receive case management services, cook and eat mid-day meals, do their laundry, and keep the majority of their clothes and belongings.\nThe Day Center strives to be as \"family-friendly\" as possible, while also housing the Family Promise business offices.\n\nThe Day Center operates Monday Friday, 7am 5pm and may be contacted at (936) 441-8778.\n\nQualifications:\nFamilies must meet the following eligibility requirements:\n    Must have child/children under the age of 18 years\n    Must currently be homeless or facing homelessness\n    Must be drug/alcohol free\n    Must be able to work full-time and maintain employment\n    Must not have serious criminal history\n    Must be willing to live/work in Montgomery County\n"
	},
	{
		"addressLine1": "306 W 7th St",
		"city": "Dumas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79029",
		"name": "SafePlace Inc.",
		"organization": "SafePlace Inc.",
		"phone": "(806) 935-7585",
		"website": "https://www.safeplaceinc.org/",
		"description": ""
	},
	{
		"addressLine1": "325 W. Division Street",
		"city": "Arlington",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76011",
		"name": "Arlington Life Shelter",
		"organization": "Arlington Life Shelter",
		"phone": "(817) 548-9885",
		"website": "https://arlingtonlifeshelter.org/",
		"description": "Arlington Life Shelter serves men, women and children of all ages.\n\n\nEmergency Shelter Program\n\n\n\nEmergency shelter services are provided for up to three (3) nights and during periods of extreme cold or heat.\n\n\n14 day services and housing placement are provided for persons unable to work due to disability or age.\n\n\nEmployment Program\n\n\nThe Employment Program is a comprehensive program designed to help adults get back on their feet and self-sufficient. It can range from a few weeks to several weeks, depending on one's needs and commitment. Additional requirements for the Employment Program:\n"
	},
	{
		"addressLine1": "1010 N. Center Street",
		"city": "Arlington",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76011",
		"name": "Safehaven of Tarrant County",
		"organization": "Safehaven of Tarrant County",
		"phone": "(817) 535-6462",
		"website": "https://www.safehaventc.org/",
		"description": "SafeHaven is home to Tarrant County's ONLY two domestic violence\n\nshelters. Please call our hotline at 1-877-701-7233 to connect to our\nresources.\n\nTransitional Housing for Victims of Domestic Violence. SafeHaven operates the only domestic violence shelters in Tarrant County.\n\n\nSafeHaven operates two emergency shelters that have a 164 bed capacity and provides 24-hour care to families fleeing life-threatening situations. The shelters provide living quarters, meals, clothing, transportation, counseling, childrens recreational and therapeutic activities, medical and dental care, and case management at no cost to the client.\n\n\n\nOutreach services include: 24-hour bi-lingual crisis line; counseling and support groups for adults and children (English and Spanish); legal services; collaborative programs with 17 police departments in suburban areas; transitional housing for families exiting the shelter seeking self-sufficiency; and educational programs to adults, children, youth and professionals on prevention and intervention regarding abusive relationships."
	},
	{
		"addressLine1": "210 W. South St.",
		"city": "Arlington",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76010",
		"name": "Mission Arlington",
		"organization": "Mission Arlington",
		"phone": "(817) 277-6620",
		"website": "https://www.facebook.com/missionarlington",
		"description": ""
	},
	{
		"addressLine1": "712 West Abram",
		"city": "Arlington",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76004",
		"name": "Arlington Family Life Shelter",
		"organization": "Arlington Family Life Shelter",
		"phone": "(817) 860-1836",
		"website": "https://arlingtonlifeshelter.org/",
		"description": "Salvation Army supported family shelter."
	},
	{
		"addressLine1": "Undisclosed suite L",
		"city": "Bedford",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76021",
		"name": "Safe To Sleep DFW",
		"organization": "Safe To Sleep DFW",
		"phone": "(800) 790-3221",
		"website": "https://safetosleepdfw.com/",
		"description": ""
	},
	{
		"addressLine1": "1617 Park Pl Ave Suite 110",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76110",
		"name": "Huma-Faith",
		"organization": "Huma-Faith",
		"phone": "(682) 304-8020",
		"website": "http://www.humafaith.org/",
		"description": "Transitional Housing for the homeless population. We provide for men, women, and minor children. There's financial responsibility and obligation that may be off-set or in some cases eliminated through our work program.\n\nFaith-Based transitional housing serving the homeless population, manageable mental health clients, refugees, victims of domestic violence, and persons released from prisons and jails with nowhere to go."
	},
	{
		"addressLine1": "3119 Teodoro Drive",
		"city": "Grand Prairie",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75052",
		"name": "Edwards Housing",
		"organization": "Edwards Housing",
		"phone": "(817) 404-7733",
		"website": "https://www.edwardshousing-inc.org/",
		"description": ""
	},
	{
		"addressLine1": "500 E. 7th Street",
		"city": "Austin",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78701",
		"name": "Austin Resource Center for the Homeless - ARCH",
		"organization": "Austin Resource Center for the Homeless - ARCH",
		"phone": "(512) 305-4100",
		"website": "http://www.frontsteps.org/",
		"description": "The Austin Resource Center for the\nHomeless (ARCH) serves as the first point of entry into the homeless\nsocial service system for many of Austins adults experiencing\n\nhomelessness. It offers 24 hours a day, 7 days a week resources and services to end homelessness.\n\nThe ARCH doors are open to everyone, whether it is their\nfirst time being homeless, or they have been living on the streets for\n\nyears. The ARCH is designed to assess client needs, provide information\non how and where to access services, and meet the basic emergency needs\nof homeless adults.\n\n\nBasic shelter services provided on a daily basis:RestroomsShowersLockersLaundryInternet AccessMail Pickup\nAdditional Services:- Aclinic that provides health care and specialized services to meet basic needs- A large commercial kitchenand dinning room where homeless adults that are staying at the shelter can get nightly meals- Sleeping areas for homeless\n\npeople to rest, day or night, and a Day Resource Center to get out of\nthe elements during the day\n\n"
	},
	{
		"addressLine1": "4613 Tannehill Ln, Bldg 3",
		"city": "Austin",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78721",
		"name": "Austin Shelter for Women and Children - The Salvation Army",
		"organization": "Austin Shelter for Women and Children - The Salvation Army",
		"phone": "(512) 933-0600",
		"website": "http://salvationarmyaustin.org/austin-shelter-for-women-and-children/",
		"description": "Provides shelter to Homeless Women and Children.\n\nOnly women and children (boys up to the age of 17)\nOpen everyday\n90-day stay period (transitional)\nHave kitchen services, serve breakfast, lunch, and dinner\nMail services available once you are a resident\n"
	},
	{
		"addressLine1": "821 Gunter",
		"city": "Austin",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78702",
		"name": "Casa Marianella",
		"organization": "Casa Marianella",
		"phone": "(512) 385-5571",
		"website": "https://www.casamarianella.org/",
		"description": "Provide emergency shelter and support to homeless immigrant women and their children.\n\n\nShelter mainly for immigrants, but also an emergency shelter\nMostly single men and women with no children\nPosada Esperanza shelter for women with children\nBreakfast and lunch prepared by residents, dinner provided by shelter staff\nMail services available to residents\nStorage of medication is allowed\nFinancial assistance available for residents. If homeless and working, no assistance will be provided for co-pay. If homeless and unemployed, a case manager might be able to help with co-pay, depending on available funds.\nAdult House\n\nCasa Marianella is an emergency homeless shelter that has served recently-arrived men and women immigrants, asylum seekers, and asylees since 1986 in East Austin. Casa Marianellas Adult House has 35 spaces for single men and women in need. The length of stay ranges from a few days to a few months.\n\nCasa offers a wide array of services, including:\n\nEmergency shelter: a bed, a hot shower, laundry, etc.\nHot meals\nMens and Womens clothing\nAccess to computers\nCase Management for everyone who stays at Casa\n\nIn addition to these services, Casa Marianella is home to a Community Center, where we provide access to:\n\n\nEnglish as a Second Language Classes: Free of charge, volunteer-run. Monday through Thursday night from 7:30-9pm.\nCasa Marianella Immigration Legal Services Center: Free legal support for Casa residents\nOriental Medicine Clinic: low-cost or free treatments including natural supplements, massage, and acupuncture. Mondays and Fridays by appointment.\n\n\nCasa shelters an average of 200 individuals annually as well as providing assistance and services to thousands of community members.\n\nOur goal is to not only connect our residents with resources and services in the community but to help them on the path towards self-sufficiency and independence as they start their new lives in the United States.\nPosada Esperanza\n\nPosada Esperanza is the family shelter of Casa Marianella. We are a full-service transitional housing program for immigrant mothers and their children, escaping domestic or cultural violence. Occupying four homes in East Austin, we currently house 14 mothers and nearly 30 children!\n"
	},
	{
		"addressLine1": "8505 Cross Park Dr. Suite 120",
		"city": "Austin",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78755",
		"name": "Foundation For Homeless Austin",
		"organization": "Foundation For Homeless Austin",
		"phone": "(512) 453-6570",
		"website": "http://www.foundationhomeless.org/",
		"description": "Provides: 30 - 90 day transitional center.\nFamilies with children ages up to 17 years old.\n\nNot an emergency shelter- must call and complete a pre-screening by phone. Then you must set up an appointment to fill out an application. If you are approved to stay you will be called back. Otherwise, you may be put on a waitlist if the shelter is full"
	},
	{
		"addressLine1": "1011 Gattis School Rd #110",
		"city": "Round Rock",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78664",
		"name": "Hope Alliance Women's Shelter",
		"organization": "Hope Alliance Women's Shelter",
		"phone": "(512) 255-1212",
		"website": "https://www.hopealliancetx.org/",
		"description": "Hope Alliance operates under the belief that physical, sexual, emotional and psychological abuse of one human being by another is unacceptable. We believe that all abuse diminishes or prohibits the full expression of life and growth that is every person's right.\n\n\n\nOur primary objectives are to:\n\n- Advocate for the creation of an environment where violence and abuse are not tolerated in the community.\n\n- Provide education, violence prevention services and crisis intervention to victims of family and sexual violence.\n\n\n- Seek the support and resources necessary to achieve the agency mission.\nEmergency Shelter\nThe emergency shelter has a maximum 30 day stay and can house up to 35 adults and children. Within 24 hours of a victim entering into the shelter, she will be assigned a case manager who will meet with her weekly. At that first meeting, the resident and case manager will work collaboratively to develop a list of line items and goals that that individual resident hopes to achieve while in shelter. These goals can be both short and long term goals.\n\nThe residents also can meet with a legal advocate and a crisis counselor, if needed.\n\nInformation\nResidents have access to a clothing closet, basic toiletries (shampoos, soap, lotions, razors, hair products, etc.) and a plethora of food items for meals and snacks.\n\nWe encourage the future residents to bring any personal items with them.\n\n\nThe shelter is an undisclosed location, and privacy and confidentiality and of course safety is this teams top priority.\n\nUnfortunately, the shelter typically has a waiting list of victims needing shelter.\n\n"
	},
	{
		"addressLine1": "14435 FM 730 No.",
		"city": "Azle",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76020",
		"name": "Green Light Ministries Brother to Brother",
		"organization": "Green Light Ministries Brother to Brother",
		"phone": "(817) 444-4442",
		"website": "mailto:dalassandri@greenlightministries.org",
		"description": "The Brother to Brother program provides for all the basic needs of a homeless man (from 15 - 70), food, clothing, and shelter. But more importantly assists the individual in finding his true purpose and gifts to bring to the world by Spiritual development then job training and search. The courses taught are: Anger Management, Finding Your Spiritual Gifts, AA/NA 12 Step programs, and individual counseling and mentoring as needed. The goal for our organization is to help each person find; Salvation,a home, a job, a car, money in the bank, and childcare if needed."
	},
	{
		"addressLine1": "512 W. 4th St.",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76102",
		"name": "Fort Worth YWCA Temporary Shelter For Women",
		"organization": "Fort Worth YWCA Temporary Shelter For Women",
		"phone": "(817) 332-6191",
		"website": "http://www.ywcafortworth.org/",
		"description": "Temporary emergency shelter for single female only."
	},
	{
		"addressLine1": "2805 4th St",
		"city": "Bay City",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77404",
		"name": "Matagorda County Women's Crisis Center",
		"organization": "Matagorda County Women's Crisis Center",
		"phone": "(979) 245-9109",
		"website": "https://crisiscnt.com/",
		"description": "The Crisis Center provides services to victims of domestic violence and/or sexual assault. Our goal is to help these victims achieve safety, self-sufficiency and a life free from violence by providing intervention services. The Crisis Centeris a community-based, volunteer supported program that provides shelter and support to victims of family violence and sexual assault in Matagorda and Wharton Counties."
	},
	{
		"addressLine1": "11614 FM 361",
		"city": "Richmond",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77469",
		"name": "Parks Youth Ranch",
		"organization": "Parks Youth Ranch",
		"phone": "(281) 392-5794",
		"website": "http://parksyouthranch.org/",
		"description": "Parks Youth Ranch is a non-profit 501(c)(3) organization serving abused and neglected youth by providing a safe, supportive, and structured environment.\n\nParks Youth Ranch provides a place of tranquility and recovery for children, ages 7-17, who have been displaced by family, or are in a state of crisis.\n\n\nRequests for placement may be emailed to intake@parksyouthranch.org or call our main line for information."
	},
	{
		"addressLine1": "3406 Wisconsin Street",
		"city": "Baytown",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77520",
		"name": "Bay Area Homeless Services",
		"organization": "Bay Area Homeless Services",
		"phone": "(281) 837-1654",
		"website": "https://bahs-shelter.org/",
		"description": "Our staff members are available to take your phone calls 24 hours a day, 7 days a week. However, we accept new clients only from 9AM until 4PM.\nEmergency Shelter ServicesBAHS provides emergency homeless shelter services for low-income clients in the East Harris County, Baytown, Liberty County & Chambers County area. A safe, secure, drug/alcohol-free community geared to promoting employment opportunities. We are a weapon-free campus with strict rules prohibiting violence, bullying, physical or verbal harassment and disruption.\n\nBritton-Fuller Family Center\nBay Area Homeless Services provides housing and intensive case management services to intact homeless families who require supportive services in order to transition into more permanent housing within the community. The Britton-Fuller Family Center has six apartment style rooms for families; eligibility can be determined by calling the BAHS main office at 281-837-1654. There may be a waiting list for these services."
	},
	{
		"addressLine1": "201 S. First Street",
		"city": "Galveston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77550",
		"name": "Alcohol Drug Abuse Women's Center",
		"organization": "Alcohol Drug Abuse Women's Center",
		"phone": "(409) 763-5516",
		"website": "https://adawomenscenter.org/",
		"description": "ADA Women's Center offers licensed residential substance abuse treatment for indigent women in Galveston and Brazoria Counties along coastal Texas.\nThe Alcohol and Drug (ADA) Womens Center centers offer the highest quality services for women with or without medical insurance. We can offer self-fund options, access to income-eligible public funding options and private insurance options. Dont let the cost of treatment keep you from getting the help you need. Generous community support allows us to provide services to women who cannot afford rehabilitative treatment. Contact us today to see how ADA can help you.\n"
	},
	{
		"addressLine1": "5670 Concord Rd.",
		"city": "Beaumont",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77708",
		"name": "Franklin House Women & Children Facility",
		"organization": "Franklin House Women & Children Facility",
		"phone": "(409) 896-5911",
		"website": "http://www.landmanor.org/",
		"description": ""
	},
	{
		"addressLine1": "2509 Cable Ave.",
		"city": "Beaumont",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77703",
		"name": "The How Center",
		"organization": "The How Center",
		"phone": "(409) 832-7102",
		"website": "https://thehowcenter.org/",
		"description": "Sober Living Home\nProvides a safe and structured living environment for individuals recovering from addiction while they gain the skills they need to live independently and successfully. Men completing treatment for an addiction, men being released from incarceration, men living on the streets or anyone enduring a life-altering event are appropriate for residency."
	},
	{
		"addressLine1": "2350 Interstate 10 E",
		"city": "Beaumont",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77703",
		"name": "Salvation Army Emergency Shelter Beaumont TX",
		"organization": "Salvation Army Emergency Shelter Beaumont TX",
		"phone": "(409) 896-2361",
		"website": "https://www.salvationarmytexas.org/beaumont/",
		"description": "The emergency shelter is an overnight shelter for those in need. Doors open at 5 PM and dinner is served until 5:30 PM. After dinner you register for the night. The shelter closes for the day at 7:30 AM. There are multiple AA meetings throughout the week as well as religious counseling.\n\nThe first 3 nights are free and it is $10 a night after that.\n\n\nThe Salvation Army in Beaumont, TX also has a Social Service Center that can assist with emergency rental and utility assistance, clothing, food, and medication.\n\nAlso if you have items you wish to donate, we take donations of all types at the warehouse beside our Social Service Center and can arrange a pick-up at your location for larger items like furniture and appliances.\nTransitional Shelter\nThe Transitional Shelter Program is a 1-6 month program that helps individuals work towards key objectives that allow them to become self-sufficient. While these people work towards these objectives, we provide them with support to meet basic needs, including meals and shelter.\n\nHome Sweet Home Transitional Housing\nThe Transitional Housing Program is a 6-month to 2-year program that provides housing and support services to individuals desiring to rise above poverty and to eliminate the constant threat of homelessness.\n\nSocial Services\nClients receive aid including: clothing and food vouchers; financial assistance for utility bills, rent/mortgage payments, bus tokens, and prescriptions.\n\nSoup Kitchen\nThe Salvation Army provides breakfast and dinner, 365 days per year, to non-sheltered and low income individuals in the Beaumont community."
	},
	{
		"addressLine1": "3964 FM 1131 RD",
		"city": "Buna",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77612",
		"name": "Armour Outreach Ministries",
		"organization": "Armour Outreach Ministries",
		"phone": "(409) 223-3455",
		"website": "http://www.armouroutreach.com/",
		"description": "Helping those in need of shelter, Men, Women, and Children.\n\nArmour Outreach is a Apostolic Outreach Ministry seeking to lead all people into a dynamic relationship with God. Our Ministry includes but not limited to, Street, Jail, Prison, One on One, Family, Group Counseling, Home Bible Studies and Online Sermons. Thank you for visiting our site, I'm sure you will find hope and understanding for any questions and concerns that you may have. If you are in need of prayer or someone to talk with we are here for you."
	},
	{
		"addressLine1": "900 6th St",
		"city": "Port Arthur",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77640",
		"name": "Port Cities Rescue Mission",
		"organization": "Port Cities Rescue Mission",
		"phone": "(409) 982-0202",
		"website": "https://www.facebook.com/pages/Port-Cities-Rescue-Mission/134874783229783",
		"description": ""
	},
	{
		"addressLine1": "531 Atlanta",
		"city": "Port Arthur",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77640",
		"name": "Lazarus Recovery Project for Single Women",
		"organization": "Lazarus Recovery Project for Single Women",
		"phone": "(409) 982-9975",
		"website": "",
		"description": "The Women's Shelter provides emergency and transitional housing opportunities for up to 13 single women."
	},
	{
		"addressLine1": "204 N East St",
		"city": "Belton",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76513",
		"name": "Option House Youth Emergency Shelter",
		"organization": "Option House Youth Emergency Shelter",
		"phone": "(800) 421-8336",
		"website": "https://www.centraltexasyouthservices.com/programs",
		"description": "Provides a licensed Emergency Shelter and Assessment Center available to any child 3 - 17 years old. Services include immediate protection, food, shelter, and clothing; counseling and independent living skills; school-based education; access to transitional living. Every effort is made to return child to stable family whenever possible. 15 bed shelter."
	},
	{
		"addressLine1": "707 South 11th",
		"city": "Temple",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76504",
		"name": "Reaching Out Crisis Ministries",
		"organization": "Reaching Out Crisis Ministries",
		"phone": "(254) 716-5728",
		"website": "http://www.reachingoutcrisisministries.org/",
		"description": "Reaching Out Crisis Ministries (ROCM)is a Christ centered non-profit six-month residential program designed to help women that are struggling with substance abuse and/or life-centered problems. We offer women a faith-based supportive and structured environment that focuses on accountability and successful reentry into the community.\n\nReaching Out Crisis Ministries envisions relationship restoration and reconciliation for women who enter our program; first with Christ and second with family. The vision of ROCM is to help women realize they can be God-sufficient, spiritually strong, and serviceable in His kingdom."
	},
	{
		"addressLine1": "1018 East Ave A",
		"city": "Temple ",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76501",
		"name": "Family Promise of East Bell County",
		"organization": "Family Promise of East Bell County",
		"phone": "(254) 773-9980",
		"website": "https://familypromisebellcounty.org/",
		"description": ""
	},
	{
		"addressLine1": "500 E. Academy",
		"city": "Brenham",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77833",
		"name": "Faith Mission and Help Center",
		"organization": "Faith Mission and Help Center",
		"phone": "(979) 830-1488",
		"website": "https://faithmission.us/",
		"description": ""
	},
	{
		"addressLine1": "2505 S. College",
		"city": "Bryan",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77801",
		"name": "Twin City Mission, Inc.",
		"organization": "Twin City Mission, Inc.",
		"phone": "(979) 822-7511",
		"website": "https://www.twincitymission.org/",
		"description": "The Doug Weedon Shelter for Hope\nThe Doug Weedon Shelter for Hope is the anchor of the Homeless Services arm of Twin City Mission and was the original focus of the mission at its inception in 1963.\n\nThe shelter provides emergency housing for any man, woman or family regardless of their race, gender, ethnicity or religion. Our staff works hard to identify each individual's needs and formulate a plan to get each one into more permanent housing.\n\n\nOur Shelter staff seeks to restore a person's health (mental and physical), rebuild a sense of dignity and prepare them to meet the challenges that they will face when they leave the shelter.\n\n\nOur Shelter is there for those who have few options, to provide for the most basic needs; food, shelter, laundry supplies and personal hygiene products.\n\n\nThe Community Closet\nProvides clothes and/or household items (when available) to individuals and families in the community at no charge to assist them in gaining and/or maintaining self-sufficiency.\n\nThe Community Closet is located at 418 N. Bryan Street, at the corner of Bryan and 22nd streets in downtown Bryan. The Closet is open Monday, Wednesday and Friday mornings from 8:00 am to 11:00 am.\n\nThe Community Cafe\nFood is a source of comfort; good nutrition contributes to an individual's physical and mental health. We strive to provide the best food services that we can for our Shelter family and anyone in the community in need of a hot meal, Monday thru Friday at 12 noon OR 5:00 pm (community members can eat one meal a day at no cost, either lunch or dinner).\n\nThe Community Cafe is located at 410 S Randolph Ave, Bryan, TX 77803.\n\nRapid Re-Housing Program\nThe Rapid Re-Housing program utilizes the HUD \"Housing First Model\" and the \"Opening Doors\" initiative to those experiencing homelessness. This is a federal strategy to end homelessness using low-barrier methods to end Chronic Homelessness. The Rapid Re-Housing program strives to achieve:\n\nShorter Shelter stays.\nHousing for those on the streets, sleeping in their cars or in parks.\nShort-term rental assistance to get those chronically homeless, back on their feet.\nProvides housing assistance to Veteran families.\nProvides housing to victims of domestic violence.\nCase management, food, eye/dental assistance, education assistance and work attire is available for those in the Rapid Re-Housing program."
	},
	{
		"addressLine1": "1806 Wilde Oak Circle",
		"city": "Bryan",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77802",
		"name": "Family Promise of Bryan Family Housing",
		"organization": "Family Promise of Bryan Family Housing",
		"phone": "(979) 268-4309",
		"website": "http://www.familypromisebcs.org/",
		"description": "Family Promise accepts families with children who are living on the street, in a shelter, tent, shed, or living double/triple with other families. The program provides overnight shelter, three meals per day, transportation to night shelter and to day center, and case management services. Families are assisted with goals to gain employment and permanent housing."
	},
	{
		"addressLine1": "1700 Groesbeck",
		"city": "Bryan",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77803",
		"name": "Save Our Streets Ministries For Men",
		"organization": "Save Our Streets Ministries For Men",
		"phone": "(979) 775-5357",
		"website": "https://www.twitter.com/sosministries93",
		"description": "Residential facility for men, offering Bible study, emotional, spiritual, and rehabilitation. Call for appointment, Hours: Mon - Fri 9:00 am - 5:00 pm"
	},
	{
		"addressLine1": "410 South Randolph Avenue",
		"city": "Bryan",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77803",
		"name": "Twin City Mission - Doug Weedon Shelter for Hope",
		"organization": "Twin City Mission - Doug Weedon Shelter for Hope",
		"phone": "(979) 822-1492",
		"website": "https://www.twincitymission.org/",
		"description": ""
	},
	{
		"addressLine1": "408 E. 24th Street",
		"city": "College Station",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77803",
		"name": "Emmanuel Lighthouse Mission",
		"organization": "Emmanuel Lighthouse Mission",
		"phone": "(979) 822-0441",
		"website": "https://www.ebcbryan.org/elm",
		"description": "Transitional Shelter for homeless women. Faith-based program for rebuilding lives. Any woman wishing to apply may call office for more information.\nThe ELM program provides a safe, drug and alcohol free environment for homeless women seeking to be set free from the chains of harmful addiction or in need of a safe place to birth their child. Through the ELM program, these women are introduced to the biblical view of Christianity and the love found in the local body of Christ.\n"
	},
	{
		"addressLine1": "408 East 24th Street",
		"city": "Bryan",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77803",
		"name": "Emmanuel Lighthouse Mission Bryan Transitional Housing Women",
		"organization": "Emmanuel Lighthouse Mission Bryan Transitional Housing Women",
		"phone": "(979) 822-0441",
		"website": "",
		"description": "Emmanuel Lighthouse Mission (ELM) provides transitional housing for homeless women. An interview process is required. Call to set up an interview."
	},
	{
		"addressLine1": "95 E Price Rd",
		"city": "Brownsville",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78521",
		"name": "Friendship of Women",
		"organization": "Friendship of Women",
		"phone": "(956) 544-7412",
		"website": "http://www.fowinc.com/",
		"description": "Long term emergency housing for womens who are victims of domestic violence.\nEmergency Shelter\nFOW's emergency shelter serves as a safe haven for women and children fleeing an abusive or unhealthy relationship or following a sexual assault victimization. As part of the emergency shelter services, all clients will be helped with food, clothing, and a confidential safe place. Individualized case management and advocacy is provided by trained staff to provide support through crisis intervention, peer support groups, counseling, child services, and emergency transportation.\n   \nFOW's Community Outreach Center\nMen, women, and their children experiencing a crisis as a result of domestic violence or sexual assault can seek services by visiting our Community Center.  We provide individualized services focused on healing and empowerment.\n"
	},
	{
		"addressLine1": "656 N Minnesota Ave",
		"city": "Brownsville",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78521",
		"name": "Ozanam Center Brownsville",
		"organization": "Ozanam Center Brownsville",
		"phone": "(956) 831-6331",
		"website": "http://www.ozanambrownsvillecenter.org/",
		"description": ""
	},
	{
		"addressLine1": "1254 E Tyler St",
		"city": "Brownsville",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78520",
		"name": "Good Neighbor Settlement House",
		"organization": "Good Neighbor Settlement House",
		"phone": "(956) 542-2368",
		"website": "https://www.goodneighborsettlementhouseinc.org/",
		"description": "Office Hours: Monday - Friday 8am to 6pm\nSaturday\nBreakfast: 7:30 to 8:30 a.m.\nDinner: 5:00 to 6:00 p.m.\n\nEmergency food pantry\nAfter-Hours Transportation Program to Ozanam Center\n\nShowers: 7:30 - 9:00 a.m.\n\nClothing Voucher: 7:30 - 9:00 a.m.\n\nList of Services:\nCommunication Services\nUse of Mailing Address\nPhone Service\nCopies\nTranslation Assistance\nFax"
	},
	{
		"addressLine1": "30094 Marydale Road",
		"city": "San Benito",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78586",
		"name": "La Posada Providencia",
		"organization": "La Posada Providencia",
		"phone": "(956) 399-3826",
		"website": "https://lppshelter.org/",
		"description": "La Posada Providencia provides safe shelter to poor immigrants, asylees and asylum seekers in the lower Rio Grande Valley of Texas. In addition, we work with our clients to help them integrate more quickly into United States culture. We make every effort to meet all the needs of our clients a very vulnerable group of people. They often arrive at La Posada with very few possessions, limited or no English and no friends or family to help them.\n\nOur comprehensive services include:\n\n    Shelter.\n    Food. Meals are prepared and enjoyed in a family atmosphere.\n    English as a Second Language (ESL) classes\n    Transportation. Language barriers and social inexperience make public transportation too difficult for newcomers to the United States, so we provide door-to-door transportation to doctors, dentists and lawyers offices, the Social Security office, Immigration, etc.\n    Life-skills classes.\n    Access to communications, computers, the Internet, email, etc.\n    Individualized case management. We work with each client to ensure they get the necessary legal aid, health care, social services and other relocation assistance.\n\n    Cultural integration. We help clients become familiar with the values, customs and social practices typical in the United States, including U.S. currency and coins, personal finance, employment practices, etc.\n    Emotional support. Many of our clients have experienced severe hardships. Our staff offer compassionate listening, guidance and mentoring.\n\n    School Enrollment. When we have long-term stay families with school-aged children, La Posada assists the families in enrolling the children in school, scheduling medical appointments for required immunizations and medical exams, and purchasing clothes, shoes, backpacks and other school supplies needed by the children."
	},
	{
		"addressLine1": "514 S. E Street",
		"city": "Harlingen",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78550",
		"name": "Open Arms Homeless Shelter",
		"organization": "Open Arms Homeless Shelter",
		"phone": "(956) 423-1014",
		"website": "https://lfrgv.org/",
		"description": "The Open Arms Homeless Shelter provides temporary residence and assistance for homeless individuals and families. Facilities exist for men and women at the Loaves & Fishes shelters. Currently, we are able to house up to 80 residents. The shelter does not discriminate against race, ethnicity, gender, and religion. Tommy Martinez is the Director of the homeless shelter and the Family Emergency as a whole.\n\nEvery shelter resident is required to complete an intake application so they are encouraged to bring their identification and any documentation. The following day they are required to meet with a case manager to discuss their needs and agree on a plan. Preventing chronic homelessness is important. Shelter stay is free."
	},
	{
		"addressLine1": "616 W. Taylor",
		"city": "Harlingen",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78550",
		"name": "Family Crisis Center Inc",
		"organization": "Family Crisis Center Inc",
		"phone": "(956) 423-9305",
		"website": "https://www.familycrisisctr.org/",
		"description": "Office hours:\nMonday - Thursday 8:00-5:30 pm\nFriday 8:30-3:30 pm\nThe Family Crisis Center is a corporation organized to provide temporary shelter and sustenance for women and their children in times of domestic crisis; to provide educational and counseling services.\nThe Family Crisis Center, Inc. provides free and confidential services to Victims of Family Violence, and Adult & Child Victims of Stranger and Non-Stranger Sexual Assault in Northern Cameron County and all of Willacy County.\n\nServices include:\n\n    24 hour hotline\n    24 hour emergency shelter for victims and their children\n    24 hour crisis intervention\n    24 hour advocacy\n    24 hour hospital accompaniment\n    Transportation to a safe place\n    Counseling services\n    Legal Advocacy\n        Law enforcement\n        Protective orders\n        Court accompaniment\n    Educational programs for schools and community/professional groups\n\nAll services are available by appointment or walk-in basis. Contact us today.\n"
	},
	{
		"addressLine1": "5899 Highway 3112",
		"city": "Vinton",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "00000",
		"name": "City of Refuge",
		"organization": "City of Refuge",
		"phone": "(337) 589-4407",
		"website": "https://www.facebook.com/ACityofRefuge/",
		"description": ""
	},
	{
		"addressLine1": "673 West College st",
		"city": "Canton",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75103",
		"name": "Arise Church of Canton - Homeless Outreach",
		"organization": "Arise Church of Canton - Homeless Outreach",
		"phone": "(903) 502-4488",
		"website": "https://arisechurchofcanto.wixsite.com/kingdom",
		"description": ""
	},
	{
		"addressLine1": "2675 North State Highway 34",
		"city": "Kaufman",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75142",
		"name": "Genesis Center Battered Women's Shelter",
		"organization": "Genesis Center Battered Women's Shelter",
		"phone": "(972) 932-4351",
		"website": "https://www.genesiscenter.org/",
		"description": "Genesis Center Battered Women's Shelter provides shelter, food, clothing and life skills for women and children who are victims of domestic violence, alcohol and drug abuse, probation or general homelessness.\n\nHours of operation: Mon-Fri 8:30am-5:00pm."
	},
	{
		"addressLine1": "800 West Belt Line Rd",
		"city": "Cedar Hill",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75106",
		"name": "Bridges Family Resource Center",
		"organization": "Bridges Family Resource Center",
		"phone": "469-264-4416",
		"website": "https://bridgescanhelp.org/",
		"description": "We offer short term housing and supportive services to homeless pregnant women and women with children in crisis. Our goal is to empower and equip women and families to start taking steps to lifetime change."
	},
	{
		"addressLine1": "805 Washington",
		"city": "Clarksville",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75426",
		"name": "Clarksville Shelter",
		"organization": "Clarksville Shelter",
		"phone": "(318) 655-2297",
		"website": "https://www.facebook.com/Clarksville-animal-shelter-102889087912014/",
		"description": "Call or text anytime! We are here to provide shelter for you and your family if you are in need. We also provide a program that is designed to get you on your feet again."
	},
	{
		"addressLine1": "450 SW 4th St Suite 310",
		"city": "Paris",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75460",
		"name": "New Hope Center of Paris",
		"organization": "New Hope Center of Paris",
		"phone": "(903) 783-0353",
		"website": "http://www.newhopecenterparis.org/",
		"description": "New Hope Center's mission is to provide a home of hope and direction for those who find themselves in life altering circumstances from either poor choices or life situations beyond their control. We strive to instill self-respect and dignity by ministering to the whole person: emotionally, intellectually and spiritually.\n\nIn addition to meeting the basic needs of food and shelter, the emphasis of the Transitional or long-term program has been on implementing individualized programming that addresses the issues that led each resident to homelessness.\n\n\nSeveral days after settling in at the shelter, a new resident is interviewed by the shelter team.\nWe assess each one's strengths, needs and insight into their particular situation.\nNHC Case Management staff creates 'schedule' of activities that provides meaningful input into return to successful, independent living.\n\n\nWe also assist with Social Security, food stamp and Medicaid referrals and getting medications and birth certificates.  Our case manager coordinates with all service agencies like MHMR, STAR, Paris Counseling or Health and Human Services.  Children are referred for counseling if needed, and all parents are expected to attend parenting classes.  Because we are a faith-based program, residents are expected to participate in morning devotionals and at least one church service of their choice a week."
	},
	{
		"addressLine1": "615 9th Street Southwest",
		"city": "Paris",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75460",
		"name": "Shelter Agencies For Familes in Paris Texas",
		"organization": "Shelter Agencies For Familes in Paris Texas",
		"phone": "(903) 783-1313",
		"website": "http://www.safe-tagency.com/",
		"description": "24 Hour Hotline: (903) 575-9999\n\nProvides shelter and help for victims of family violence and sexual assault. Males under 17 years old accepted. Walk in's welcome. Shelter for abused children, domestic violence, battered women.\n\nRESIDENTIAL SERVICES\nShelter\nVictim Assistance\nHousing Assistance\nCounseling & Group Advocacy\nLegal Advocacy\nChildren's Advocacy\n\nOutreach Services\n24 Hour Crisis Hotline\nCounseling and Support Groups\nCrime Victim Assistance\nRape Crisis Intervention\nAccompaniment to Court\nLegal Assistance\nEducational Programs and Professional Trainings\nWomen's Support Group and Men's Support Group\nHousing Assistance\nVAWA and UVISA Immigration services"
	},
	{
		"addressLine1": "660 County Rd 903",
		"city": "Cleburne",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76033",
		"name": "Johnson County Family Crisis Center",
		"organization": "Johnson County Family Crisis Center",
		"phone": "(817) 558-7171",
		"website": "https://www.familycrisisjc.org/",
		"description": ""
	},
	{
		"addressLine1": "3712 Wichita St,",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76119",
		"name": "ACH Child and Family Services",
		"organization": "ACH Child and Family Services",
		"phone": "(817) 335-4673",
		"website": "https://achservices.org/",
		"description": "Emergency Youth Shelter. No ID/TB card required."
	},
	{
		"addressLine1": "301 Avenue E",
		"city": "Conroe",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77301",
		"name": "Salvation Army Wayne Bergstrom Center of Hope",
		"organization": "Salvation Army Wayne Bergstrom Center of Hope",
		"phone": "(936) 760-2440",
		"website": "http://salvationarmyhouston.org/conroe/",
		"description": ""
	},
	{
		"addressLine1": "4501 N. Frazier",
		"city": "Conroe",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77303",
		"name": "BridgeWay Youth Shelter - Montgomery County Youth Services",
		"organization": "BridgeWay Youth Shelter - Montgomery County Youth Services",
		"phone": "(936) 890-1132",
		"website": "https://www.sayyestoyouth.org/",
		"description": "BridgeWay Youth Shelter is a 13 bed coed facility offering emergency shelter for youth ages 10-17 who need temporary (up to 90 days) housing due to extreme family conflict, abuse and/or neglect or who are runaway and homeless."
	},
	{
		"addressLine1": "4495 N. Frazier",
		"city": "Conroe",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77303",
		"name": "The Fairway Home - Montgomery County Youth Services",
		"organization": "The Fairway Home - Montgomery County Youth Services",
		"phone": "(936) 856-8015",
		"website": "",
		"description": "Co-ed, 8-bed facility offering up to an 18-month transitional living program for youth, ages 16 19. The mission of the Fairway Home is to empower youth to build on their successes to gain skills necessary to make healthy life choices and become independent."
	},
	{
		"addressLine1": "1022 Mccall Ave",
		"city": "Conroe",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77301",
		"name": "Crisis Assistance Center",
		"organization": "Crisis Assistance Center",
		"phone": "(936) 539-1096",
		"website": "https://www.cac-mctx.org/",
		"description": "Business 936.539.1096\nAppointment 936.539.9211\n"
	},
	{
		"addressLine1": "1401 Airport Rd",
		"city": "Conroe",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77301",
		"name": "Montgomery County Women's Center Conroe",
		"organization": "Montgomery County Women's Center Conroe",
		"phone": "(936) 441-4044",
		"website": "http://www.mcwcthewoodlands.org/",
		"description": "24 Hour Crisis Hotline 936-441-7273\n\nThe Montgomery County Women's Center provides safe shelter, crisis intervention, counseling, legal and support services to victims/survivors of family violence, sexual assault, stalking and abuse in Montgomery and surrounding counties and provides education about such issues.\n\nServices:\nResidential programs including emergency shelter and transitional housing\nCommunity educational outreach;Legal services\nSexual assault and counseling program."
	},
	{
		"addressLine1": "1600 Lake Front Circle, Suite 100",
		"city": "The Woodlands",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77387",
		"name": "Montgomery County Women's Center",
		"organization": "Montgomery County Women's Center",
		"phone": "936-441-4044",
		"website": "https://mcwctx.org/",
		"description": "24 hour crisis hotline: 936-441-7273\n\nEmergency Domestic Violence Women and Children.\n\nMCWC provides emergency shelter to abused women and children along with individual counseling, legal advocacy, support groups, education and childcare while they begin their healing process and seek employment. Food, clothing, limited medical treatment, and personal care items are also provided. Shelter services are available for a maximum of 45 days with two-week extension if there is an expectation of permanent or transitional housing. Call for shelter access. They also offer a transitional housing option called Reaching Pines for those who qualify (must be employed for at least one month, be free of addiction, pay rent based on a sliding scale, attend meetings with case managers, have their own transportation)."
	},
	{
		"addressLine1": "8555 E. Loop 1604 North Converse, Texas 78109",
		"city": "Converse",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78109",
		"name": "Boysville TX - Texas Home For Boys and Girls",
		"organization": "Boysville TX - Texas Home For Boys and Girls",
		"phone": "(210) 659-1901",
		"website": "https://www.boysvilletexas.org/",
		"description": "Boysville is a home for boys and girls, ranging in age from newborn to 18 years, who cannot remain in their home due to abuse, abandonment, neglect, poverty or family crisis. Most children are placed by the Texas Department of Family and Protective Services. As Boysville continues to accept private placements, others are referred by a parent or guardian. Some children are referred by another family member, teacher, counselor or pastor."
	},
	{
		"addressLine1": "7911 Broadway",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78209",
		"name": "Family Violence Prevention Services Inc.",
		"organization": "Family Violence Prevention Services Inc.",
		"phone": "(210) 733-8810",
		"website": "https://fvps.org/",
		"description": "FVPS is able to offer residential and non-residential clients shelter, transitional housing, counseling for adults, children, families, and legal services. These services help individuals and families recover from the pain and longer-term effects of domestic violence\n\n24 Hour Emergency Shelter Services\n\nLegal Assistance\n\nViolence Intervention Program (VIP)\n\nNon-Residential Services\n"
	},
	{
		"addressLine1": "P.O. Box 692041",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78269",
		"name": "Magdalena House",
		"organization": "Magdalena House",
		"phone": "(210) 561-0505",
		"website": "https://maghouse.org/",
		"description": "Magdalena House provides safe transitional housing for women with children escaping violence, survivors of human trafficking, young mothers\n\nMagdalena House is not used as an emergency shelter.\n"
	},
	{
		"addressLine1": "626 Nolan St",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78202",
		"name": "Catholic Worker House Day Shelter",
		"organization": "Catholic Worker House Day Shelter",
		"phone": "(210) 224-7736",
		"website": "http://www.sa-catholicworker.org/",
		"description": "We are a day shelter our Hours are Mondays thru Thursdays from 7:00am to 7:00pm and Fridays from 8:00am to 12:30pm and supper is a bag lunch (at 5:30pm) We are not open on weekends ...,\nWe provide breakfast; coffee and pastry, hot meal at lunch (for our Lunch Bunch Members) and a supper truck that comes Mondays thru Thursdays between 5:00pm and 6:00pm, you don't need your Catholic Worker Lunch Bunch Membership card for the supper truck out in the back yard.\n\n\nYou can become a member by being here at Catholic Worker House  on Tuesdays at 11.00 am Sharp, no late comers, it is a 25 minute orientation, and it costs $1 dollar, but if you don't have a dollar she will provide you with one to use for sign up......\n \nWe also have mail services, laundry (single load), internet (for people with computers, or tablets or phones... and phone service  (local and long distance), and hygiene supplies as well.."
	},
	{
		"addressLine1": "414 North Hackberry Street",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78202",
		"name": "Strong Foundation Emergency and Transitional Housing",
		"organization": "Strong Foundation Emergency and Transitional Housing",
		"phone": "210-641-4357",
		"website": "https://strongfoundation.org/",
		"description": "Offers emergency and transitional housing for families with children. Beds for single women also available.\n\nMust be homeless; families with children; zero tolerance for alcohol and drugs\n\nFees: Call for information\n\nIntake Process: Call for information and appointment.\n\nSTRONG FOUNDATION MINISTRIES is not an emergency shelter. We are a Christian Ministry that houses families with children, single mothers, and single women who are serious about getting their life back on track. We teach our residents: how to grow their Spiritual life, teach them life skills, offer Pastoral counseling, provide a weekly \"Celebrate Recovery,\" help our residents get a job. We have a zero-tolerance policy regarding drugs, alcohol, and violence."
	},
	{
		"addressLine1": "907 E. Quincy",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78215",
		"name": "San Antonio Rescue Mission",
		"organization": "San Antonio Rescue Mission",
		"phone": "(210) 222-9736",
		"website": "http://sarescuemission.org/",
		"description": "Shelter\nThe San Antonio Rescue Mission dormitory houses up to 40 men in clean bunk beds.    All bed linens are washed, dried and replaced on each bed every day.   Our dormitory building which was completed in 2005 consists of the sleeping area (shown in the photograph), dining area, kitchen, showers and bathroom facilities,  laundry room and two staff quarters.\n\nFood\nA hot meal is served each evening to our guests. Our dining room (shown in the photos) can serve up to 40 men. The evening meal is prepared by SARM staff and served at the completion of the worship service (around 8:00 PM). In addition, a light breakfast (pastry, juice and coffee) is served to the men as they depart the mission each morning. The Mission obtains its food through donations by individuals, companies and churches and by spot purchasing. Our kitchen is well equipped, city approved and includes oven, gas range, microwave, large refrigerator, walk-in freezer, and high speed dishwasher."
	},
	{
		"addressLine1": "5254 Blanco Road",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78216",
		"name": "SAMMinistries Transitional Living and Learning Center",
		"organization": "SAMMinistries Transitional Living and Learning Center",
		"phone": "(210) 340-0302",
		"website": "https://www.samm.org/",
		"description": "SAMMinistries prevents homelessness in San Antonio through a compassionate, holistic approach that brings self sufficiency, pride and dignity to struggling families with no where else to turn.\n\nSAMMinistries is an interfaith ministry that helps the homeless and those at risk of becoming homeless attain self-sufficiency by offering shelter, housing, and services."
	},
	{
		"addressLine1": "226 Nolan Street",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78202",
		"name": "The Salvation Army Dave Coy Shelter for Men",
		"organization": "The Salvation Army Dave Coy Shelter for Men",
		"phone": "(210) 226-2291",
		"website": "http://www.salvationarmysanantonio.org/dave-coy-shelter-men/",
		"description": ""
	},
	{
		"addressLine1": "519 W Elmira St",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78212",
		"name": "Salvation Army Family Shelter W. Elmira",
		"organization": "Salvation Army Family Shelter W. Elmira",
		"phone": "(210) 352-2000",
		"website": "https://www.facebook.com/SalvationArmyUSA",
		"description": "Provides emergency shelter for women and single parents with children and intact families. Provides intake assessment, daily case management, parenting and life skills, and a clean facility with launderette. Shelter for 10 days, 3 meals a day.\n\nEligibility: Must be 18 years of age or older.\n\nFees: No fees.\n\nIntake Process: 3:00 on weekdays; anytime on weekends; fill out intake card."
	},
	{
		"addressLine1": "945 W. Huisache",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78201",
		"name": "Visitation House",
		"organization": "Visitation House",
		"phone": "(210) 735-6910",
		"website": "https://visitationhouseministries.org/",
		"description": "Transitional housing for single women with children under age 12. Education is free for the children to bring them up as useful citizens.\nWomen who are participants in the housing program\n\nVisitation House is not an emergency shelter. Visitation House provides transitional housing and education which is more long term and includes an application and an interview process.\n\nOur programs are designed for single women with young children, not men.\n"
	},
	{
		"addressLine1": "1 Haven for Hope Way",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78207",
		"name": "Haven For Hope",
		"organization": "Haven For Hope",
		"phone": "(210) 220-2100",
		"website": "https://www.havenforhope.org/",
		"description": "Haven for Hope is a place of hope and new beginnings for people in Bexar County who are experiencing homelessness. It is made up of two major programs: the Courtyard and the Transformational Campus. Both are on the Haven for Hope property and require a visit to the Intake Department to get started. The Courtyard is a low-barrier, safe sleeping program that offers shelter and basic needs. The Transformational Campus is a center that offers services and shelter with an emphasis toward addressing the root causes of homelessness.\n\nIntake Building is located at 1 Haven for Hope Way\nIntake Hours: Monday through Friday 8am to 3pm.\n\nNew arrivals to Haven for Hopes Transformational Campus and the Courtyard are done on a walk-in basis.\n\n\nTo be eligible for our shelter and services you MUST:\n\n\n    Be homeless (Lacking a fixed, regular, and adequate nighttime residence), and have proof of homelessness (eviction notice, statement from family member/friend, motel/hotel receipts)\n    Be a resident of Bexar County with proof of residency for at least 9 months (Transformational Campus).\n    Proof of residency is a document that proves your status as a Bexar County resident; for example, tax documents, dated store receipts, library cards, pay stubs, hospital records, etc.\n    Have government issued photo ID (such as a drivers license, passport, military ID, Bexar County Mug Shot, or any state or federally issued photo ID) or be willing to obtain government issued photo ID within 30 days.\n\nPETS ALLOWED\nHaven for Hopes Transformational Campus does have a kennel for cats and dogs. Placement is not guaranteed and is based entirely on availability.\n\nAFTER HOURS:\nIf you are an adult with no minors, the Courtyard will provide a temporary, safe sleeping arrangement at 1300 W Martin Street, between Comal and Medina St.\n\n\nRequirements for entering Transformational Campus Program\n\n\nFirst, you must complete the intake process at the Intake Department. Intake is first come, first served. Families and singles wait separately; the family waiting room contains toys and play areas for children.\n\n    Be a resident of Bexar County\n    Have proof of residency of at least nine (9) months in Bexar County\n    Be 18 years or older or accompanied by a legal guardian\n    Be able to care for self independently\n    Have valid government issued ID\n    Be drug and alcohol free, upon campus bed availability a Urine Analysis (UA) will be completed to screen for drugs and alcohol\n    Cannot be a registered sex offender\n    Be considered homeless by HUD definition (HUD Definition of homelessness: an individual who lacks a fixed, regular, and adequate nighttime residence)\n    Have proof of homelessness (eviction notice, statement from family members or friends, hotel/motel receipts)\n    Be willing and commit to working with a Haven to Home Team, with a goal of housing and sustainability\n\nRENT ASSISTANCE PROGRAM\nIf you are in need of rental assistance you can stop by the Intake Department between Monday-Friday from 8:00 am to 3:00 pm for resource assistance. You can also contact United Way of Bexar County by dialing 211 or visit the San Antonio Community Resource Directory by visiting sacrd.org.\n\nWAIT LIST\nThere is no formal wait list. If you are eligible for the Transformational Campus, you can check with the\nIntake Department for bed availability on Tuesdays and Thursdays during business hours. Individuals arriving after hours should\n\nreport to the Courtyard before 10 p.m. Families with minor children arriving after hours should present to the security building at the East Gate over the railroad tracks for assistance."
	},
	{
		"addressLine1": "3103 West Avenue",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78213",
		"name": "Youth Alternatives Inc.",
		"organization": "Youth Alternatives Inc.",
		"phone": "(210) 340-8077",
		"website": "https://www.rmya.org/",
		"description": "Long Term shelter and councelling for children who runaway from their houses or are homeless."
	},
	{
		"addressLine1": "1115 Mission Rd.",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78210",
		"name": "Seton Home",
		"organization": "Seton Home",
		"phone": "(210) 533-3504",
		"website": "https://www.setonhomesa.org/",
		"description": "Long term emergency shelters for homeless single pregnant and parenting teen mothers with their babies."
	},
	{
		"addressLine1": "2102 Buena Vista Street",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78207",
		"name": "Guadalupe Home",
		"organization": "Guadalupe Home",
		"phone": "(210) 476-0707",
		"website": "http://www.ccaosa.org/",
		"description": "Transitional housing for homeless women pregnant women with children less than 1yr. old.\n\nHours of Operation: 24 hours a day, 7 days a week\n\nGuadalupe Home is a transitional living program for homeless expectant mothers and homeless mothers with infants. During their stay at Guadalupe Home, mothers have a safe place to live and to prepare for birth, as well as have a home-like environment in which to nurture their baby. Women who come to Guadalupe Home are ready to improve their lives and the lives of their children."
	},
	{
		"addressLine1": "2939 W. Woodlawn Av.",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78228",
		"name": "The Childrens Shelter",
		"organization": "The Childrens Shelter",
		"phone": "(210) 212-2500",
		"website": "https://www.childrensshelter.org/",
		"description": "Temporary emergency shelter for children in the State of Texas. We specialize in care to infants and young children serving newborn up to the age of twelve years."
	},
	{
		"addressLine1": "6363 De Zavala Road",
		"city": "San Antonio",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78228",
		"name": "Fairweather Family Lodge",
		"organization": "Fairweather Family Lodge",
		"phone": "(210) 208-5700",
		"website": "https://www.endeavors.org/",
		"description": "The Fairweather Family Lodge (FFL)\n\nEndeavors provides permanent supportive housing, case management, professional counseling, life skills training, and employment opportunities for chronically homeless women in San Antonio with disabilities and their children so that they can achieve a life full of stability, success, and self-sufficiency in an apartment-style campus.\n\nWe provide the following services through Fairweather Family Lodge\n\n    A safe, healthy, stable, and secure place to live\n    Life skills training in parenting, finance, conflict resolution, relationship, problem-solving, leadership, and other social interaction issues\n    Assistance in meeting educational needs of school-age children\n    Symptom management\n    Case management services\n    Individualized assessments\n\nThe goals for this program include:\n\n    Providing a safe, healthy, stable, and caring environment\n    Increasing self-sufficiency and family/personal income through education, job training, and job placement\n\n    Decreasing episodes of homelessness and/or acute psychiatric care\n\nReferrals and Admission\n\nThe Fairweather Family Lodge receives all referrals for admission from Coordinated Entry through the South Alamo Regional Alliance for the Homeless."
	},
	{
		"addressLine1": "811-A Martin Luther King Jr.",
		"city": "Copperas Cove",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76522",
		"name": "The Refuge Corporation",
		"organization": "The Refuge Corporation",
		"phone": "(254) 547-6753",
		"website": "https://www.therefugecorporation.org/",
		"description": "Provides emergency shelter for homeless women with children, and transitional housing for families that has experienced hardships in their lives. Our programs are designed to benefit every aspect of work and family life, from education and employment to parenting and planning ahead. Our current programs include:\n\nSheltering of women and children at one time, including a bedroom for each family,  long length of time to stay and all at no cost to the resident\n\nCase management for women and children\nParenting workshops\nAdult educational resources\nChildrens educational and cultural enrichment programs\nEmployment resources\nBudget training\nLife skills training\nSavings program\nResource assistance, including\nHealth services\nChildcare\nTransportation\n"
	},
	{
		"addressLine1": "108 E Halstead Avenue",
		"city": "Copperas Cove",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76522",
		"name": "Cove House Emergency Homeless Shelter",
		"organization": "Cove House Emergency Homeless Shelter",
		"phone": "(254) 547-4673",
		"website": "http://www.covehouse.org/",
		"description": "Office Hours are Mondays through Fridays, 9:00 am 1:00 pm\nCove House maintains four housing facilities that are used to provide emergency shelter for those in need. We have a mens home, a womens home, and two family homes. As a general rule, individuals and families may stay in the facilities for a two week period. During that period, they are expected to make a strong effort to get their own independent housing and employment (if needed).\n\nWhile at the facility, individuals will have all of their food and hygiene needs met. They may take advantage of the housing accommodations, our laundry appliances, and playground. We want the residents of Cove House to find a safe and secure environment as they seek to regain their independence and self sufficiency.\nCove House is a strong believer in empowerment over short-term welfare. We want to assist those in need of shelter to be self-sufficient and to provide them with the tools necessary for them to move out of their impoverished situation. We do not want to simply give an individual or family a temporary service and do nothing to keep them from falling back into the conditions they are seeking relief from. \nRequirements for residents:\nApplicants must be willing to comply with all of the shelters rules and policies.Applicants for residency must provide two forms of identification. One being a Texas issued picture ID such as a TX Drivers License or TX ID Card. The other may be a birth certificate, Social Security Card or military ID. All applicants must go to the Copperas Cove Police Station and request a Wants and Warrant Check.All residents are accepted on a space available basis.\n\n"
	},
	{
		"addressLine1": "not provided",
		"city": "Killeen ",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76543",
		"name": "Kingdom of Judah Women & Children Crisis Shelter",
		"organization": "Kingdom of Judah Women & Children Crisis Shelter",
		"phone": "(737) 758-8107",
		"website": "mailto:koj.outreachministriesintl@yahoo.com",
		"description": "Office hours: Mon-Fri 9am-5pm Intake .24 hr emergency crisis shelter temporary/transitional We provide food,clothing and a safe clean place for Homeless/Domestic Violence Crimes to individual,women/veterans and children, spiritual individual/group counseling life skills programeducational material,safety plan,housing ,resumes financial budgeting ,job readiness,substance abuse program, mentorship for low income and needy families we are also a community outreach by referral to clients other local state and federal programs.Our goal is to help the client to become spiritual mentally and physically able to become self sufficient.we"
	},
	{
		"addressLine1": "818 North Fourth Street",
		"city": "Killeen",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76541",
		"name": "Jesus Hope and Love Mission",
		"organization": "Jesus Hope and Love Mission",
		"phone": "(254) 239-1610",
		"website": "https://jhlm.org/",
		"description": ""
	},
	{
		"addressLine1": "412 E Sprott St",
		"city": "Killeen",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76541",
		"name": "Friends in Crisis Shelter",
		"organization": "Friends in Crisis Shelter",
		"phone": "(254) 245-8269",
		"website": "http://www.familiesincrisis.net/",
		"description": ""
	},
	{
		"addressLine1": "513 Sam Rankin Ave.",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78401",
		"name": "Mother Teresa Shelter, Inc.",
		"organization": "Mother Teresa Shelter, Inc.",
		"phone": "(361) 883-7372",
		"website": "https://motherteresashelter.org/",
		"description": "Mother Teresa Shelter, Inc. is a non-profit, faith-based organization that provides services to homeless men and women. The primary purpose of Mother Teresa Shelter Inc. is to provide shelter and supportive services to homeless persons during the day in the hope that they will gain their dignity and stability. Wrap around programs are designed to help meet the demands of our homeless population.Homeless Day Shelter and Supportive Services\n\nBreakfast\nWe provide breakfast, Monday-Friday, from 8:00-9:00 a.m.\nSnacks\nWe provide snacks, Monday-Friday, from 10:30-11:00 a.m. and 2:30-3:00 p.m.\n\nWe also provide:\nLockers for belongings\nShowers\nLaundry facilities\nPhones\nInternet\nBus Tokens\nBlankets\nJackets\nClothing\nFirst Aid\n"
	},
	{
		"addressLine1": "709 Waco Street",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78401",
		"name": "Search for Truth Ministry",
		"organization": "Search for Truth Ministry",
		"phone": "(361) 882-4143",
		"website": "http://search4truthmission.com/",
		"description": "The primary mission of SFTM is to provide and operate faith-based transitional housing for homeless men in the Corpus Christi area. Most of the men staying at the shelter grow in their faith, get jobs, and become self-sufficient.\n\nApproximately 25-30 homeless men of Corpus Christi receive shelter and meals at the mission each day. Clothing, shoes, linens, showers and laundry facilities are provided. Men can stay up to 90 days while looking for employment and a permanent residence. Most of the men staying at the shelter grow in their faith, get jobs, and become self-sufficient."
	},
	{
		"addressLine1": "902 Nueces Bay Blvd.",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78401",
		"name": "Good Samaritan Rescue Mission",
		"organization": "Good Samaritan Rescue Mission",
		"phone": "(361) 883-6195",
		"website": "http://www.goodsamcc.org/",
		"description": "Good Samaritan Rescue Mission is a 203 bed homeless shelter. Faith based.\n\nAlso provides a food pantry, homeless drop in center and pet care, job placement help, thrift shop, transitional housing shelter.\n\n\nWalk in's allowed. Contact for details or just walk in.\n\n\nGood Samaritan Rescue Mission is the largest shelter for the homeless in this region of the state.\n\nThe shelter is open 24 hours a day, each and every day."
	},
	{
		"addressLine1": "513 Josephine Street",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78401",
		"name": "The Salvation Army Corpus Christi Shelter",
		"organization": "The Salvation Army Corpus Christi Shelter",
		"phone": "(361) 888-6174",
		"website": "http://www.salvationarmytexas.org/corpuschristi/",
		"description": "The Salvation Army Corpus Christi provides shelter and service. Services include:\nFamily Shelter - Homeless Services, Homeless Shelter for Families with Children, Homeless Shelter for Females.\nHours: Monday - Sunday 4:30pm - 9pm.\n\n\nSocial Services: Clothing, Clothing Vouchers, Food Pantry.\n\nProject Bridge Transitional Housing.\n\nHomeless Shelter for Veterans."
	},
	{
		"addressLine1": "1919 Leopard Street",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78408",
		"name": "Corpus Christi Metro Ministries",
		"organization": "Corpus Christi Metro Ministries",
		"phone": "(361) 887-0151",
		"website": "https://ccmetro.org/",
		"description": "Rainbow house for women.\nTransitional, supportive housing and emergency shelter for women and children, and access to free counseling and child care.\n\nFull list of service provided: Homeless Services, Homeless Shelter for Females and Children, Transitional Housing and Shelter for Females and Children.\n\n\nRainbow House provides emergency shelter and transitional housing for homeless women and homeless women with children. The emergency housing program offers shelter and evaluates participants for the transitional housing program. The transitional program provides a structured, case-managed environment for these women and families to work toward greater self-sufficiency and independent living. When they are ready for independent living, case managers assist with housing searches and follow-up with them for a minimum of six months to assure that they can sustain independent living.\n\nFree lunch and dinner programs\nLoaves & Fishes is a free cafeteria that serves nutritious dine-in meals for the homeless, poor, working poor, disabled, and elderly. This program provides lunch and dinner Monday through Friday. For residents of Rustic House and Rainbow House, Loaves & Fishes provides all of their meals and bag lunches for those who have obtained gainful employment.\n"
	},
	{
		"addressLine1": "658 Robinson",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78404",
		"name": "Corpus Christi Hope House",
		"organization": "Corpus Christi Hope House",
		"phone": "(866) 852-2276",
		"website": "http://www.cchope.org/",
		"description": "Provides housing for pregnant women and their dependent children.\n\nHope House assists pregnant women including minors, single women who are not pregnant, their dependent children and newborn babies when in need. We are a welcome refuge for women who have no other place to go because of domestic violence, homelessness, addiction or being left completely abandoned and alone. We provide shelter and assistance to mothers and their children regardless of race, age, ethnicity, religion or disability. Our shelter gives these women the opportunity to accept responsibility, to care for their children, further their education, obtain employment, permanent housing and become productive, self-sufficient members of our community with the support of our staff and volunteers."
	},
	{
		"addressLine1": "501 Josephine",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78401",
		"name": "Red Shield Men's Lodge Corpus Christi",
		"organization": "Red Shield Men's Lodge Corpus Christi",
		"phone": "(361) 884-9497",
		"website": "https://www.salvationarmytexas.org/corpuschristi/",
		"description": ""
	},
	{
		"addressLine1": "513 Sam Rankin St",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78401",
		"name": "Mother Teresa Shelter & Transitional Housing For Men",
		"organization": "Mother Teresa Shelter & Transitional Housing For Men",
		"phone": "(361) 883-7372",
		"website": "https://www.motherteresashelter.org/",
		"description": ""
	},
	{
		"addressLine1": "813 Buford St",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78404",
		"name": "The Purple Door",
		"organization": "The Purple Door",
		"phone": "(361) 884-2900",
		"website": "https://purpledoortx.org/",
		"description": "Corpus Christi Service Center: 361-881-9675\nDomestic violence hotline: 361-881-8888\nSexual assault hotline: 361-881-8454\nToll-free number: 1-800-580-HURT (4878)\nAdministration: 361-884-2900\n\nServices: 24-hour safe shelter and crisis hot line for victims of family violence, Training and education for the community, Volunteer opportunities.\n\nThe Women's Shelter is a safe house option for victims fleeing domestic violence relationships and those who have been sexually assaulted. Our shelter is an inviting, yet confidential and safe environment for those in need of our services. It is imperative that our shelter is able to assist women and children to become empowered and understand the importance of safety planning while in our shelter.\n\n\nThe shelter offers support services to women and children including support groups, case management, counseling, community referrals, and activities for children. The basic needs of food, clothing , hygiene items, linen, beds and bathing amenities are all provided free of charge. Our shelter is a 65 bed facility that operates 24 hours a day, 365 days a year. While the shelter may have space limitations, our team will assist individuals and families, with the appropriate community referrals. **We also extend relocation options to victims in other family violence shelters that are in need or have a desire to relocate to Corpus Christi, Texas."
	},
	{
		"addressLine1": "919 Leopard St",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78408",
		"name": "Rustic House Shelter Corpus Christi",
		"organization": "Rustic House Shelter Corpus Christi",
		"phone": "(361) 888-4446",
		"website": "http://www.ccmetro.org/",
		"description": "Rustic House provides a transitional housing program for homeless men who are mentally and/or physically disabled, and/or elderly. The transitional housing program provides a structured, case-managed environment for these men to work toward greater self-sufficiency and independent living. When they are ready for independent living case managers assist with housing searches, and the agency provides financial assistance for security and utility deposits, the first month's rent, furniture, and basic household items. The case managers follow-up with them for a minimum of six months to assure that they can sustain independent living."
	},
	{
		"addressLine1": "513 Sam Rankin Avenue",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78401",
		"name": "Mother Teresa Shelter",
		"organization": "Mother Teresa Shelter",
		"phone": "(361) 883-7372",
		"website": "http://www.motherteresashelter.org/",
		"description": "Mother Teresa Shelter\nMonday - Friday, 8:00 am - 4:00 pm\nTransitional Housing For Men\nPlease call to schedule facility tours and intake applications. Applications are always accepted.\n\n\nProviding comprehensive, community-based outreach services to homeless individuals and families, creating opportunities to help break the cycle of homelessness.\n \nAssisting the homeless during the day which includes breakfast, snacks, lockers, showers and laundry facilities, phone and internet service, blankets, jackets, and clothing, first aid, referral services, and CONTINUUM of Care Program (COC).\n\n \nIncorporating learning and social activities through the Multi-purpose Activity and Therapeutic Center.\n\n\nTransitional Housing for Men At a Glance\n    Providing housing for 24 single men for a period not exceeding 24 months\n\n    Including private rooms, ADA restrooms and showers, laundry facilities, commercial kitchen, recreational area, dog kennel, and security-enhanced grounds\n    Offering support services including self-sufficiency workshops and continuing education\n    Applications are always accepted\n\nMeals at the Shelter\nThe Mother Teresa Shelter offers the area homeless several options for meals throughout the day.\nBreakfast: 8:00 am\nOpen for everybody\nSnack: 10.30 am\nSnacks during this time are for registered clients only\nSnack: 2:00 pm\nOpen for everybody"
	},
	{
		"addressLine1": "10501 S.P.I.D.",
		"city": "Corpus Christi",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78480",
		"name": "Timon's Ministries Day Resource Center",
		"organization": "Timon's Ministries Day Resource Center",
		"phone": "(361) 937-6196",
		"website": "http://timonsministries.org/",
		"description": "Timon's Ministries is a day resource center serving low/no-income families in the Flour Bluff area. An average of 80-100 hot lunches are provided daily. Over 300 dependent children rely on Timon's to provide groceries and assistance to their parents. The William Allen Dental Clinic, opened in 2009, provides free dental work to low-income, drug-free individuals from the entire Coastal Bend.\n\nTimon's prides itself in making a difference in the community by offering the following services:\n\n     The Shepard's Table - provides hot meals 6 days a week;\n     Crisis Pantry - distributes groceries to low/no income families;\n\n     Outreach Program - distributes groceries to the home bound and elder;\n      Dental Clinic - cleaning, extractions, fillings,  x-rays, partials and some dentures;\n     Medical Clinic - family medicine for the  underprivileged and uninsured;\n     Eye Clinic - provides eye exams and glasses;\n    Timon's Boutique - contains clothing and some household items; and\n    Laundry and Shower Facilities."
	},
	{
		"addressLine1": "1217 Mary Street",
		"city": "Waco",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76701",
		"name": "My Brother's Keeper Homeless Emergency Shelter",
		"organization": "My Brother's Keeper Homeless Emergency Shelter",
		"phone": "(254) 296-9866",
		"website": "mailto:jbrammer@missionwaco.org",
		"description": "Emergency shelter for men or women (18 years or older).\nIntake Procedure: Go to the Meyer Center at 1226 Washington Ave - Mon-Thurs 10:00am - 1:00pm Fri 8:00am - 11:30am\nSat 6:00am - 10:00am\n\nMy Brother's Keeper chronic homeless shelter operated by Mission Waco is located at 1217 Mary Street behind Habitat for Humanity's ReStore. Applications for the shelter are taken at the Meyer Center (1226 Washington).\n\nCall the Meyer Center at 254-296-9866 for more info. Once an application is on file applicants request a bed on a daily basis at the Meyer Center. Chapel services are M-F from 7:00-7:45pm. Contact us to volunteer for a chapel service.\nEXCEPTIONS:\nCold weather night at the shelter are open to anyone, regardless of ability to pay. We will be post a designated color on the windows of the Meyer Center and MBK by 5:30p.m. The weather will be forecasted to be 35 degrees or colder OR 40 degrees with rain or excessive wind chill factor. On those nights, everyone needing shelter will be bedded somewhere.\nThose with special needs (mental or physical disability; etc) who do not currently receive any government support may meet with the Social Worker for a voucher pass.\n\nThe staff will create about 10 volunteer job with job descriptions (about 45 minutes/day of work for 5 days/wk) that shelter folks can apply for and which guarantee them a bed for through the first 60 days. After 30 days, anyone not working or in the volunteer program go into thelottery system.\nThere can be exceptions made by the social worker meeting with them if he/she determine that it is in the best interest for the participants empowerment.\n4. After 30 days, bed fees go to $5/night, for a total of 63 days. Some exceptions made after meeting with the Social Worker and it is determined that an extention or waiver is best for the participant.\n5. Those who did not stay in the shelter will not be allowed to eat breakfast.  Breakfast is for shelter residents only..\n\n6. The Mon/Tues lunch is also only provided to shelter residents.  We do not serve meals to the general public.\n\n7. After the first free clothing voucher, participants must pay $1 for each voucher per person, unless exempted by the Social Worker.\n8. The Meyer Center Clinic (Tuesday/Thursday evenings) will cost $2/per visit. Exceptions made only with chaplain and social worker. (Note: The Family Health Center/Family Practice Meyer Center Clinic has its own fee schedule.)\nThose who are working will be encouraged to move into the SHP program."
	},
	{
		"addressLine1": "1717 Jeffries St",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75226",
		"name": "Austin Street Center, Shelter and Food",
		"organization": "Austin Street Center, Shelter and Food",
		"phone": "(214) 428-4242",
		"website": "https://www.austinstreet.org/",
		"description": ""
	},
	{
		"addressLine1": "1100 Cadiz",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75215",
		"name": "Dallas Life Foundation",
		"organization": "Dallas Life Foundation",
		"phone": "(214) 421-1380",
		"website": "http://www.dallaslife.org/",
		"description": "Dallas Life Foundation strives to provide those in need with adequate shelter We operate a 100 000 square foot facility capable of housing up to 500 men women and children per day. Men and women are on separate floors in dormitory style housing.\n\nShelter Guidelines\nDallas LIFE is not a domestic violence shelter.\nCheck in is from 4:00p.m to 8:30p.m., 7 days a week.\nYou are allowed 2 bags or 2 boxes, nothing more. Each piece is to weigh 25 lbs. or less.\n\nIf you are a married couple, you must have a valid marriage license.\nEach person must have ID and a Social Security card\nIf you have no ID, you will need to get one through other agency assistance.\n\nChildren must have a birth certificate, Social Security card and immunization records.\nWe cannot take men on parole.\nWe cannot take anyone convicted of a sex crime at any time in the past or if you have been convicted of a heinous/violent crime.\nYou must sign rules & regulations to stay.\nYou must shower daily, no exceptions.\nIf you commit to our program and then leave, you may not return for 30 days.\nBreaking rules can result in a 30, 60, 90 day or PERMANENT restriction.\nChildren are always free.\nSenior Citizens are welcomed.\nChapel is at 8:00a.m. every morning and 6:00p.m. on Tuesday, Wednesday and Thursday evenings, as well as Sunday morning and Sunday evening.\nWe offer dorms for those who are single.\nWe offer private rooms for married couples or those with children.\nEvery resident has a daily cleaning job, no exceptions.\n\nOnly a limited number of vehicles are able to be accommodated on our property.\nThere is no fraternization with other residents.\nNo pets allowed.\nWe perform random drug testing.\n\nFirst time residents receives 5 free nights. After that, you choose between the Pay-To-Stay Program at $12 per night, or the 10-Month New Life Program which is free for those having no income.\n\n\n\nLargest Homeless Shelter in north Texas housing up to 500 people each night. Highly successful long-term addiction recovery program. Recovery program for Senior Citizens and disabled. Families stay together and single dads with kids welcome!\n\n\nLargest homeless shelter in north Texas. We welcome families and keep couples together. We also welcome Senior Citizens and those with slight mental health issues."
	},
	{
		"addressLine1": "711 South St. Paul Street",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75201",
		"name": "Family Gateway",
		"organization": "Family Gateway",
		"phone": "(214) 823-4500",
		"website": "http://familygateway.org/",
		"description": "Programs and services provided include assessment and diversion, emergency shelter and supportive housing (through DHA vouchers and a permanent supportive housing program), comprehensive case management, adult and childrens services, and an education program.\n\nIf you are a family in need of assistance in Dallas or Tarrant County, please call the homeless crisis helpline at 1-888-411-6802 (Option 3) or take the online assessment found at our website.\n\n\nThe mission of Family Gateway is to provide stability and life-changing supportive services to children and families affected by homelessness. Founded by Mayor Annette G. Strauss in 1986, Family Gateway has served homeless families with children for more than thirty years. The agency receives more than 300 unique calls per month and has been designated as the county-wide point of entry (triage point) for families with children who are experiencing a homeless crisis.\n\n\nFamily Gateway believes in providing housing first and then uses a two-generation approach to wrap trauma-informed services around both the parent and the child. At Family Gateway, families of all kinds are welcome.\n\nWant to get involved as a volunteer or support the mission of Family Gateway? Visit familygateway.org or call 214-823-4500 for more information.\n"
	},
	{
		"addressLine1": "4411 Lemmon Ave, Ste 201",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75219",
		"name": "Genesis Women's Shelter",
		"organization": "Genesis Women's Shelter",
		"phone": "214-389-7700",
		"website": "https://www.genesisshelter.org/",
		"description": "Genesis Women's Shelter provides emergency shelter, safety and counseling for victims of domestic violence and their children. All of the services at Genesis Women's Shelter's are confidential and free."
	},
	{
		"addressLine1": "233 W. 10th Street",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75208",
		"name": "Homeward Bound Inc",
		"organization": "Homeward Bound Inc",
		"phone": "(214) 941-3500",
		"website": "https://www.homewardboundinc.org/",
		"description": ""
	},
	{
		"addressLine1": "224 W Page Ave.",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75208",
		"name": "Promise House",
		"organization": "Promise House",
		"phone": "(214) 941-8578",
		"website": "https://promisehouse.org/",
		"description": "Transitional temporary emergency housing for runaway homeless youth ages 10-17.\nEmergency Youth Shelter Program\nThe Emergency Youth Shelter Program provides a temporary sanctuary for homeless, runaway and abandoned youth until a permanent home is found.\n\nTransitional Living Program\nThe Transitional Living Program equips homeless youth ages 18 to 21 with the skills and education to become independent, productive members of society.\n\n\n"
	},
	{
		"addressLine1": "1818 Corsicana Street",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75201",
		"name": "The Bridge North Texas",
		"organization": "The Bridge North Texas",
		"phone": "(214) 670-1101",
		"website": "http://www.bridgenorthtexas.org/",
		"description": "225 emergency mats, 100 transitional beds;\n\nIf you are an adult experiencing homelessness in Dallas, please contact us at 214.670.1101 for more information about participating in homeless recovery activities.\n\nThe Bridge's purpose is to end adult long-term homelessness in Dallas and the surrounding region by developing, coordinating, and/or delivering:\n    Outreach/intake services\n    Jail diversion/reentry services\n    Emergency shelter/transitional shelter services\n    Primary health care/behavioral health care services\n    Recreational/educational services\n    Employment income/supported employment income/disability income services\n    Affordable housing/supportive housing services"
	},
	{
		"addressLine1": "402 N. Good Latimer Expy.",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75204",
		"name": "Shared Housing",
		"organization": "Shared Housing",
		"phone": "(214) 821-8510",
		"website": "https://www.sharedhousing.org/",
		"description": "Transitional long term emergency housing for homeless families victims of domestic violence."
	},
	{
		"addressLine1": "1128 reverend CBT Smith",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75203",
		"name": "ARM Ministries - Adult Rehab",
		"organization": "ARM Ministries - Adult Rehab",
		"phone": "(214) 943-5010",
		"website": "https://www.armdallas.org/",
		"description": "The recovery ministry includes narcotics anonymous and alcoholic anonymous (NA/AA) support meetings, biblical counseling, as well as group and individual sessions. The program is six months to one year with participants residing in houses on the campus of Golden Gate and includes a daily curriculum administered by the program director\n\n\n\nPrimary Care is a six-month comprehensive inpatient care program based on a Christ-Centered 12-Step Recovery curriculum. Primary Care incorporates intensive Bible Study, Job Readiness, Character Development and Life Management Skills components into its therapeutic recovery program. Outside activities are limited during the first four months of Primary Care treatment.\n\n\n\n\nAftercare is an optional six-month program offered to participants who have successfully completed Primary Care. Aftercare provides men with the opportunity to slowly transition back into their communities. While in Aftercare, participants continue to receive inpatient services as they seek and obtain employment and attend outside AA/NA meetings. In addition, Aftercare incorporates two additional components of Money Management and Social Skills Enrichment."
	},
	{
		"addressLine1": "2707 Routh Street",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75201",
		"name": "Turtle Creek Manor",
		"organization": "Turtle Creek Manor",
		"phone": "(214) 522-7930",
		"website": "https://www.facebook.com/turtlecreekrecovery/",
		"description": "Temporary shelter for mentally handicapped and persons with HIV/AIDS."
	},
	{
		"addressLine1": "3211 Irving Blvd",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75247",
		"name": "Union Gospel Mission",
		"organization": "Union Gospel Mission",
		"phone": "(214) 637-6117",
		"website": "https://ugmdallas.org/",
		"description": ""
	},
	{
		"addressLine1": "13134 Nile Drive",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75253",
		"name": "Soul's Harbor",
		"organization": "Soul's Harbor",
		"phone": "(972) 286-1940",
		"website": "https://www.soulsharbordallas.org/",
		"description": "Addiction treatment center\nSouls Harbor offers a six month program that should provide, for the men, the basic tools that will help facilitate them to become reintegrated back into society.\n\n"
	},
	{
		"addressLine1": "not disclosed",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75238",
		"name": "River Of Life Homes For Women and Children",
		"organization": "River Of Life Homes For Women and Children",
		"phone": "(800) 799-7233",
		"website": "http://www.riveroflifehomes.org/",
		"description": "River Of Life Homes provides shelter, food and clothing for homeless women and women with children in a domestic violence situation. We also offer group homes for women and men who are homeless but have some kind of income SSI.\n\nEligibility: Must be homeless or in a domestic violence situation and need a safe place to live.\n\nPrograms: \nEmergency shelter for women in life-threatening situations, for up to 3 months, average stay is 30 days.\n \nTransitional housing for up to 1 year, average stay is 6 months. Services are available to women, and their children, who have completed the emergency shelter program but need additional time to complete their life plan or job training.\nServices:\nFood, Shelter, Clothing\nBible Study (Not mandatory)\nBoundary Teaching\nCounseling\nParenting Skills Classes\nLife Skills (Job Skills,Health/Nutrition,Personal Hygiene,Financial Mgmt)"
	},
	{
		"addressLine1": "5302 Harry Hines",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75235",
		"name": "Salvation Army Dallas Shelter and Services - Carr P. Collins Social Service Center",
		"organization": "Salvation Army Dallas Shelter and Services - Carr P. Collins Social Service Center",
		"phone": "(214) 424-7050",
		"website": "https://www.salvationarmydfw.org/p/locations/dallas/carr_p_collins",
		"description": "Open 24 hours a day.\nMen's & Women's Shelter\n\nOpen 24 hours a day, 365 days a year, the Shelter Care Program provides safe shelter, hot meals, clothes, showers and laundry facilities for or individuals and families experiencing homelessness. Additional programming and support services are available to assist the individual or family to transition from homelessness to stability.\n\nCarr P. Collins Social Service Center\n\nShort-term temporary shelter, meals, and casework services for men, women and families. Capacity of 240 people. Cost $7.00 per night negotiable in some cases. Religious service not required. On-site child care is available to residents with children.\n\nLocated west of downtown Dallas, The Salvation Army Carr P. Collins Social Service Center is across from Parkland Hospital on Harry Hines Boulevard.\n\nThe161,000 square foot center, which houses up to 600 people per night, is the largest multi-use facility in The Salvation Army world. Every year, thousands of people find the spiritual and practical help they need to change their lives at The Salvation Army Carr P. Collins Social Service Center. Nowhere else in Dallas will people find so many resources under one roof.\n\nPROGRAM & SERVICES:\nFood Pantry\nSummer Heat Relief - Cooling Station\nMens & Womens Shelter\nSubstance Abuse Program\nHome Sweet Home\nMeals\nLife-Skills Classes\nDomestic Violence Program (Confidential Location)\nVeterans Programs\nWorship Programs\n"
	},
	{
		"addressLine1": "1822 Young Street",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75201",
		"name": "The Stewpot Dallas",
		"organization": "The Stewpot Dallas",
		"phone": "(214) 746-2785",
		"website": "http://www.thestewpot.org/",
		"description": "The Stewpot offers a safe haven for homeless and at-risk individuals of Dallas, providing resources for basic survival needs, as well as opportunities to start a new life.\n\nServices ID SERVICES (Monday Thursday, 8:00 a.m. for new clients; 1:00 p.m. for returning clients)\n\n\nDOCUMENT BANK (Monday Thursday, 1:00 pm, and Friday 8:00 am noon)\n\nMETROCARE SERVICES\n\nPARKLAND MEDICAL CLINIC\n\nFOOD STAMPS (Tuesday, 8:00 a.m. 2:45 pm)\n\nCOUNSELING SERVICES\n\nART CLASS (Normal schedule, meet at garage entrance at class start timeno late arrivals)\n\nMAIL SERVICE (Monday Friday, 10:30 a.m. 11:30 a.m.; 1:30 p.m. 2:30 p.m.)\n\nSTREETZINE SALES (Regular sales times; however, there will be no STREETZine orientation during September)\n\n\n\n\n- Clothing and hygiene items will not be available at The Stewpot. For clothing needs, please check out OUR CALLING (1702 S. CESAR CHAVEZ BOULEVARD @ HICKORY STREET) where there is an extensive clothing closet. For more detailed information, visit their website HERE.\n\n\nList of services include: ase management, health care, dental care and substance abuse assistance; youth programs; job training; rep payee; referral for employment, housing and other benefits; access to mailing address and voice mail.\nSince May 2008, The Stewpot has also been the sole meal provider at The Bridge Homeless Recovery Center, serving 1,000-2,000 meals per day, 7 days per week.\n"
	},
	{
		"addressLine1": "828 E 4th Ave",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75226",
		"name": "Living Word Harvest of Dallas Men’s Shelter",
		"organization": "Living Word Harvest of Dallas Men’s Shelter",
		"phone": "(972) 432-6941",
		"website": "https://www.livingwordharvestofdallas.org/",
		"description": ""
	},
	{
		"addressLine1": "2706 S 2nd AVE",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75210",
		"name": "D.I.S.C MINISTRIES",
		"organization": "D.I.S.C MINISTRIES",
		"phone": "(469) 601-4445",
		"website": "http://www.karendudleyministries.org/",
		"description": "Dallas International Street Church is a 24-hour per day, 7 day a week church located at 2706 Second Avenue, Dallas, Texas 75210.\n\nBy day, it becomes a rest haven and lighthouse for those who are broken and weary from life in the streets. Many who come are plagued with life controlling circumstances and just need to be shown the love of Jesus.By night, we become the church that never sleeps . We load up our bus and take to the streets to bring in those folks who are needing the love of Jesus and a hot meal. Services begin at 7 p.m. Tuesday through Friday with preaching of the Word followed by a hot meal. We serve at least 200 meals daily and sometimes more. We provide clothing, showers, personal items for those in need. We also have church services on Sunday at 11 a.m. and 7 p.m. All are welcome."
	},
	{
		"addressLine1": "3110 Metropolitan Ave",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75215",
		"name": "Eden Outreach, Inc.",
		"organization": "Eden Outreach, Inc.",
		"phone": "(214) 421-5894",
		"website": "https://www.edenoutreach.com/",
		"description": "Eden Outreach, Inc. is a nonprofit organization committed to the rehabilitation and transformation of formerly incarcerated and homeless men and women with drug/alcohol addictions, providing a positive, drug-free, safe, and structured environment with guidance that integrates their physical, spiritual, and emotional lives, giving training that brings about character change and total restoration from addictive behaviors.\n\nWe prepare individuals for success in life by providing transitional housing, mentoring, job/life skills training, education, and career training to become independent and productive adults. A majority of this population ends up homeless or in prison if not redirected.\n\n\nEden Outreach, Inc. (formerly MetroHaven of Love, Inc. founded in 1999) provides a positive environment for rehabilitation and restoration from alcohol and drug addiction in a drug-free, safe, and structured living environment with supportive recovery services.\n\n\nWe prepare men and women for success in life by providing transitional housing, mentoring, life skills training, and job opportunities to become independent and productive individuals for a successful integration into the community.\n"
	},
	{
		"addressLine1": "522 Shadyway Dr.",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75232",
		"name": "Living Word In The CliffS Ministries",
		"organization": "Living Word In The CliffS Ministries",
		"phone": "(469) 254-1419",
		"website": "http://www.lwtgchurch.com/",
		"description": "Living Word In The Cliffs Ministries is a 12month nonprofit organization committed to the rehabilitation and transformation of formerly incarcerated and homeless men with drug/alcohol addictions, providing a positive, drug-free, safe, and structured environment with guidance that integrates their physical, spiritual, and emotional lives, giving training that brings about character change and total restoration from addictive behaviors."
	},
	{
		"addressLine1": "4815 Cass Street",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75235",
		"name": "UGM Center of Hope - Shelter for single women and children",
		"organization": "UGM Center of Hope - Shelter for single women and children",
		"phone": "(214) 638-2988",
		"website": "https://ugmdallas.org/",
		"description": ""
	},
	{
		"addressLine1": "1818 Corsicana Street",
		"city": "Dallas",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75201",
		"name": "Calvert Place Men's Shelter",
		"organization": "Calvert Place Men's Shelter",
		"phone": "(214) 637-6117",
		"website": "https://ugmdallas.org/",
		"description": ""
	},
	{
		"addressLine1": "928 Bluebird Dr",
		"city": "Irving",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75061",
		"name": "Brighter Tomorrows",
		"organization": "Brighter Tomorrows",
		"phone": "(972) 254-4003",
		"website": "http://www.brightertomorrows.net/",
		"description": "Brighter Tomorrows provides free emergency shelter for victims of domestic and sexual violence at 2 locations. Each location provides 35 beds in a safe, supportive environment. Our shelters are staffed 24 hours a day, year round. The shelters are fenced and equipped with security cameras.\n\nBrighter Tomorrows Transitional Housing Program is available to families that are no longer in immediate crisis. Our program helps survivors develop skills to stabilize their finances and provide for their own futures."
	},
	{
		"addressLine1": "331 W. Morton",
		"city": "Denison",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75020",
		"name": "Texoma Family Shelter",
		"organization": "Texoma Family Shelter",
		"phone": "(903) 465-6041",
		"website": "https://texomafamilyshelter.com/contact/",
		"description": ""
	},
	{
		"addressLine1": "5700 Texoma Pkwy",
		"city": "Sherman",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75090",
		"name": "Salvation Army of Grayson County Texas",
		"organization": "Salvation Army of Grayson County Texas",
		"phone": "(903) 868-9602",
		"website": "http://www.salvationarmytexas.org/sherman/",
		"description": "Provides emergency assistance for food, clothing, emergency shelter, pastoral counseling and prescriptions, when funding warrents. Emergency shelter for men, women, and families. Persons must call before coming to shelter if possible. Seasonal programs include Summer Camps for children and adults and Christmas assistance for food and gifts. To recieve school supplies applicants must come in to fill out applications and bring birth certificates or other identification showing the childs age.\n\nDuring extremely hot weather the facility operates as a Cooling Center.\n\n\nEligibility: Emergency shelter for three day intervals; all populations 18 and over; must leave facility during the daytime hours.\n\nHours: Mon - Fri 9:00am - Noon; 1:00pm - 4:00.\n\nIntake procedure: Call for appointment for utility requests, Call or walk-ins accepted.\n\n"
	},
	{
		"addressLine1": "1014 West University Drive",
		"city": "Denton",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76201",
		"name": "Friends of the Family",
		"organization": "Friends of the Family",
		"phone": "(940) 387-1750",
		"website": "https://www.dcfof.org/",
		"description": "Friends of the Family offers emergency shelter for survivors of relationship violence and sexual assault. Persons seeking shelter may call the crisis line 24 hours a day, 7 days a week, at 800-572-4031 or 940-382-7273. Eligibility for shelter will be determined based on safety concerns related to relationship violence or sexual assault, resulting in the person having no safe place to stay. In the event a caller is not eligible for our shelter, referrals to other local resources will be provided.The shelter is staffed 24 hours a day, 7 days a week. Crisis intervention specialists answer the hotline, monitor the house, and assist clients with basic needs during night, weekend and holiday hours.The 32-bed residential facility offers numerous services that encourage safety planning, education regarding relationship violence, personal growth, and independent living skills in an abuse-free environment. Generally, clients stay in the shelter for up to 30 days; extensions may be approved on a case-by-case basis."
	},
	{
		"addressLine1": "1508 E. McKinney",
		"city": "Denton",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76209",
		"name": "Salvation Army Shelter Shelter Denton TX",
		"organization": "Salvation Army Shelter Shelter Denton TX",
		"phone": "(940) 566-3800",
		"website": "http://www.salvationarmydfw.org/p/services/homeless",
		"description": "Emergency shelter for men & women.\nCase management available.\nMust have state issued ID.\n\nBreathalyzer test.\nProvides evening and morning meals and breakfast to public at 6:30 AM, age 18 and older.\nSocial worker available M-F 1-4 PM.\nNo pets allowed.\n\n"
	},
	{
		"addressLine1": "1003 E. San Antonio",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79901",
		"name": "Annunciation House",
		"organization": "Annunciation House",
		"phone": "(915) 545-4509",
		"website": "https://annunciationhouse.org/",
		"description": "Annunciation House is a volunteer organization that offers hospitality to migrants, immigrants and refugees in the border region of El Paso, Texas and Ciudad Juarez. It provides shelter, clothing, food, and other necessities to a lot of vulnerable individuals, mostly from Mexico and Central America.\n\nAnnunciation House is the entry point for most of the guests. It hosts individuals that have short to mid term needs, who might stay for weeks or months. These individuals might be people who came to the U.S. seeking work, people that have fled their home country due to violence, corruption or extortion, or undocumented individuals/families that are living in El Paso but are currently facing financial hardship.Annunciation House includes four houses, each of which has a different focus, although these distinctions are fluid and change accordingly with the guest needs.\n\n\n\nCasa Vides:Is a long term house of hospitality for individuals that are going through immigration proceedings such as political asylum or other types of cases, and medical situations. It also provides hospitality to Mexican nationals, widows of U.S. citizens who must spend some time in the U.S to collect the Social Security benefits that they are entitled to receive.\nCasa del Refugiado:Is a very short-term house of hospitality to individuals that have just been released from ICE custody. It is the largest facility, with a capacity of around 500 people. Guests typically stay at this house somewhere between 1 to 3 days, which is usually enough time to address their basic needs while they connect with family/friends in the U.S. There is a high turnover in this house and numbers are very unpredictable as they depend on ICE's release weekly schedule.\n\nCasa Oscar Romero:It houses short-term and long-term guests making it the most varied house.\n\n\nCasa Teresa:Houses all the offices of the Annunciation House. Also, it has an apartment that volunteers can utilize as a gathering place for recreational/community time or use as a retreat on their days off.\n\n\nMailing Address:Annunciation House, Inc.P.O. Box 11189El Paso, TX 79995-1189"
	},
	{
		"addressLine1": "1020 N. Campbell Street",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79902",
		"name": "La Posada Home Inc",
		"organization": "La Posada Home Inc",
		"phone": "(915) 544-4595",
		"website": "http://www.laposadahome.org/",
		"description": "Transitional/Permanent long term emergency housing for homeless families victims of domestic violence.\nLa Posada Home serves women with children who are survivors of domestic violence. The average client is a Hispanic female, between the ages of 20 and 35, who is in the \"Extreme Low Income\" bracket; no high school diploma, with an average of two children under the age of 18 and escaping domestic violence.\n"
	},
	{
		"addressLine1": "221 N. Lee Street",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79901",
		"name": "Rescue Mission of El Paso",
		"organization": "Rescue Mission of El Paso",
		"phone": "(915) 532-2575",
		"website": "https://rmelp.org/",
		"description": ""
	},
	{
		"addressLine1": "1220 Myrtle Avenue",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79901",
		"name": "Opportunity House Women's Resource Center",
		"organization": "Opportunity House Women's Resource Center",
		"phone": "(915) 577-0069",
		"website": "https://homelessopportunitycenter.org/",
		"description": "The Womens Resource Center (WRC) is an emergency shelter for single homeless women. This is our newest facility, created in response to the growing number of homeless women in our community. Before this facility was created, homeless women were housed in a separate area within the mens emergency shelter. It grew evident that this arrangement was problematic, and that the women could best be protected and supported in pursuing their goals given a separate facility. Now that the women have a safe place of their own, they have truly developed a supportive, community environment. The residents work together to maintain the shelter, advocate for each other, connect each other to resources, and encourage each other to make positive changes in their lives.\nAll residents receive three meals a day, clothing, and basic hygiene items. They are also connected with supportive case management services and have access to all the services the Opportunity Center has to offer.\n"
	},
	{
		"addressLine1": "1208 Myrtle Avenue",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79901",
		"name": "Opportunity House El Paso Men's Resource Center",
		"organization": "Opportunity House El Paso Men's Resource Center",
		"phone": "(915) 577-0069",
		"website": "https://homelessopportunitycenter.org/",
		"description": "Men's Resource Center\nHours: 24 hours a day.\n\nEveryone seeking help in our facility receives 3 meals a day, free medical service, and free access to showers, bathrooms, laundry facilities, storage, clothes closet, individual bedding, phone and mail service, and substance abuse counseling among many others.\n\nOur emergency overnight shelter/day resource center is the only barrier-free facility in the Paso del Norte region.\n\n\nOn average, the Mens Resource Center (MRC) provides a safe place for 170 homeless men from all walks of life to sleep."
	},
	{
		"addressLine1": "5300 Paisano",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79905",
		"name": "El Paso Housing Authority HACEP Shelter Program",
		"organization": "El Paso Housing Authority HACEP Shelter Program",
		"phone": "(915) 849-3742",
		"website": "http://www.hacep.org/",
		"description": "Shelter Plus Care Program will help homeless veterans receive housing and supportive services through the collaboration with El Paso Veterans Affairs Healthcare Services and Integrity Asset Management. HUD-VASH program.As of 16NOV09, 40 housing slots vouchers available for homeless veterans.\n\nFor Homeless Civilians\nThe final sub-category of public housing is the Shelter Plus Care Program.  This is a transformative, grant-funded initiative to assist chronically homeless disabled individuals.  HACEP provides 22 units to the residents of Siesta Gardens in the Northeast.  Meanwhile, a partnership with Emergence Health Network provides important onsite counseling and rehabilitative care to the residents.\nThese are but a few of the many programs HACEP offers to the residents of the City of El Paso. If you need any additional information that is not listed on our website, feel free to contact our customer service department at (915) 849-3742."
	},
	{
		"addressLine1": "8023 San Jose Road",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79915",
		"name": "Reynolds Home For Women and Children",
		"organization": "Reynolds Home For Women and Children",
		"phone": "(915) 274-2598",
		"website": "https://reynoldshome.org/",
		"description": "Reynolds Home provides shelter to homeless women and children, provides case management to residents to empower them to better themselves educationally and vocationall.\n\nEligibility: Homeless women and children only.\n\nFees: None\n\nIntake Procedure: Call for availability."
	},
	{
		"addressLine1": "920 S. Oregon St.",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79901",
		"name": "El Paso Villa Maria - For Women",
		"organization": "El Paso Villa Maria - For Women",
		"phone": "(915) 544-5500",
		"website": "http://www.villamariaep.org/",
		"description": "Villa Maria is a temporary home where women, homeless & without children, heal to wholeness.\n\nVilla Maria receives referrals from various agencies including: probation officers, social workers, hospitals, the Center Against Family Violence, drug and alcohol treatment programs, other shelters and mental health agencies. And often women in need simply ring the doorbell for help. Within a year's time we receive more than three times the number of requests for shelter than we can realistically handle.\n\nCall for more information."
	},
	{
		"addressLine1": "1014 S Virginia St",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79901",
		"name": "Dame La Mano Crisis Center",
		"organization": "Dame La Mano Crisis Center",
		"phone": "(915) 546-4040",
		"website": "https://www.facebook.com/dame.lamano.1",
		"description": ""
	},
	{
		"addressLine1": "4300 E. Paisano Dr",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79905",
		"name": "Salvation Army of El Paso Emergency Shelter",
		"organization": "Salvation Army of El Paso Emergency Shelter",
		"phone": "(915) 544-9811",
		"website": "https://www.salvationarmytexas.org/elpaso/",
		"description": ""
	},
	{
		"addressLine1": "920 S Oregon St",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79901",
		"name": "Villa Maria",
		"organization": "Villa Maria",
		"phone": "(915) 544-5500",
		"website": "https://villamariaep.org/",
		"description": ""
	},
	{
		"addressLine1": "3700 Altura Ave",
		"city": "El Paso",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79930",
		"name": "YWCA El Paso For Women - Sara McKnight Transitional Living Center",
		"organization": "YWCA El Paso For Women - Sara McKnight Transitional Living Center",
		"phone": "(915) 566-2762",
		"website": "https://www.ywcaelpaso.org/",
		"description": "The Sara McKnight Transitional Living Center (TLC) provides housing for 39 homeless women at a time with or without children for up to 24 months; however, the average stay is less than one year. YWCA El Paso del Norte Regions Transitional Living Center provides a bridge to successful independence for women who are homeless or at risk of homelessness."
	},
	{
		"addressLine1": "1050 W. Amador",
		"city": "Las Cruces",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "88004",
		"name": "Las Cruces Gospel Rescue Mission",
		"organization": "Las Cruces Gospel Rescue Mission",
		"phone": "(575) 523-7727",
		"website": "http://www.lcgrm.org/",
		"description": "Free meals (breakfast, lunch and supper everyday), clothing, food, and emergency lodging.\n\nMeeting people at their point of need (physically, emotionally, spiritually) by providing hot meals (3 times daily), hot showers, clean beds and shelter, clothing, and the Good News.\n"
	},
	{
		"addressLine1": "3500 Noble Avenue",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76111",
		"name": "Cornerstone Assistance Network",
		"organization": "Cornerstone Assistance Network",
		"phone": "(817) 632-6000",
		"website": "http://www.canetwork.org/",
		"description": "Housing Solutions & Development\n\nCornerstone has been helping men, women, and families find stability in their lives by meeting their housing needs since 1994. Eliminating housing barriers allows all people the opportunity to move forward and become more stable and productive members of our community. Our housing efforts focus on the individual who may be facing challenges with housing solutions. Our goal is to move individuals from insecurity in housing to a variety of permanent solutions including home ownership. Our goal is not to transition those in need into a living space, but to work with them toward their long term goals for life and housing desires. Over 25 properties have been made available since 2014 for affordable ownership. Many of them are now owned by individuals and families who once saw homeownership as an unreachable dream.\n\nOur current housing division includes three distinct avenues to sustained living. For men, the New Life Center in the up-and-coming Fairmount Historic District offers housing for men who have faced homelessness. Women who are being released from incarceration can become part of the Promise House, a place that provides safe shelter while working toward building a new life based upon Christian principles. We work to provide affordable homes to individuals and families who are ready and willing to achieve this goal.\n\n\nNew Life Center\nNew Life Center is a home where men who have faced homelessness can focus on education and meeting their long-term career goals. During their residence, each man is provided supportive services such as case management, mentoring, and spiritual, physical, emotional, and financial guidance. Despite where these men may come from, their future possibilities are limitless. Residents graduate from college every year, including one resident who graduated as Valedictorian from TCU.\n\nThose interested in being a resident may complete the application and interview process in person, Monday mornings at 9:30 am. No appointment is necessary. Applicants must be currently homeless and drug- and alcohol-free.\n\n1628 Sixth Ave. Fort Worth, Texas 76104"
	},
	{
		"addressLine1": "2400 Cypress Street",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76102",
		"name": "Presbyterian Night Shelter",
		"organization": "Presbyterian Night Shelter",
		"phone": "(817) 632-7400",
		"website": "http://journeyhome.org/",
		"description": "Long term emergency shelter for general population. Dinner is served to all overnight guests. 5:00 pm to 6:30 pm daily.\n\nServices:\nSingle Men and Women\nOur shelter for homeless adults operates 24 hours a day, and 365 days a year.\n\nHousing, meals and additional support services are available for single women and single men.\nWe are free to anyone in need, and we are the only shelter in our area without length-of-stay restrictions.\n\nWomen and Children\nOur Women and Children's Facility is the only area shelter that allows families with older teenage boys to remain with their mothers, keeping the families together.\nWe also provide a comprehensive children's program, which includes playgrounds, on-site counseling and after-school tutoring.\nOur capital campaign is increasing our ability to meet growing demand for families, including a new facility to be opened in 2016, expanded support services and enhanced safety and security.\n\nVeterans\nWe have one of the most successful transitional housing programs for veterans in the United States, preparing them for permanent, independent housing within 12 months.\n\nWe have developed semiprivate facilities for veterans, allowing them to prepare their own meals and have separate recreation, as well as access to showers, laundry services and a computer lab.\nWe work with Veterans Affairs to secure and retain employment for homeless veteran clients, move them into permanent housing and eliminate or minimize barriers to continued self-sufficiency.\n\nMentally Ill/Behaviorally Disabled\nOur Behavioral Care Facility provides services for severely mentally ill homeless, who often suffer from substance abuse issues.\nWe work with mentally ill homeless to live in furnished, private rooms in a residential facility.\nMHMR Tarrant County collaborates with us to provide health care services."
	},
	{
		"addressLine1": "929 Hemphill St.",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76104",
		"name": "Tarrant County Samaritan House",
		"organization": "Tarrant County Samaritan House",
		"phone": "(817) 332-6410",
		"website": "https://samaritanhouse.org/",
		"description": "Samaritan House:\n\nOur single-room occupancy (SRO) facility is a permanent housing environment for single men and women living with HIV/AIDS in a service enriched community of care providing 60 one-person units and supportive services. Qualifications: Applicants must be 18 years of age or older, living with HIV/AIDS, low income and homeless. Rent: Applicants are required to pay 30% of their annual adjusted income towards their rent. All utilities are included in the rent. Contact Crystal Daniel, Intake Coordinator, at 817-332-6410 ext. 172 or cdaniel@samaritanhouse.org for more information."
	},
	{
		"addressLine1": "1321 East Lancaster Avenue",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76102",
		"name": "Union Gospel Mission of Tarrant County",
		"organization": "Union Gospel Mission of Tarrant County",
		"phone": "(817) 339-2553",
		"website": "https://www.ugm-tc.org/",
		"description": "UGM-TC provides emergency services for the homeless living in Tarrant County. We offer breakfast, lunch and dinner every day for those in need. In addition, overnight shelter for men is available.\n\n\n\nMeal Times for Outside Guests:\n\nBreakfast: 7:00am\n\nLunch: 12:30pm\n\nDinner: 6:00pm\n\n\n\nGuests line up to enter the building 45 minutes prior to meal times in order to enter the chapel. Meal times remain consistent throughout the year, except for certain holidays.\n\n\n\nOvernight Shelter for Men:\n\nCheck in occurs at 7:00pm every day at the main entrance of the Men's Building located at 1331 E. Lancaster. An ID and proof of a TB test within the past year will be needed in order to spend the night. When temperatures are over 90 degrees or under 40, we accommodate as many people as possible and work with other shelters and agencies to find additional space. Men staying overnight can be shifted to the Resident Program should they choose and if space is available.\n\nMens Program:\nThe men's program serves men 18 years of age and older with a focus on intensive supportive services to address mental health, substance use, education, employment, transportation, and other needs to give men the greatest chance of developing the skills and self-confidence to attain self-sufficiency. The skill-building program provides them with the communication, relationship building, and social skills necessary to maintain stable employment.\n\nRequirements for Admission to Mens Building:\nMale 18 years of age or older\nCapable of independent living throughout their stay\nComplete an admission application, including a complete and factual disclosure of mental and physical history. Failure to disclose this information will cause the application for admission to be denied.\n\nHave or obtain a legal state identification and Social Security card\nProvide a list of prescription medications to the case manager or facility manager. This list should be updated any time a new prescription is given after becoming a resident.\nReceive treatment for any communicable disease or condition (such as lice) which pertains to the applicant, before introduced into the communal environment.\nHave a current TB card issued by a local shelter or obtain a TB test at the next testing date.\n\nTo learn about our intake procedures & fees, please call: 817.332.3019\nUpon entering the program, a professional social worker conducts a face-to-face comprehensive assessment with each client. Together, they identify the clients strengths and challenges while establishing a trusting and empowering relationship. This is done through a case management plan designed to address the physical, emotional, spiritual and social needs for each client.\n\n\nWomens Program:\nThe women's programs serves women 18 years of age and older with a focus on helping women in crisis discover their new path for permanent change toward healing, empowerment, self-supportiveness and fulfillment of their God-given potential. Women are provided classes on domestic violence, personal empowerment, and budgeting and computer skills. Case managers are their advocates linking them to economic opportunities, strong social services and effective supportive services. Women receive direction on personal responsibility; self-management; goal-directed behavior; decision-making; and relationship skills.\n\nFamily Program:\nOur families program serves mothers with children, fathers with children and intact families with children. The family program focuses on keeping families together and providing them with a safe, whole and supported environment. The onsite case managers encourage, educate and empower parents while helping them develop critical skills for a healthy strong family foundation. Life skills classes are provided including parenting classes, early childhood reading classes, cooking a healthy meal, more than budgets, personal social adjustment groups, grief and loss groups, and numerous other classes as needed.\n"
	},
	{
		"addressLine1": "1100 E. Lancaster",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "00000",
		"name": "Day Resource Center",
		"organization": "Day Resource Center",
		"phone": "(817) 810-9797",
		"website": "https://www.whenwelove.org/",
		"description": ""
	},
	{
		"addressLine1": "1100 Hemphill Street, Suite 303",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76104",
		"name": "SafeHaven of Tarrant County - Victims and Their Children",
		"organization": "SafeHaven of Tarrant County - Victims and Their Children",
		"phone": "(877) 701-7233",
		"website": "http://www.safehaventc.org/",
		"description": "24 hour Domestic violence hotline for women and their children. SafeHaven operates the largest and most comprehensive domestic violence shelters in Tarrant County.\n\nServices\nEMERGENCY SHELTER\nProvides 24-hour care to families fleeing life-threatening situations. Includes a secure living environment, legal services, professional counseling, transportation to and from work, on-site school and daycare, and medical and dental referrals.\n\n24 HOUR HOTLINE\nProvides counseling, information and referrals. Services are provided in English and Spanish and all calls are confidential and free of charge.\n\nSAFE LIVING HOUSING\nGives clients skills and tools necessary to move from the shelter to independent living. The average stay ranges from 3 months to 2 years.\n\nOUTREACH PROGRAMS\nInclude counseling and support groups for adults and children in English and Spanish, legal services, and collaboration with area police departments.\n\nPREVENTION & EDUCATION PROGRAMS\nInclude programs about healthy relationships, safe dating, bullying, and other relevant topics for adults, children, teens and professionals. In 2016, SafeHaven educated over 30,000 students in Tarrant County school districts.\n\nPARTNER ABUSE AND INTERVENTION PROGRAM\nHelps abusive individuals identify belief systems that form the core of abusive behaviors. paip equips abusers with tools to help them recognize and avoid aggressive and violent behaviors in the future and teaches healthy replacement options."
	},
	{
		"addressLine1": "1855 E. Lancaster",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76103",
		"name": "The Salvation Army Fort Worth Shelter",
		"organization": "The Salvation Army Fort Worth Shelter",
		"phone": "(817) 344-1800",
		"website": "http://fortworth.satruck.org/",
		"description": "Day and Night Shelter. Prepared meals provided. Breakfast at 7:30am, Lunch at 12:30pm, and dinner at 5:30pm.\n\nEmergency Shelter 817-334-2495\nFamily Center 817-344-1800 Ext.4\nFirst Choice Substance Abuse/Women and children 817-344-1831\nNorthside Corps/Community Center 817-624-3111"
	},
	{
		"addressLine1": "2400 Cypress St",
		"city": "Fort Worth",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76102",
		"name": "Presbyterian Night Shelter For Single Women and Children",
		"organization": "Presbyterian Night Shelter For Single Women and Children",
		"phone": "(817) 632-7429",
		"website": "https://www.journeyhome.org/",
		"description": "Intake: Come to the shelter's main door at 2400 Cypress Street, Fort Worth, Texas 76102 at 5 p.m.\n\nGeneral Shelter Inquiries\nMain Facility\n817-632-7400\n\nEmergency and transitional housing for single women with children and , case management, tutoring, mentoring and educational classes, 3 meals served daily, restrooms with showers, washers/dryers, dispensary items.\n\nEligibility: Homeless women with children, women in last trimester of high risk pregnancy doctor verification required.\n\nWomen and Children\n    Our Women and Childrens Facility is the only area shelter that allows families with older teenage boys to remain with their mothers, keeping the families together.\n    We also provide a comprehensive children's program, which includes playgrounds, on-site counseling and after-school tutoring.\n\n    Our capital campaign is increasing our ability to meet growing demand for families, including a new facility to be opened in 2016, expanded support services and enhanced safety and security."
	},
	{
		"addressLine1": "1618 North Avenue J",
		"city": "Freeport",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77541",
		"name": "Salvation Army of Freeport, Texas Shelter",
		"organization": "Salvation Army of Freeport, Texas Shelter",
		"phone": "(979) 233-5420",
		"website": "http://salvationarmyusa.org/",
		"description": "Emergency Shelter:\nMonday-Sunday\nCheck-in: 5PM-8PM\n3 Day stay allowed.\n\nServices Offered:\nEmergency Shelter\nSeasonal Services\nCasework Services\nVisitation Services\nWorship Services - Church\nWomen's Ministries\nCharacter Building Programs\nDay Care"
	},
	{
		"addressLine1": "1618 Ave. J",
		"city": "Freeport ",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77541",
		"name": "The Salvation Army Shelter Freeport TX",
		"organization": "The Salvation Army Shelter Freeport TX",
		"phone": "(979) 233-5420",
		"website": "https://southernusa.salvationarmy.org/texas-freeport/",
		"description": "Services Offered:\n    Emergency Shelter\n    Seasonal Services\n    Casework Services\n    Visitation Services\n    Worship Services - Church\n    Women's Ministries\n    Character Building Programs\n    Day Care"
	},
	{
		"addressLine1": "601 51st St",
		"city": "Galveston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77550",
		"name": "The Salvation Army Center of Hope",
		"organization": "The Salvation Army Center of Hope",
		"phone": "(409) 763-1691",
		"website": "http://www.salvationarmytexas.org/galvestoncounty/",
		"description": "The shelter serves men, women and families. There are a limited number of first-come, first-served beds that people can line up for beginning at 3:00pm.\n\n\nReserved beds are available for people working with case management.\n\nCheck-in for all is between  6pm and 8:00pm.\n\nA community meal is served at 5:00 for anyone who is hungry and can get there. A hot breakfast is provided for those who stay in the shelter overnight."
	},
	{
		"addressLine1": "2420 Winnie",
		"city": "Galveston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77550",
		"name": "Christus Our Daily Bread Shelter and Services",
		"organization": "Christus Our Daily Bread Shelter and Services",
		"phone": "(409) 765-6972",
		"website": "http://www.christusfoundation.org/",
		"description": "Christus Our Daily Bread provides services for the homeless. Services include a day shelter, meals, clothing, first aid and hygiene items, along with licensed counselors to provide assessment, counseling, education, and referrals for addiction and mental illness recovery, and other issues.\nIntake: Walk-ins accepted; Referral from other service agencies\nThis is a free service.\nEligibility: Homeless\nHours: Mon - Fri 8:15am - 4:00pm\nServices: Homeless Drop In Center, Homeless Shelter"
	},
	{
		"addressLine1": "2127 Avenue M",
		"city": "Galveston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77550",
		"name": "Galveston Island Family Crisis Center",
		"organization": "Galveston Island Family Crisis Center",
		"phone": "(409) 621-1228",
		"website": "https://www.facebook.com/RCCGC/",
		"description": "Provides emergency shelter for homeless parents, their children and older homeless youth.\n\nEligibility: Homeless parents with children, Homeless youth ages 18-21"
	},
	{
		"addressLine1": "5105 Timothy Street",
		"city": "Texas City ",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77591",
		"name": "Worthy Ministries Inc",
		"organization": "Worthy Ministries Inc",
		"phone": "(409) 682-0854",
		"website": "http://worthyministriesinc.prohost.mobi/",
		"description": "We are a shelter with Transitional housing we help people up we do not hand out."
	},
	{
		"addressLine1": "451 West Avenue D",
		"city": "Garland",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75046",
		"name": "Salvation Army Garland TX",
		"organization": "Salvation Army Garland TX",
		"phone": "(972) 272-4531",
		"website": "https://www.salvationarmydfw.org/p/locations/garland",
		"description": ""
	},
	{
		"addressLine1": "not provided.",
		"city": "Richardson",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75081",
		"name": "River of Life Homes - ROLH",
		"organization": "River of Life Homes - ROLH",
		"phone": "(214) 886-3563",
		"website": "http://www.riveroflifehomes.org/",
		"description": "Programs:  \nEmergency shelter:   EMERGENCY SHELTER IS 0 -30 DAY- PROGRAM FOR ADULT FEMALES, AND WOMEN WITH CHILDREN (0 12 YRS OLD), WHO ARE IN A LIFE THREATENING DOMESTIC VIOLENCE SITUATION. A POLICE REPORT IS REQUIRED TO PROVE THAT THE INCIDENT HAS BEEN FILED WITHIN 2 WEEKS OR LESS OF THE INCIDENT.\n \nTransitional housing: TRANSITIONAL HOUSING IS 0 12 MONTHS PROGRAM FOR VICTIMS OF DOMESTIC VIOLENCE  HOMELESS ADULT FEMALES, AND WOMEN WITH CHILDREN (0 -12 YR OLD) WHO HAVE INCOME BUT NOT ENOUGH TO PAY FOR THEIR OWN PLACE TO LIVE. MONTHLY RENT IS BASED ON CLIENTS ABILITY TO PAY. UTILITY BILLS ARE INCLUDED IN THE RENT\n\nServices:\n\nShelter,Food and Clothing\n\nCounseling: Individual and Group Counseling\n\n Education: Financial planning, Family reconciliation, Healthy Boundary Setting,Parenting.\n\nEmployment: Resume writing, job location and job interview preparation.\n\n\nSpiritual Upliftment: Prayer meeting, group sharing and encouragement,"
	},
	{
		"addressLine1": "3454 US-281",
		"city": "George West",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78022",
		"name": "Live Oak Outreach",
		"organization": "Live Oak Outreach",
		"phone": "(361) 449-1860",
		"website": "https://live-oak-out-reach-inc.business.site/",
		"description": ""
	},
	{
		"addressLine1": "601 Indiana",
		"city": "Graham",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76450",
		"name": "Harry’s House",
		"organization": "Harry’s House",
		"phone": "(940) 549-6002",
		"website": "https://grahamcrisiscenter.org/",
		"description": " The Graham Crisis Center is an umbrella organization which includes a womens shelter.\nThe Graham Crisis Center Shelter for The Graham Area Crisis Center serves women (and families) in crisis by attempting to understand the causes and complexities of women and children in crisis and provide care, shelter, food and guidance to help with transitional planning for short- and long-term goals toward successful independence.\n\n"
	},
	{
		"addressLine1": "1149 Fort Worth Hwy",
		"city": "Weatherford",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76087",
		"name": "Freedom House",
		"organization": "Freedom House",
		"phone": "(817) 596-7543",
		"website": "http://www.freedomhousepc.org/",
		"description": ""
	},
	{
		"addressLine1": "710 E. Hatton Rd.",
		"city": "Wichita Falls",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76302",
		"name": "Faith Refuge Shelter for Women and Children",
		"organization": "Faith Refuge Shelter for Women and Children",
		"phone": "(940) 322-4673",
		"website": "https://faithmissionwf.org/",
		"description": "Faith Refuge provides shelter for women and children experiencing homelessness and a one-year New Beginnings Recovery Program for women who are interested in overcoming addictions and inviting Christ to transform their lives.\n\n\n\nFaith Refuge offers shelter and meals for women and mothers with children experiencing homelessness. It houses one main dorm for women, a dorm for women with children, one dorm for New Beginnings programmers, and one dorm for Career Academy students.\n\n\nThe New Beginnings Recovery Program for women is a 10-month residential work program for those desiring to overcome addiction. Women in the program assist with day-to-day operations of Faith Refuge.\n\nThe Faith Refuge Career Academy is a free 12-week Academy that prepares women for the workforce using biblical precepts for daily living. The Career Academy is also open to the public for free. Courses in the Academy include Boundaries, Anger Management, Computer Skills, Jobs for Life, Money Management, Parenting Plus, Professional Communication, and more. The Academy partners with Region IX Education Service Center to offer GED preparation and testing. It also partners with local businesses and volunteers to mentor and equip women for the workforce.\n\n\nGraduates of the New Beginnings Recovery Program for women and the Faith Refuge Career Academy are eligible to apply for a scholarship to further their education.\n\n\nWomen needing a safe place to stay can sign in at 5:00 p.m. daily or call Faith Refuge at 940-322-4673 to speak with someone.\n\n"
	},
	{
		"addressLine1": "1101 30th St.",
		"city": "Wichita Falls",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76302",
		"name": "Children's Aid Society of West Texas Inc.",
		"organization": "Children's Aid Society of West Texas Inc.",
		"phone": "(940) 322-3141",
		"website": "https://www.facebook.com/cas.shelter/?fref=ts",
		"description": "Provides emergency shelter to teens.Teen Emergency Shelter"
	},
	{
		"addressLine1": "P.O. Box 349",
		"city": "Greenville",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75403",
		"name": "Women In Need Inc.",
		"organization": "Women In Need Inc.",
		"phone": "(903) 455-4612",
		"website": "https://www.wintexas.org/",
		"description": ""
	},
	{
		"addressLine1": "1710 N McDonald St",
		"city": "McKinney",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75071",
		"name": "The Samaritan Inn McKinney",
		"organization": "The Samaritan Inn McKinney",
		"phone": "(972) 542-5302",
		"website": "http://www.thesamaritaninn.org/",
		"description": "The largest and leading homeless program in Collin County, Texas. The shelter provides a place for homeless residents looking to get back on their feet and has grown from 120 to 160 beds the past 10 years.\n\n\nTo be eligible, you must:\n\n\nHave a photo ID\n\nSubmit to a drug test\n\nSubmit to a background check\n\n\n\nTo apply, please come to The Samaritan Inn to meet with a case worker for an intake interview. Intake Interviews are held every day, 7 days a week, from 11 am to 2 pm. The waiting room is available starting at 10 am. For more information, please call 972.542.5302.\n\n\n\n\n\nAlso has supportive housing: The Gateway Apartments are across the street from the Inn. About 50 to 60 people live in 20 units at the apartments, for which they pay a discounted rent upon graduating from the Inn program."
	},
	{
		"addressLine1": "2505 Southmore",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77004",
		"name": "Lil Audrey's Safe Place",
		"organization": "Lil Audrey's Safe Place",
		"phone": "(281) 501-3807",
		"website": "http://www.lilaudreysafeplace.com/",
		"description": "Lil Audrey's Safe Place Foundation is a safe environment within a transitional homeless facility and emergency shelter that house alumni of the foster care system seeking a Post Secondary Education."
	},
	{
		"addressLine1": "1111 Lovett Blvd",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77006",
		"name": "Covenant House Texas",
		"organization": "Covenant House Texas",
		"phone": "(713) 523-2231",
		"website": "http://www.covenanthouse.org/homeless-charity/texas",
		"description": "Provides a shelter for homeless youth. Residents are provided with room, food, clothing, crisis intervention counseling, health services (both on site and through referral), short-term casework, counseling, substance abuse counseling, mental health counseling, GED program, education and vocational counseling and referral. Contact with Covenant House may enable youth to renew family ties and return home. Other youth are assisted in obtaining long-term placement or specialized treatment."
	},
	{
		"addressLine1": "6300 Chimney Rock",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77081",
		"name": "Chimney Rock Center Harris County Protective Services for Children",
		"organization": "Chimney Rock Center Harris County Protective Services for Children",
		"phone": "(713) 295-2600",
		"website": "http://hcps.harriscountytx.gov/",
		"description": "Emergency - Children Shelter"
	},
	{
		"addressLine1": "1010 Waugh",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77019",
		"name": "Houston Area Women's Center",
		"organization": "Houston Area Women's Center",
		"phone": "(713) 528-2121",
		"website": "https://hawc.org/",
		"description": "Shelter and support services to survivors of domestic and sexual violence.\n\nIndividuals and families fleeing from abuse can find safety and support our 120-bed shelter and residential facility. The Houston Area Womens Center shelter is at an undisclosed location and supports 24-hour surveillance and security personnel. Clients entering the shelter can expect clean and comfortable amenities and access to a host of programs, resources and support staff. Each client is assigned a case advocate and together they develop safety planning, goal setting and discuss additional community resources so the client may make informed decisions about the future. To promote economic stability and independence, the Career Development Program provides assistance and resources to help each client work towards educational and/or employment goals.\n\n \nChildren and youth are a top priority at the Women's Center. Our dedicated and highly trained children's staff create a safe and comfortable environment that focuses on the needs of each child so they can work through the trauma, develop coping skills and spend time having fun and being a kid again. To remove the barriers of securing childcare, we offer daycare, educational arrangements and after-school programming to ensure mothers can work towards goals, such as counseling, education and employment.\n \nAt the shelter clients will find:\n    Individual/Group Counseling services for women, youth and children.\n    Career Development Program, including skills assessment and training, career planning financial assistance for education.\n    Advocacy, resources and referrals provided during individual appointments and weekly meetings.\n    Women's and Children's Libraries\n    Cafeteria dining serves three nutritious meals each day to all residents.\n    Parenting education classes.\n    Bench-lined courtyard garden and covered age-appropriate play areas.\n    On-site early childhood education and Houston Independent School District classes.\n\n    Children's Enrichment Program providing opportunities for after school education, field trips, summer camps and special events.\n \nIf you need emergency shelter, please call the Domestic Violence Hotline 713.528.2121 or\nThe Sexual Assault Hotline 713.528-RAPE (7273)."
	},
	{
		"addressLine1": "10247 Algiers Rd",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77041",
		"name": "Mission of Yahweh",
		"organization": "Mission of Yahweh",
		"phone": "(713) 466-4785",
		"website": "https://missionofyahweh.org/",
		"description": "Women's Programs\n\nThe Mission of Yahweh offers many life-changing programs focused on ending the cycle of homelessness and dependency.\n    Emergency Shelter\n    Transitional Living Program\n    Seniors 60+ Program\n    Responsible Resident Program\n    Aftercare Program\n    Educational & Vocational Support\n    Case Management\n    Spiritual Counseling\n    Kingdom Expansion Program\n    Community Outreach\n\n\nThe Mission of Yahweh, Inc. is a faith-based shelter that empowers, enriches, and restores the lives of homeless women and children and provides outreach services to low-income communities.\n\n\nEligibility:Homeless women and their children; Boys maximum age eight, girls maximum age twelve; Must live in zip code 77041.\n\n\nMust be willing to donate 20 hours per week working at mission\n\nServices:Domestic Violence Shelters, Homeless Shelter for Single Parent Families Headed by Mothers. Food Pantry: Zip Code 77041 only; Shelter: Harris County"
	},
	{
		"addressLine1": "320 Hamilton St.",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77002",
		"name": "New Hope Housing Inc.",
		"organization": "New Hope Housing Inc.",
		"phone": "(713) 223-1995",
		"website": "http://newhopehousing.com/",
		"description": "Transitional housing for low income families.\n\nMission: New Hope Housing's core purpose is to provide life stabilizing, affordable, permanent housing with support services for people who live on very limited incomes. Our vision is to be an enduring institution serving Houstons most vulnerable citizens."
	},
	{
		"addressLine1": "15555 Kuykendahl Rd.",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77090",
		"name": "Northwest Assistance Ministries",
		"organization": "Northwest Assistance Ministries",
		"phone": "(281) 885-4555",
		"website": "https://www.namonline.org/",
		"description": ""
	},
	{
		"addressLine1": "4516 Old Yale St.",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77018",
		"name": "The Life Center for the Homeless",
		"organization": "The Life Center for the Homeless",
		"phone": "832-413-1746",
		"website": "http://lifecenterhouston.com/",
		"description": "The Life Center operates as a 24 hour refuge for those who are in need. There is also a 90 day Rehabilitation Program. There is an on site Director and an outreach team. We have a non-discrimination policy.\n\nThe Life Center is dedicated to serve, educate and represent the Homeless of Houston. Through the operation of a short-stay residential facility, and the combination of an educational program, an in-house work program and group counseling sessions, The Life Center hopes to impart sufficient work and basic living skills, along with a positive and focused mental attitude to Homeless individuals so they can take their proper place as productive and stable members of today's society."
	},
	{
		"addressLine1": "1603 McGowen",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77004",
		"name": "Salvation Army Houston Family Residence",
		"organization": "Salvation Army Houston Family Residence",
		"phone": "(713) 650-6530",
		"website": "http://salvationarmyhouston.org/family-residence/",
		"description": "Provides comprehensive total care for women and families needing temporary emergency shelter or transitional living. The Family Residence provides a place of safety and healing for women and children, many of whom are victims of domestic violence, crime, and generational poverty.\n\nEligibility:Legally married couple with children, women with children, single women; Must be physically and mentally stable, alcohol and drug free, capable of self care.\n\nHours: Mon - Fri 8:30am - 4:30pm.\n\nfull list of services: homeless shelter and transitional housing."
	},
	{
		"addressLine1": "2005 Jacquelyn",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77055",
		"name": "Santa Maria Hostel",
		"organization": "Santa Maria Hostel",
		"phone": "(713) 957-2413",
		"website": "http://www.santamariahostel.org/",
		"description": "The mission of Santa Maria Hostel is to empower women and their families to lead healthy, successful, productive and self-fulfilling lives.\nSanta Maria is Texas' largest multi-site residential and outpatient substance abuse treatment center and one of a very few to provide a comprehensive continuum for pregnant and parenting women and their children. Clients progress towards achieving improved mental and physical health, family functioning and economic stability that supports a drug- and violence-free lifestyle.\n\nSanta Maria is proud of its history in providing recovery services which have a long-term impact on individuals and families served. Through these services, clients complete substance abuse treatment, acquire parenting skills, develop job readiness skills, set and attain educational and employment goals, gain critical life skills, get referrals and information on resources and obtain permanent housing.\n\nEmergency Shelter\nSanta Marias emergency shelter for single women offers a short-term safe and secure environment for women in the Houston area who find themselves homeless or at the risk of becoming homeless or those fleeing domestic violence situations. The goal of the shelter is to serve as a bridge to assist residents in moving from an emergency situation to stable, appropriate housing.\nIn addition to short-term housing, the following support services are offered:\n    Case Management\n    Three meals per day\n    Assistance finding long-term housing\n    Transportation assistance\n    Access to primary care\n    Access to mental health services\n    Recovery support services\n    Access to substance use disorder treatment\n    Life skills\n    Job Readiness/Search assistance"
	},
	{
		"addressLine1": "419 Dowling",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77003",
		"name": "Star of Hope - Women & Family Emergency Shelter",
		"organization": "Star of Hope - Women & Family Emergency Shelter",
		"phone": "(713) 222-2220",
		"website": "http://www.sohmission.org/",
		"description": "Transitional living center for women and families. Apartments for 66 families and apartments for 45 single women are available.\n\nServices We Provide\n    Comprehensive Needs Assessment\n    Action Plan for Families and Singles\n    Food, Clothing and Shelter\n    Referrals for housing, social services, employment and job training\n    Chapel Services and Bible Studies\n    Motivational Classes\n    House of Hope Daycare and After School Tutoring\n    Activities for Children and Teens\n    Computer Learning Center\n    Playground\n    Wellness Clinic"
	},
	{
		"addressLine1": "5803 Harrisburg Blvd.",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77011",
		"name": "The Open Door Mission",
		"organization": "The Open Door Mission",
		"phone": "(713) 921-7520",
		"website": "https://www.opendoorhouston.org/",
		"description": "A Christ-centered emergency relief and rehabilitation shelter dedicated to meeting the needs of men in our community who are homeless addicted destitute and disabled.\n\nOpen Door Mission's DoorWay Substance Abuse Recovery Program\n\nTo rescue men enslaved by substance abuse disorders, co-occurring illnesses, and homelessness, the Mission's 7- month residential DoorWay Recovery Program (DoorWay) provides services to heal body, mind and spirit. The goal is to assist each student in making a successful transition into stable recovery and a lifetime of self-sufficiency and independent living.\nThe DoorWay Program provides intensive and supportive treatment services and The Mayfield House provides transitional living aftercare treatment for up to an additional 6 months to employed graduates of the DoorWay Program. The Mission's Social Services Department caseworkers assist the students while in residence and post-graduation by reducing or totally resolving the issues that have been mounting over years of ignoring medical, dental, legal, past taxes, and child support. The DoorWay Program has 148 beds and the Mayfield House can accommodate 16 graduates.\n\nAdmission to DoorWay Recovery Center\nAdmissions Process\n    Walk-ins only. Phone call not required but recommended before coming to the Mission (713-921-7520 ext.242). No one is accepted over the phone. In person interviews are required of everyone.\n    Interview with a Licensed Chemical Dependency Counselor\n\n    Arrival time between 6 AM - 10 AM Monday-Thursday only\n    No Admissions Friday-Sunday\n    The Mission provides clothing and hygiene products\nEligibility Requirements\n    Male\n    Must be at least 18 years of age\n    History of substance abuse\n    Passing the intake assessment upon arrival\n    Desire, willingness and attitude conducive to change\n    Tobacco free, non-smoking campus. No tobacco of any kind, matches or lighters.\n    Ability to prove identity\n    Physically able to do on campus job assignments\n    Minimum 30 day supply of prescribed medications\n    Requirements are subject to change at any time.\nIneligible Applicants\n    Active (untreated) communicable disease\n    Unable to perform self-care\n    Active felony warrants\n    High-risk psychiatric medications, such as benzodiazepines or opioid maintenance.\n    Serious psychiatric diagnosis\n    Severe cognitive deficits/dementia\n    Recent evidence of uncontrolled violent behavior\n    Fugitive\n    Registered sex offender\n    Individuals previously restricted by Open Door Mission\n\nNOTE: If the individual's condition upon arrival is not congruent with the information supplied, admission to the Open Door Mission will be refused.\n\n"
	},
	{
		"addressLine1": "4640 Main St. #213",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77002",
		"name": "U.S. Veterans Initiative Veterans Seeking Housing",
		"organization": "U.S. Veterans Initiative Veterans Seeking Housing",
		"phone": "(713) 797-2912",
		"website": "http://www.usvetsinc.org/houston/",
		"description": "Veterans Seeking Housing Service."
	},
	{
		"addressLine1": "1701 Jacquelyn Drive",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77055",
		"name": "Turning Point Center",
		"organization": "Turning Point Center",
		"phone": "(713) 957-0099",
		"website": "https://turningpointcenter.org/",
		"description": ""
	},
	{
		"addressLine1": "1811 Ruiz St",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77081",
		"name": "Star of Hope - Men's Development Center",
		"organization": "Star of Hope - Men's Development Center",
		"phone": "(713) 227-8900",
		"website": "https://www.sohmission.org/",
		"description": "Houston Homeless Shelter.\n\nStar of Hope is a Christ-centered community dedicated to meeting the needs of homeless men, women and their children. Positive life changes are encouraged through structured programs which focus on spiritual growth, education, employment, life management and recovery from substance abuse.\n\n\nProvides a 300 bed shelter and meals. Motivational classes and area referrals are available to shelter residents for employment, social services, spiritual programs, alcohol and drug counseling, mental health counseling, and medical assistance services to aid their recovery from homelessness. Maximum stay is 30 days unless extension is granted.\n\n\n\n\nMust be mobile and able to care for self; Married couples with children, women with children, men with children, and single women.\n\n\nComplete list of services: Family Crisis Shelters, Homeless Shelter, Transitional Housing Shelter."
	},
	{
		"addressLine1": "2009 Congress Street",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77002",
		"name": "Miryam's Hostel - Loaves and Fishes",
		"organization": "Miryam's Hostel - Loaves and Fishes",
		"phone": "(713) 224-1373",
		"website": "http://www.magnificathousesinc.org/Miryams.html",
		"description": "Emergency Women's Center\n\nAPPLY ONLY IN PERSON Loaves & Fishes the soup kitchen at 2009 Congress Street (at corner of Chartres)\n \nINTAKE  3:30 - 4:30 p.m.\nFirst come, first served!\nPlease note:   Our 8 beds fill up quickly. Must be on time.\n\nWomen who live on the street have special needs not always addressed by agencies. We offer a clean, secure dormitory bed for up to four nights, a hot bath, clean pajamas, and breakfast. We do not need her explanation for being on the street-we just care about her safety and well-being. Women needing this temporary service are also eligible to apply for residency in one of our regular women's houses.\n"
	},
	{
		"addressLine1": "1410 Elgin Street",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77004",
		"name": "Magnificat Houses, Inc. (Admissions and Supportive Services)",
		"organization": "Magnificat Houses, Inc. (Admissions and Supportive Services)",
		"phone": "(713) 529-4231",
		"website": "https://mhihouston.org/",
		"description": "They have houses for men, women and houses targeted to those with special needs.\nAll are safe, secure, and supervised 24/7.\n\nAll provide:\nNutritious home-cooked meals every day\nBasic laundry services\nBed linens, towels\n\nAll offer time to adjust to new circumstances, and the opportunity to grow with their community.\n\nWhat to Expect:\nFirst, help you get your identity established. Then provide counseling to help you plan a promising future. Often help with GED completion and job searches. When ready, you may qualify for specific skills training at our Moran Center.\n\nOf course, you will bring gifts of your own to share with the community: your experiences, your skills, your ideas, your willingness to help others like yourself. You will do your fair share to keep your home running smoothly.\n\n\nSome residents stay until their immediate problems lift. Others find meaningful work within the community and stay with us, sometimes, for years, as family."
	},
	{
		"addressLine1": "1811 Ruiz",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "07705",
		"name": "Doris and Carlos Morris Mens Development Center",
		"organization": "Doris and Carlos Morris Mens Development Center",
		"phone": "(713) 227-8900",
		"website": "http://www.sohmission.org/",
		"description": "Provides a walk-in day shelter and overnight shelter for homeless, transient men as well as a six-month program for men committed to changing their lives through spiritual and educational counseling. Serves three meals daily: 7:15am breakfast, 12:35pm lunch, and 5:30pm dinner. Emergency food (sack lunch) is available for those seeking to re-enter the workforce. Clothing is furnished in conjunction with showers at 9:30am and 8:30pm (for those spending the night). Shelter is provided overnight with the facility doors closing at 7:30pm.\n\nIntake procedure: Walk-ins accepted; Call for application\n\nServices We Provide\n    Shelter\n    Food\n    Clothing\n    Showers and Hygiene Products\n    Prayer and Counseling\n    Dunn Wellness Clinic\n    Referrals to Social Services\n    Looper Career Education and Development Center\n    Computer Learning Center\n    Van Outreach\n    Christian Library\n    Chapel Services"
	},
	{
		"addressLine1": "13617 Kaltenbrun Road",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77086",
		"name": "Spirit Key Transitional Housing",
		"organization": "Spirit Key Transitional Housing",
		"phone": "(281) 971-0014",
		"website": "http://www.spiritkey.org/",
		"description": "Transitional housing and work facility for homeless, ex-offenders and veterans. After care re-entry program.\n\nSpirit Key is a transitional work facility for men located in Houston, north Harris County. Our services include: housing, mentoring and job and life skills training.  We  have a greater than 90% success rate in assisting our clients in becoming viable and productive tax-paying citizens. Helping them to transform their lives from being tax burdens to tax payers. We have saved Texas taxpayers over 10 million dollars."
	},
	{
		"addressLine1": "1212 Prairie Street",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77002",
		"name": "The Beacon",
		"organization": "The Beacon",
		"phone": "(713) 220-9737",
		"website": "https://www.beaconhomeless.org/",
		"description": "The Beacon is more than a meal. It's a way out of homelessness. Our organization meets the daily needs of hundreds of homeless men and women while also empowering them with housing case management, appropriate program referrals, and civil legal aid. Our organization does not provide overnight shelter.\n\nThe Day Center:\nThe Day Center is open Thursday through Monday from 7:00 AM to 2:00 PM. The Day Center provides a hot lunch, access to showers, and laundry services and serves as the central hub for referral services to our other programs including housing assessments with Coordinated Access, pro bono legal services with Beacon Law, and case management and mail privileges with COMPASS as well as access to the Cathedral Clinic run by Healthcare for the Homeless.\n\nBrigid's Hope at The Beacon\nBrigid's Hope at The Beacon offers transitional housing and supportive services in an effort to reduce the number of women returning to the criminal-justice system.\n\nBeacon Law\nBeacon Law provides pro bono legal services for Houston's homeless and low-income individuals including ID restoration and criminal sealing cases.\n\nHousing/Coordinated Access\nThrough the Way Home initiative, homeless individuals are able to receive housing assessments onsite Monday through Friday from 8:00 AM to 3:00 PM.\n\nCOMPASS\nAfter merging in 2019, COMPASS and its services are now officially a part of The Beacon. These services include mailbox privileges, transportation services, walk-up case management, and access to the Harris Health System."
	},
	{
		"addressLine1": "3410 Drew Street",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77004",
		"name": "Madge Bush Transitional Living Center",
		"organization": "Madge Bush Transitional Living Center",
		"phone": "(713) 579-2729",
		"website": "https://www.wheelera5cs.org/",
		"description": ""
	},
	{
		"addressLine1": "5718 Westheimer Road",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77053",
		"name": "Almost There Supportive Services - For Women",
		"organization": "Almost There Supportive Services - For Women",
		"phone": "(281) 310-1457",
		"website": "https://almosttheresupportiveservice.com/",
		"description": ""
	},
	{
		"addressLine1": "7843 PARK PLACE BLVD.",
		"city": "HOUSTON",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77017",
		"name": "Crossroads At Park Place, Inc.",
		"organization": "Crossroads At Park Place, Inc.",
		"phone": "(713) 252-3604",
		"website": "https://crossroadsatparkplace.org/",
		"description": "What We Do: Crossroads are open each Tuesday and Thursday from 7:00 a.m. to 1 p.m.\n\nWe serve breakfast and lunch along with a generous portion of friendship. Shower facilities are available for women and men, we offer laundry services, a clothing closet, hygiene and first aid products, haircuts, computer terminals and our community partners provide medical and social services.\n\n\nOur Mission: Crossroads opened its doors in October 2001 with a simple mission: to provide services to promote the health, hygiene and dignity of homeless persons in Southeast Houston."
	},
	{
		"addressLine1": "2605 Parker Road",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77093",
		"name": "Bonita Street House of Hope",
		"organization": "Bonita Street House of Hope",
		"phone": "(713) 691-0900",
		"website": "http://www.santamariahostel.org/?s=bonita+house",
		"description": "Transitional housing with support services for persons who are homeless, chemically dependent, and ex-felons.\nInsurance accepted:\n$80.00 fee to live in shelter, with all bills paid.\n\nThe Bonita Hope Transitional Housing complex consists of eight buildings with 60 apartment units and two 16-bed dormitories. The facility provides a safe haven for up to 199 transitionally homeless men, women and children on any given night.\n\n\nHomeAid's mission is to build and renovate shelters for the temporarily homeless. On any given night more than one million men, women and children find themselves without a home. In fact, women and children represent the fastest growing segment of the homeless populations. Sadly, the average age of a homeless person is only 9 years old! The future is in our children - the sound of laughter, a safe and dignified place to live, a new vocation, skills that create new opportunities, family bonds renewed, counseling for parents, a sense of belonging, self-esteem and determination will all thrive under the roof of Bonita House of Hope, because you made a difference."
	},
	{
		"addressLine1": "6342 Ludington Dr",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77035",
		"name": "Grace and Joy Transitional Living",
		"organization": "Grace and Joy Transitional Living",
		"phone": "(832) 890-9253",
		"website": "",
		"description": "Transitional Living for the elderly and disabled women we also serve disabled males as well income-based program that offers 3 meals per day educational programs and to help those to be come back productive in society"
	},
	{
		"addressLine1": "1717 Congress",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77002",
		"name": "Salvation Army Center of Hope",
		"organization": "Salvation Army Center of Hope",
		"phone": "(713) 752-0677",
		"website": "https://www.salvationarmyhouston.org/center-of-hope",
		"description": "Open 24hrs. Center for single men without kids, looking to resolve their homelessness with the tools we help provide them with.\n\nThe Center of Hope, formally Sallys House, is designed to provide food and emergency or transitional housing to people in need.\n"
	},
	{
		"addressLine1": "5609 E Mt Houston Rd",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77093",
		"name": "Sonrise Shelter",
		"organization": "Sonrise Shelter",
		"phone": "(281) 449-0994",
		"website": "https://www.facebook.com/SonRiseCommunityChurchHTX/?rf=108131162561515",
		"description": ""
	},
	{
		"addressLine1": "7023 Crestmont",
		"city": "Houston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77033",
		"name": "Crowder's Assisted Living",
		"organization": "Crowder's Assisted Living",
		"phone": "(281) 701-0042",
		"website": "http:",
		"description": "Housing for veterans, the homeless, and those with mental disabilities. $650/month includes 3 meals a day, snacks, and all toiletries. Call Rosie for more information."
	},
	{
		"addressLine1": "711 Perla Street",
		"city": "Pasadena",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77502",
		"name": "Sarah's House",
		"organization": "Sarah's House",
		"phone": "(713) 475-1480",
		"website": "http://www.sarahshouse.org/",
		"description": "Sarah's House is a non-profit organization that provides emergency shelter for homeless single women or women with their children. Additionally, other services are offered such as: meals, clothing and other basic necessities.\n\nSarah's House main goal is to assist in providing these homeless families with stability, education and life-skills so that they can regain permanent housing. In order to do this, Sarah's House supports these homeless women's efforts to find employment opportunities and achieve self-sufficiency.\n\nFor additional information, please contact the office.\n\n"
	},
	{
		"addressLine1": "3811 Allen-Genoa Rd",
		"city": "Pasadena",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77504",
		"name": "Bridge Over Troubled Water Emergency and Transitional Shelter",
		"organization": "Bridge Over Troubled Water Emergency and Transitional Shelter",
		"phone": "(713) 472-0753",
		"website": "https://tbotw.org/",
		"description": ""
	},
	{
		"addressLine1": "1203 S Houston Ave",
		"city": "Humble",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77347",
		"name": "FamilyTime Crisis and Counseling Center",
		"organization": "FamilyTime Crisis and Counseling Center",
		"phone": "(281) 446-2615",
		"website": "https://familytimeccc.org/",
		"description": "Counseling Services\nFamilyTime offers professional counseling services for:\n    Individuals\n    Families\n    Couples\n    Teens\n    Group Counseling\n    Play Therapy for Children\n    Parenting Education Classes\n    Anger & Emotions Management Classes\nCounseling services at FamilyTime are designed to assist clients with the following Issues:\n    Past & Present Victimization(s)\n    Personal Growth\n    Marital & Relationship Issues\n    Self Esteem\n    Health & Wellness\n    Grief & Loss\n    Assertiveness Training\n    Communication Skills\n    Stress/Anxiety\n    Divorce: Past & Present\n    Mediation\n    Social Fears\n    Codependency\n    Conquer Phobias\nCost:  There is no fee for the first (intake) session.  All fees are charged on a sliding-scale and are due at the time of service.  Our office does not accept insurance as a form of payment for counseling services.\nFor those who are seeking counseling services to address issues stemming from a victimization such as domestic violence, sexual assault or other violent crime, you may be eligible for our free counseling program for victims of abuse.  Your counselor will discuss your potential eligibility for this program with you during your first session.  Not all clients will be eligible for this program.\n\nIf you are interested in scheduling an appointment for counseling or would like more information, please contact FamilyTime at (281) 446-2615."
	},
	{
		"addressLine1": "111 South Avenue G",
		"city": "Humble",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77338",
		"name": "Family Promise of Lake Houston",
		"organization": "Family Promise of Lake Houston",
		"phone": "(281) 441-3754",
		"website": "https://fplh.org/",
		"description": "Family Promise of Lake Houston will provide a caring and positive environment for homeless children and their families while they design and execute a plan to break the cycle of homelessness in their lives. While utilizing the energy of over 2,800 community volunteers, together we are dedicated to serve families who seek to be accountable, resilient, and strive for a better tomorrow for their families.\n\nWe serve low-income families that become homeless due to an unfortunate circumstance, such as a fire, flood, the death of a spouse, loss of a job, an eviction, or a foreclosure of a home. Our families include infants, children, teenagers, and couples. Single men and anyone with serious psychiatric problems or those with current drug or alcohol addiction problems are not appropriate; however, we work closely with other shelters in the area to ensure that those we are unable to serve find shelter elsewhere.\n\n\nFamilies wishing to participate in our program are encouraged to contact the Day Center Monday through Friday at 281-441-3754 to make an appointment for an intake interview. Our families agree to participate fully in a self-sufficiency program and adhere to all of our program guidelines and rules during their stay in the Network. Family Promise of Lake Houston is a sober program, and requires all participants to agree to random drug testing as a condition of acceptance into FPLH.\n\nWe accept referrals from all organizations and locally we work in partnership with HAAM, Family Time, 211 Texas as well as the Humble ISD advocates.\n\nLife Skills Center\nMonday - Friday\n8 a.m. - 5 p.m.\nIntake interview appointments: 281-441-3754\n\nFPLH requires that families save 80% of their income while in our shelter. Without food and housing expenses our families are able to develop a reserve. This income base allows each family to take the necessary steps toward independence and a better life for themselves and their loved ones. The savings help with apartment escrow and home down payments.\n\nFamily Promise operates at less than 1/3 the average cost of most shelters, and does not accept State or Federal funding to provide any service to our families or community."
	},
	{
		"addressLine1": "1005 Martin Luther King, Jr. Blvd (Ave. F)",
		"city": "Huntsville",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77320",
		"name": "Good Shepherd Mission",
		"organization": "Good Shepherd Mission",
		"phone": "(936) 291-8156",
		"website": "http://www.walkercountyonline.com/org/mission/",
		"description": "The Good Shepherd Mission Provides food, clothing, and temporary shelter to indigent locals and transients.\n\nServices include: Two hot meals daily, food bank, thrift store, human services, additionally offering limited prescription and travel-aid vouchers. Counseling and referral counseling is also provided.\n\n\nThe primary objective is to give those in need hope, meeting basic human needs, based upon New Testament teachings of Jesus Christ.This mission was founded by an ecumenical, interdenominational alliance of local ministers, in 1983. Local Church laity serve as Board Members. The individuals are elected by their church. The staff is less than 10, but uses over 20 volunteers.\n\nMeals\n\n    Each day of the year hot meals are served free of charge at noon and 6:00 PM. Sunday lunch is served at 1:00 PM.\n    All are welcome; however, all are expected to help with clean up (as able).\n    Lodgers have breakfast at 6:00 AM.\n    We are currently planning total renovations of the kitchen to a fully functional commercial kitchen where interns will be taught the Culinary Arts.  This will empower them for good jobs.  We are accepting funding for this ministry program.\n\nFood Pantry (Matthew 25:45)\n    Groceries are distributed at the Food Pantry  window Monday Friday from 9:00 AM to 12 PM.\n    Vouchers are awarded inside the front entrance of the Mission.\n\n    We serve an average of 140 households per week moving 135 tons of groceries a year.\n    Client applicants must provide Food Stamp verification and/or other sources of information such as utility bill documentation or letter of introduction from local churches.\n    Serving size depends on the number of people in the clients family.\n\n\nLodging\nOvernight lodging is available for needy travelers or those in local crises.\nWe average over 1,000 bed uses per month.\nA stay of up to three nights is the rule with exceptions to be counseled by the Director.\nFamilies and the employees here have longer stays if the situation is productive.\nThe goal is for a successful transition to self sufficiency.\nLodging may be denied or terminated because of health, safety or security reasons.\nShowers, linens, toiletries and clean clothes are available without charge.\nWe are strictly a night shelter. We are not a day shelter.\nNo one under the influence of dependency materials may be lodged."
	},
	{
		"addressLine1": "429 Washington",
		"city": "Kerrville",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78028",
		"name": "Hill Country Crisis Council",
		"organization": "Hill Country Crisis Council",
		"phone": "(830) 257-7088",
		"website": "https://hillcountrycrisiscouncil.com/",
		"description": "Our Emergency Shelter offers women and their children a short-term safe and secure environment to escape from the hand of domestic violence.\n\n"
	},
	{
		"addressLine1": "815 Hidalgo St",
		"city": "Laredo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78040",
		"name": "Bethany House Transitional Housing For Families",
		"organization": "Bethany House Transitional Housing For Families",
		"phone": "(956) 717-0882",
		"website": "http://www.bethanyhouseoflaredo.org/",
		"description": "Bethany House is operated by the Homeless Coalition it provides twenty beds for males, eight beds for females and two efficiency units for homeless families. If needed, the Resource Center can converted into an efficiency unit at night. The term of stay is 15 days of every 30 days, except for families who might need more time to stabilize their lives.\n\nEligibility: Homeless families and individuals needing a place to stay temporarily due to hardship situations.\n\n\nHours: Mon - Sun 6:00pm - 7:00am; Registration 6:00pm - 8:30pm\n\n\n\nEMERGENCY SHELTER\nThe emergency shelters provide short term housing to men and women that need a place to stay, shower and store their personal belongings. Terms of stay are generally 30 days after they undergo an intake process.\nThe Lamar Bruni Vergara Emergency Shelter has capacity for 10 women, while the Barbara A. Kazen Center for Hope has 28 beds for men.\nIn 2013, shelter was provided to 2,392 clients (43,056 beds were occupied).\nDuring extreme weather conditions, where demand for emergency shelter is higher, our resource center and other available rooms are temporarily conditioned for this purpose.\n\n\n"
	},
	{
		"addressLine1": "408 Matamoros St",
		"city": "Laredo",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78040",
		"name": "The Salvation Army Laredo Men's Shelter",
		"organization": "The Salvation Army Laredo Men's Shelter",
		"phone": "(956) 723-2349",
		"website": "https://www.salvationarmytexas.org/laredo/",
		"description": "Provides shelter for men only. Accommodates for the night only not an all day shelter. Showers are made available to those who will be staying the night. Lodge registration starts at 6:00pm lights out by 10:00pm.\n\nWalk-Ins Accepted (without prior phone call), call for information\n\nHours: Daily 6:00pm - 10:00pm\n\nOther Services provided at the Laredo Salvation Army:\nThe Salvation Army Soup Kitchen\nThe Salvation Army Christmas Assistance\nThe Salvation Army Family Emergency Service\nThe Salvation Army Disaster Service and Emergency Services\nThe Salvation Army Summer Camp"
	},
	{
		"addressLine1": "1607 South Washington Avenue",
		"city": "Livingston",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77351",
		"name": "GODTEL Ministries",
		"organization": "GODTEL Ministries",
		"phone": "(936) 327-8863",
		"website": "https://www.godtel.org/",
		"description": "Christian non-for profit shelter. 100 bed facility 50% women 50% men, separate housing for both. Children allowed but must be with parent at all times.\n\nTemporary housing, clothing and meals for residents. Clothing for non-residents on Tuesday, Wednesday and Thursday from 9:00am-11:30am\n\n\nServices provided at this location: Homeless drop in center and homeless shelter.\n\nHours: Main Office Mon-Fri 9:00am-5:30pm Shelter open 6:00am-10:00pm"
	},
	{
		"addressLine1": "3117 W. Marshall Ave",
		"city": "Longview",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75606",
		"name": "Highway 80 Rescue Mission",
		"organization": "Highway 80 Rescue Mission",
		"phone": "(903) 759-8101",
		"website": "http://hiway80mission.org/",
		"description": "Hiway 80 Rescue Mission provides services that make a real difference in the lives of men, women and children in our community who are in need of help.\nSome need just a hand up, while others require more intensive, long-term assistance. The Mission is here to meet all their needs, both physical and spiritual, and to utilize the services of other community agencies as needed.\n\n\nWe provide the following services to all at Hiway 80 Rescue Mission:\nFood (3 times a day, 365 days a year)\nClothing room\nPrescription assistance\nChapel services (365 days a year)\nTutoring\nShelter\nMedical clinic\nLaundry services\nComputer lab\nSpiritual counseling\nShowers and personal care items\nBeds\n\nHiway 80 Rescue Mission is a 501(c)(3) nonprofit organization and continues to provide emergency shelter for men, women and families who are homeless and in need of help. We do not receive any federal, government, or United Way funds. Hiway 80 Rescue Mission is a faith -based ministry and is funded through the generous contributions from individuals, local churches, businesses and corporations, and the community at large.\nNew Creation Discipleship Recovery Program\n\nServices provided to men who join our New Creation Discipleship/Recovery Program at Hiway 80 Rescue Mission:\n\n    Discipleship classes\n    Life Skills classes\n    Devotionals\n    Case management\n    Relapse prevention classes\n    Discipleship workbooks\n    Work therapy\n    Peer accountability\n    Recovery skills\n    Bible study/Scripture memorization\n    Tutoring\n    Counseling\n\nWomen and Families Shelter\nWe offer food clothing, shelter, and gospel services. Hiway 80 Rescue Mission provides solace and hope in the face of abuse, addiction or financial problems. Our Women & Families Shelter provides beds for at-risk women and children, along with physical, emotional and spiritual support in a safe, family oriented environment.\n"
	},
	{
		"addressLine1": "3117 W. Marshall",
		"city": "Longview",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75604",
		"name": "Hiway 80 Rescue Mission",
		"organization": "Hiway 80 Rescue Mission",
		"phone": "903-759-8101",
		"website": "http://www.hiway80rm.org/",
		"description": "Hiway 80 Rescue Mission provides services that make a real difference in the lives of men, women and children in our community who are in need of help.\n\nSome need just a hand up, while others require more intensive, long-term assistance. The Mission is here to meet all their needs, both physical and spiritual, and to utilize the services of other community agencies as needed.\n\n\nWe provide the following services to all at Hiway 80 Rescue Mission:\n\n    Food (3 times a day, 365 days a year)\n    Clothing room\n    Prescription assistance\n    Chapel services (365 days a year)\n    Tutoring\n    Shelter\n    Medical clinic\n    Laundry services\n    Computer lab\n    Spiritual counseling\n    Showers and personal care items\n    Beds"
	},
	{
		"addressLine1": "3011 West Marshall",
		"city": "Longview",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75604",
		"name": "House of Hope For Women",
		"organization": "House of Hope For Women",
		"phone": "(903) 295-0904",
		"website": "http://ahopeforwomen.org/",
		"description": ""
	},
	{
		"addressLine1": "1639 10th Avenue",
		"city": "Longview",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75602",
		"name": "The Salvation Army, Northwest Division | Longview Corps Community Center",
		"organization": "The Salvation Army, Northwest Division | Longview Corps Community Center",
		"phone": "360-423-3992",
		"website": "https://www.salvationarmytexas.org/Longview/",
		"description": "Our Social Services Office is open Monday to Thursday 9am - 4pm and Fridays 9am - 12 Noon onThe emergency shelter opens daily at 5pm.\nThe Salvation Army Emergency Shelter provides meals and lodging 365 days a year. Men, Women and Families receive a warm nutritious meal and a comfortable place to stay as they search for a job and other services to help them get back on their feet.\n\nShelter opens at 5:00pm; meals for those in shelter 6:00pm; meals for the community 6:30pm\n\nEligibility: Anyone in need of emergency assistance\n\nFees: None\n\nIntake Procedure: Walk-in, or call for appointment."
	},
	{
		"addressLine1": "2610 Elysian Fields Ave.",
		"city": "Marshall",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75672",
		"name": "Marshall's My Friend's House, Inc.",
		"organization": "Marshall's My Friend's House, Inc.",
		"phone": "903-930-2739",
		"website": "mailto:atmyfriendshouse@gmail.com",
		"description": "Shelter Fees: $10.00 per day, per person  ($5 for children).\n\nMarshall's My Friend's House, Inc., a non-profit, Texas corp. with 501 ( c ) 3 status. Capacity is 12 residents including 8 single men and 4 single women. We are a temporary, transitional facility offering a place to stay until one can get up on one's feet. Residents must follow basic rules, help with the house work and be looking for work and willing to try to move on. There is a charge of $10 per day, but some of this can be worked off by working in the thrift store which is on the campus. Admission is by completing a short application, interview and background check and limited to suitability and availability of space."
	},
	{
		"addressLine1": "1319 15th St",
		"city": "Lubbock",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79408",
		"name": "Family Promise of Lubbock",
		"organization": "Family Promise of Lubbock",
		"phone": "(806) 744-5035",
		"website": "https://familypromiselubbock.squarespace.com/",
		"description": "Family Promise of Lubbock offers temporary shelter and support to homeless families with children. Our guests are committed to seeking employment and saving their income to achieve sustainable housing. Family Promise provides shelter through an Interfaith Hospitality Network.\n\nFamily Promise of Lubbock's mission is to provide homeless families with children the tools necessary to achieve long term financial, parental and personal self-sufficiency through a comprehensive program of temporary housing, case management and supportive services."
	},
	{
		"addressLine1": "1111 16th Street",
		"city": "Lubbock",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79401",
		"name": "The Salvation Army South Plains Texas",
		"organization": "The Salvation Army South Plains Texas",
		"phone": "(806) 765-9434",
		"website": "https://southernusa.salvationarmy.org/lubbock/",
		"description": "Clients may stay 30 nights. Extensions are available on a case by case basis after the client has met with a case worker. Mail box and voicemail service is available. The family apartment style rooms also have laundry and shower facilities.\n\nEligibility: Homeless men, women and families. Walk Ins Accepted\n\nHours: 24 hours a day, 365 days a year.\n\nSoup kitchen hours:\nMondays through Fridays: Breakfast  6:00 am-6:45 am, Lunch 11:00 am-11:45 am, Dinner at 5:00 pm-5:45 pm\nSaturdays, Sundays: Breakfast 6:00 am-6:45 am, Lunch 11:00 am- 11:45 am, Dinner at 5:00 pm-5:45 pm\n\n\n\nComplete list of SOCIAL SERVICES at Salvation Army Lubbock\n\n    Emergency Shelter\n    Feeding Program\n    Rapid-Rehousing\n    Rent and Utility Assistance\n    Food Vouchers\n    Clothing Vouchers\n    Hygiene Kits\n    Cooling and Warming Stations\n    Public Showers\n"
	},
	{
		"addressLine1": "1611 Avenue O",
		"city": "Lubbock",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79401",
		"name": "Restoration Empowerment Center Shelter for Women and Children",
		"organization": "Restoration Empowerment Center Shelter for Women and Children",
		"phone": "(806) 775-0851",
		"website": "https://restoration-empowerment-centers.org/",
		"description": ""
	},
	{
		"addressLine1": "407 L Casillas Blvd",
		"city": "Clovis",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "88101",
		"name": "Lighthouse Mission Clovis",
		"organization": "Lighthouse Mission Clovis",
		"phone": "(575) 769-7775",
		"website": "http://clovislighthousemission.org/",
		"description": "Services:\n\nHOMELESS SHELTER\nEmergency shelter for men, women, and children 365 days a year.\nNo one plans to be homeless. It can happen literally overnight. In hard economic times the homeless rate increases sharply and there is no doubt that a record number of people will find themselves homeless in 2015. Even some people that do work just can't make ends meet and pay the rent. The Lighthouse provides shelter on a transitional or emergency basis making sure people aren't exposed to the weather or living out of a car.\n\nRECOVERY PROGRAM- Men & Women\n6 month residential drug and alcohol recovery program.\nThe Lighthouse Mission Discipleship Program is a 6 month residential recovery program. It is designed to help disadvantaged individuals who are battling life threatening addictions. A clean and sober environment is needed to heal physically, emotionally and spiritually. Each person enrolled will be given the 'tools of life' skills that will enable them to once again be productive members of society.\n\nCLOTHING BANK\nProviding gently-used clothing  Monday-Thursday.\n The Missions clothing bank provides new and used clothing, shoes, books, toys, household items and small kitchen appliances to those that cannot otherwise afford those items. Warm clothing is essential to our well-being. Presentable clothing can make the difference in that 'first impression' at a job interview or whether a child is accepted or ridiculed by their peers at school. Irrespective of being right or wrong this is a reality. Providing a family with decent clothing and shoes can boost opportunities in both employment and education and provide a path to rebuild their lives to become self-sufficient. Providing suitable toys and books for children can also lead to a more normalized life style. Volunteers sort through and categorize and organize these items for local assistance however many items are sent to impoverished countries as well.\n\n\nSOUP KITCHEN\nFighting hunger by providing well-balanced meals 7 days a week.\nIn 2014 The Lighthouse Soup Kitchen, also know as Bonner Hall, served 43,510 balanced meals(not including homeless shelter nighttime meals) to those in need. We anticipate a record year in 2015 as the struggle of our economy increases. Think about how your mind wanders that hour before you go to lunch then try to imagine not knowing where that next meal will come from. Nothing will discourage a person's heart and mind quicker than the pain of hunger. A education of a child suffers when they are hungry. Our bodies become subject to illness when we are weakened by malnutrition. Our hopes of employment and improvement vanish when our entire goal of our day becomes just finding food. Directly addressing this food insecurity is the first step in human recovery. Our minds begin to think more clearly when not being punished by the pain of hunger.\n\n"
	},
	{
		"addressLine1": "3909 North Street",
		"city": "Nacogdoches",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75964",
		"name": "Family Crisis Center of East Texas Nacogdoches",
		"organization": "Family Crisis Center of East Texas Nacogdoches",
		"phone": "(936) 569-1018",
		"website": "https://www.familycrisiscenterofeasttexas.com/",
		"description": "Supports women and children who are victims of domestic violence; Also offer food clothing transportation.\n\n\nEmergency Shelter\n\nThe Family Crisis Center of East Texas operates a 39-bed emergency shelter, or Safehouse. This 24-hour facility offers services to victims and their children such as food, clothing, peer support, transportation, self-sufficiency assistance, and community referrals. Clients also receive case management to secure criminal justice support, employment, housing, child care, counseling, and health services. The Safehouse was built in 2008 and has a Family Room, Teen Room, Exercise Room, Computer Room, Play Room, Comfort Room, Outside Play Area, Kitchen, Dining Room, and ten bedrooms, each complete with a private bath.\n\n"
	},
	{
		"addressLine1": "420 North 21st St.",
		"city": "McAllen",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78501",
		"name": "Mujeres Unidas/Women Together",
		"organization": "Mujeres Unidas/Women Together",
		"phone": "(956) 630-5053",
		"website": "http://mujeresunidas.org/",
		"description": "Nueva Vida Transitional Supportive Housing Program\n\nNueva Vida Supportive Housing Program was founded in 2002 to provide short term (18 months) supportive housing to women and their children who are victims of family violence and/or sexual assault.\n\nNueva Vida is designed to:\nAssist families to become independent and self-sufficient\nAssist with referrals to community resources\nAssist with enrollment in higher education\nAssist in obtaining better employment"
	},
	{
		"addressLine1": "1901 Cedar",
		"city": "McAllen",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78501",
		"name": "Victory Ministries of the Rio Grande Valley, Inc",
		"organization": "Victory Ministries of the Rio Grande Valley, Inc",
		"phone": "(956) 702-2781",
		"website": "mailto:rolandomvm@aol.com",
		"description": ""
	},
	{
		"addressLine1": "111 S. 15th St.",
		"city": "McAllen",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78501",
		"name": "Catholic Charities Respite Center Shelter",
		"organization": "Catholic Charities Respite Center Shelter",
		"phone": "(956) 702-4088",
		"website": "http://sacredheartchurch-mcallen.org/immigrant-assistance/general-information/",
		"description": "Temporary Shelter\n   Valid Photo ID for all adults in the household\n    Birth certificates & social security cards for all children in the household\n\n    Eviction notice if available or letter from friend or relative situation\n\n    \n"
	},
	{
		"addressLine1": "705 East Santa Rosa",
		"city": "Victoria",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77901",
		"name": "Perpetual Help Home Women's Shelter",
		"organization": "Perpetual Help Home Women's Shelter",
		"phone": "(361) 575-5335",
		"website": "http://www.perpetualhelphome.org/",
		"description": "Perpetual Help Home is a Christian housing for women and children, job training, and financial planning. We are a permanent supported housing program.\n\nEligibility: Ex-offenders, drug rehabilitation, homeless women, battered women.\n\n\nFees: Varies, client is expected to work and contribute 10% to church.\n\n"
	},
	{
		"addressLine1": "2400 Whitmire Blvd Suite 100",
		"city": "Midland",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79705",
		"name": "Midland Fair Havens",
		"organization": "Midland Fair Havens",
		"phone": "(432) 689-3411",
		"website": "http://www.mfh.org/",
		"description": "Midland Fair Havens equips single mothers and their children for self-sufficient living by addressing their educational, vocational, spiritual, and emotional needs in residential and non-residential settings.\n\nServices for residential clients:\nHousing at no cost for up to 24 months\nIndividual case management with emphasis on\naccountability to a plan of personal goals Life skills training in the areas of finance, parenting, health, nutrition, personal development, and Bible study\n\nConsistent emotional support through the care of Christian staff and volunteers\nReferral to community resources for education, vocational evaluation and development, counseling, and family assistance\n\nServices for non residential clients:\nFinancial assistance for utilities and rent, including budgeting advice, to prevent homelessness\nBasic needs assistance with clothing, food and personal hygiene items\nReferral to community resources for education, vocational evaluation and development, counseling, and family assistance"
	},
	{
		"addressLine1": "2908 W. Ohio",
		"city": "Midland",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79701",
		"name": "Family Promise of Midland",
		"organization": "Family Promise of Midland",
		"phone": "(432) 218-7630",
		"website": "https://familypromiseofmidland.com/",
		"description": "Family Promise of Midland, TX serves FAMILIES experiencing the crisis of homelessness.\n\nQualifications:\nIn order to qualify, the family must be homeless and have at least one child under the age of 18 years in their care. We accept single moms, single dads, and two parent families.\nThis is NOT a hand-out program; it's a hand-up.\nFamilies MUST be willing to be dedicated to helping themselves achieve greater independence and self-sufficiency. Free childcare is provided, so parents can work full-time, go to school full-time, or a combination thereof. All families work with a case manger on weekly goals. Families must be willing to follow rules and get along with other families. Background checks and drug screenings are conducted on all families.\n\nOffice Hours:\n"
	},
	{
		"addressLine1": "600 East Wall Street",
		"city": "Midland",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79701",
		"name": "Salvation Army Midland TX Homeless Shelter",
		"organization": "Salvation Army Midland TX Homeless Shelter",
		"phone": "(432) 683-3614",
		"website": "https://www.salvationarmytexas.org/midland/",
		"description": "The shelter accommodates up to 70 people each night. Houses men, women, mothers with children, and for the first time, fathers with children.\n\nThe Salvation Army continues to provide daily meals, hygiene kits, food boxes, emergency financial assistance, clothing and furniture vouchers and other services.\n\n\nA laundry facility is also available to shelter guests.\nThe Salvation Army provides emergency shelter for women, children, and men. The period of time they can stay at the shelter depends on each individual case. While at the shelter, the residents receive three nourishing, healthy meals. A person/persons may stay at the shelter for five nights without having to speak to the Social Worker. If further lodging is needed, an arrangement to speak to the Social Worker will be made and time will be extended. Children must be accompanied by parents, must have valid id and social security card"
	},
	{
		"addressLine1": "4100 N FM 1788",
		"city": "Midland",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79707",
		"name": "American Heritage Cemetery Funeral Home Crematory",
		"organization": "American Heritage Cemetery Funeral Home Crematory",
		"phone": "(432) 653-0643",
		"website": "https://www.thehealingstartshere.com/",
		"description": "As a respected provider of cemetery & funeral services for Midland & Odessa, TX, American Heritage Cemetery Funeral Home Crematory is highly dedicated to helping people honor their loved ones and design a resting place unlike any other. Beside providing cemetery and funeral services, we also have an onsite crematory and can help you design a healing experience that is customized to individual needs. In addition, we offer veterans a special rate on our cemetery property. Contact us today to find out more about our services for Texans.We specialize in funeral services including funeral planning services in Odessa & Midland, TX, on-site crematory in Odessa & Midland, TX, and obituaries in Odessa & Midland, TX."
	},
	{
		"addressLine1": "1354 East 6th Street",
		"city": "Odessa",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79761",
		"name": "Family Promise of Odessa",
		"organization": "Family Promise of Odessa",
		"phone": "(432) 934-6693",
		"website": "https://www.facebook.com/familypromiseofodessa/",
		"description": "Family Promise of Odessa, Inc exists to enable transitional families with children to achieve lasting self-sufficiency by providing temporary shelter, meals and access to existing community social services.\n\nFamily Promise has 5 components that work together to provide services to homeless families. The shelter is open from 5:30pm to 7:00pm different sites location. The agency help families find housing and jobs and to secure entitlements.\n\n\nEligibility: No current substance abuse, no handicap, must pass criminal background, required to have children.\n\nIntake Procedure: Appointment Required."
	},
	{
		"addressLine1": "1335 East 6th Street",
		"city": "Odessa",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79761",
		"name": "Jesus House of Odessa",
		"organization": "Jesus House of Odessa",
		"phone": "(432) 272-3362",
		"website": "https://www.jesushouseodessa.com/",
		"description": "Office hours:\nMonday - Thursday 8:00am-12noon.\n\nGentleman's Transitional Program\nIf you need shelter for up to 1 year while you get back on your feet, please read the documents we have provided to get started. Please be aware that we can not accept sex offenders at any time, those with diagnosed with schizophrenia or bi-polar disorders, or violent offenders within the last 5 years.\n\n\nMen's Transitional Program please call 432-272-3362 for information\n\nWomen and Children's Center please call 432-272-3362 for information"
	},
	{
		"addressLine1": "810 East 11th Street",
		"city": "Odessa",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79761",
		"name": "Salvation Army Odessa TX Homeless Shelter",
		"organization": "Salvation Army Odessa TX Homeless Shelter",
		"phone": "(432) 332-0738",
		"website": "http://www.salvationarmytexas.org/odessa/",
		"description": "The Emergency Shelter lodging serves meals daily at 5:00 pm 7 days a week. Must have picture ID, stay in the shelter. Shelter opens at 5:00 pm every day, Walk-ins accepted.\n\nProvides showers at six pm every night male and female towel and soap included."
	},
	{
		"addressLine1": "1213 West 2nd Street",
		"city": "Odessa",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79763",
		"name": "Mission Messiah for Women and Children",
		"organization": "Mission Messiah for Women and Children",
		"phone": "(432) 580-5222",
		"website": "https://missionmessiah.org/",
		"description": "Mission Messaih offers a twelve month Christian oriented program for women and their children who are in need of shelter and serious about change.\n\nEligibility: Women and their children."
	},
	{
		"addressLine1": "P.O. Box 1456",
		"city": "Mount Vernon",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75457",
		"name": "The Madeline House & Grace Outreach",
		"organization": "The Madeline House & Grace Outreach",
		"phone": "(903) 717-2317",
		"website": "mailto:ayarnoldwomenministries@gmail.com",
		"description": "We are a Christian emergency temporary shelter for women and children. We also have an outreach service to assist in connecting ladies with criminal background friendly employers, insurance, substance abuse rehabilitation, mental treatment, We are highly confidential for protection of residents and staff.\n\nWe facilitate weekly recovery and bible study groups among other events as weekly church service and money management. We have childcare for women working.\n\nMissionTo provide a safe home and environment for women and their children (if needed) involved in/victims of domestic violence situations, emergency situations ie; being released from jail and have lost home or job and do not want to return to prior negative living arrangement, or as well as connecting and guiding them to the proper agencies and services they are in need of at that moment.\n\nServices / ProgramsWe offer temporary short term, emergency housing and shelter for women in need during extreme or traumatic times.\nWe also assist with transportation allowing them to maintain or seek employment or physician appointments.\nWe connect and direct the ladies through our Grace Outreach Program to agencies such as food banks, clothes closets, low-income housing, felon-friendly employers and services including drug & alcohol counseling, legal-aid, Texas Medicaid, etc.\n\n\n\n\n"
	},
	{
		"addressLine1": "1114 Epps Rd",
		"city": "Palmer",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75152",
		"name": "Serenity Veterans Village",
		"organization": "Serenity Veterans Village",
		"phone": "(469) 319-1229",
		"website": "https://www.serenityveteransvillage.org/",
		"description": ""
	},
	{
		"addressLine1": "507 W. Jefferson",
		"city": "Waxahachie",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75165",
		"name": "Daniel's Den Ministries - Emergency Homelessness Response Services",
		"organization": "Daniel's Den Ministries - Emergency Homelessness Response Services",
		"phone": "(972) 938-0103",
		"website": "http://www.danielsdenelliscounty.org/",
		"description": "Daniel's Den\nEMERGENCY ASSISTANCE/EMERGENCY SHELTER\n\nNo \"walk-ins\".  Assistance is available 24/7 to anyone regardless of gender, residency or situation when referred by the local law enforcement agencies or hospitals.\n \nThe needs of the client are reviewed for referral to the appropriate agency which can help them be restored to a productive life.\n\n\nTransportation assistance is available if we are unable to provide long-term services for them in Ellis County. Transportation assistance includes agency transport, long distance bus tickets, gasoline so they can get to other facilities and/or family and friends.\n\nEmergency shelter assistance includes a meal, bath, toiletries, clothing, and a warm bed.  Due to limited overnight staff and volunteers, emergency shelter is available only if there are no other options at the time.\nSamaritan House\nTRANSITIONAL HOUSING\n\nApplication approval is required.  Please call for an appointment.\nHousing is subject to space availability.  \n\nTransitional housing program provides housing for single women, women with children and legally married couples who are residents of Ellis County.  Residents are provided with personalized case management services for an average of six months.  Other services include job search assistance, clothing, transportation, childcare, general health exam and financial stability training.  All residents are required to attend a local church of their choice. "
	},
	{
		"addressLine1": "P. O. Box 260671",
		"city": "Plano",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75026",
		"name": "Emily's Place Transitional Housing For Women",
		"organization": "Emily's Place Transitional Housing For Women",
		"phone": "(972) 424-7775",
		"website": "https://emilysplacetx.org/",
		"description": "Emily's Place is not a shelter, which typical allows women to stay for 30 - 90 days. Rather, it is a transformational housing ministry based on a 24 month stay commitment which promotes stability and wise choices.\n\nThe transformational program includes counseling, addictions recovery, vocational assistance, life skills development and spiritual nurturing--all within a structured environment of 24/7 live-in staff who are dedicated to offering the support and accountability needed to transition from a difficult past into a bright future.\n\n\nFor victims of domestic violence, Emily's Place is the BRIDGE from the shelter back into the community."
	},
	{
		"addressLine1": "undisclosed location",
		"city": "Richmond",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77406",
		"name": "Fort Bend County Women's Center",
		"organization": "Fort Bend County Women's Center",
		"phone": "(281) 342-4357",
		"website": "https://fbwc.org/",
		"description": "Emergency Domestic violence shelter for Women and Children - undisclosed location\n\nOur services include our 24 hour crisis hotline, emergency shelter, counseling, legal and medical support and much more. We also offer community education and outreach designed to reduce domestic violence and sexual assault.\n\n\nWe provide emergency shelter for individuals and their families. In addition to a place to sleep, we provide meals, basic medical care, childcare and a range of support services to help you heal from your abuse and begin to rebuild your life. Our shelter is in a private, secure location.\n\nIf we have space for you and your family, well help you make a plan to get to us safely.\n\nIf you have been sexually assaulted, we can ask one of our team to meet you at the hospital and stay with you while youre examined. Our specially trained advocates will help you make sense of whats happening and support you as you make decisions about what you want to do next, including potentially coming to our shelter or using some of our other services,\n\n"
	},
	{
		"addressLine1": "518 S. Guadalupe St",
		"city": "San Marcos",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "78666",
		"name": "Southside Community Center Homeless Shelter",
		"organization": "Southside Community Center Homeless Shelter",
		"phone": "(512) 392-6694",
		"website": "https://www.southsidecommunitycenter.org/",
		"description": ""
	},
	{
		"addressLine1": "1602 E Lamar St",
		"city": "Sherman",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75091",
		"name": "North Texas Youth Connection",
		"organization": "North Texas Youth Connection",
		"phone": "(903) 893-4717",
		"website": "http://www.ntxyouthconnection.org/",
		"description": "North Texas Youth Connection provides emergency shelter and safety to\nhomeless and otherwise disenfranchised youth ages 11-17. We provide\n\nemergency shelter for over 100 young people each year, as well as\ntransitional living arrangements for youth ages 16-17.\n\n\n24-hour Crisis Hotline 1-800-568-7776."
	},
	{
		"addressLine1": "P. O. Box 1923",
		"city": "Springtown",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76082",
		"name": "CLOSED: Liberty Lighthouse, Inc.",
		"organization": "CLOSED: Liberty Lighthouse, Inc.",
		"phone": "(817) 523-0222",
		"website": "http://www.libertylighthouseinc.org/",
		"description": "Shelter had to close end of 2013:\nLiberty Lighthouse, Inc. offers shelter to women of all ages and those with children whose lives have been devastated by circumstances causing homelessness through abuse, abandonment, poverty or any life altering situation. While in the shelter, residents participate in a 12-month program focusing on education, counseling and mentoring with the goal of becoming self-sufficient."
	},
	{
		"addressLine1": "402 Oak Street",
		"city": "Texarkana",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75501",
		"name": "Randy Sams' Outreach Shelter, Inc.",
		"organization": "Randy Sams' Outreach Shelter, Inc.",
		"phone": "(903) 792-7024",
		"website": "http://www.randysams.org/",
		"description": "The Randy Sams' Outreach Shelter is a 24 hour evening emergency shelter that accepts both men and women (no persons under the age of 18). There are 86 beds with restroom facilities, daily meals, and case management services. The length of stay is limited to 90 days. Rent and utility assistance may be available as funds are limited.\n\nhe RSOS is a 90-day shelter that provides basic essential activities of daily living such as meals, seperate sleeping areas for men and women, and bathrooms which include shower facilities for residential clients. Each day breakfast is served at 6:00am and dinner is served at 6:00pm. Clients are encouraged to have lunch across the street at the Friendship Center from 11:00am-1:00pm. Clients leave during the day at 8:00am and can return for check-in at 3:30pm. A complete list of rules will be reviewed during admission."
	},
	{
		"addressLine1": "424 Spruce St",
		"city": "Texarkana",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75504",
		"name": "Domestic Violence Prevention",
		"organization": "Domestic Violence Prevention",
		"phone": "(903) 794-4000",
		"website": "https://www.dvptxk.org/",
		"description": "DVP provides emergency shelter, immediate crisis intervention and advocacy, a 24 hour crisis hoteline, emergency and medical transportation, legal advocacy and court accompaniment, educational and supportive activities for children, education and support groups for adult and child victims of sexual assault/incest and domestic violence, individual counseling for shelter residents and nonresidents, and community referrals and information. Also, a battering intervention and preventio"
	},
	{
		"addressLine1": "633 North Broadway Avenue",
		"city": "Tyler",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "75702",
		"name": "Salvation Army of Tyler Texas",
		"organization": "Salvation Army of Tyler Texas",
		"phone": "(903) 592-4361",
		"website": "https://www.salvationarmytexas.org/tyler/",
		"description": "The Salvation Army in Tyler is the only residential shelter in the area that serves both men, women, and children; we also operate both an emergency shelter and a transitional living shelter and programs. All residents of either program are able to receive hot meals to feed their bellies, to wash their clothes for safety and health, to sleep soundly in safety, and to receive counseling and spiritual guidance.\n\nEmergency Housing\nEmergency housing is available for those who wish to only stay 1-5 nights in our shelter. Those who are passing through town, those who have temporary housing problems due to a disaster, and those who prefer to be homeless but are forced indoors by heat, cold, or bad weather seek refuge in our shelter. These residents are not required to participate in a work program or enter our transitional shelter. They are however, encouraged to consider if they would like to be a part of our larger community while developing their own self-sufficiency abilities.\n\nTransitional Housing\nIndividuals and families that find themselves homeless but are eager to find their way again enter our transitional housing program, which includes a work component. The H.E.L.P. (Holistic Employment and Life-skills Placement) Program, a 90-120 day work program, empowers our residents. Counseling services, transportation, recreational activities, spiritual guidance, hot meals, clean clothes, and more await those who enter into this program to build their life back, one block at a time. Obtaining and maintaining employment, building savings, receiving physical and mental health services, and more are the services provided and steps taken to provide these residents a hand up and not a hand out.\nComplete list of Services Offered:\n    Worship Services (Wed. & Sun.)\n    After School Program (K-5th grade)\n    Summer Day Camp\n    Shelter (Men, Women, Families)\n    Angel Tree (Christmas Assistance Program)\n    Grocery Assistance\n    Clothing Vouchers\n    Referrals to other agencies\n    In-House Rehabilitation Program\n    Soup Kitchen: Open to Public at 4:30pm Daily\n    Showers: Open to Public twice daily\n    Senior Citizen Residences\n"
	},
	{
		"addressLine1": "210 West Broadway",
		"city": "Van Horn",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "79855",
		"name": "Van Horn Community Christian Shelter",
		"organization": "Van Horn Community Christian Shelter",
		"phone": "(432) 283-1631",
		"website": "https://www.instagram.com/explore/locations/393426304587276/van-horn-community-christian-shelter/",
		"description": ""
	},
	{
		"addressLine1": "1302 N. Louis",
		"city": "Victoria",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77901",
		"name": "Salvation Army Victoria TX",
		"organization": "Salvation Army Victoria TX",
		"phone": "(361) 576-1297",
		"website": "https://www.salvationarmytexas.org/victoria/",
		"description": ""
	},
	{
		"addressLine1": "1421 Austin Ave.",
		"city": "Waco",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76701",
		"name": "Compassion Ministries of Waco",
		"organization": "Compassion Ministries of Waco",
		"phone": "(254) 755-7640",
		"website": "http://compassionwaco.com/",
		"description": "The goal of Compassion Ministries is to provide a homelike atmosphere to families with children who are homeless or unable to maintain their current residence. The program provides a more secure and stable home environment that allows those in personal and financial crises to re-establish themselves.\nWhile living in our transitional housing facility, we provide services that include family counseling, job training/search, drug/alcohol abuse treatment, daycare, childrens programs, transportation, literacy training, health care, social and domestic skills, using in-house staff and in conjunction with local agencies currently providing support services.\n\nHope House Transitional Shelter\nCompassion Ministries is the only transitional homeless facility in Central Texas for families with children. Hope House provides 14 apartments for families. We believe that an apartment living environment as opposed to community living promotes personal independence and responsibility. We serve an average of 50 families annually, including approximately 100 children ranging from infancy to 17.\n\nAdmissions\nTo be admitted into the Compassion program, residents must:\n    Be alcohol and drug free;\n    Work closely with assigned Compassion caseworkers;\n    Obtain full-time employment within the first 30 days in the program and pay approximately 30% of their gross income for rent;\n    Attend weekly counseling sessions provided by community volunteers in budget and employment skills.\nTo Apply for Admission:\nPlease download all the forms on our website. Please fill out the application form and bring it, along with your picture ID and social security card (if you have one), to a personal interview on any Tuesday at 2 p.m. at 1421 Austin."
	},
	{
		"addressLine1": "4721 W Waco Dr",
		"city": "Waco",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76710",
		"name": "Salvation Army Waco Emergency Shelter Transient Lodge",
		"organization": "Salvation Army Waco Emergency Shelter Transient Lodge",
		"phone": "(254) 753-2648",
		"website": "http://www.salvationarmytexas.org/waco/",
		"description": "Overnight shelter provided for men. Also, 2br/ meals per day through on-site feeding and clothing everybr/ 30 days provided. Showers are available daily.\n\nEligibility: Low income or crisis situation, 1 night per month for local residents except during cold or bad weather or through special arrangements with a caseworker; 3 nights per year if transient. ID is required for lodging or police clearance.\n\nHours: Mon - Sun 7:00pm - 7:00am."
	},
	{
		"addressLine1": "4721 W Waco Dr",
		"city": "Waco",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76710",
		"name": "Salvation Army's Sally's House",
		"organization": "Salvation Army's Sally's House",
		"phone": "(254) 756-7271",
		"website": "http://www.salvationarmytexas.org/waco/",
		"description": "The Salvation Army's Sally's House provides emergency shelter for women and women with children.They also provide case management.Sally's House is located at 4th and Clay in downtown Waco. Intake is conducted through the Social Services Department which we list above."
	},
	{
		"addressLine1": "210 S. Walnut",
		"city": "Webster",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "77598",
		"name": "Bay Area Turning Point Shelter",
		"organization": "Bay Area Turning Point Shelter",
		"phone": "(281) 286-2525",
		"website": "http://www.bayareaturningpoint.org/",
		"description": ""
	},
	{
		"addressLine1": "1300 Travis Street",
		"city": "Wichita Falls",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76301",
		"name": "FAITH MISSION SHELTER",
		"organization": "FAITH MISSION SHELTER",
		"phone": "(940) 723-5663",
		"website": "https://faithmissionwf.org/",
		"description": "Faith Mission houses one main dormitory for men, four rooms for families with children, and dorms for those in either our New Beginnings or Faith Enterprise programs. In addition to providing shelter, it also provides clothing and meals to adults and children, which is a service available to the community. See the daily schedule for the availability of these services.\n\nFaith Mission is also home to the New Beginnings Recovery Program for men. New Beginnings is a 6-month course for male residents desiring to overcome addiction. This is a free substance abuse program for men who enter the program either voluntarily or by court order. Students in this program volunteer for the organization and share a variety of responsibilities related to the day-to-day operations.\n\n\nFollowing the New Beginnings program, men may choose to enter our job-readiness residential program called Faith Enterprises. Faith Enterprises is a social enterprise which offers lawn services and tree maintenance to the community. Graduates in our New Beginnings Program are able to develop a positive work history and accumulate savings leading to employ-ability and independence. Call 940-761-6006 to schedule your project.\n\nMen or families needing a safe place to stay can sign in at 6:00 p.m. daily or call Faith Mission at 940-723-5663 to speak with someone.\n"
	},
	{
		"addressLine1": "403 Seventh Street",
		"city": "Wichita Falls",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "76307",
		"name": "Salvation Army Wichita Falls",
		"organization": "Salvation Army Wichita Falls",
		"phone": "(940) 322-9822",
		"website": "https://southernusa.salvationarmy.org/wichita-falls/",
		"description": "Provides temporary shelter for people who have no permanent housing. Also has day labor for residents.\nOur services here in Wichita Falls include feeding the hungry, sheltering the homeless,  supporting families through crisis situations, providing Christmas assistance to families in need, and serving children  through our character building programs and summer camps.  In addition, we assist  Senior Citizens and Veterans and provide counseling and guidance to  those suffering from addiction.  The Salvation Army strives to \"Do The  Most Good\" in our community.\n\n\nEligibility: Anyone in service area. Shelter is MEN only.\n\nFees: No cost.\n\nIntake Procedure: Walk ins, Call for appointment"
	},
	{
		"addressLine1": "1203 South West Texas Ave",
		"city": "Lawton",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "73501",
		"name": "C. Carter Crane Shelter for the Homeles",
		"organization": "C. Carter Crane Shelter for the Homeles",
		"phone": "(580) 248-0936",
		"website": "https://www.gpif-caa.org/",
		"description": "Office Hours 8am-5pm Monday-Friday Intake Hours 8am-5pm Monday 8am-10pm Tuesday-Friday 9am-3pm Saturday All calls to 580-248-0936 are answered 24 hours a day.\n\nEmergency shelter for all. Men, women, children. Can stay at shelter up to 6 weeks depending on needs.\n\n\nThe C. Carter Shelter fot the Homeless is the only homeless program which allows its clients to stay for a period of up to six weeks. The shelter is a homelike environment and provides all clients with strong supportive case-management services to help in gaining employment and housing. Clients are also provided transportation to employment, medical appointments, employment search, and other appointments in the form of Lawton Area Transit System (LATS) bus passes. Necessary hygiene items are provided to all clients during their stay at the shelter."
	},
	{
		"addressLine1": "901 SW E Avenue",
		"city": "Lawton ",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "73501",
		"name": "Family Promise of Lawton Inc",
		"organization": "Family Promise of Lawton Inc",
		"phone": "(580) 699-2821",
		"website": "http://www.familypromiseoflawton.org/",
		"description": "Family Promise of Lawton Inc serves homeless children and their families. This program provides shelter for up to 90 days. Single or married pregnant mom's are welcomed.\n\nA nonprofit organization empowering homeless children and their families to achieve stable housing, employment, and financial independence."
	},
	{
		"addressLine1": "1004 N 5th",
		"city": "Duncan",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "73533",
		"name": "Sought out Ministries Homeless Shelter",
		"organization": "Sought out Ministries Homeless Shelter",
		"phone": "(580) 467-8328",
		"website": "mailto:support@script-it.net",
		"description": "We are a homeless shelter for men and families right now. We are ran by donations only. Any and all donations are accepted and appreciated. If you would like more information on how to donate or where to donate please feel free to call us at any time. We are open from 8am to midnight. For after hours please call or go to the white door on the north side of the building that is the shelter directors apartment.\n\nCurfewWe emergency intake 24/7"
	},
	{
		"addressLine1": "214 W Main Street",
		"city": "Marlow",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "73055",
		"name": "Marlow Samaritans Emergency Shelter",
		"organization": "Marlow Samaritans Emergency Shelter",
		"phone": "(580) 658-5771",
		"website": "",
		"description": "Office hours: Mondays, Wednesdays, Fridays 10am - 2pm.\n\nEMERGENCY SHELTER provided by giving one night at a local motel-No homeless shelter available. Provides temporary shelter for those in need in emergencies for the night in a motel, when funding is available.\n\n\nYou must live in Marlow, OK, mailing area and must explain the cause of the emergency to the case worker. Situations are reviewed and assessed individually before help is granted, deferred or denied altogether.\nDocumentation: Photo ID and Proof of Residency if different than what is listed on Photo ID"
	},
	{
		"addressLine1": "Long Island Hospital",
		"city": "Long Island",
		"state": "Texas",
		"stateAbbreviation": "TX",
		"postal": "00000",
		"name": "BOSTON CITY SHELTER",
		"organization": "BOSTON CITY SHELTER",
		"phone": "",
		"website": "",
		"description": "617 534 2526"
	}
]