[
  {
    "addressLine1": "510 South First St",
    "city": "Albemarle",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28001",
    "name": "Stanly Community Inn",
    "organization": "Stanly Community Inn",
    "phone": "(704) 984-6454",
    "website": "http://www.homesofhopestanly.org/",
    "description": ""
  },
  {
    "addressLine1": "216 Patterson Avenue",
    "city": "Concord",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28025",
    "name": "The Salvation Army Center for Hope - Concord",
    "organization": "The Salvation Army Center for Hope - Concord",
    "phone": "(704) 782-7710",
    "website": "https://www.salvationarmycarolinas.org/cabarrus/locations",
    "description": "The Salvation Army (Center of Hope)\n\nCall for Financial Assistance: M-F ; 8am-12pm,\n1-4pm Samaritan House Soup Kitchen: M-F; 11:30am-12:30pm\n\nNight Shelter: 7pm-7am 704-782-7710"
  },
  {
    "addressLine1": "930 S Fayetteville Street",
    "city": "Asheboro",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27203",
    "name": "Christians United Outreach Center - CUOC Food Pantry and More",
    "organization": "Christians United Outreach Center - CUOC Food Pantry and More",
    "phone": "(336) 625-1500",
    "website": "https://mycuoc.org/",
    "description": ""
  },
  {
    "addressLine1": "400 N. Centennial Street",
    "city": "High Point",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27261",
    "name": "Open Door Ministries Men's Shelter",
    "organization": "Open Door Ministries Men's Shelter",
    "phone": "(336) 885-0191",
    "website": "https://opendoorministrieshp.org/",
    "description": "Provides help for those in need, whether through our emergency services help, through our Father's Table Food Kitchen, or through the Open Door Shelter, an emergency shelter for men.\n\nThe Mens Shelter program at Open Door Ministries is a facility designed to house adult homeless men on a temporary basis. First preference is given to the High Point resident followed by the Guilford County resident. Clients go an entrance screening before being accepted to the facility. They must be 18 years of age and cannot be a sex offender. The shelter offers 66 beds for the general populations, and ten beds for treatment program and six beds in the overflow dormitory. Additional mattresses are set up in the cold months to handle the overflow.\n\n\nThe Men's Shelter at Open Door Ministries is the only homeless shelter that serves adult men in High Point. Those that come to our program benefit from a variety of programs at Open Door Ministries such as the Fathers Table, Arthur Cassell Transitional House and the Education and Job Readiness Program. Our goal is to serve the whole man, with focus on spiritual, physical and social development.\n\n\nEMERGENCY ASSISTANCE\n\nEmergency Financial Assistance\n\nThe Emergency Financial Assistance Program assists families experiencing unexpected occurrences that affect their ability to pay utilities and rent. Open Door Ministries is a participating agency in the Community Resource Network (CRN), a network of community agencies working together to streamline services to the community. Call 336-885-0191 for an appointment.\n\nEmergency Food Assistance\n\nThe Emergency Food Assistance Program provides individuals and families with a generous supply of food including meat, fresh vegetables, and nonperishable items. The food box contains five days worth of food, and each family or individual can receive a box once per month. M, W, Th, Fr 11-2, walk-ins welcome.\n\n"
  },
  {
    "addressLine1": "30 Cumberland Avenue",
    "city": "Asheville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28801",
    "name": "ABCCM Downtown Crisis Ministry",
    "organization": "ABCCM Downtown Crisis Ministry",
    "phone": "(828) 259-5300",
    "website": "http://www.abccm.org/",
    "description": "ABCCM Homeless Services\n\nABCCM's Homeless Services program is made up of two transitional housing facilities: the Veterans Restoration Quarters for men and the Steadfast House for women and children. Both of these facilities provide housing, food, case management, education and connection to both mental and physical health providers to their residents. All residents are supplied three meals per day and have access to a nurse, computer lab, and laundry room privileges. They also receive transportation services to the VA Medical Center and downtown Asheville. The goal of these programs is to move the resident from a state of homelessness to a position of self-sustainability.\n\nIn 2014, these two ministries came together under one operations plan. The purpose was to standardize programs, policies and procedures, where applicable, to provide efficiency, with effectiveness and create more volunteer opportunities across the ministries.\nVeterans Restoration Quarters\n\nThe Veterans Restoration Quarters (VRQ) is a 246 bed facility that serves 166 veterans in transitional housing, fifty veterans in permanent supportive housing, eighteen veterans/civilians in nightly emergency shelter and twelve civilians in a six month housing program. The point-in-time count taken on 1/29/2014 showed that there were only six male veterans and one female that were unsheltered in Buncombe County. The impact of the VRQ in our Community has essentially eradicated homelessness for male veterans since it opened its doors in 2008.\nSteadfast House\n\nSteadfast House is a forty three bed facility that houses twenty six single women and seven moms with children. Ten of these beds are designated for female veterans. The need for more beds continues to increase. In September of 2013 the waiting list to get in to Steadfast House was 144. The current waiting list exceeds 300. This need is driving the goal of implementing Transformation Village."
  },
  {
    "addressLine1": "225 Patton Avenue",
    "city": "Asheville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28802",
    "name": "Western Carolina Rescue Mission",
    "organization": "Western Carolina Rescue Mission",
    "phone": "(828) 254-0471",
    "website": "https://www.westerncarolinarescue.org/",
    "description": "Services   \nOvernight Emergency Shelter\nHot Meals Served Daily\nFood Boxes\nCounseling\nJob Training\nRecovery Programs\n& Many Others\n\nWe believe that God loves everybody regardless of their background or circumstance. No matter what you are facing, God has better plans for you. And we want to help you get there. We are here for you. All services are provided at our 225 Patton Avenue location in downtown Asheville. For more information call: (828) 254-0471Meals\n    Breakfast:  Daily 6:00-6:30 AM\n    Lunch:  Monday-Friday: 12:00 - 12:40 PM\n    Dinner:  Daily 4:30 - 5:30 PM\n \nEmergency Overnight Shelter\nBed Registration (Space is subject to availability.  Government issued Photo ID required)\n    Women/Children 1:30 - 3:30  PM\n    Men 9:00 - 11:00 AM / 3:00 - 6:00 PM\nEvening Check-In (for newly registered and continuing guests)\n    Women/Children 4:00 - 4:30 PM to eat dinner or 5:00 PM if not eating dinner\n\n    Men 4:00 - 5:00 PM to eat dinner or 6:00 PM if not eating dinner\n \nClothing Closet\nMonday and Thursday: 9:00 - 11:00 AM\n \nFood Boxes\nTuesday sign-up: 12:30 - 3:00 PM; distribution: 2:00 - 3:00 PM\n \nShowers\nMonday - Friday: 1:00 - 3:00 PM (except for holidays)\n \nChapel Services\nMonday: 9:00 - 10:00 AM\nTuesday: 7:30 - 8:00 AM\nThursday: 7:00 - 8:00 AM\nNightly (Overnight Shelter guests only)\n \nMen's Recovery Program\nOur free, 12-month residential drug and alcohol Recovery Program is an intense life training course; a place where men learn to abandon addiction and receive the resources and support necessary to build a new life. As up to 18 men progress through the 5 stages of the program, our aim is to help them to experience health and freedom beyond the substances that have controlled them for so long.\n\n\nWestern Carolina Rescue Ministries operates on a very simple, but powerful idea: to help people in need. Our work with the poor, the homeless and the addicted takes many forms and fits broadly into three initiatives: Rescue, Recovery and Restoration. In each of these our goal is to embody the love and compassion of Jesus Christ.\nRescue\nA place to come when there is nowhere else to go.\nWith more than 500 men, women and children experiencing homelessness in our community on any given night, Western Carolina Rescue Ministries operates Asheville's largest emergency overnight shelter. By providing food, shelter and clothing, our focus is to meet the immediate physical needs of men, women and children at the point of crisis in their life and to offer hope through the power of God's love. We are here to help anyone in true need \"assisting those who can and will help themselves, showing compassion for those who cannot and refusing to enable the few who would try to abuse the generosity of others.\nRecovery\nReceive the help necessary to build a new life free from addiction.\nOur free, 12-month residential drug and alcohol Recovery Program is an intense life training course; a place where men learn to abandon addiction and receive the resources and support necessary to build a new life. As up to 18 men progress through the 5 stages of the program, our aim is to help them experience health and freedom beyond the substances that have controlled them for so long.\nRestoration\nChange situations and build a better future.\nWe provide life counseling, job training and assistance with transitional services so that people have the opportunity to change their situations and build a better future. These services are designed to equip long-term homeless clients, Recovery Program participants and the working poor from the community with the tools necessary to overcome the internal and external problems that have plagued their past, corrupted their present, and are jeopardizing their future."
  },
  {
    "addressLine1": "204 Haywood Street",
    "city": "Asheville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28801",
    "name": "Salvation Army Shelter For Men And Women",
    "organization": "Salvation Army Shelter For Men And Women",
    "phone": "(828) 253-4723",
    "website": "https://southernusa.salvationarmy.org/asheville-buncombe-county/",
    "description": "Asheville Center of Hope\n\nCall to find out more about the shelter for men and women. Also provides showers for those in need on Mondays, Wednesdays, Fridays 6pm - 6:45pm."
  },
  {
    "addressLine1": "19 N. Ann Street",
    "city": "Asheville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28801",
    "name": "AHOPE Day Center",
    "organization": "AHOPE Day Center",
    "phone": "828-252-8883",
    "website": "https://homewardboundwnc.org/",
    "description": "A HOPE DAY CENTER - 7 a.m. to 12 p.m. daily, provides basic services like showers, laundry, storage, mail & phone access, and engaging case management\nPATH - outreaches people who are homeless and mentally ill to engage them in mental health treatment and housing services\n\nROOM IN THE INN - a mobile shelter for 12 women supported by 38 local congregations that host them a week at a time\nHOPE TO HOME - teams of volunteers from congregations are matched with a person or family who's moving out of homelessness & into permanent housing; teams support their partners financially, materially, practically, & relationally for a year, putting a support system back in place for their newly-housed partners\nPATHWAYS TO PERMANENT HOUSING - facility provides permanent housing through a patchwork of community partnerships & government grants, paired with supportive case management services to help people stabilize in their new homes; PPH has housed 273 people since it began in 2006, and 89% of those people are still stably housed!"
  },
  {
    "addressLine1": "39 GROVE ST.",
    "city": "Asheville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28801",
    "name": "Beloved House Hospitality",
    "organization": "Beloved House Hospitality",
    "phone": "(828) 242-8261",
    "website": "http://belovedasheville.com/",
    "description": "Programs provided:\nDay Shelter for folks on the street\nTransitional Housing program for homeless folks who are ill or disabled\nOne on One advocacy\nSupport groups\nWomen's Empowerment Program\nElder Initiative\nStreet Outreach\nYouth Alternatives\n\nHours: Wednesdays, 10:00am - 2:00pm - \"Pop Up\" Markets Scheduled at Senior Center on Grove Street. Call Ahead for Emergency Food Box.\n\n"
  },
  {
    "addressLine1": "179 Hemlock Street",
    "city": "Waynesville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28786",
    "name": "Haywood Pathways Center",
    "organization": "Haywood Pathways Center",
    "phone": "(828) 246-0332",
    "website": "https://haywoodpathwayscenter.org/",
    "description": "Haywood Pathways Center is a faith based 501 (c) 3 nonprofit organization in Haywood County that provides adult and family emergency shelter, halfway house for men and women recently released from prison, short term residential program for individuals seeking life transformation and soup kitchen providing free meals to those living in the shelter and within our community. Our services are open to anyone in Haywood County regardless of age, race, gender, religion or nationality. No one who is sober and drug free is turned away for a short stay, but participation in the short term residential program requires the commitment to participate in a program, or programs, of Christ centered rehabilitation.\nPrograms offered include:\n    Adult Emergency Shelter\n    Family Emergency Shelter\n    Halfway House\n    Short Term Residential Program\n    3 day program\n    21 day program\n    6 month Discipleship program\n    Community Kitchen\n\nThe Haywood Pathways Center operates as a Halfway House for residents of Haywood County that are coming out of incarceration. While in the halfway house guests will go through classes that will help develop and strengthen their job skills and life skills. While in the halfway house they will do volunteer work at various non- profits to work on their work skills and communication skills. An intensive outpatient plan for substance abuse is implemented as needed.\n\n3 Day Program\nInitial Intake\nGuests will receive up to 3 nights lodging upon admission to the Haywood Pathways Center. After 3 days the director will work with them to evaluate which options are the best solution for their needs. Guests may be invited to join a program of extended stay at the Haywood Pathways Center, or we may assist them in obtaining other avenues of assistance. If Guests are in a program and stay out overnight without permission, they will not be allowed back for 10 days. During the 3-day period, Guests will work on getting their identifications if they don't have them.  Guests will be required to do dorm chores during their 3 day stay.  Guests will meet with the director on day 3 to discuss their continued stay at the Haywood Pathways Center.\n\n21 Day Program\nProgram Goals\nThe program our guest are entering is a program designed to assist them in learning what the Bible says concerning their life and possible relationship with God.\nThe Bible says:\n- God wants to reconcile them to Himself through their trust and commitment in his Son, Jesus Christ.\n- Daily personal Bible study and application of Biblical principles lead to wholeness in a person's life.\n\nThis program lasts three weeks. An extension of stay or acceptance into another program depends on their satisfactory progress in and completion of this program.\nIf Guest leave prematurely without completing this program, they will be disqualified from returning to the shelter for 10 days!\nTheir Commitment:\n1. I will be diligent in completing all Bible studies and assigned work. I will be on time and prepared for my regular counseling sessions.\n2. I will take whatever action is required on my part to complete the entire 21 day program.\n3. I will meet with the Director to fill out the Empowerment Commitment Contract.\n4. I will spend the daytime hours working or looking for full-time work. I will discuss employment opportunities with the program Director prior to accepting new employment.\n5. I will sign up for and attend classes at Meridian. I will provide the Director with a list of said classes.\n\n6. I will use the resources of Career Connections to the fullest. I will attend their workshops on how to develop job retention skills while I am seeking employment.\n7. I will apply for a minimum of 10 jobs per week.\n8. I will volunteer at various non-profits within the area to work on job skills and communication.\n9. On day 14 I will make an appointment with the Director to complete the VI-SPDAT form for housing.\n10. I will be cooperative with all volunteer staff and personnel.\n11. I will not use profanity or abusive language at any time or in any situation during this program.\n12. I will keep staff informed about where I am going, who I will be with, and when I will return.\n13. I will not keep or use an unauthorized motor vehicle.\n14. I will not use any non-prescription drug (alcohol, meth, marijuana, cocaine, etc.) nor will I abuse or misuse any medication prescribed for me.\n15. I will attend devotions each night and attend a local church on Sunday.\n16. I will open a savings account to deposit the majority of my earnings, if I am working.\nI understand that my residence at the Haywood Pathways Center depends on my willingness to follow the above program standards with a positive attitude.\n\nDiscipleship Program\nThe Discipleship Program is a voluntary program designed to assist our guest in learning what the Bible says concerning their life and relationship with God. The goal of the program is to show from the Bible how God wants to reconcile them to Himself through their trust and commitment to His Son, Jesus Christ, and to show how daily personal Bible study and application of Biblical principals will meet the essentials needs for their life. The Christian life is about more than a one-time decision or having their name on the roster at a church. It is about living a life that glorifies Jesus and drawing others to choose to live for Him as well. The discipleship program teaches about a Christian life.\nAny extensions of our guest length of stay depend fully upon satisfactory progress in this program. If they leave prematurely before completing all of the six-month period, they will not be allowed to return to the center for 45 days.\nPROGRAM STANDARDS\n    I will read at least one to two pages per day from the books provided. I realize that I need to work daily to keep pace.\n    I will keep up with the pace of the material in order to finish the materials within the time frame(s) provided.\n\n    I will follow all of the rules of the Center and this program. I will set the example before other residents.\n    I will be cooperative with all volunteers and staff.\n    I will attend Devotions each night and be active in a local Bible-believing church on Sunday.\n    I will hold down full-time work.\n    I will open a savings account at a local bank and deposit the majority of my earnings in that account.\n    I will be active in looking for housing solutions.\n    I will not use profanity or vulgar language while I am in this program.\n    If I have not found work by this time, I will attend Lifeworks weekly.\n    I will continue to use the resources at Career Connections to find employment.\n    I will continue to attend classes at Meridian.\n    I will not use alcohol or illegal drugs or any medicine that is not prescribed to me.\n    I will not keep or use an unauthorized motor vehicle.\n    I will keep the staff advised of where I am going, who I will be with, and when I'll return.\n    I will meet with my supervisor or the program director once a week to review my finances and my progress in the program.\n\n    I will follow these standards to the best of my ability.\n\nKitchen\nThe Haywood Pathways Center has, on campus, a full dining room and kitchen facility.  Guests staying at Haywood Pathways Center have the availability for three meals a day.  Breakfast is cooked each morning by a team made up of guests that are staying at HPC.  Guests sign up the previous night at dinner if they need a bag lunch to take out with them during the day. At 6PM each evening, 7 days a week, an evening meal is prepared and served to guests and is open to the public as well. There is no charge to the public for the evening meal, although contributions are accepted and appreciated.  This meal is prepared and served by various community and church groups.  This meal is also open to the community as well.\n\n"
  },
  {
    "addressLine1": "240 South Caldwell Street",
    "city": "Brevard",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28712",
    "name": "The Haven of Transylvania County",
    "organization": "The Haven of Transylvania County",
    "phone": "(828) 877-2040",
    "website": "https://havenoftc.org/",
    "description": "The Haven is a temporary, emergency shelter for homeless families and individuals in Transylvania County. Potential residents may apply between 4 pm and 7 pm daily.\n\nThe Haven provides:\nSafe, secure shelter, shower and laundry facilities, evening and morning light meal, counseling and case management, mail and telephone message service.\n\n"
  },
  {
    "addressLine1": "338 Brook Hollow Rd",
    "city": "Boone",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28607",
    "name": "Hospitality House of Northwest North Carolina",
    "organization": "Hospitality House of Northwest North Carolina",
    "phone": "(828) 264-1237",
    "website": "https://www.hosphouse.org/",
    "description": "Coordinated Entry Process\nIf you are currently homeless, please call (828) 264- 1237 and request to speak with the Emergency Shelter Coordinator. Hospitality House operates the community's Coordinated Entry & Assessment system, and our agency strives to ensure that each individual and family experiencing homelessness receives an assessment for services. Individuals and households demonstrating the highest level of need will be prioritized for housing services.\n\nPlease call us anytime (828) 264-1237 - 24 HOURS A DAY\n\nWinter Seasonal Shelter: November 1st - April 30th\nSix months of the year we operate a Winter Seasonal Shelter to keep people safe from the weather. Each night we convert our Conference Room and Dining Room into sleeping quarters. Men, women and children seeking shelter must arrive prior to 5:30 pm each day to complete an intake. We provide a safe, warm environment for anyone experiencing homelessness, living in a tent, car or uninhabitable structure. One locker per person is issued upon check-in. Each evening at 9:00 pm cots are distributed and they are put away the next morning beginning at 6:00 a.m.\n\nEmergency Shelter Program:\nPrior to or on the day of becoming homeless CALL US at (828) 264-1237 to check availability. If we have space available, we ask you to arrive for an intake prior to 4:30 pm. Our funding dictates our ability to only serve individuals and families from Ashe, Avery, Wilkes, Watauga, Alleghany, Mitchell and Yancey counties in North Carolina.\n\n\nIn order to stay in the Emergency Shelter Program will need to provide verification of homelessness. This may include an eviction notice or a statement from a family member, friend, or community member.\n\nHospitality House continues to serve as the only 24-hour homeless shelter facility, outside of domestic violence facilities, for seven rural North Carolina mountain counties (Watauga, Ashe, Wilkes, Alleghany, Avery, Mitchell, and Yancey). Hospitality House provides Emergency Shelter Services, Transitional & Family Housing, Permanent Supportive Housing, Scattered Site Housing and Rapid Rehousing.\n\nEmergency Shelter\nOur Emergency Shelter is comprised of two dorms for men and two dorms for women that house a total of 24 residents with a potential for eight overflow beds. The dedicated service coordinator counsels each client, evaluating their homeless situation, guiding them through the steps to begin rebuilding their lives while providing the structure of accountability they need to be successful. To stay in the Emergency Shelter one must provide verification of homelessness.\n\nFor those in the community who are unable or choose not to stay at Hospitality House, we offer three daily meals, showers and laundry facilities to anyone who needs them.\n\nWinter Seasonal Shelter\nSix months of the year (November 1st - April 30th) we operate a Winter Seasonal Shelter to keep people safe from the weather. Each night we convert our Conference Room and Dining Room into sleeping quarters. Men, women, and children seeking shelter must arrive prior to 5:30 pm each day to complete an intake. We provide a safe, warm environment for anyone experiencing homelessness, living in a tent, car, or uninhabitable structure. One locker per person is issued upon check-in. Each evening at 9:00 pm cots are distributed and they are put away the next morning beginning at 6:00 a.m.\n\nTransitional and Family Housing\nThis program houses space for 29 residents in either family quarters or single room efficiencies. The dedicated service coordinator guides residents along the path to employment, sustainable housing and goal-setting through motivation, accountability and the building of life skills. Last year 82% of our residents exited this program with income and housing.\n\nWe pride ourselves on being a family-first transitional living facility by keeping the family unit intact regardless of economic circumstances. The need for family housing is on the rise with up to 20% of our residents under age 12.\n\n\nBecause of the increased need for families and children we have implemented an afterschool program, visual arts program, reading program, Kid's birthday parties and movie night.\n\n\nPermanent Supportive Housing\nSelf-reliance is a life goal, benchmark and measure of success for anyone transitioning out of homelessness. The Permanent Supportive Housing Program includes nine residences at the Hospitality House and the eight unit Rock Haven Independent Living Facility. This program provides the structure and sense of community while the residents contribute to the rent and sustainability of the facilities. The majority of residents identify as permanently disabled and having the ability to live independently in and of itself is a victory.\n"
  },
  {
    "addressLine1": "1129 West Avenue",
    "city": "Lenoir",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28645",
    "name": "Lenoir Emergency Outreach Shelter (LEOS)",
    "organization": "Lenoir Emergency Outreach Shelter (LEOS)",
    "phone": "(828) 726-3634",
    "website": "https://lenoiremergencyoutreachshelter.webs.com/",
    "description": ""
  },
  {
    "addressLine1": "806 College Avenue",
    "city": "Lenoir",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28645",
    "name": "Shelter Home of Caldwell County",
    "organization": "Shelter Home of Caldwell County",
    "phone": "(828) 754-3712",
    "website": "https://shelterhomecc.org/",
    "description": "The Shelter Home of Caldwell County (SHCC) provides shelter, emergency and support services for survivors/victims of domestic violence and homeless people.\nServices:\nCHILD ADVOCACY\nRAPE AND SEXUAL ASSAULT\nCOURT ADVOCACY\nDOMESTIC VIOLENCE\nSUPPORT GROUPS AND CLASSES\n\n"
  },
  {
    "addressLine1": "1315 M.L.K. Jr Blvd",
    "city": "Chapel Hill",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27516",
    "name": "Secu Community House",
    "organization": "Secu Community House",
    "phone": "(919) 967-1086",
    "website": "http://www.ifcweb.org/services/community-house",
    "description": "f you are a homeless man who would like to enroll in the transitional housing program at Community House, please call 919 967-1086 and select option 4.\nIf you need emergency shelter during inclement weather (when WRAL predicts overnight temperatures to be below 40 degrees), please call 919-967-1086 and press 5 to speak to a staff person on duty to sign up for space. You must sign up for space by 4:00pm, or meet at Community Kitchen 100 West Rosemary Street by 6pm. To verify whether or not Community House is providing emergency shelter for the night, please call 919-967-1086 and press 2.\n\nCommunity House offers safe living accommodations, meals, showers and laundry facilities. Community House guests also receive an array of services: referrals to substance abuse education and counseling; medical, mental health and dental treatment; social worker support; job coaching; and referrals to community agencies. Residents are encouraged to identify and address personal challenges, seek employment opportunities, and establish a plan with short and long-term goals. IFC partners with Piedmont Health Services (PHS) to provide a PHS Satellite Clinic inside Community House to provide health care services to respond to the various needs of homeless men and women. Staff and volunteers strive to empower, educate and support homeless men to take important steps towards a successful transition out of homelessness. There are a variety of volunteer opportunities for individuals and groups available at Community House, which include: evening volunteers, receptionists, building monitors and clinic staff. Community House serves as Orange County's only shelter for homeless men. It also provides 17 emergency shelter cots during inclement weather."
  },
  {
    "addressLine1": "2505 Homestead Rd",
    "city": "Chapel Hill",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27516",
    "name": "HomeStart",
    "organization": "HomeStart",
    "phone": "(919) 932-6025",
    "website": "http://www.ifcweb.org/",
    "description": "HomeStart provides emergency and longer-term housing and services to 50 homeless women and children at a time, on land provided by Orange County. 110 women and 60 children stayed at HomeStart during the 2009-10 fiscal year, and 10,076 meals were served. HomeStart has a Smart Start Case Manager to help families prepare their children for kindergarten, and a Social Worker who provided case management for 22 families to prevent homelessness in FY 09-10."
  },
  {
    "addressLine1": "410 Liberty Street",
    "city": "Durham",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27702",
    "name": "Urban Ministries of Durham Inc.",
    "organization": "Urban Ministries of Durham Inc.",
    "phone": "(919) 682-0538",
    "website": "http://www.umdurham.org/",
    "description": "If you are homeless and need shelter, come to the Community Cafe by entering through the Resource Center doors, underneath the purple awning, Monday at 10 a.m. to reserve a bed for two weeks. We accept emergency referrals from affiliated organizations any day space is available. Call 919-682-0538 x221 to learn more.\nEmergency Shelter.Direct Substance Abuse Services.\nShelter Journey Programs\nUMD's Community Shelter has 81 beds for men, 30 for women and nine family rooms with a total of 38 beds for parents and their children, for a total of 149 beds. There are also 25 overflow mats that supplement the bed space when needed, especially during severe weather (including when the temperature is below freezing) known as White Flag nights, for a total of 174 beds. The shelter now seeks to provide every single client not just with food and shelter, but also with a future, offering case management to end their homelessness through our Journey Programs\nNew Arrivals\nOur main check-in for new arrivals is held each Monday morning beginning at 10 a.m. We accept referrals from other agencies and from clergy from supporting faith communities 24 hours per day, seven days a week. New arrivals receive a bed for the next 14 nights and have access to hygiene products and showers, the Clothing Closet, meals in the Caf and Bread for the Journey."
  },
  {
    "addressLine1": "300 N. Queen Street",
    "city": "Durham",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27702",
    "name": "Genesis Home",
    "organization": "Genesis Home",
    "phone": "(919) 683-5878 ext 22",
    "website": "http://genesishome.org/",
    "description": "Genesis Home works to end homelessness for families with children and for young adults by providing housing and supportive services to foster independence."
  },
  {
    "addressLine1": "1201 E. Main Street",
    "city": "Durham",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27701",
    "name": "Durham Rescue Mission",
    "organization": "Durham Rescue Mission",
    "phone": "(919) 688-9641",
    "website": "https://www.durhamrescuemission.org/",
    "description": "Homeless Shelter for Men\n\nThe Durham Rescue Mission provides food, shelter and other programs and services to the homeless men of Raleigh-Durham-Chapel Hill through our mens program.\n\nBy offering safe shelter, three meals a day, clean clothing, Biblical counseling, financial planning, vocational training, GED/education and employment assistance, weve helped mend the shattered lives of many homeless men since opening in 1974.\n\n\nWe have approximately 267 beds available, with a max of 312 beds including mats for emergency situations and currently house an average of 270 men a night.\nProspective Client Check-In Information\n\n    Photo ID Required (State/ Out of State/ DOC) if photo ID is not available, clients are required to have a printout of a police/sheriffs criminal history report.\n    Must be able and willing to do chores (40 hours a week)\n    No sex offender of any type (pending, charged, registered and/or any other sex related offenses) will be permitted to check in.\n    Must be willing to abide by all rules, regulations, and policies established by the Durham Rescue Mission.\n    The following will be provided shelter, food, clothing, and biblical counseling.\n\n\nIf you or someone you know is in need of assistance at our mens shelter in Durham, NC, please call 919-688-9641 ext. 5034."
  },
  {
    "addressLine1": "507 East Knox St.",
    "city": "Durham",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27701",
    "name": "Durham Rescue Mission Shelter For Women - Good Samaritan Inn",
    "organization": "Durham Rescue Mission Shelter For Women - Good Samaritan Inn",
    "phone": "(919) 688-9641",
    "website": "https://www.durhamrescuemission.org/",
    "description": "At the Durham Rescue Mission, we offer safe shelter, three meals a day, clean clothing, Biblical counseling, financial planning, vocational training, GED/education and employment assistance to help the homeless in the Raleigh-Durham-Chapel Hill area get back on their feet.\n\nOur women and children's shelter, known as the 'Good Samaritan Inn' has helped many homeless, addicted and otherwise hurting women and families learn marketable skills they can use to find a decent paying job in the Triangle that will help them provide for their families.\n"
  },
  {
    "addressLine1": "300 Hawthorne Ln",
    "city": "Charlotte",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28205",
    "name": "Charlotte Emergency Housing",
    "organization": "Charlotte Emergency Housing",
    "phone": "(704) 335-5488",
    "website": "https://charlottefamilyhousing.org/",
    "description": "While we primarily serve single mothers with children, we are also one of the limited options for single fathers with children and two-parent families.\n\nAre You Eligible for Our Program?\nApplicant must be a family unit (at least one adult age 18 or older with at least one dependent).\nApplicant must be considered homeless by HUD definition.\n\nTotal household income must be less than 80% of AMI (verified by any income received).\nApplicant must be a Mecklenburg County resident for at least 30 days.\nApplicant must be free from active substance abuse for at least three months outside of any residential treatment programs.\nApplicant will be given a criminal background check at time of assessment. Applicants with convicted sex offenses, felonies within the last three years and/or with pending charges are not eligible.\nApplicant demonstrates motivation to make changes in their lives and is open to partnering closely with a social worker to do so.\nApplicants must be willing to provide proof of income earned and money saved while in the program.\n\nIn order to make a referral or inquire about the status of a referral, please call our Intake Specialist, Tammie Rorie, at 980-288-0498. Completed referral packets can be sent via fax or email to:\nCharlotte Family Housing\nAttention: Intake Specialist\nFax Number: 704.973.0011\nEmail: intake@charlottefamilyhousing.org\nA completed referral packet includes the following items:\nCompleted referral form with signatures from applicant and referring social worker\nCompleted budget that reflects realistic picture of applicant's income and expenses\nCopies of IDs for all adults age 18 and older, and social security cards and birth certificates for all family members\nProof of employment and income (last thirty days of pay stubs, child support statement)\nProof of savings (bank statement)\nProof of full-time student status (if applicable)\nUpon receipt of completed referral packet, the applicant will be contacted to complete an in-person assessment with a clinical family social worker."
  },
  {
    "addressLine1": "2225 Freedom Dr",
    "city": "Charlotte",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28297",
    "name": "Harvest Center",
    "organization": "Harvest Center",
    "phone": "(704) 335-1616",
    "website": "http://www.theharvestcenter.org/",
    "description": "The Ideal Candidate for Our Transformation Program:\nAffected by homelessness, poverty, and/or unemployment\n\nSingle adults, 18 years of age, and older, in transition\nNo custodial obligation to a dependent\nFree/clean of impairing substances\nWillingness to remain unemployed for the first two months of the Transformation Program\nHighly-functioning, able-bodied, and ready, willing, and able to be employed after the first two months\nHighly motivated for success\n\nTHCs SIX-MONTH TRANSFORMATION PROGRAM consists of our transitional housing for male and female program participants, with a three-phase, holistic approach, for spiritual, emotional, physical, and financial well-being. Our Transformation Team will interview and evaluate each applicant on a case, by case, basis. We will prayerfully, and carefully, select the ideal candidates who are more likely to complete the Transformation Program successfully.\n\nWe accept applications year-round, and notify applicants of our Open Enrollment Periods.\nFor all Transformation Program inquiries, and for scheduling of interviews, please call 704-335-1616. "
  },
  {
    "addressLine1": "945 North College Street",
    "city": "Charlotte",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28206",
    "name": "Urban Ministry Center",
    "organization": "Urban Ministry Center",
    "phone": "(704) 347-0278",
    "website": "http://www.urbanministrycenter.org/",
    "description": "Emergency Shelter, Permanent Supportive Housing.\n\nPermanent Supportive Housing\nHousingWorks\nThrough our HousingWorks program,the Urban Ministry Center seeks to fulfill its mission of ending homelessness by giving the most vulnerable what they so desperately need: a home. HousingWorks has three pathways to housing for chronically homeless individuals: at Moore Place, an 85-unit apartment building that opened in February 2012; in Scattered Site apartments (45 units); and in MeckFUSE, a partnership with Mecklenburg County providing an additional 45 community-based apartments.\nThe HousingWorks approach is simple: give chronically homeless individuals what they need most - a safe, stable, affordable home - and then provide the wrap-around support to help them remain housed and regain lives of wellness and dignity. A team of social workers, therapists, a full-time nurse and a part-time psychiatrist provide supportive services to help each HousingWorks tenant manage the transition from long-term homelessness to housing, and to help individuals meet personal goals to ensure they never become homeless again.\n\nHousingWorks specifically targets those individuals who have been homeless the longest, are the most vulnerable and are the most frequent users of emergency rooms, jails, shelters and other costly crisis services. Our experience demonstrates - and research shows - that supportive housing for this population saves lives and saves our community money.\n\nEligibility for HousingWorks:\nAll potential tenants must be unaccompanied (we regret we cannot house couples or families) and meet the federal definition of chronic homelessness, including documentation of a disabling condition. They must be a US resident, ages 18 or older. Income is not a requirement.\nHousingWorks participates in the Charlotte-Mecklenburg Coordinated Assessment System and all referrals for housing must come from one of the assessment sites. This is an assessment site. Hours: Mondays through Fridays 8:30am to 3:30pm.\n\n\n"
  },
  {
    "addressLine1": "107 Cromer St",
    "city": "Charlotte",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28104",
    "name": "Hoskins Park Ministries",
    "organization": "Hoskins Park Ministries",
    "phone": "(704) 391-3303",
    "website": "https://hoskinsparkclt.org/",
    "description": "The purpose of Hoskins Park Ministries is to help men who have been living on the street, or are near homelessness, to get back on their feet as independent God-fearing men by experiencing grace through Jesus Christ.\n\nHoskins Park Ministries (HPM) is a Christian ministry whose primary purpose is to share the love of Christ with the poor and homeless by providing transitional housing facilities, clothing, food and other necessary support to those in need while adhering to the call of the Bible for Christians to make disciples of all nations (Matthew 28:19).\n\nThe purpose of Hoskins Park Ministries is to help men who have been living on the street, or are near homelessness, to get back on their feet as independent God-fearing men by experiencing grace through Jesus Christ.\n\nFrequently Asked Questions\nWhat does it mean to \"make a disciple?\"\n\nIt means to teach others about the Jesus of the Holy Bible. We believe the Bible to be the Holy word of God. That means we believe God wrote the Bible using inspired men and all of it is true.\n\nThe Bible says that Jesus became sin for us and bore our sins in His body on the tree (the cross), healing our wounds (otherwise known as our sin) and giving Himself as a ransom for all men (1 Timothy 2:5-6), 1 Peter 2:24). The Bible says whoever believes this in his heart and professes Jesus as Lord through his mouth, is saved (Romans 10:9). God calls us to follow Him and teach others to do the same (Matthew 28:20).\n\nWe believe this, try to model it through our behavior and teach this through Bible study at HPM.\n\n \nWho does HPM accommodate?\nHPM accommodates homeless or near homeless men willing to let God transform their lives into the live He intended. We have an application and interview process to determine who is right for HPM.\n \nWhat is the process for new residents?\nWhen a new resident enters the ministry they are first given a room and a bed. Until they are working, we provide food as well. Then we provide what a resident needs. If it is cloths, they get them. If a job, we work with them to obtain employment. If they need medical assistance, we direct them wherever they need to go and help them get help. If they need government help, we try to assist them down the administrative paths. We'll also help them achieve additional education from recognized institution or achieve various other goals as we are able.\n \nDo you charge rent?\nNo, Hoskins Park Ministries does not charge rent. We provide furnished houses for the residents. There is a nominal program fee. It should be noted, however, that often times a resident requires a period of grace before they can pay that amount.\n\n \nIf they are working, why do they need you?\nFirst, we believe they need God in their lives, before they need us. But we try to be the Hands of Jesus to the residents of HPM so that we do not preach a message that we are not willing to support through our own actions. Many people struggle with addictions or other hurts, hang-ups, or habits that negatively impact their life. Perhaps we all have something like that in our lives. Like all of us, they need someone to believe in them during their healing or recovery period.\n\nThey also need a place to call home, with an actual street address. And in all cases there is a story that each man can tell that makes it understandable as to why they are where they are. Again, many reading this may be in the exact set of circumstances they face. We are in their corner. We stand in the gap for these men.\n\n \nShouldn't homeless people just get a job?\nAccording to statistics about 30% or more of homeless people do have jobs. For them, it would be like any one of us having the job we have without having a home to come home to after work. Can you imagine how you would feel? In our ministry many of the residents are unemployed when they arrive. But we consider ourselves to have a working ministry and typically all of our residents are working.\n\n"
  },
  {
    "addressLine1": "945 North College Street",
    "city": "Charlotte",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28206",
    "name": "Roof Above Day Services Center",
    "organization": "Roof Above Day Services Center",
    "phone": "(704) 334-3187",
    "website": "https://www.roofabove.org/",
    "description": "Open 24 hours a day, 365 days per year.\n\nMSC has two shelter locations, one on North Tryon Street, and the other on Statesville Avenue. We offer both emergency shelter and wrap-around supportive services to unaccompanied homeless men ages 18 and older. Individualized Service Plans are created for each client to help them obtain or increase income, and then obtain and maintain housing.\n\nMSC serves unaccompanied men ages 18 and older.\n\nThe mission of Men's Shelter of Charlotte is helping homeless men. We serve homeless men, ages 18 and over. We provide safe emergency shelter and meet basic needs. Address barriers related to homelessness and self-sufficiency and help homeless men obtain and maintain more appropriate housing."
  },
  {
    "addressLine1": "1100 East Blvd.",
    "city": "Charlotte",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28203",
    "name": "The Relatives, Inc.",
    "organization": "The Relatives, Inc.",
    "phone": "(704) 377-0602",
    "website": "https://therelatives.org/",
    "description": "The Relatives is Mecklenburg County's only shelter for youth 7-17 who are homeless, have runaway, or are experiencing serious family conflict. The mission of The Relatives is to keep kids safe and families together. Founded in 1974, in the basement of the Dilworth United Methodist Church, The Relatives houses nearly 300 youth per year who have no other safe place to go. Additionally, The Relatives provides walk-in crisis counseling to youth and their families, a 24-hour crisis hotline, and free parenting classes designed to help eliminate the family conflicts which cause family break-ups where youth either run away or are kicked out onto the streets.\nThe Relatives is Mecklenburg County's Safe Place shelter. The agency recruits local businesses, churches, community organizations, and all city transit vehicles to display yellow and black signs bearing the National Safe Place logo to signify the partnership with The Relatives to link children in need to safety."
  },
  {
    "addressLine1": "3239 Beatties Ford Road",
    "city": "Charlotte",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28216",
    "name": "My Sister's House",
    "organization": "My Sister's House",
    "phone": "(704) 200-2807",
    "website": "http://www.friendshipcdc.org/",
    "description": "Transitional Living Center for Women.\nMission\nTo stabilize and strengthen our sisters through counseling, stability in living arrangements, and education as we guide them on the path to self reliance."
  },
  {
    "addressLine1": "816 Peaceful Glen Rd",
    "city": "Charlotte",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28273",
    "name": "Discovery Home Care Inc",
    "organization": "Discovery Home Care Inc",
    "phone": "(980) 201-9145",
    "website": "http://www.discoveryhomecare.org/",
    "description": "Discovery Home Care INC, a Youth Emergency Care Shelter located in Mecklenburg County, N.C, Gaston County, NC a non-profit organization, licensed by North Carolina Department of Health and Human Service, Division of Social Service, to provide emergency shelter care and Respite Care among other services to children ages 6 to 17 years. Discovery Home Care is a 15 days temporary shelter for youth. We serve children who have been victims of sexual or physical abuse, emotional or physical neglect, abandonment, homeless and runaways. These children may be referred to Discovery Home Care by Social Services or by a law enforcement agency. Or other agencies Discovery Home Care INC emergency shelter is open 24 hours a day, 7 days a week. The shelter has 5 beds to accommodate 5 male or female children. We provide respite care. Discovery Home Care is dedicated to serving. We serve youth in Gaston, Lincoln, Cleveland, Iredell, Stanley, Cabarrus and Mecklenburg Counties, NC\n\nGoal of Service:\nThe goal of Emergency Shelter care is to provide a safe, temporary, confidential place for youth to stay. While helping the child avoid the dangers of living on the streets. We would love to have you Volunteer with our youth shelter Office 980 201-9145 Sandra Williams"
  },
  {
    "addressLine1": "534 Spratt St",
    "city": "Charlotte",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28206",
    "name": "The Salvation Army Center of Hope Shelter",
    "organization": "The Salvation Army Center of Hope Shelter",
    "phone": "(704) 348-2560",
    "website": "http://www.salvationarmycarolinas.org/charlotte/programs/homeless-services/",
    "description": "Office hours: 8:30 AM to 6:00 PM (Monday thru Thursday); 9:00 AM to 4:00 PM (Fridays)\n\nWhen women and children have nowhere else to go, they can count on The Salvation Army Center of Hope. Located two miles north of Uptown Charlotte, the Center of Hope sleeps an average of 300 women and children every night. An active member of the Homeless Services Network, The Salvation Army is a leader in providing families with a successful way out of homelessness. Each program is graduated to step clients from the point of crisis to the point of resolution. These programs include emergency shelter, transitional housing, rapid rehousing, and shelter diversion."
  },
  {
    "addressLine1": "107 South Broad Street",
    "city": "Gastonia",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "00000",
    "name": "Center of Hope Emergency Shelter Gastonia",
    "organization": "Center of Hope Emergency Shelter Gastonia",
    "phone": "(704) 867-6145",
    "website": "https://www.salvationarmycarolinas.org/cabarrus/locations",
    "description": "Provides shelter for men, women, families.\n\nShelter Intake: Monday - Friday 12:00 pm - 4:00 pmSaturday - Sunday 1:00 pm - 4:00 pm\n\nAlso provides: food assistance, rent assistance, utility assistance, medicine assistance."
  },
  {
    "addressLine1": "809 W Airline Ave",
    "city": "Gastonia",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28052",
    "name": "As One Ministries Day Shelter Gastonia",
    "organization": "As One Ministries Day Shelter Gastonia",
    "phone": "(704) 862-6079",
    "website": "http://aomofgastonia.org/day_shelter.html",
    "description": "Day Shelter.\nHours: Mondays through Fridays 8am - 4pm.\nThe renovation of the donated building at809 W. Airline Ave. is complete. The newfacility includes showers, washers/dryers,storage, a full-kitchen and the installation ofa sprinkler system.\nServices:\nShowers for men and women\nWashers and dryers\nComputer lab\nFull kitchen\nClient storage\nTelephones\nEmergency overflow overnight shelter during the winter\n\nTransitional housing\nAs One Ministries is currently working on plans to developseveral transitional housing units in the Gaston Countyarea as a stepping stone to full recovery fromhomelessness."
  },
  {
    "addressLine1": "226 N Long Street",
    "city": "Salisbury",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27846",
    "name": "Rowan Helping Ministries Overnight Shelter",
    "organization": "Rowan Helping Ministries Overnight Shelter",
    "phone": "704-637-6838",
    "website": "https://rowanhelpingministries.org/",
    "description": "The Overnight Shelter provides temporary overnight shelter and related services to those who have no alternative nighttime residence. Supportive services are available and an individual case management approach is taken. Shelter residents receive supper and breakfast. Rowan Helping Ministries is using the shelter facilities to allow homeless individuals not staying in the shelter to shower during the daytime in an effort to promote physical wellness to all individuals in the community.\n\n\nIf you have been evicted or have no where to go, the Overnight Shelter is available to Rowan County residents. An evening and breakfast meal is included for those staying in the shelter. A shower and a change of clothing is required. Case management services are also provided to help clients get back on their feet. For more information please call (704) 637-9355 and select option 3.\n\nThe Soup Kitchen provides a nutritious noon meal to the hungry without qualification, anyone is welcome. Each Sunday, God's Table provides a meal plus a 30 minute spiritual service."
  },
  {
    "addressLine1": "130 Hill St",
    "city": "Elkin",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28621",
    "name": "ECHO Ministries, The ARK",
    "organization": "ECHO Ministries, The ARK",
    "phone": "(336) 527-1637",
    "website": "https://www.thearkelkin.org/",
    "description": "The ARK accepts single women, married couples with or without children, and single parent (male or female) families with children. We can accommodate 25 people per night. We have three bedrooms designated for single women and four bedrooms designated for families.\n\nOur goal is to model a healthy family lifestyle: therefore, we have a structured environment that promotes personal responsibility, respect, and cooperation among guests.\n\n\nEach guest receives intensive case management from our staff to assist them in finding and maintaining employment and accessing community resources that will help them return to self-sufficiency and permanent housing as soon as possible. ARK staff is on duty 24 hours a day, 7 days a week. Guests work together to prepare meals and keep the house neat and clean.\n\nGuests can remain at The ARK as long as weekly progress is being made toward their personal goals, with the average length of stay 20-24 weeks.\n\nThe ARK provides shelter and supportive services to homeless families and single women who are not victims of domestic violence."
  },
  {
    "addressLine1": "112 W Elm St",
    "city": "Yadkinville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27055",
    "name": "Yadkin Christian Ministries Emergency Food and Other Services",
    "organization": "Yadkin Christian Ministries Emergency Food and Other Services",
    "phone": "(336) 677-3080",
    "website": "http://www.y-c-m.org/",
    "description": "At Yadkin Christian Ministries, we serve families in need of basic requirements including food, assistance for utilities, rent, medication, and other miscellaneous items. You must live in Yadkin County within one of these zip code areas to receive assistance\n\n\nYadkin Christian Ministries is a cooperative effort of churches, individuals and non-profit agencies unified for the purpose of sharing Christ?s love by providing daily necessities to the less fortunate in our community.\n\nWhen you come to Yadkin Christian Ministries make sure to bring:\nState-issued photo identification showing your current address\nAny other government-issued identity cards\nSocial Security card\nA list of everyone in your householdtheir names, ages, and relationship to you and their Social Security card or Social Security number"
  },
  {
    "addressLine1": "303 Maloney Avenue",
    "city": "Fayetteville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28301",
    "name": "New Life Mission Mens Shelter",
    "organization": "New Life Mission Mens Shelter",
    "phone": "(910) 864-4678",
    "website": "",
    "description": "Provides a shelter for single men."
  },
  {
    "addressLine1": "913 Person Street",
    "city": "Fayetteville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28301",
    "name": "Gospel Services Hope Center",
    "organization": "Gospel Services Hope Center",
    "phone": "(910) 920-4729",
    "website": "mailto:gospelservices@aol.com",
    "description": "Shelter for single males."
  },
  {
    "addressLine1": "1401 Coley Drive",
    "city": "Fayetteville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28301",
    "name": "New Start New Beginning Shelter For The Homeless & Battered Women",
    "organization": "New Start New Beginning Shelter For The Homeless & Battered Women",
    "phone": "(910) 483-6336",
    "website": "mailto:frontdoor110a@yahoo.com",
    "description": "Homeless shelter for all and battered women."
  },
  {
    "addressLine1": "333 Hawley Lane",
    "city": "Fayetteville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28301",
    "name": "Teague's Home for Women",
    "organization": "Teague's Home for Women",
    "phone": "(910) 483-5044",
    "website": "http://www.teagueshomeforwomen.org/",
    "description": "Teague's Home for Women, previously known as Green's Home for Women, is a religious based non-profit organization providing shelter to homeless women in the form of a home-style environment with strict guidelines that teach and re-teach personal hygiene, good manners, life skills, build self-esteem and tackle all the elements that have prevented them from becoming productive members within our society. Each woman is given an opportunity to feel safe and secure, learn to take pride in herself, train for new job skills, obtain an education and most of all - bring God into their lives during this time of transition."
  },
  {
    "addressLine1": "913 Person Street",
    "city": "Fayetteville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28301",
    "name": "True Vine Ministries' Hope Center",
    "organization": "True Vine Ministries' Hope Center",
    "phone": "(910) 364-2981",
    "website": "mailto:mstonistewart@gmail.com",
    "description": ""
  },
  {
    "addressLine1": "113 Stein Street",
    "city": "Fayetteville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28303",
    "name": "Cumberland Interfaith Hospitality – Shelter for families",
    "organization": "Cumberland Interfaith Hospitality – Shelter for families",
    "phone": "(910) 826-2454",
    "website": "https://www.facebook.com/Cumberland-Interfaith-Hospitality-Network-Inc-168202093194563/",
    "description": "Provides a shelter for homeless families."
  },
  {
    "addressLine1": "425 Alexander Street",
    "city": "Fayetteville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28301",
    "name": "Salvation Army of Cumberland County Emergency Shelter",
    "organization": "Salvation Army of Cumberland County Emergency Shelter",
    "phone": "(910) 323-9769",
    "website": "https://www.twitter.com/sacarolinas",
    "description": "Shelter for single men. Dinner served from 5pm to 5:30pm every day."
  },
  {
    "addressLine1": "503 Old Wilmington Road",
    "city": "Fayetteville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28301",
    "name": "Robin's Meadow Transitional Housing",
    "organization": "Robin's Meadow Transitional Housing",
    "phone": "(910) 321-6582",
    "website": "",
    "description": "homeless transitional housing for men, women, and families."
  },
  {
    "addressLine1": "531 Hillsboro Street",
    "city": "Fayetteville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "00000",
    "name": "Operation Inasmuch Homeless Center - The Lodge",
    "organization": "Operation Inasmuch Homeless Center - The Lodge",
    "phone": "(910) 433-2161",
    "website": "https://www.faoiam.org/",
    "description": ""
  },
  {
    "addressLine1": "245 Alexander Street",
    "city": "Fayetteville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "72701",
    "name": "The Salvation Army Pathway of Hope Shelter",
    "organization": "The Salvation Army Pathway of Hope Shelter",
    "phone": "(910) 479-4663",
    "website": "https://www.salvationarmycarolinas.org/fayetteville/",
    "description": ""
  },
  {
    "addressLine1": "537 West Main Street",
    "city": "Forest City",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28043",
    "name": "Grace of God Rescue Mission",
    "organization": "Grace of God Rescue Mission",
    "phone": "(828) 245-9141",
    "website": "https://gogrm.wordpress.com/",
    "description": "The Men's Shelter provides housing for men with sleeping quarters, a kitchen, meeting room and shower facilities. The mission provides a place to stay for 30 days and three meals per day. The men residents originally stayed at the Main Street facility in Forest City. After Doug Atchley donated this trailer and the Green River Baptist Association donated the fixtures to the mission, the men's residence was moved to this 14-bed facility.\n\nGail's House is the women's shelter. It is a God-filled refuge for women in times of trouble and distress. Women and their children can come and stay where the Lord provides for their needs and necessities. Gail's House was named after Gail Hogan who was very instrumental in helping the mission grow and become better known. Being a teacher, she collected cans after school for the mission and helped in any other way possible. Upon her death from cancer in 1996, the new women's shelter was named \"Gail's House\" in her honor.\n\nGrace Country Kitchen\nThe Mission started a soup kitchen two days a week in January of 1999. This was the dream of sponsor and volunteer Olen J. Millis. Olen passed away just before the soup kitchen was started. Evening meals are now served seven days a week from 5:00 until 6:00 p.m. Depending on the time of the month, we will serve 50 - 70 meals per day. We have served over 100 meals in one day."
  },
  {
    "addressLine1": "206 Mount Sinai Church Rd.",
    "city": "Shelby",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28152",
    "name": "Crossroads Rescue Mission",
    "organization": "Crossroads Rescue Mission",
    "phone": "(704) 484-8770",
    "website": "http://www.crossroadsrescuemission.org/",
    "description": "Check-In Information and Procedures:\nEach potential resident needs to complete a telephone interview by calling the main office. They will then complete an in-person interview when they arrive at Crossroads.  There is no fee required to stay at the mission until you get a job or equivalent funding; however we do ask for an initial registration fee of $60 to cover printed materials and other goods.  But, we do not turn anyone down on account of not being able to meet this fee.\n\nTo Check-In:\n    Call the main office at 704-484-8770 and complete the phone interview\n    Have all court dates and legal requirements settled or postponed for the first 45 days\n\n    Complete a check-in interview upon arrival at the mission\n    At time of check-in you must be clean and sober, and not in need of medical detox treatment\n\nItems needed at Check-In\nState ID (drivers license or state-issued ID card with picture.\nChange of clothes (work and dress clothes). If you do not have clothes, then we will provide some from the clothing room.\nShower shoes\nKJV Bible; If you do not have one, we will provide you with a Bible upon arrival.\n\nOur Program:\nOur program consists of three phases.  In phase one, we expect each man to commit to 90 days here at Crossroads.  Men attend chapel twice a day with phase one classes for sixty minutes each morning. Through the day men are assigned various jobs depending on their particular skill sets; everything from maintenance and green-house workers, cooks, warehouse workers, to thrift store helpers.  Phase-one classes focus on recovery and providing the basics needed to begin a personal walk with the Lord and successful Christian living. We encourage each resident to continue to the second phase of our program, \"The Sons of God.\"  This is an intense, six month study, presented in a fast-paced, challenging, learning environment.  Men enrolled in the Sons of God program are held to a  higher standard of accountability and are used as encouragers to the new residents.  The courses deliver the equivalent of a first year of Bible college curriculum.  Upon graduation, phase three emphasizes preparing a resident for self sufficiency.  Attention is given to financial planning, family life, job skills, and continuing education.  We believe all three phases of this program identify the plan that God intends for us to live, according to the instruction He has given us in His Word. "
  },
  {
    "addressLine1": "1100 Buffalo St.",
    "city": "Shelby",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28150",
    "name": "Cleveland County Rescue Mission",
    "organization": "Cleveland County Rescue Mission",
    "phone": "(704) 481-1889",
    "website": "https://clevelandcountyrescue.org/",
    "description": "We are a nonprofit faith based organization dedicated to providing shelter, recovery and support services to the homeless.\n\n\nCCRM offers Christ-centered addiction recovery programs: Discipleship and Turning Point. We provide an array of educational classes. These classes include personal finance, GED, job skill training, theology, healthy living, volunteer work program, basic life skills, and vocational training. These programs will help residents gain employment, further their education, build self confident, and transition them to more stable or permanent housing."
  },
  {
    "addressLine1": "305 West Lee Stree",
    "city": "Greensboro",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27406",
    "name": "Weaver House Night Shelter - Greensboro Urban Ministry",
    "organization": "Weaver House Night Shelter - Greensboro Urban Ministry",
    "phone": "(336) 271-5959",
    "website": "http://greensborourbanministry.org/services/housing-assistance/weaver-house/",
    "description": "Weaver House Night Shelter offers year round shelter to adult men and women. Weaver House accommodates 86 men and 14 women in separate dormitory rooms.\n\nWeaver House Desk\nPhone  336.553.2665\nFax  336.553.2809\n\nPotter's House Community Kitchen helps these individuals make ends meet by providing a free, well-balanced, nutritious meal each day to those in need.  The meal is served between 10:30 A.M. and 12:30 P.M. For many in our community, this may be the only nutritious meal they receive that day.  Additionally, breakfast and dinner are provided to those individuals staying in Weaver House Night Shelter."
  },
  {
    "addressLine1": "701 Cedar Lane",
    "city": "Tarboro",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27886",
    "name": "Tarboro Community Outreach Homeless Shelter and Pantry",
    "organization": "Tarboro Community Outreach Homeless Shelter and Pantry",
    "phone": "(252) 823-8801",
    "website": "",
    "description": "Homeless Shelter. TCO operates a 26 man homeless shelter as well as a wonderful home that provides temporary housing for displaced families, women and children. These facilities have developed into centers for personal growth and transformation, not just a drop in and sleep area.\n\nTarboro Community Outreach (TCO) is a non-profit agency, which serves needy families and individuals of Edgecombe County, NC. Founded in 1982, TCO gives support to people in need of shelter, food, or clothing. In a region that has been plagued with a number of natural disasters and economic hardships, TCO makes a difference in the lives of the poor.\n\n\nSoup Kitchen. Among its busiest programs, TCO's soup kitchen facility serves more than 350 meals each weekday for those seeking and in need of healthy, prepared meals. The kitchen also serves as a training area for TCO's shelter residents who perform volunteer duties to assist in running the program.\n\nFood Pantry. TCO's food pantry redistributes canned goods and perishable foods to those who are experiencing hunger, helping more than 400 households per month. Volunteerism is key to TCO's success. Recipients help with food distribution, which helps them maintain a sense of dignity when receiving free food."
  },
  {
    "addressLine1": "2014 Raleigh Road",
    "city": "Henderson",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27536",
    "name": "Lifeline Outreach Inc",
    "organization": "Lifeline Outreach Inc",
    "phone": "(252) 438-2098",
    "website": "",
    "description": "Emergency Shelter for women only. Call for more information."
  },
  {
    "addressLine1": "222 Young St",
    "city": "Henderson",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27536",
    "name": "Henderson Vance Men's Shelter",
    "organization": "Henderson Vance Men's Shelter",
    "phone": "(252) 820-0701",
    "website": "https://sites.google.com/site/cpohope1/mission-history",
    "description": "In the Men's Shelter, we provide a man a shower, a meal, and a safe warm place to sleep for a night and try to help him move on to something better.\n\nAt Hope House we plan to offer the next steps toward independence: \n\ntransitional housing, assistance in getting training, counseling, and life skills, and help to find and keep a job.\n\n\nThe Henderson/Vance Men's Shelter currently operates in the basement of First Presbyterian Church at the corner of Young Street and Chestnut Street in Henderson, NC. It is our goal to obtain a larger and more permanent location in order to offer more services. The Shelter opens on November 1st and remains operational through March 31st. During this period, the shelter will receive men from 5:30pm until 7:00pm daily and discharge them at 6:30am the following day. The men get a chance to take a hot shower and enjoy a dinner and light breakfast before heading out for the day.\n\nThe Shelter is staffed by a paid part-time Shelter Director and a team of volunteers. The Director is responsible for daily operations of the Shelter, coordinating the staffing of volunteers and ensuring that the rules of the Shelter are followed. The volunteers will help to register the men, serve meals, and supervise their stay.\n\n\nThe ultimate goal of the Shelter is to help the men get back to a self sufficient life. Upcoming efforts will include job and education counseling, social services referrals, and more."
  },
  {
    "addressLine1": "not disclosed",
    "city": "Oxford",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27565",
    "name": "Harbour House, Inc",
    "organization": "Harbour House, Inc",
    "phone": "(919) 690-1977",
    "website": "mailto:harbourhouse1@centurylink.com",
    "description": "Two shelters located in Oxford, NC for men, women, and children. Provides temporary housing up to 90 days."
  },
  {
    "addressLine1": "112 2nd Ave., South East",
    "city": "Hickory",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28602",
    "name": "Safe Harbor of NC, Inc.",
    "organization": "Safe Harbor of NC, Inc.",
    "phone": "(828) 326-7233",
    "website": "https://safeharbornc.org/",
    "description": "They offer a safe place for women and children to come to during the day.\nThey also offer basic needs, food, shelter, showers, laundry facility as well as job mentor ship, Bible study, education and possibility for transitional housing.\n\n"
  },
  {
    "addressLine1": "208 White Street",
    "city": "Morganton",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28655",
    "name": "Burke Women & Children's Shelter",
    "organization": "Burke Women & Children's Shelter",
    "phone": "(828) 432-5659",
    "website": "http://meetingplacemission.org/",
    "description": "Women & Children's Emergency ShelterThe emergency shelter provides a safe night's stay for women and children who have nowhere to go. When someone checks into the shelter we provide a good meal and a clean bed.\n\nWe give each person a clean set of pajamas to wear after they shower. This allows us to launder their clothes overnight. In the morning they leave after breakfast with a hearty snack wearing clean clothes."
  },
  {
    "addressLine1": "200 North King Street",
    "city": "Morganton",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28655",
    "name": "The Meeting Place Mission",
    "organization": "The Meeting Place Mission",
    "phone": "(828) 432-5659",
    "website": "http://www.meetingplacemission.org/",
    "description": "Transitional Housing, Emergency Shelter, Family Housing: "
  },
  {
    "addressLine1": "309 Court St",
    "city": "Jacksonville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28540",
    "name": "Second Chance Mission of Hope Inc.",
    "organization": "Second Chance Mission of Hope Inc.",
    "phone": "(910) 455-7111",
    "website": "http://jvillesoupkitchen.tripod.com/second.html",
    "description": "Spiritual Renewal and Empowerment Center for men women and children."
  },
  {
    "addressLine1": "600 Court St",
    "city": "Jacksonville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28540",
    "name": "Onslow Community Outreach Homeless Shelter",
    "organization": "Onslow Community Outreach Homeless Shelter",
    "phone": "(910) 347-3227",
    "website": "http://www.onslowco.org/",
    "description": "The Homeless Shelter is a temporary, emergency program. It operates seven days a week from 5:00 p.m. to 7:00 a.m. Sundays through Thursdays and 6:00 p.m. to 8:00 a.m. Friday and Saturday. Location is 600 Court Street, Jacksonville, NC 28540 (hyperlink address)\n\nThe shelter can accommodate 26 residents in two dorm rooms and two family rooms. Residents may stay up to three months and must be involved in positive self-help activities. This is not a flop house program.\n\n\nThe majority of our program clients are chronically homeless persons. Typically, our clients are persons who slept in a car or under a bridge the previous night, were evicted and are without back-up financial resources, or were discharged from a health care or public safety facility and are without a permanent address.\n\nHomelessness comes at a very high cost to individuals, communities, and systems of care. The research shows that providing housing to someone experiencing chronic homelessness results in reduced utilization of publicly- funded services such as police, hospital, emergency and impatient services, and the correctional systems.\n\n\nOnslow Soup Kitchen\nOur Soup Kitchen hours are Monday-Friday 11am-Noon.\nFood insecurity is a defined reality for hundreds of thousands of hard working Americans who still cannot keep food on the table. Its affecting more than just the families living at or below the poverty line. Addressing hunger and malnutrition is the right thing to do and is a smart investment.\n\n\nThe Soup Kitchen is a vital resource toward helping Onslow County become a healthy, food secure community. Activities are:\n    Lunch Meals\n    Mobile Soup Kitchen\n    Monthly Food Bank\n    Support to Church Food Pantries"
  },
  {
    "addressLine1": "919 George Street",
    "city": "New Bern",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28560",
    "name": "Religious Community Services (RCS)",
    "organization": "Religious Community Services (RCS)",
    "phone": "(252) 633-2767",
    "website": "https://www.rcsnewbern.com/",
    "description": ""
  },
  {
    "addressLine1": "919 George Street",
    "city": "New Bern",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28560",
    "name": "RCS - Emergency Homeless Shelter",
    "organization": "RCS - Emergency Homeless Shelter",
    "phone": "(252) 633-2767",
    "website": "http://www.rcsnewbern.com/",
    "description": "Religious Community Services of New Bern, Inc. is incorporated as a nondenominational, not-for-profit corporation to provide, in Christ's name and in the name of His people, immediate and dignified relief to needy persons and families in Craven, Jones and Pamlico Counties."
  },
  {
    "addressLine1": "515 Scroggs St NW",
    "city": "Lenoir",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28645",
    "name": "The Shelter Home of Caldwell County",
    "organization": "The Shelter Home of Caldwell County",
    "phone": "(828) 758-0888",
    "website": "https://shelterhomecc.org/",
    "description": "If you or someone you know needs help, many organizations and professionals are available to provide counsel and support. The first steps are to see a doctor with any physical injuries and report a crime to law enforcement officers. SHCC provides victim advocacy services to help you navigate the system or find shelter."
  },
  {
    "addressLine1": "804 State Street",
    "city": "Marion",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28752",
    "name": "John Thompson Center for Men",
    "organization": "John Thompson Center for Men",
    "phone": "(828) 659-3981",
    "website": "http://www.mcdowellmission.com/",
    "description": "Provides emergency housing for up to 21 men. Men are provided a clean, safe and structured environment where they may get back on their feet socially, financially and spiritually. Our goal is to see our residents return to a productive lifestyle. Sometimes this means giving them a safe place to live while they improve their education or work on a disability claim. Other times, this means providing a place where they are protected from the elements. Most of the time, it means just giving them a place to get back on their feet financially and find affordable housing.\n\nAt the John Thompson Center, residents are provided with a number of services. We provide Individualized Case Management, working with all residents to identify and set goals to give them a plan for getting back on their feet. Additionally, we provide transportation for residents to get to work assignments and appointments, often in conjunction with McDowell Transit, a service offered by DSS. Residents are provided three meals a day as well as all personal grooming and hygiene necessities.\n\n\nAs part of case management and being a part of our shelter community, all residents are expected to assist with McDowell Mission and community volunteer work when asked. Residents must also attend 3 self improvement meetings a week, which may include classes, doctor's appointments, mental health care group meetings, faith based studies and services, counseling, and many other options."
  },
  {
    "addressLine1": "PO Box 297",
    "city": "Marion",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28752",
    "name": "Friendship Home for Women and Children",
    "organization": "Friendship Home for Women and Children",
    "phone": "(828) 659-6490",
    "website": "http://www.mcdowellmission.com/",
    "description": ""
  },
  {
    "addressLine1": "106 Murphy Street",
    "city": "Morganton",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28655",
    "name": "House of Refuge",
    "organization": "House of Refuge",
    "phone": "(828) 433-8921",
    "website": "http://refugeministries.us/",
    "description": "Here at The House of Refuge we are a temporary men's homeless shelter. We serve any male 18 years or older. We believe that schedules and structure are good recipes for success.\nCheck in begins each afternoon at 4:30. First night is free and each night thereafter is $3.00. Each guest must pass a breathalyzer test. Bed assignments are made at check in. Each guest must make his own bed with freshly laundered sheets and blankets. A shower is required and clean towels are assigned. Laundry services are offered so the each guest is able to clean the clothes he wears or carries with him. A hot meal is served at 6 pm. TV and socialization are allowed until lights out at 10 pm.\n\nWake up is 6:00 am. Sheets, blankets and towels are turned into laundry room. The guest share in the cleaning of bathrooms, sweeping and mopping floors. Breakfast is served and check out follows at 8:00 am.\nBecause we are a temporary shelter each guest must take his belongings with him daily.\nWe offer limited scholarships for men in need of financial assistance.\nWe recommend that the application be made a minimum of 2 days before the monetary need presents.\nWe have rules that must be followed by each guest in order to provide safety to all who stay.\nThose who cannot follow the rules are asked to leave. Offering a peaceful, clean and safe place for each guest is a must for our success."
  },
  {
    "addressLine1": "160 Meadow St",
    "city": "Monroe",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28112",
    "name": "Union County Community Shelter",
    "organization": "Union County Community Shelter",
    "phone": "(704) 289-5300",
    "website": "http://unionshelter.org/",
    "description": " Emergency Shelter\n\nThe Community Shelter of Union County emergency shelter serves single adults and families.\n\nWe provide short term shelter while we work with clients with our Rehousing program to stabilize and move into permanent housing.\n\n\nIn Union County, the number of our neighbors living at or below the poverty line paired with the lack of affordable housing are the primary causes of people experiencing an episode of homelessness. Our system of emergency shelter and rehousing programs have evolved to address these issues in Union County to make these episodes brief, rare, and one time only.\n\n"
  },
  {
    "addressLine1": "125 South Charlotte Ave.",
    "city": "Rock Hill",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "29730",
    "name": "Salvation Army Center of Hope",
    "organization": "Salvation Army Center of Hope",
    "phone": "(803) 324-5141",
    "website": "https://www.salvationarmycarolinas.org/",
    "description": "Salvation Army Shelter for women and children.\n\nLocated two miles north of Uptown Charlotte, the Center of Hope sleeps an average of 300 women and children every night. An active member of the Homeless Services Network, The Salvation Army is a leader in providing families with a successful way out of homelessness. Each program is graduated to step clients from the point of crisis to the point of resolution. These programs include emergency shelter, transitional housing, rapid rehousing, and shelter diversion.\n\nThere is no single portrait of homelessness. Sometimes families lose their homes because of money; women grab their children and run from abusive husbands; an illness strips a person of work; a layoff comes unannounced. In addition to basic needs, clients receive case management, intervention programs, health care, child care for young children, and guidance for school-age children and teens. Shelters are only a temporary solution. Homeless families need help getting back on their feet."
  },
  {
    "addressLine1": "404 East Main St",
    "city": "Rock Hill",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "29730",
    "name": "Family Promise of York County",
    "organization": "Family Promise of York County",
    "phone": "(803) 329-2456",
    "website": "https://familypromiseyc.org/",
    "description": "Mission\n To provide a comprehensive and compassionate program of meals, shelter and case management services to homeless families through a community network of congregations and staff that foster long-term self-sufficieny, independence and success for families.\nFamily Promise of York County is a shelter program for families.  We do not have programs for single men or single women.  In order to enter our program, all adult family members (including children 18 and over) must complete an assessment with program staff.  To schedule an assessment, please contact us at (803) 329-2456\nInterfaith hospitality network\n\nFourteen York County congregations utilize classrooms and other facilities to offer homeless families with minor children overnight shelter, meals, and hospitality. Each congregation hosts the guest families for a week at a time, about four times a year, on a rotating schedule. Seven other congregations assist the hosts by providing volunteer services. Family Promise of York County is able to serve up to 4 families at a time in this program and provides a unique and valuable service to the area by accepting one and two parent families. Unlike other programs serving the homeless, fathers and teen aged boys are able to remain with their families. Pregnant women also qualify as a family unit."
  },
  {
    "addressLine1": "236 W Main St",
    "city": "Rock Hill",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "29730",
    "name": "Pilgrims' Inn",
    "organization": "Pilgrims' Inn",
    "phone": "(803) 327-4227",
    "website": "https://pilgrimsinn.org/",
    "description": ""
  },
  {
    "addressLine1": "227 Rockford Street",
    "city": "Mount Airy",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27030",
    "name": "The Shepherd's House",
    "organization": "The Shepherd's House",
    "phone": "(336) 786-1420",
    "website": "mailto:director@shepherdshousema.org",
    "description": "If you or someone you know is homeless or at imminent risk of losing housing, have them call us at (336)786-1420. We are staffed 24/7 and are always eager to help out those in need. Even if we cannot help you out directly, it is our hope that we can direct you to the appropriate resource for whatever need you may have."
  },
  {
    "addressLine1": "408 West Center St",
    "city": "Galax",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "24333",
    "name": "Hope House -The Good Shepherd",
    "organization": "Hope House -The Good Shepherd",
    "phone": "(276) 236-7573",
    "website": "mailto:galaxhostel@embarqmail.com",
    "description": "We are a homeless shelter/recovery center helping the homeless and hurting to help themselves. The Galax Hope House is a Faith-based Ministry. The Mission of the Hope House of the Good Shepherd, Inc of Southwest Virginia is to provide a Christ-based recovery program for the homeless and hurting that will help them to be healthy, happy, productive and self-sufficient."
  },
  {
    "addressLine1": "73 Blumenthal St",
    "city": "Murphy",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28906",
    "name": "Hurlburt Johnson Friendship House, Inc",
    "organization": "Hurlburt Johnson Friendship House, Inc",
    "phone": "(828) 837-2654",
    "website": "https://www.hurlburt-johnsonfriendshiphouse.org/",
    "description": "Family Emergency shelter - intake from 4 PM to 9 PM.Need personal ID, pass a background check (performed thru the local police office free of charge) and clean drug screen.\nAdmissions Criteria1.  A Photo Identification\n2. Must be able to pass a drug screen\n3. Be willing and able to do chores\n4. Pass a background check\n5. No sex offenders accepted at any time\n6. Must be willing to abide by all rules.\n"
  },
  {
    "addressLine1": "882 Asbestos Rd",
    "city": "Cleveland",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "30528",
    "name": "Yesha House Family Shelter",
    "organization": "Yesha House Family Shelter",
    "phone": "(706) 865-5044",
    "website": "https://www.yeshahouse.org/",
    "description": "Provides a family shelter. Call for details as we do not have any further information to publish on this website."
  },
  {
    "addressLine1": "3200 Statesville Rd, 2nd Floor",
    "city": "North Wilkesboro",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28659",
    "name": "Catherine H. Barber Memorial Homeless Shelter",
    "organization": "Catherine H. Barber Memorial Homeless Shelter",
    "phone": "(336) 838-7120",
    "website": "https://www.wilkeshomelessshelter.com/",
    "description": "Hours: 6:30 pm until 6:30 am\n\n Wilkes County's only homeless shelter.\n\n We serve men, women and families with children.  We provide beds, shower facilities, food and a laundry machine free of charge for anyone needing our services.  We are a temporary homeless shelter.  We request that your stays with our facility be short term.  Our hope is that after a short stay with us, you are able to find permanent housing for yourself and your family.  If you require more than 14 calendar nights, special limited accommodations may be granted.  Long term or chronic homeless individuals should be cared for by other out of town organizations.  We will assist in contacting those organizations for those individuals or families."
  },
  {
    "addressLine1": "135 North Main Street",
    "city": "Red Springs",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28377",
    "name": "Janeth's Center for Women in Crisis",
    "organization": "Janeth's Center for Women in Crisis",
    "phone": "(910) 802-7794",
    "website": "mailto:janethscenterforwomenincrisis@hotmail.com",
    "description": "Janeth's Center for Women in Crisis is a safe haven for women in time of need. We are a womens homles sheler. We cater to domestic violence, homeless and recently Incarcerated women. We provide transitional housing, help the women get enrolled in school or find a job and help find premanent housing. We offer these woemen a hand-up not a hand out."
  },
  {
    "addressLine1": "314 E. Hargett Street",
    "city": "Raleigh",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27611",
    "name": "Raleigh Rescue Mission",
    "organization": "Raleigh Rescue Mission",
    "phone": "(919) 828-9014",
    "website": "https://www.raleighrescue.org/",
    "description": "The Mission serves people in the community in many ways, including:\n\nEmergency Overnight Services for women and children and single men\nLife-changing Recovery and Rehabilitation for men and women\nAdult Education Center (GED preparation)\nQuality preschool through our Children's Development Center\nHousing Locator Assistance\nHomeless Services Resource Referral Card\nSummer Water Ministry\nWinter Clothing Ministry\nFor recovery and rehabilitation clients only, we offer a broad range of services as you or your loved one move from homelessness to a restored life. From medical care to interview coaching to help with parenting and budgeting, we work with each individual to reach their God-given potential.\n\n\n\nEmergency Overnight Services for Women and Children\n\nWe welcome women, as well as mothers with children, on a space-available basis. The elderly and moms with children who have never stayed with us before receive priority placement. Due to the limitations of our facilities, we can only accommodate male children up to ten years of age.\nTo request a bed, women and children must line up on the ramp in front of the Mission at 314 E. Hargett Street, Raleigh, no later than 3:30pm. Services begin at 4:00pm and include:\nDinner\nShower\nHygiene items\nChange of clothes if needed\nClean sheets\nBed in an open dormitory-style room\nBreakfast the next morning\nTo Go Sack lunch\nOpportunity for Bible study\nInvitation to be added to the waiting list for our Recovery and Rehabilitation Services\nAbility to return in the evening\n\nEmergency Overnight Services for Men\nWe welcome men to stay with us overnight on a space-available basis. Elderly men (age 55 and up) and men who have never stayed with us before receive priority placement.\nTo request a bed, men must line up on the ramp in front of the Mission at 314 E. Hargett Street, Raleigh, at 2:45pm. Services begin at 3:00pm and include:\nDinner\nShower\nHygiene items\nChange of clothes if needed\nClean sheets\nBed in a semi-private, dormitory-style room\nBreakfast the next morning\nTo G Sack lunch\nOpportunity for Bible study\nInvitation to be added to the waiting list for our Recovery and Rehabilitation Services\nAbility to return in the evening\nYou can also call (919) 828-9014 for more information."
  },
  {
    "addressLine1": "908 W. Morgan St.",
    "city": "Raleigh",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27603",
    "name": "Wrenn House",
    "organization": "Wrenn House",
    "phone": "(919) 832-7866",
    "website": "http://www.havenhousenc.org/",
    "description": "Wrenn House is available to serve any youth age 10-17 from any geographical location.\n\nWrenn House is the only homeless/runaway/crisis intervention program and shelter for youth in the Triangle.\n\n\nWrenn House provides a safe, legal and responsible environment for youth who run away from home, who are homeless, or are otherwise in a crisis situation. Wrenn House is open 24 hours a day, 365 days a year.\n\n\n\nProvides: temporary shelter, counseling, case management, referrals, mentoring, and a variety of life skills."
  },
  {
    "addressLine1": "5805 Old Forge Circle",
    "city": "Raleigh",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27609",
    "name": "HADIT Home for Veterans",
    "organization": "HADIT Home for Veterans",
    "phone": "(919) 924-4738",
    "website": "https://www.hadithome.org/",
    "description": ""
  },
  {
    "addressLine1": "412 Capital Blvd",
    "city": "Raleigh",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27603",
    "name": "AME Men's Shelter",
    "organization": "AME Men's Shelter",
    "phone": "(919) 834-3734",
    "website": "https://www.facebook.com/pages/category/Nonprofit-Organization/AME-Mens-Empowerment-Center-134568243561053/",
    "description": "The St. Paul AME Empowerment Center seeks to provide meals, shelter, and a safe sanitary environment for homeless men, while serving an incentive center for all workable men, by networking with community agencies. Further, our mission seeks to provide relevant programs that will enable skills, raise hope and self-esteem so that these men will move away from being homeless to productive independent living."
  },
  {
    "addressLine1": "1310 Roanoke Avenue",
    "city": "Roanoke Rapids",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27870",
    "name": "Union Mission of Roanoke Rapids",
    "organization": "Union Mission of Roanoke Rapids",
    "phone": "(252) 537-3372",
    "website": "http://www.unionmissionrorap.org/",
    "description": "Intake Monday - Friday 10:00am -3:00 pm\n\nMinistry to Men\nEmergency shelter, Long-term recovery/rehab program (rural), Transitional housing, Case management\nWomen and Family Ministries\nEmergency shelter, Single women (with children)\n\nFood\nPrepared meals served, Community food pantry\n\nPrograms and Services\nSick at heart, alone and often suffering the devastating effects of drug use, men come to Union Mission looking for help, hope, and a chance to start their lives over again. They find all three in our Men's Program.\n\nThis long-term residential program offers men a safe environment in which to grow spiritually while healing from addiction and other destructive behaviors through one-on- one counseling, case management, and educational and life-skills classes.\nUp to 18 men reside in our facility, where they receive the tools they need to grow strong emotionally, spiritually, academically and physically, through courses like Overcoming Crisis, Codependency, Anger Management, Financial Management, Life Skills, Computer Skills, GED Preparation, and Bible Study.\nUnion Mission does everything possible to eliminate discouraging roadblocks and give our homeless residents every opportunity for success:\n-Safe shelter and an address where they can be contacted for employment\n-Appropriate clothing for interviews, along with instruction in personal hygiene\n-Job-skills training, resume writing, and interview coaching\n-Necessary credentials for employment\n-Transportation to training and interviews\n-Christ-centered counseling and character-building programs\n-Spiritual encouragement and moral support\n\nMonthly Food Distribution and Community Meals\nEvery 30 days, Union Mission distributes at least 200 50-pound boxes filled with meat, fresh produce and staple items to near-homeless and working-poor families right here in the Roanoke Valley.\n\nEach month, we provide nearly 1,000 hot, nourishing meals through our evening dinners, which are open to the community.\nWithout these food boxes or meals, many of our neighbors, may be forced choose between feeding their kids or paying the rent. When a family is forced to make these hard choices, they know they are welcome to share meals with us at the Mission or request a food box."
  },
  {
    "addressLine1": "1320 Washington Ave.",
    "city": "Cleveland",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "44113",
    "name": "Stella Maris Cleveland",
    "organization": "Stella Maris Cleveland",
    "phone": "(216) 781-0550",
    "website": "https://www.stellamariscleveland.com/",
    "description": "Shelter for Men with drug and alcohol addiction\n    Serves 20 single men with alcohol and drug addiction\n    Length of stay in program: four to six months\n    Services:\n        Provides intensive outpatient services\n        Provides a therapeutic community\n        Provides job readiness and permanent housing referrals\n   "
  },
  {
    "addressLine1": "252 School St",
    "city": "Rockingham",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28379",
    "name": "Place of Grace",
    "organization": "Place of Grace",
    "phone": "(910) 817-8701",
    "website": "https://pogcampus.com/",
    "description": "The Place of Grace Campus serves as a resource center focused on finding solutions to homelessness, hunger, and the lack of education through residential and community outreach programs."
  },
  {
    "addressLine1": "341 McDonald Street",
    "city": "Rocky Mount",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27804",
    "name": "United Community Ministries - Community Shelter",
    "organization": "United Community Ministries - Community Shelter",
    "phone": "252-985-1650",
    "website": "http://unitedcommunityministries.org/",
    "description": "Provides the only emergency and transitional shelter for the general homeless population in the Rocky Mount area. \n\nUnited Community Ministries' mission is to provide a nurturing and supportive environment for homeless and nearly homeless families and individuals as they move toward wholeness.\n\n\nPermanent Housing\nThe Permanent Housing Program (PHP) is a one year commitment to living in an apartment with a roommate and working ones way to self-sufficiency. Adults have to be chronically homeless or disabled to qualify. A person is considered chronically homeless when he/she has experienced at least two episodes of homelessness in the past year of at least 30 days duration each. A person is considered permanently disabled if he/she is receiving benefits from the Social Security Administration. Since program inception, nearly 100 Community Shelter residents have transitioned into UCMs Permanent Housing Program, of which 85% remain permanently housed today.\n\nRapid Re-housing\nUCMs Rapid Re-Housing is a successful community strategy for ending homelessness. The intent is to minimize the length of time an individual or family remains in the limbo of homelessness and to help the household quickly re-establish stability. In the safety and predictability of permanent housing, they are encouraged to choose how, when and where they will address other life problems or goals using mainstream resources. Rapid Re-Housing resolves the crisis of homelessness; the rest is up to the individual or familyand their community support systems. Rapid Re-Housing can provide financial assistance in the form of security/utility deposits, rent/utility payments, rent/utility arrears, and application fees. All assistance is based on individual assessment and case plan. Rapid Re-Housing also provides housing stabalization case management to resolve issues that are barriers to achieving housing stability. in 2013-2014 Rapid Re-Housing provided nearly $40,000 in financial assistance to qualifying adults, children and families."
  },
  {
    "addressLine1": "916 Branch Street",
    "city": "Rocky Mount",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27801",
    "name": "Bassett Center, House the Children",
    "organization": "Bassett Center, House the Children",
    "phone": "(252) 985-0078",
    "website": "http://www.unitedcommunityministries.org/",
    "description": "HOUSE THE CHILDREN PROGRAM\n\nThe Bassett Center, located at 916 Branch Street, in Rocky Mount, NC provided outreach services for over 100 homeless and nearly homeless families and children in 2013. Over 1000 people utilized the Bassett Center facilities including but not limited to our Computer Lab, Playroom/Library, Chapel, and Meeting Room. Over 30,000 meals were served to Bassett Center residents, and 100% of Bassett Center residents received intensive case management."
  },
  {
    "addressLine1": "705 Chattham Street",
    "city": "Sanford",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27330",
    "name": "Outreach Mission Inc",
    "organization": "Outreach Mission Inc",
    "phone": "(919) 776-8474",
    "website": "https://www.sanfordoutreachmission.com/",
    "description": "Outreach Mission currently has two shelters: the Women's Shelter, and the Men's Shelter. Both shelters are open 24/7.\nNew guests are welcome at any time, as long as there is a bed available.\n\nThe Women's Shelter houses women and children, and the Men's Shelter is specifically for men over the age of 18.\nAt both shelters a meal is provided, as well as laundry services and showers."
  },
  {
    "addressLine1": "P.O. Box 1331",
    "city": "Shallotte",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28459",
    "name": "Brunswick County Streetreach, Inc.",
    "organization": "Brunswick County Streetreach, Inc.",
    "phone": "(910) 842-2711",
    "website": "http://www.bcstreetreach.org/",
    "description": "This is an Interfaith Network, church host sites do overnight sheltering for the homeless during the coldest months of the year. (November - February). Churches in the area rotate on a weekly basis, during the coldest months of the year (November- February)\n\nPlease keep in mind that there are NO permanent shelters in Brunswick County and after 6pm you usually can't sign in at the shelters in Wilmington or Horry County, SC. \nStreetreach 24 hr. message center (910) 842-2711 \nHOUSING CRISIS HOTLINE ( 910) 444-4998 M-F: 9am-3pm\n\n"
  },
  {
    "addressLine1": "811 Martin St",
    "city": "Wilmington",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28401",
    "name": "Good Shepherd Center",
    "organization": "Good Shepherd Center",
    "phone": "(910) 763-4424",
    "website": "http://www.goodshepherdwilmington.org/",
    "description": "Shelter Intake Hours: Monday Friday, 8 11 am and 12:30 3:30 pm\nValid Photo ID required, or birth certificate for children under 18\nCall 910.763.4424 x100 with questions\nDay Shelter\n\nThe Day Shelter is a safe haven for all, including the most fragile and chronically homeless, those with mental illness and/or physical disabilities. It provides many of the basic life necessities that we take for granted when we have a home of our own: access to bathrooms, showers, toiletries and clean clothing; phone and mail service; assistance obtaining photo identification; case management; on-site medical treatment; connection and transportation to day labor opportunities; and referral to needed community resources such as mental health counseling, substance abuse treatment, and transitional or permanent supportive housing.\n\nBecause it is a low-demand drop-in center, the Day Shelter succeeds in drawing into services even the most severely mentally ill who are not willing, because of their fragile psychological state, to consider coming into shelter overnight. Building trust with these individuals over time through small but positive interactions results in their eventual willingness to access additional needed services toward helping them regain stability.\n\n\n\nNight Shelter\n\nOpened in October 2005, the Night Shelter provides 118 emergency beds for homeless men, women, and families with children every night, year round. While the reasons for their becoming homeless vary, many are working individuals unable to afford housing in this area. Our goal: to provide the intensive support needed to shorten the length of their crisis and expedite their return to housing.\n\nAfter check-in, overnight guests are provided a dinner meal, on-site educational opportunities, and case management, including setting and working toward a plan for becoming housed again. Volunteers including families, congregations, and individualsassist with check-in and shelter monitoring, as well as preparation and service of the dinner meal."
  },
  {
    "addressLine1": "2002 Colwell Ave",
    "city": "Wilmington",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28403",
    "name": "Sergeant Eugene Ashley Center",
    "organization": "Sergeant Eugene Ashley Center",
    "phone": "(910) 362-0292",
    "website": "http://www.ashleycenter.org/",
    "description": "Office Hours: Mondays through Fridays 11:00am to 7:30pm\n\nThe Ashley Program is an 18 month transitional residence and recovery center for up to 23 homeless veterans. Our goal is to provide structure, support and resources that foster lasting recovery and a return to independent living.\n\n\nRecovery is a difficult task that is rarely accomplished alone. Residents receive support in their efforts to become clean and sober and maintain that sobriety through on-site group and individual counseling, mandatory attendance at AA/NA meetings, work with a sponsor, and the built-in network of other recovering individuals on site.On site group and individual counseling is conducting by a Licensed Clinical Social Worker with a background in addiction therapy and focuses on relapse prevention.\n\nTo be accepted to this program an individual must complete the following steps:\n1. Complete and application and send it by fax or mail.\n2.Pass a screening interview with designated staff persons.\n3.Maintain sobriety for a minimum of 14 days. Sobriety time must be established through documented testing by an approved agency. Formal detoxification is preferred, but not required.\n\n4. Submit copies of form DD214 and social security card.\n5.Pass an in-person interview with members of the community and receive vote of approval from community members."
  },
  {
    "addressLine1": "4938 Oleander Drive",
    "city": "Wilmington",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28403",
    "name": "Family Promise of the Lower Cape Fear",
    "organization": "Family Promise of the Lower Cape Fear",
    "phone": "(910) 769-4730",
    "website": "http://familypromiselcf.org/",
    "description": "Hours of operation Monday - Friday 8:30 AM - 5 PM. Call for an appointment.\n\nFamily Promise/WIHN (Wilmington Interfaith Hospitality Network) provides the only transitional housing in the tri-county area for families who are victims of domestic violence with our Families Forward program.  Our emergency shelter program, (WIHN) unites community partners in a collaborative effort to assist homeless families. On a rotating basis, 13 host congregations provide accommodations and meals for up to four families for one week, four times a year. An additional 25 congregations support the hosts, providing material, human, and financial resources to support the program. Volunteers from the community provide meals and support services. A Day Center is located at 4938 Oleander Drive, where staff works intensively with the families as they seek jobs, housing, health care, and other resources necessary for independent living."
  },
  {
    "addressLine1": "1005 Osceola St",
    "city": "Myrtle Beach",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "29577",
    "name": "Street Reach Ministries of Myrtle Beach",
    "organization": "Street Reach Ministries of Myrtle Beach",
    "phone": "(843) 945-4902",
    "website": "mailto:helpstreetreach@gmail.com",
    "description": "Street Reach provides transitional shelter and supportive services to men and women.\n\nEmergency Overnight Service Program (EOS) is in place to provide the homeless men and women in our area a free, safe, clean place to bathe, sleep, receive an evening meal, and gain limited access to free medical care, if necessary.\n\nAn EOS Day at Street Reach:\nMust be 18 years or older\n\nEvening\n3:00-5:00 p.m. Mandatory showers.\n4:00-5:30 p.m. Check-in (valid photo ID needed)\n7:00 p.m. Dinner (open to anyone) & Volunteer Church Service\n\nMorning\n6:15 a.m. Wake-up Call\n6:45 a.m. Exit\n\nLittle River Medical provides on-site medical care every Tuesday & Thursday.\n\nRecovery Program:\nThe Journey Program is a voluntary 15-week Christ centered drug & alcohol rehabilitation program offered to both men and women. Enrollment in the Journey program begins with an interview by Street Reach Staff. Once accepted into the program, there are basic life skills classes, work training, and Bible classes available up to 9-months.\n\nThroughout rehabilitation, participants are never left alone and random drug testing is mandatory. Everyone in the program participates in chores and has assigned responsibilities, which contribute to the facility upkeep and continuation of programs. Recovery classes and Bible classes begin at 7:30 a.m. daily. Teachers, volunteers, pastors and retired church leaders offer encouragement, support and guidance to help keep residents on the path to recovery."
  },
  {
    "addressLine1": "227 Henderson St.",
    "city": "Gaffney",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "29341",
    "name": "Cherokee County Rescue Mission - Miracle Hill Rescue Mission",
    "organization": "Cherokee County Rescue Mission - Miracle Hill Rescue Mission",
    "phone": "(864) 488-0376",
    "website": "https://miraclehill.org/",
    "description": "Intake Begins\nTimes vary depending on staff availability\n\nCapacity\n40 shelter beds plus 6 beds for transitional housing\n\nServices Provided\n- Shelter Beds\n- Meals\n- Access to Healthcare\n- Chapel Services\n- Counseling\n- Guest Laundry Facilities\n- Guest Gym (on mens side)\n- Case Management\n- Transitional Housing\n- Cold Weather Shelter\nProvides safe shelter for a variety of people experiencing homelessness, including men, women, and mothers with children in two different dormitory-style wings. Comprehensive services that include personal counseling, educational opportunities and basic life skills advice are available for those who need extra care.\n\n\nTemporary shelter is also available for those who only need a few weeks to get back on their feet.\n"
  },
  {
    "addressLine1": "227 Henderson Street",
    "city": "Gaffney",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "29342",
    "name": "Miracle Hill Rescue Mission Cherokee",
    "organization": "Miracle Hill Rescue Mission Cherokee",
    "phone": "(864) 488-0376",
    "website": "https://miraclehill.org/",
    "description": "Shelter for victims of abuse, designated shelter for the homeless, a centralized facility to coordinate between health providers, social workers, homeless families, abused women and their children, homeless elderly men and women, and people in need. The agency also provides three meals everyday, laundry facilities, Christian counseling, clean clothing and vital link to health, human services and other community agencies."
  },
  {
    "addressLine1": "523 Glenn Street",
    "city": "Smithfield",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "27577",
    "name": "Smithfield Rescue Mission",
    "organization": "Smithfield Rescue Mission",
    "phone": "(919) 934-9257",
    "website": "https://smithfieldrescue.org/",
    "description": "Emergency Shelter.Separate shelter programs for men and for women/children\n\n\nWe help homeless people, and more importantly, we actively help to prevent homelessness and hunger through operations like Twelve Baskets. Service projects like this underscore our need to live out our gospel calling to help the widows and orphans, the sick, and those who have been forgotten.\n\nThe Smithfield Rescue Mission exists to proclaim the passion of Jesus for those who are homeless and in crisis by providing shelter and necessities of life and life changing programs to break the cycle of poverty."
  },
  {
    "addressLine1": "1421 Fifth Street",
    "city": "Statesville",
    "state": "North Carolina",
    "stateAbbreviation": "NC",
    "postal": "28677",
    "name": "Fifth Street Ministries",
    "organization": "Fifth Street Ministries",
    "phone": "(704) 872-4045",
    "website": "http://www.fifthstreetministries.com/",
    "description": "Fifth Street addresses the needs of the homeless, the hungry, and the impoverished.704-872-4045\n\nFifth Street Ministries offers a variety of services to the homeless, the impoverished and the working poor. For two decades, individuals and families have been served in a variety of ways. From addressing the needs of the homeless to providing sanctuary to victims of domestic violence, thousands of individuals have been assisted. The programs housed under the umbrella of Diakonos are successful because of invaluable community support through exceptional volunteerism, the donation of clothing, food and household items, and financial contributions.\n\nNight Shelter: The starting point for those coming into our program, with the exception of families.  Evaluation of particular needs and empowerment to develop the best course of action to attain short, intermediate and long term goals begins.  Whether it be continued education, referral to substance abuse and/or mental health treatment, life skills training - or a variety of other options to best address the individual  issues, opportunity is given as each step is accomplished.\n\nTransitional Housing:  Some guests qualify for transitional housing after meeting benchmarks designed individually. When a guest is employed, a portion of the monthly income must be placed  into a savings account to be used towards expenses necessary to be satisfied before moving into permanent housing.  Educational programs offered on-site are required. Credit counseling, budgeting, job training, parenting, AA/NA meetings, etc. are incorporated weekly into the program and requires mandatory participation by those enrolled in Transitional Housing.  For those unable to work, reasonable and attainable goals are set and monitored closely.\n"
  }
]