[
  {
    "addressLine1": "604 Park Avenue SE",
    "city": "Aiken",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29802",
    "name": "Salvation Army Shelter - MACH",
    "organization": "Salvation Army Shelter - MACH",
    "phone": "(803) 641-4149",
    "website": "https://www.salvationarmycarolinas.org/aiken",
    "description": "For individuals and families with documented need for housing. Providing crisis intervention and case management. Open 24 hours a day, 7 days a week.\nAccepts: Up to 10 days for men, women, and families.\nMust have ID."
  },
  {
    "addressLine1": "PO Box 1074",
    "city": "AIKEN",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29802",
    "name": "Nurture Home For Women",
    "organization": "Nurture Home For Women",
    "phone": "(803) 641-4164",
    "website": "https://mha-aiken.org/index.php/nurture-home/",
    "description": "Nurture Home is our response to women who are homeless with a mental illness. Nurture Home provides structured interventions to empower each of the women to become self-sufficient. Combined with individualized support to improve the mental health of women.\n\nMission\nThe mission of Nurture Home is to provide women that are homeless with a mental illness a safe place to thrive and restore stability within the Aiken community."
  },
  {
    "addressLine1": "2534 Augusta Rd",
    "city": "Gloverville",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29828",
    "name": "Mt. Salem Outreach Mission",
    "organization": "Mt. Salem Outreach Mission",
    "phone": "(803) 593-2276",
    "website": "mailto:brotherrob@atlanticbb.net",
    "description": "Check in time 4pm-6pm, Office hours are from 9am-3 pm. Men can stay everyday no limit.\n\nMt. SALEM'S soup kitchen will be at 2444 Jefferson Davis Hwy, Graniteville, SC 29829. Monday- Friday 11am-2pm."
  },
  {
    "addressLine1": "106 Tolly St",
    "city": "Anderson",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29624",
    "name": "Salvation Army of Anderson County - Shelter",
    "organization": "Salvation Army of Anderson County - Shelter",
    "phone": "(864) 225-7381",
    "website": "https://www.salvationarmycarolinas.org/anderson/home/",
    "description": "If you are experiencing homelessness and need help call (864) 225-7381 Ext. 2 - If before 4pm or if no one answers please leave a message and we will call you back.\n\nWe have a day resource center open from Monday - Friday from 8am-4pm and someone there can help you if you are in crisis.\n"
  },
  {
    "addressLine1": "219 West Whitner St",
    "city": "Anderson",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29624",
    "name": "Haven of Rest Ministries",
    "organization": "Haven of Rest Ministries",
    "phone": "(864) 226-6193",
    "website": "https://www.havenofrest.cc/",
    "description": "Provides the Rescue Mission homeless shelter for men (can stay up to 30 days). t the HAVEN of REST Rescue Mission, we provide meals for the homeless and an emergency shelter on a nightly basis.\n\nAfter entering the Rescue Mission, a man has 30 days to make a decision whether or not he is going to enter the Men's Training Center. During this time he starts a bible study series, attends chapel services as well as local church services. He will also begin work at one of the ministry locations during the day.\n\nOffice hours: Mondays through Fridays 8am - 5pm.\n\nProvides a 6 month faith based rehab program for women with addictions.\n\nSchedule\nWeekday Schedule\n6:00 Wake-up\n6:00-06:45 Personal Hygiene and\nDorm Clean-up\n06:45 Breakfast\n07:15 Roll Call\n07:20 Devotions\n08:00 Work Assignments\n12:00 Lunch Break\n04:30 Back to Mission\n05:00 Dinner\n06:00-07:00 Class or Self-Study\n07:00-08:00 Chapel Service\n\nSunday Schedule\n7am Wake-up\n07:00-07:30 Personal Hygiene and\nDorm Clean-up\n07:30 Dorm inspection\n08:00 Breakfast\n09:45-12:00 Church\n01:30 Lunch\n02:00-04:00 Free Time\n05:00 Dinner\n06:00-08:00 Church\n\nNeeds\nDisposable Razors\nDeodorant\nShaving Cream\nIbuprofen\nCold Medicine\nHeartburn Medicine\nAllergy Medicine\nSaline Solution\n\nWHAT IS INCLUDED IN HAVEN PROGRAMS?\n\n    Men and women are taught, trained, and mentored in a Christ-centered environment. Programs include in-depth Bible teaching and preparation to live a healthy, productive Christian life.\n        Basic Needs:\n        Meals\n        Shelter\n        A safe place\n        Equipping for a better future:\n        Biblical foundation\n        Christian mentorship\n        Bible teaching\n        Life-skills training\n        Job training\n        Chores\n        GED classes\n        Work Keys training\n        Church Involvement\n        Anger resolution\n        Recovery classes\n        Parenting classes\n        Intangibles:\n        New-life in Christ\n        Healing\n        Hope\n        Transformation\n        Restoration\n        Freedom\n        Victory in Jesus\n"
  },
  {
    "addressLine1": "P.O. Box 1466",
    "city": "Anderson",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29621",
    "name": "Family Promise of Anderson County, Inc. - Family Shelter",
    "organization": "Family Promise of Anderson County, Inc. - Family Shelter",
    "phone": "(864) 760-0908",
    "website": "https://www.familypromiseanderson.org/",
    "description": "Monday through Friday 9:00 a.m. - 5:00 p.m.\n\nProvides emergency shelter and transitional housing for homeless families with children in Anderson County.\n\nOur mission is to reduce homelessness for children and their families in Anderson County by uniting local congregations through an Interfaith Hospitality Network to provide shelter, food and the necessary tools needed for the families to regain their independence\n\nOne Step Closer to Independence\nThrough a new partnership with Grace Episcopal Church, Family Promise offers transitional housing for guests as they exit the Interfaith Hospitality program but still need case management support. These \"Sunshine Houses\" provide an affordable, safe and consistent home for guests as they start work, pay off debt and become fiscally stable. They provide ways to help families into more stable housing situations and break the cycle of homelessness."
  },
  {
    "addressLine1": "111 Hillcrest Ave",
    "city": "Easley",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "00000",
    "name": "Family Promise of Pickens County",
    "organization": "Family Promise of Pickens County",
    "phone": "(864) 644-8828",
    "website": "http://www.familypromisepickens.org/",
    "description": "Provides an emergency shelter. The actual shelter is provided at host congregational churches in Pickens County. There is also a day center at the Dream Center in Easley.\n\nHost congregations rotates weekly among 13 host congregations in our network. In turn, each host congregation provides lodging, three meals daily, and hospitality.\n    Trinity Point Church\n    Arial Baptist Church\n    Easley First Baptist Church\n    Fort Hill Presbyterian Church\n    Holy Trinity Episcopal Church\n    Bethesda United Methodist Church\n    Rock Springs Baptist Church\n    Clemson First Baptist Church\n    The Mill Church\n    Clemson Presbyterian Church\n    Pickens Presbyterian Church\n    Blue Ridge View Baptist Church\n    Clemson United Methodist Church"
  },
  {
    "addressLine1": "19 Santee Lane",
    "city": "Beaufort",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29906",
    "name": "Streets of America Homeless Outreach",
    "organization": "Streets of America Homeless Outreach",
    "phone": "(843) 592-1001",
    "website": "http://www.streetsofamericaministry.com/",
    "description": "Streets of America Homeless Outreach Mission is a Mobile Outreach Mission providing Food and Clothes to our homeless living under bridges, in Alleys, out in the wooded area's of the city or Towns. Streets of America Homeless Outreach Ministry has been working the streets of Beaufort County SC, Charleston SC, Savannah Ga, And Atlanta Ga. Though we can not provide a shelter over their heads for a night we can make sure they don't go hungry, Naked, or Cold. We try to get donations for Food, Clothes, Sleeping Bags, Blankets, Tents etc, so our homeless have a temporary shelter until they can find one down the road. We are a Mobile Mission. Shelters can contact us and we will use you as a contact location when we are in your area. Thank You. Our Homeless need your help, so please help us. May the Lord Bless."
  },
  {
    "addressLine1": "124 Arnold St",
    "city": "Savannah",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "31401",
    "name": "Inner City Night Shelter",
    "organization": "Inner City Night Shelter",
    "phone": "(912) 232-4673",
    "website": "http://icns-sav.com/",
    "description": "Emergency Shelter for Women Sojourner is the emergency shelter program for adult women who are homeless. This facility provides safe place to shower, eat a meals, and rest for the night for homeless women.\n\nEmergency Shelter for Men Safe Haven is a place for homeless men to spend the night, take a shower, and eat meals.\n\n\nIndividual Case Management will address the challenges in the individual's life. After their challenges are identified they are provided access to the programs and help they need. We have aided many men and women move beyond drug addiction, alcoholism, mental illness to stabilize their lives.\n\nTransitional Housing is the next step in moving an individual to becoming more independent. Mens Transitional is the transitional program for adult men, and ABIDE is the transitional program for adult women.\n\nPrison Reentry is a program that provides an address and place to stay for former inmates to avoid homelessness. We have separate prison reentry programs for men and women.\n\n\n\nShelter: 6:00 pm to 7:00 am MON - SUN\nMeals: 4:30 pm to 6:00 pm daily\nShowers: noon to 1:00 pm MON WED FRI\n\nIntake hours: walk-in before 4:00 pm\nEligibility: single homeless males regardless of sobriety\n\nOther services provided: Bathing Facilities, Community Clinics, Community Shelters for Men, Community Shelters for Substance Abusers, Community Shelters for Women, Homeless Drop In Centers, Soup Kitchens"
  },
  {
    "addressLine1": "120 Fahm St",
    "city": "Savannah",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "31401",
    "name": "Union Mission Inc.",
    "organization": "Union Mission Inc.",
    "phone": "(912) 236-7423",
    "website": "https://www.unionmission.org/",
    "description": "Provides shelter for men women and families.\n\nTHE GRACE HOUSE\nThe emergency shelter services at Grace House provides temporary shelter to those in immediate need. The emergency shelter stay is 90 days. Grace House has 31 emergency shelter beds available for men. In addition to addressing clients shelter needs, Grace House offers case management and supportive services to address clients' medical, mental health, and employment needs in order to help them permanently end their homelessness.\n\nBEYOND GRACE\nBeyond Grace provides transitional housing support for those who have completed the 90 day emergency services program at Grace House. By providing an additional two years of transitional housing and supportive services, Beyond Grace gives clients additional time to save for a more stable future and increases their chances of success when they leave Union Mission.\n\nTHE PRISON REENTRY PROGRAM\nThe prison reentry program provides shelter and services to previously incarcerated individuals in order to assist with a successful transition to their community after they are released. Clients in the prison re-entry program receive the same supportive services as those enrolled in Grace House's 90 day emergency services program. Upon completing the prison reentry program, the client has the option of transitioning into the standard Grace House program for an additional 90 days of support, if bed space is available.\n\nMAGDALENE PROJECT\nFamily comes first even when you 're homeless. Women and children are the fastest growing population of homeless in America. Union Mission provides emergency shelter to women with children through The Magdalene Project. During the 90-day shelter stay, clients receive supportive services that help put them on the road to self-sufficiency."
  },
  {
    "addressLine1": "3100 Montgomery Street",
    "city": "Savannah ",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "31405",
    "name": "Salvation Army Homeless Shelter Savannah",
    "organization": "Salvation Army Homeless Shelter Savannah",
    "phone": "(912) 651-7420",
    "website": "http://www.salvationarmy-georgia.org/",
    "description": "Homeless Shelter At Location. Can arrange for extended stays in order to gain self-sufficiency.  365 day a year emergency shelter for men, women and children.\n\nHours:\nMondays through Sundays intake starting 4:00 pm\n\nOffice hours: Mondays through Fridays8:00 am - 5:00 pm.\n\nThe emergency shelter and transitional housing programs provide lodging, meals, personal hygiene items, clothing, employment assistance and casework services with in-depth assessment of circumstances that led to homelessness. The Salvation Army Case Managers work one-on-one with each resident to formulate a plan toward self-sufficiency and stable housing."
  },
  {
    "addressLine1": "1207 Mill Street",
    "city": "Camden",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29020",
    "name": "New Day on Mill Transitional Housing",
    "organization": "New Day on Mill Transitional Housing",
    "phone": "(803) 432-5456",
    "website": "https://www.uwkc.net/homelessness",
    "description": ""
  },
  {
    "addressLine1": "110 A E. Dekalb St.",
    "city": "Camden",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29020",
    "name": "Food for the Soul KC",
    "organization": "Food for the Soul KC",
    "phone": "(803) 432-4771",
    "website": "http://foodforthesoulkc.com/",
    "description": "Food for the Soul is a 24/7 emergency shelter for men, women, and children. Shelter guests must provide proof of residency of Kershaw County in order to utilize overnight services. Services include meals, showers, financial stability, and job readiness classes.\n\nGuest Services\nTuesday-Friday 9:00AM - 2:00PM\nBreakfast\nTuesday-Friday 9:00-10:00AM\n\nLunch\nTuesday-Friday 12:00PM-1:00PM\n\nEmergency Shelter\n7 Days a Week 7:00PM -7:00AM\n"
  },
  {
    "addressLine1": "510 West Oakland Avenue",
    "city": "Sumter",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29150",
    "name": "Sumter Mission Outreach",
    "organization": "Sumter Mission Outreach",
    "phone": "(803) 491-5481",
    "website": "mailto:waltdphillips@aol.com",
    "description": "Sumter Mission Outreach (SMO) is a discipleship ministry housing men and women at two different locations in Sumter SC. The mission provides clothing, housing, food, discipleship, and many other opportunities for men and women who have struggled with homelessness and addictions. SMO provides men and women with hope and with prospects of not just a new life on earth but with finding their place in Christ. Members of the houses give back to the community by feeding the homeless and ministering to all those in need. The mission is a 501C3 and is totally dependent on donations. Board members include a local judge, a former substance abuse councilor, a police officer (a graduate of LU and current Master's degree student), a Christian school principal, and a former pastor. Any questions can be directed to the Director, Walter Phillips."
  },
  {
    "addressLine1": "320 West Oakland Ave",
    "city": "Sumter",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29151",
    "name": "Samaritan House of Sumter Emergency Shelter",
    "organization": "Samaritan House of Sumter Emergency Shelter",
    "phone": "(803) 775-0757",
    "website": "https://sumterunitedministries.org/",
    "description": "The Emergency Shelter provides for those who need rest and nourishment. We exist to help as many people as possible take their next step towards a more whole and independent lifestyle. We seek to do so by providing those in our shelter with relationships and resources so they may be gainfully employed and plan to exit the shelter into stable housing situation.\n\nThe shelter is located at 320 W. Oakland Avenue. It opens at 6:00 PM and closes at 7:00 AM the following morning. New shelter guests can enter before 9:30 PM without a police escort, or must obtain a police escort if after that time. All shelter guests receive a meal at 7:00 PM and have access to amenities such as laundry washing and drying machines and showers.\nThe Emergency Shelter Mission Statement:\n\nThe Emergency Shelter is a temporary shelter seeking to minimize the physical and spiritual impact of brokenness and homelessness by providing rest and nourishment. The Shelter partners with local Sumter County churches to initiate and facilitate healing and restoration, enabling residents to glorify God by leading productive and independent lives."
  },
  {
    "addressLine1": "2411 Two Notch Road",
    "city": "Columbia",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29204",
    "name": "Family Shelter",
    "organization": "Family Shelter",
    "phone": "(803) 771-7040",
    "website": "mailto:rebecca@columbiafamilyshelter.org",
    "description": "Emergency shelter for homeless families, we shelter couples with children, single mothers and single fathers with children. Each family has a private room and shared bathroom in a dorm-style environment. We offer case management, counseling services and a variety of family enrichment programs."
  },
  {
    "addressLine1": "3425 North Main Street",
    "city": "Columbia",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29203",
    "name": "Columbia Women's Shelter",
    "organization": "Columbia Women's Shelter",
    "phone": "(803) 779-4706",
    "website": "https://womenshelter.org/",
    "description": "Women's Shelter. Housing.\n\nPrograms\n\nPrimary Housing\nThe Primary shelter offers temporary housing for a maximum of 11 women. In addition to housing the program provides comprehensive services that include food, clothing, transportation, counseling, educational programs and dental health services.\nResidents are interviewed to determine their readiness for this structured program. Once a woman is accepted her primary focus is to obtain a job that allows her to work at least 25 hours each week while meeting a 5:00pm curfew. Residents enjoy dinner together as a family and attend nightly programs. While participating in this twelve week program, residents are required to deposit the majority of their wages into a savings account. Residents begin to develop a positive routine while saving money and addressing the issues that led them to this program. Successful participation in this program allows a woman to progress into our Transitional Housing Program.\n\nTransitional Housing\nThe Transitional Housing Program began in 1986 with the rental of one foreclosed HUD home. Today, The Womens Shelter Transitional program owns 17 fully furnished housing units all located within six blocks of the primary shelter. This program provides women gradual \"re-entry\" into the community as totally self-sufficient members. In this program residents still attend regular meetings while working with the Transitional Housing Director to begin addressing additional issues. Residents may participate in this program for up to two years while they work to repair their credit, rebuild relationships with their children and family, acquire a GED and other educational goals, and obtain stable careers.\nOur newest undertaking is assisting former residents with home ownership opportunities. To date we have sold three houses to former residents.\n \nDental Services\nThe Dental Clinic facility was developed in 1989. It wasnt until 1999, with a large grant from HUD and a collaborative partnership with another non-profit, that the clinic was able to provide a full-time, paid staff offering comprehensive dental care. Over the past 9 years we have seen over 4,000 individuals, pulled over 8,000 teeth, and made over 500 sets of dentures with a total of over 44,000 procedures. This valuable program brought smiles and self esteem back to many deserving adults.\nIn April of 2008, another phase of our dental center began. Our collaborative partner of many years, the Columbia Oral Health Clinic, became the sole manager of the Dental Clinic. They will remain, ministering to specialized populations and will also assist the residents of The Womens Shelter with their dental needs.\n \nOn Site Counseling\nThe Womens Shelter provides comprehensive programs as a means for residents to obtain the life skills and educational tools necessary to become a healthy, productive member of the community.\nThese programs include group therapy, relapse prevention, parenting classes, assertiveness training, health education, stress reduction, Bible study, various arts and crafts projects and more. Staff, volunteers and licensed professionals from the community conduct these programs."
  },
  {
    "addressLine1": "1726 Sumter Street",
    "city": "Columbia",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29201",
    "name": "Hannah House",
    "organization": "Hannah House",
    "phone": "(803) 771-4357",
    "website": "https://www.christcentralministries.org/",
    "description": "Our Vision is to create a self-sufficient woman capable of caring for her children and building a future for her family.\n\nTransitional living facility for homeless women and their children.\n\n\nHannah House is a Christian based transitional housing facility, under the umbrella organization of Christ Central  Ministries Inc.  Our program fosters personal and spiritual growth to women and children in 1999.  Hannah House is a 4-story brick building that provides shelter for 14 single women and 8 families.  The women are offered the opportunity for life change including advancement in education, knowledge of health and wellness, life skills, assistance in goal setting and personal support towards achieving goals.  However, non-residents can procure needed items as well through the distribution program which includes clothing, shoes, hygiene products, personal care products and some houseware products.\nAMENITIES\nFurnished living space\nDaily Meals\nClothing/Shoes\nPersonal care products\nInternet access\nTelephone access\nHomely living environment\nHealthcare assistance\nFamily oriented culture\nBaby items/accommodations\nLaundry facilities\nTransportation assistance\n\nApartment Style Living\nOur 1 and 2 bedroom apartments are reserved for our women with up to 5 children. Each family has access to the following amenities:\nOne Bed/Crib Per Family Member\nPersonal Bathroom w/ Shower\nCloset and Dresser Space\nDormitory Style Living\nLocated on the 4th floor, the dormitory can house 12 women with no children. Each woman has access to the following amenities:\nOne Twin Bed\nPersonal Closet Space\nPersonal Shelving Space\nResidential Style Bathrooms"
  },
  {
    "addressLine1": "2025 Main Street",
    "city": "Columbia ",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29201",
    "name": "Transitions Homeless Center",
    "organization": "Transitions Homeless Center",
    "phone": "(803) 708-4861",
    "website": "https://transitionssc.org/",
    "description": "We are the Midlands Largest Homeless Center providing homeless men and women ages 18 and older access to our day center, hot meals, showers, service providers and housing.\n\nClients receive services right here at Transitions, to help them to stabilize their lives, increase their income, and secure permanent housing.\n\n\nWe cover the following counties: Richland, Lexington, Fairfield, Chester, Lancaster, Newberry, York, Calhoun, Orangeburg, Bamberg, Allendale, Barnwell, and Aiken. Client referrals are ONLY accepted from local partnering agencies.\n\n\n\nTransitions is a 501(C)3 Non-Profit Organization\n\nTransitions' MISSION\nTo Engage and equip homeless adults of the Midlands to transition into stability and permanent housing.\nThe primary goal of Transitions is to move people from homelessness to permanent housing. Various strategies and types of housing are used to help stabilize individuals living on the street and enroll them in services designed to stabilize their lives, increase their income, and help them secure permanent housing.\n\nOUTREACH\nGoal: To identify and engage people who are living on the streets in order to increase their awareness of services and to improve their readiness to participate in Transitions' programs.\nApproach: Transitions' outreach workers will actively engage and assess eligible clients for the center by visiting places where homeless people congregate including soup kitchens and public/community places. Outreach workers will also work closely with other providers.\n\nDAY CENTER\nGoal: To engage chronically homeless people in services and to recruit them into on-site housing programs so they can begin the process of recovery through offering them a safe and appropriate daytime alternative to the streets for those in need. The center will also provide the basic needs such as food, showers and laundry.\n\nHOUSING- 260 Beds (ADULT MEN AND WOMEN)\n68 Emergency Beds- 42 Male/26Female\nThese beds are for people who are on the street and need a safe place to sleep but may not yet be ready for the structured programs of Transitions. Many will be in active addiction or have a mental illness. Clients may be symptomatic of their illnesses, but they must meet the basic expectations for behavior and safety. Those who are in an imminent health crisis will be sent to the emergency room.\n41 Pre-Program Beds- 29 Male/12Female\nGoal: First Step entry into Program Housing that provides an intermediate progression\nfrom Emergency Beds to case managed Program Beds\n\n73 Program Entry Beds- 55 Male/18 Female\nGoal: This program will provide case management services and short term housing (45-60 days) to individual homeless men and women who are motivated and ready to participate in a structured program of recovery, including increasing their income and securing permanent housing.\nApproach: Provide services and housing that allow homeless people the opportunity to stabilize from their crisis and develop a plan to improve their employment, housing, health care, mental health and addiction issues.\n64 Transitional Housing Units- 32 Male/32 Female\nGoal: Transitional housing units provide a three-month to two-year opportunity to fully address individual obstacles so that the clients can achieve self-sufficiency. Residents of the transitional housing units program will work to improve skills and knowledge and change behaviors so that they can attain and maintain appropriate permanent housing.\nApproach: Provide services and housing that allow clients to overcome obstacles to housing placement, including increasing income and achieving self-sufficiency.\n14 Convalescent Beds- 9 Male/5 Female\nGoal: To shelter currently homeless men while they recuperate from physical illness or injury rather than discharging them to traditional emergency housing facilities or the streets."
  },
  {
    "addressLine1": "1100 Taylor St.",
    "city": "Columbia",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29202",
    "name": "Oliver Gospel Mission Men's Center",
    "organization": "Oliver Gospel Mission Men's Center",
    "phone": "(803) 254-6470",
    "website": "http://www.olivergospelmission.org/",
    "description": "Emergency Shelter for Men.\nEmergency Center\nDoors are open 24/7\n\nOliver Gospel reaches out to the homeless population within the Midlands through its emergency shelter.  43 beds are available each night with an additional 32 mats available when the temperature drops below 40F or in the event of severe inclement weather. Men can stay for up to 30 days, provided that they return each night. After 30 days, there is a 2 week waiting period before they can re-enter into our emergency shelter program.Oliver Gospel believes in providing for those in need but in doing so, also holds strong policies to ensure all of our clients safety. In order to stay at the Mission please provide a picture ID and the ability to pass a breathalyzer test. We are a non-smoking, drug and alcohol free facility. Oliver Gospel also provides breakfast and dinner with chapel services being held after each. For more information, please contact the Front Desk at 803.254.6470 ext. 1007 or visit us at 1100 Taylor Street in downtown Columbia.\n\nRecovery Program\nA 4 Phase Program\n\nThe Recovery Program is a 4-phase program designed to help men addicted to drugs and/or alcohol escape those addictions. It is our aim to assist these men in being transformed into successful, recovered, productive members of the community. The curriculum for the Recovery Program includes Bible studies, addiction recovery classes, and one-on-one meetings with a certified counselor.  Guests are also aided in developing their resumes and preparing for interviews as they enter the later phases of the program.  Literacy classes as well as GED preparation and testing are also available if needed. Oliver Gospel is focused on a recovery relevant, biblical-based program to help facilitate life transformation.  The ultimate aim is to see the participants find jobs that enable them to find a stable place to live and lead self-sustaining, responsible lives. A man is only considered a graduate of the Recovery Program when he has:\n\n\n\n    Completed all phases of the program.\n\n    Obtained employment enabling him to be financially independent.\n\n\n    Obtained stable living arrangements which can be sustained.\n\n    Is actively saving money.\n\n    Become involved in a healthy local church.\n\n\n\nAn aftercare program is offered to willing participants who have completed the Recovery Program. A staff person connects with the men on a regular basis for encouragement and to continue the education process as they face lifes daily trials. For more information or to apply for the Recovery Program, visit Oliver Gospel at 1100 Taylor Street in downtown Columbia or call the Front Desk at 803.254.6470 ext. 1007.\n\n\nHand-Up Program\n\"Get a job\"\n\nThese words that come to mind are both a goal and a curse.  It seems as though when you have hit rock bottom, the only admonition or advice that anyone can give you is \"get a job.\"  But its not as easy as it sounds, particularly when you are struggling with homelessness.  Everything you own is in a bag on your shoulder, you dont have anywhere to shower, and doing laundry is an impossibility.The Hand Up Program is designed to assist men in overcoming the barriers that prevent them from finding employment and escaping their homeless situation.  Participants are assigned a coach to help with resume writing, job applications, job searches, clothing for interviews, financial accountability, and saving for housing.In order to complete the program and graduate, a program participant must:Gain stable, steady employment.Obtain stable, steady living accommodations.Begin actively saving money.For more information or to apply to the program, please contact the Front Desk at 803.254.6470 ext. 1007 or visit us at 1100 Taylor Street in downtown Columbia."
  },
  {
    "addressLine1": "1333 Omarest Dr",
    "city": "Columbia",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29210",
    "name": "Family Promise of the Midlands",
    "organization": "Family Promise of the Midlands",
    "phone": "(803) 832-4765",
    "website": "https://www.familypromisemidlands.org/",
    "description": "Family Promise helps families transition out of homelessness. We provide intensive case management to families to assist in meeting their greatest needs.\n\nInterested families should call to complete a screening questionnaire\nNo walk-ins. Appointments only from 9 am- 3pm\n\nThe mission of Family Promise of the Midlands is to help families who are experiencing situational homelessness achieve sustainable independence by providing temporary shelter in participating houses of worship in the Midlands.\n\nWhile in the program, there are support services for budgeting, job and life skills; transportation , if needed; assistance in securing housing and resources and referrals to other agencies as needed.\n\nDay Center\n\nThe Family Promise of the Midlands Day Center gives families a \"home base\" during their stay in our program.\n\nAt the Day Center, guests work on self-sufficiency plans and meet with staff. We provide transportation to and from the Day Center and to the host church accomodations every day, if necessary.\n"
  },
  {
    "addressLine1": "474 Meeting St.",
    "city": "Charleston",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29403",
    "name": "Star Gospel Mission",
    "organization": "Star Gospel Mission",
    "phone": "(843) 722-2473",
    "website": "https://stargospelmission.org/",
    "description": "TRANSITIONAL HOUSING FOR MEN\nThe Star Gospel Mission is Charleston's oldest not-for-profit Christian welfare organization serving the homeless and needy in the community since 1904. We provide transitional housing for homeless men and respond to the needs of the community by offering food, clothing, rental assistance, utility assistance, emergency medical and transportation assistance. We provide help to the needy by responding to their temporal needs and by sharing the message of the Gospel of Jesus Christ with those who are seeking a spiritual transformation in their lives. Our principal response is to homeless men who are working, or who have a steady source of income, such as: veterans, or those who are disabled or who may be receiving unemployment."
  },
  {
    "addressLine1": "5055 Lackawanna Blvd",
    "city": "North Charleston",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29405",
    "name": "Runaway and Homeless Youth Program",
    "organization": "Runaway and Homeless Youth Program",
    "phone": "(843) 266-5273",
    "website": "https://cydc.org/ncharleston-campus/",
    "description": "Runaway and Homeless Youth Program provides basic emergency shelter for ages 12-20 (until 21st birthday)\n\nThey currently have designated six beds to this initiative within our Charleston Emergency Shelter.\nEligibility:\nResidents must be referred for the program by DSS.\n\n\n\n"
  },
  {
    "addressLine1": "P.O. Box 3395",
    "city": "Columbia",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29230",
    "name": "Palmetto Place Children's Shelter",
    "organization": "Palmetto Place Children's Shelter",
    "phone": "(803) 786-6819",
    "website": "http://palmettoplaceshelter.org/",
    "description": "Palmetto Place Children's Shelter is a safe haven for abused and neglected children and homeless teens throughout the state of South Carolina. We provide a safe and nurturing environment where children have access to after-school programs, tutoring, recreational and social activities. We offer a broad range of services that concentrate on personal healing and development including medical attention, mental health care, crisis adjustment and transitional counseling. We help children succeed; their grades improve and their behaviors stabilize. Here, the state's most desperate children are home. The shelter is open 24 hours each day of the year."
  },
  {
    "addressLine1": "23 Crooked Island Circle",
    "city": "Murrells Inlet",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29576",
    "name": "HADIT Home for Veterans",
    "organization": "HADIT Home for Veterans",
    "phone": "(843) 318-6043",
    "website": "https://www.hadithome.org/",
    "description": "This is a home and food bank for veterans. Shelter, food and clothing is available on a limited basis. Contact the Home residence manager before you arrive to ensure that someone is present to greet you."
  },
  {
    "addressLine1": "1005 Osceola St",
    "city": "Myrtle Beach",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29577",
    "name": "Street Reach Ministries of Myrtle Beach",
    "organization": "Street Reach Ministries of Myrtle Beach",
    "phone": "(843) 945-4902",
    "website": "mailto:helpstreetreach@gmail.com",
    "description": "Street Reach provides transitional shelter and supportive services to men and women.\n\nEmergency Overnight Service Program (EOS) is in place to provide the homeless men and women in our area a free, safe, clean place to bathe, sleep, receive an evening meal, and gain limited access to free medical care, if necessary.\n\nAn EOS Day at Street Reach:\nMust be 18 years or older\n\nEvening\n3:00-5:00 p.m. Mandatory showers.\n4:00-5:30 p.m. Check-in (valid photo ID needed)\n7:00 p.m. Dinner (open to anyone) & Volunteer Church Service\n\nMorning\n6:15 a.m. Wake-up Call\n6:45 a.m. Exit\n\nLittle River Medical provides on-site medical care every Tuesday & Thursday.\n\nRecovery Program:\nThe Journey Program is a voluntary 15-week Christ centered drug & alcohol rehabilitation program offered to both men and women. Enrollment in the Journey program begins with an interview by Street Reach Staff. Once accepted into the program, there are basic life skills classes, work training, and Bible classes available up to 9-months.\n\nThroughout rehabilitation, participants are never left alone and random drug testing is mandatory. Everyone in the program participates in chores and has assigned responsibilities, which contribute to the facility upkeep and continuation of programs. Recovery classes and Bible classes begin at 7:30 a.m. daily. Teachers, volunteers, pastors and retired church leaders offer encouragement, support and guidance to help keep residents on the path to recovery."
  },
  {
    "addressLine1": "P.O. Box 452",
    "city": "Darlington",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29540",
    "name": "House of Refuge - Refuge Outreach Ministry",
    "organization": "House of Refuge - Refuge Outreach Ministry",
    "phone": "(843) 624-3214",
    "website": "mailto:tflowers@ymail.com",
    "description": ""
  },
  {
    "addressLine1": "1020 Darlington Street",
    "city": "Florence",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29501",
    "name": "House of Hope of the Pee Dee Homeless Shelters",
    "organization": "House of Hope of the Pee Dee Homeless Shelters",
    "phone": "(843) 667-9000",
    "website": "https://www.hofh.org/",
    "description": ""
  },
  {
    "addressLine1": "411 S. Jarrott Street",
    "city": "Florence",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29506",
    "name": "PDCAA Shelter for the Homeless",
    "organization": "PDCAA Shelter for the Homeless",
    "phone": "(843) 678-3410",
    "website": "https://pee-dee-caa-shelter-homeless.business.site/",
    "description": ""
  },
  {
    "addressLine1": "535 South Church Street",
    "city": "Florence",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29506",
    "name": "Courtney McGinnis Graham Community Shelter",
    "organization": "Courtney McGinnis Graham Community Shelter",
    "phone": "(843) 731-9315",
    "website": "https://www.hofh.org//",
    "description": ""
  },
  {
    "addressLine1": "20 3rd Street",
    "city": "Greenville",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29611",
    "name": "United Veterans Association Shelter Greenville",
    "organization": "United Veterans Association Shelter Greenville",
    "phone": "(864) 483-0317",
    "website": "",
    "description": "Hours of Operation: 8:00 - 5:00 p.m.\nServices: Provides an emergency shelter and a 90-day drug and alcohol rehabilitation program for homeless men, veterans, and non-veterans.Exception/Criteria: Must be a homeless man"
  },
  {
    "addressLine1": "575 West Washington Street",
    "city": "Greenville",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29602",
    "name": "Miracle Hill Ministries - Greenville Rescue Mission",
    "organization": "Miracle Hill Ministries - Greenville Rescue Mission",
    "phone": "(864) 242-6933",
    "website": "https://miraclehill.org/shelters/greenville-rescue-mission/",
    "description": "Greenville Rescue Mission is an emergency shelter for men that provides refuge from the dangers of living on the streets.\n\nRecommended Arrival Time\n5:00am\n\nIntake Begins\n8:00am\n\nCapacity\n135 beds in dormitory-style rooms plus 6 respite care beds\n\n\nServices Provided\n- Shelter Beds\n- Meals\n- Access to Healthcare\n- Chapel Services\n- Counseling\n- Guest Laundry\n- Guest Gym\n- Case Management\n- Respite Care\n- Cold Weather Shelter\n\nServices are offered in two tiers: one for guests who need temporary shelter and the other for guests in need of more comprehensive help. In partnership with New Horizons Medical Center, the mission also provides respite care beds for men experiencing homelessness who have just been released from the hospital or who have special medical needs."
  },
  {
    "addressLine1": "110 South Main Street",
    "city": "Greenville",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29601",
    "name": "Greenville Area Interfaith Hospitality Network",
    "organization": "Greenville Area Interfaith Hospitality Network",
    "phone": "(864) 271-3424",
    "website": "http://gaihn.org/",
    "description": "Provides shelter, meals, housing and employment assistance to homeless families in the Greenville area.\n\nEligibility: must be homeless with one or more children.\n\n\nOffice Hours: Monday through Friday & Sunday 7:30 a.m. - 5:00 p.m.\n\nGAIHN's hospitality strategy is to provide homeless families with emergency shelter and meals at our host congregations (free of charge) for about 10-12 weeks, followed by intermediate periods in either short-term (3-6 months) or longer term (12 months +) transitional housing (with GAIHN staff providing intensive case management, high-quality life skills training, and ongoing counsel). Our dream is for each guest family to obtain sustaining employment and permanent housing that is safe, affordable, accessible, and adequate for their family's needs."
  },
  {
    "addressLine1": "417 Rutherford Rd.",
    "city": "Greenville",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29601",
    "name": "Salvation Army Greenville",
    "organization": "Salvation Army Greenville",
    "phone": "(864) 235-4803",
    "website": "https://www.facebook.com/salarmygvl/",
    "description": "Office Hours: 8:30 a.m. - 5:00 p.m., Monday through Friday\n\nServices: helps with utilities, rent; provides clothing, transitional housing, food, emergency shelter for men and women, helps with prescriptions, transportation.\nDoes not pay deposits for utilities or rent.\n\nEligibility: need cut off notice or eviction notice to receive help. Must have proof of address, proof of income, and Social Security card for every individual in the household, photo identification for the head of household.\n\nServices include:  Helps with utilities and rent; food, emergency shelter for men and women, helps with prescriptions.\n"
  },
  {
    "addressLine1": "1001 N Main Street",
    "city": "Mullins",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "00000",
    "name": "King's Court Shelter",
    "organization": "King's Court Shelter",
    "phone": "(843) 464-6060",
    "website": "http://www.kingscourtcare.com/",
    "description": "3 Day Temporary Shelter to those who are not able to pay (based on available space, and referral).Discounted Long-term stays for those who are able to pay a low weekly fee (based on income and need).\n\nSponsored shelter rooms for those whose stay is paid for by local churches, Government agencies; DSS, VA, Pee Dee Coalition, or concerned families and members of the community.\n\n\nKing's Court is a  501c3 non-profit organization located in Mullins, SC. Through partnership with Martins Motel we are currently providing services to residents of Marion County who are homeless, low-income, or have economic need.\n\nOther Services\nOnce weekly meals from a local soup kitchen. \nOnce monthly bags of groceries from House of Plenty Food Bank.\nSince opening the shelter in January of 2014 we have provided assistance to more than 50 individuals who are homeless, disabled veterans, battered women, or low-income families.  Partnerships in the community, and donations from churches and individuals have allowed us to assist many, but there is much more work to be done.\n "
  },
  {
    "addressLine1": "227 Henderson St.",
    "city": "Gaffney",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29341",
    "name": "Cherokee County Rescue Mission - Miracle Hill Rescue Mission",
    "organization": "Cherokee County Rescue Mission - Miracle Hill Rescue Mission",
    "phone": "(864) 488-0376",
    "website": "https://miraclehill.org/",
    "description": "Intake Begins\nTimes vary depending on staff availability\n\nCapacity\n40 shelter beds plus 6 beds for transitional housing\n\nServices Provided\n- Shelter Beds\n- Meals\n- Access to Healthcare\n- Chapel Services\n- Counseling\n- Guest Laundry Facilities\n- Guest Gym (on mens side)\n- Case Management\n- Transitional Housing\n- Cold Weather Shelter\nProvides safe shelter for a variety of people experiencing homelessness, including men, women, and mothers with children in two different dormitory-style wings. Comprehensive services that include personal counseling, educational opportunities and basic life skills advice are available for those who need extra care.\n\nTemporary shelter is also available for those who only need a few weeks to get back on their feet.\n"
  },
  {
    "addressLine1": "227 Henderson Street",
    "city": "Gaffney",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29342",
    "name": "Miracle Hill Rescue Mission Cherokee",
    "organization": "Miracle Hill Rescue Mission Cherokee",
    "phone": "(864) 488-0376",
    "website": "https://miraclehill.org/",
    "description": "Shelter for victims of abuse, designated shelter for the homeless, a centralized facility to coordinate between health providers, social workers, homeless families, abused women and their children, homeless elderly men and women, and people in need. The agency also provides three meals everyday, laundry facilities, Christian counseling, clean clothing and vital link to health, human services and other community agencies."
  },
  {
    "addressLine1": "206 Mount Sinai Church Rd.",
    "city": "Shelby",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "28152",
    "name": "Crossroads Rescue Mission",
    "organization": "Crossroads Rescue Mission",
    "phone": "(704) 484-8770",
    "website": "http://www.crossroadsrescuemission.org/",
    "description": "Check-In Information and Procedures:\nEach potential resident needs to complete a telephone interview by calling the main office. They will then complete an in-person interview when they arrive at Crossroads.  There is no fee required to stay at the mission until you get a job or equivalent funding; however we do ask for an initial registration fee of $60 to cover printed materials and other goods.  But, we do not turn anyone down on account of not being able to meet this fee.\n\nTo Check-In:\n    Call the main office at 704-484-8770 and complete the phone interview\n    Have all court dates and legal requirements settled or postponed for the first 45 days\n\n    Complete a check-in interview upon arrival at the mission\n    At time of check-in you must be clean and sober, and not in need of medical detox treatment\n\nItems needed at Check-In\nState ID (drivers license or state-issued ID card with picture.\nChange of clothes (work and dress clothes). If you do not have clothes, then we will provide some from the clothing room.\nShower shoes\nKJV Bible; If you do not have one, we will provide you with a Bible upon arrival.\n\nOur Program:\nOur program consists of three phases.  In phase one, we expect each man to commit to 90 days here at Crossroads.  Men attend chapel twice a day with phase one classes for sixty minutes each morning. Through the day men are assigned various jobs depending on their particular skill sets; everything from maintenance and green-house workers, cooks, warehouse workers, to thrift store helpers.  Phase-one classes focus on recovery and providing the basics needed to begin a personal walk with the Lord and successful Christian living. We encourage each resident to continue to the second phase of our program, \"The Sons of God.\"  This is an intense, six month study, presented in a fast-paced, challenging, learning environment.  Men enrolled in the Sons of God program are held to a  higher standard of accountability and are used as encouragers to the new residents.  The courses deliver the equivalent of a first year of Bible college curriculum.  Upon graduation, phase three emphasizes preparing a resident for self sufficiency.  Attention is given to financial planning, family life, job skills, and continuing education.  We believe all three phases of this program identify the plan that God intends for us to live, according to the instruction He has given us in His Word. "
  },
  {
    "addressLine1": "526 Walker Street",
    "city": "Augusta",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "30901",
    "name": "Augusta Rescue Mission",
    "organization": "Augusta Rescue Mission",
    "phone": "(706) 722-2058",
    "website": "http://augustarescuemission.org/",
    "description": "Overnight Guest Program - homeless men benefit daily from hot meals, showers, clothing, safe sleeping facilities and chapel services, while in transition \"free of charge!\n\nThe Augusta Rescue Mission provides free holiday meals to those in need in the downtown area, including homebound individuals who cannot come to the Mission to receive assistance. In addition, ARM is prepared to provide food to families referred to the Mission by the Department of Family and Children Services.\n\nAnd while not a primary ministry of the Mission, during times of crisis - home fire, etc. - We will occasionally be called upon to provide furnishing for families who are less fortunate and have been left destitute.\nThe Augusta Rescue Mission is currently in the process of being certified by the Red Cross to serve families in the local community as an emergency shelter in times of disaster."
  },
  {
    "addressLine1": "828 Fenwick St",
    "city": "Augusta",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "30901",
    "name": "Garden City Rescue Mission",
    "organization": "Garden City Rescue Mission",
    "phone": "(706) 724-6960",
    "website": "https://www.gcrmaugusta.com/",
    "description": ""
  },
  {
    "addressLine1": "1384 Greene Street",
    "city": "Augusta",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "30901",
    "name": "The Salvation Army Center of Hope Shelter",
    "organization": "The Salvation Army Center of Hope Shelter",
    "phone": "(706) 364-7921",
    "website": "http://www.salvationarmyaugusta.org/",
    "description": "For individuals and families with documented need for housing. Providing crisis intervention and case management. Open 24 hours a day, 7 days a week.\n\nSoup Line A hot evening meal is available 365 days a year to anyone in the community who needs dinner. Dinner is served at the Center of Hope from 5:30pm to 5:50pm Monday- Saturday, and from 4:00pm to 4:20pm on Sundays. Available at our Center of Hope.\n\nShelters Our shelters offer spiritual and physical care, food, and shelter to people in need. They attend the total needs of the individual and are meant to be a kind resting place to help these individuals get back on their feet.\n\nWomen and Children's Emergency Shelter Single women and mothers with children can receive temporary shelter, three healthy meals per day, tutoring, and individual case management. Call the Homeless Social Services office at 706.364.7921 for availability and more information.\n\n\nMen's Emergency Shelter Homeless men receive a safe place to sleep, a shower, and breakfast each morning. Shelter check-in is from 6:00pm to 8:30pm. You must show identification and have shelter clearance from the sheriff's department. Individual case management and group classes are offered in order to help men move to permanent housing. Call the Men's Residential Manager at 706.434.3193 for more information.\n\nDrug and Alcohol Rehabilitation This free, 9-month, residential program is for adult males struggling with addiction. This program includes recovery classes, individualized support, work therapy, and spiritual guidance. Interested candidates must submit a pre-enrollment application to be considered for enrollment. The application can be faxed to 706.826.1801. For more information call the CSRC Manager at 706.434.3194.\n\nSocial Service Assistance\nSocial Service Assistance\nThe First Stop Family Service Center is The Salvation Army of Greater Augusta's Social Services office for people who are housed or have an address. To request an appointment, or to get more information, call 706-922-8330 between 8:30 a.m. and 12 p.m. or 1 p.m. and 4 p.m., Monday through Friday.\nRent and Utility Assistance\nAvailable through the Project SHARE program for residents of Richmond, Burke, Columbia, and Glascock Counties. The bill must be past due and the household must be facing a specific challenge or crisis that makes them unable to pay the bill. Natural gas assistance is offered through a special program that has additional income qualifications. For more information about application requirements or to see when the next screening date will be, contact the First Stop Family Service Center at 706-922-8330.\nEmergency Grocery Assistance\nAvailable for people who do not receive food stamps. Applicants should provide picture ID, social security card, proof of income and expenses, and a description of their food need. Applicants must wait at least 90 days after their last visit and will be referred by staff to food pantries in their neighborhood for additional food assistance.\nClothing Vouchers\nAvailable to The Salvation Army Family Stores for people who need clothing. Applicants should provide picture ID, social security card, proof of income and expenses, and a description of their food need. Applicants must wait at least 90 days after their last visit.\nChristmas Gift and Toy Assistance\nAvailable to families with children up to 12 years old. We participate in the Augusta Christmas Clearinghouse to insure families receive help from only one agency. Christmas open application dates vary each year, but will be released after September 1. Call 706.922.8330.  Applications require photo ID for all adults in the household, birth certificates for all children in the household, social security cards for all household members, proof of income (including food stamps) and expenses, proof of current address, and proof of child custody.  Senior citizens and disabled individuals should call 706.922.8330 after September 1 to ask about Christmas food boxes.\nFurniture Assistance\nAvailable only to fire or disaster victims with a referral from the Red Cross and other required documentation.  Please contact the First Stop Center at 706.922.8330 for information and to schedule an appointment for this service.\nOther assistance is available periodically, depending on the season and supplies available. Items available in the past have included fans, school supplies, children's books, toiletries or diapers, and children's pajamas."
  },
  {
    "addressLine1": "1739 Fenwick Street",
    "city": "Augusta",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "30904",
    "name": "Mercy Ministries - Day Center",
    "organization": "Mercy Ministries - Day Center",
    "phone": "(706) 737-7994",
    "website": "http://augustahomeless.org/",
    "description": "We are Georgia's only drop-in Day Center for the homeless. We are located at 1739 Fenwick St. in the historic Harrisburg neighborhood of Augusta, Ga.\n\nWHAT WE DO\n    We do NOT charge our clients for any of the services we offer.The Day Center on Fenwick St. provides services to the homeless and under housed (usually no utilities) and low income individuals and families.The center is a safe place, out of the weather with access to hot/cold food, showers and laundry use.The Fenwick Street Center also has a case management team to assist in preventing or ending homelessness. We have an active caseload of 1,500 individuals and families.\n    Also recovery 12-step programs are available.\n    We obtain birth certificates, social security cards, Georgia IDs, and provide transportation to job interviews and resume help.\n\n    We assist clients with finding medical help.We pay for doctors and clinic visits(if funds are available) and medications.\n\n    We also assist in locating affordable housing and give vouchers for clothing to our Thrift Shop.\n    We serve 8,000 - 10,000 meals each month and provide fresh fruit, vegetables and bread to 2,000 individuals and families\n    every month during our twice a week food drive. (See photo below-people line up behind Fenwick Street Tuesdays and Fridays at 3:30. Bring a bag or box to carry the food in.)"
  },
  {
    "addressLine1": "1739 Fenwick Street",
    "city": "Augusta",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "30904",
    "name": "Mercy Ministries Day Shelter For Homeless",
    "organization": "Mercy Ministries Day Shelter For Homeless",
    "phone": "(706) 737-7994",
    "website": "http://augustahomeless.org/",
    "description": "We are Georgia's only drop-in Day Center for the homeless.\n\nWHAT WE DO\n    We do NOT charge our clients for any of the services we offer.The Day Center on Fenwick St. provides services to the homeless and under housed (usually no utilities) and low income individuals and families.The center is a safe place, out of the weather with access to hot/cold food, showers and laundry use.The Fenwick Street Center also has a case management team to assist in preventing or ending homelessness.We have an active caseload of 1,500 individuals and families.\n    Also recovery 12-step programs are available.\n    We obtain birth certificates, social security cards, Georgia IDs, and provide transportation to job interviews and resume help.\n    We assist clients with finding medical help.We pay for doctors and clinic visits(if funds are available) and medications.\n\n    We also assist in locating affordable housing and give vouchers for clothing to our Thrift Shop.\n    We serve 8,000 - 10,000 meals each month and provide fresh fruit, vegetables and bread to 2,000 individuals and families\n    every month during our twice a week food drive. (See photo below-people line up behind Fenwick Street Tuesdays and Fridays at 3:30. Bring a bag or box to carry the food in.)"
  },
  {
    "addressLine1": "2177 Central Avenue",
    "city": "Augusta",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "30904",
    "name": "Family Promise of Augusta",
    "organization": "Family Promise of Augusta",
    "phone": "(706) 364-4462",
    "website": "http://familypromiseaugusta.com/",
    "description": "Assistance for homeless families with children. Also provides transitional housing. Waiting list. Call for details.\n\nThe Interfaith Hospitality Network (IHNA) service programs are formed from many already existing programs and resources in the local area. The benefit of using pre-existing assets is so we can react quickly and without major costs. Guests accepted in the network are eligible to receive the following services and assistance:\n\nHost Churches:\nWe have a network of local churches that volunteer to house our guests for one week at a time four times a year. When families enter our program they spend the night at one of these churches. At 5:00 they return to the church for the evening. The volunteers at the host church that week feed the guests supper and usually have family time or a mentoring class in the evening. Next morning these volunteers feed the guests breakfast and send them off with a sack lunch.\n\nEmployment Searches:\nAfter leaving the host church in the morning, the adults come to the Day Center. From there they are transported to job interviews, employment agencies, or wherever they need to be transported in their search for employment.\n\nTransportation:\nWhile in the program our guests and their children are provided with cost free transportation. Guests can be taken to and from various locations in conjunction with regaining their independence, while their children are taken to whichever school they were enrolled in prior to entering the program.\n\nDay Care Services:\nFPA operates a cost free Day Care Shelter for the children of our guests. Each morning the children who are not enrolled in school, or who are out of school, are transported to the Day Care center. Guests in transitional housing are still eligible for our day care services.\n\nPersonal Services:\nDuring their stay we try to ensure we meet all the needs of our guests including medical assistance and dental care. Life skills assistance, Budget Management and Parenting Classes are also offered. Assistance will be provided as needed with resumes, GED classes and navigating the job market.\n\nTransition to Independence:\nAfter our guests find stable employment they move to one of our transitional homes. When they move in we try to make sure they have everything they need. This includes furniture, linens, household items and transportation./p>\n\nTransitional Housing:\nAfter the adult of the family has found employment and has a stable income the family moves to one of our transitional homes; where they can stay, rent free, for up to two years. During their stay in transitional housing they are responsible for all other expenses and required to save 30 percent of their income as well as look for permanent housing. Regular meetings with the director is also required for all guest who enter transitional housing."
  },
  {
    "addressLine1": "2136 Circular Dr",
    "city": "Augusta",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "30903",
    "name": "Head of the Giant Ministry Inc.",
    "organization": "Head of the Giant Ministry Inc.",
    "phone": "(706) 496-1540",
    "website": "https://www.headofthegiantministry.com/index.html",
    "description": "Head of the Giant Ministries provides emergency housing, transient housing, job training, job placement, Christian teaching, GED preparation, VA referral, and SSI benefit assistance to those who are in need within the CSRA.\n\nIntake is from 9-5pm. Guest are allowed up to 90 days stay. Must have shelter clearance pass. Mothers must show proof of guardianship of children. Men's intake upon appointment"
  },
  {
    "addressLine1": "11 Regency Hill Drive",
    "city": "Greenville",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29607",
    "name": "Shepherd's Gate - Miracle Hill Ministries Inc",
    "organization": "Shepherd's Gate - Miracle Hill Ministries Inc",
    "phone": "(864) 268-5589",
    "website": "https://miraclehill.org/shelters/shepherds-gate/",
    "description": "Shepherds Gate in Greenville provides safe shelter for women and mothers with young children who are experiencing homelessness.\n\nShort-term services are provided through a Crisis Program and more in-depth services are provided through a New Life Program for women in need of comprehensive care.\n\n\nShepherds Gate also provides beds for ladies waiting to enter Renewal, Miracle Hills addiction recovery program for women.\nIntake Begins\n2:00pm\n\nCapacity\n52 beds plus 10 Personal Development Program beds\n\nServices Provided\n- Shelter Beds\n- Meals\n- Access to Healthcare\n- Chapel Services\n- Counseling\n- Free Laundry Facilities\n- Case Management\n- Personal Development\n- Cold Weather Shelter\n"
  },
  {
    "addressLine1": "949 S. Main St",
    "city": "Greenwood",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29646",
    "name": "Kinard Manor of Lutheran Family",
    "organization": "Kinard Manor of Lutheran Family",
    "phone": "(864) 229-8020",
    "website": "http://www.lfscarolinas.org/",
    "description": "We are a ten bed transitional housing facility for male veterans. No direct intakes allowed. All veterans are placed with us through the VA under the Health Care for Homeless Veterans (HCHV) program. Contact us or any VA hospital or clinic for more information about the program. All support for the veteran is free until they find employment.More Information: Lutheran Family Services in the Carolinas operates Kinard Manor inpartnership with the Department of Veteran Affairs. Kinard Manor openedits doors in November 2007. Since that time we've served 38 veteransand have had 11 program graduates. Our program provides shelter, food,life skills training, and job hunting, all geared towards reintegratingthe veteran back into the community. Veterans are placed in KinardManor by the VA. We are not allowed to do a direct (walk-in)intake,although we can provide transportation to the VA hospital for thepurpose of getting enrolled in the VA's Health Care for Homeless Veteranprogram. The VA has program requirements: The veteran must behomeless. Also, the veteran must be documented as having (or have had)an addiction problem or mental problem. Once in the program, allmedical needs for the veteran are handled by the VA. Although theaverage stay at Kinard Manor has been six months, the HCHV program doesallow exceptions for up to two years."
  },
  {
    "addressLine1": "208 Panola Avenue",
    "city": "Greenwood",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29646",
    "name": "Greenwood Pathway House",
    "organization": "Greenwood Pathway House",
    "phone": "(864) 223-4460",
    "website": "https://www.gwdpathway.org/",
    "description": ""
  },
  {
    "addressLine1": "129 Gibson St",
    "city": "Lexington",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29072",
    "name": "Samaritan's Well - Shelter for women",
    "organization": "Samaritan's Well - Shelter for women",
    "phone": "(803) 785-4357",
    "website": "https://samaritanswellsc.wordpress.com/",
    "description": ""
  },
  {
    "addressLine1": "542 Cypress Avenue",
    "city": "Murrrells Inlet",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29576",
    "name": "St Vincent De Paul Society Food Pantry",
    "organization": "St Vincent De Paul Society Food Pantry",
    "phone": "(843) 855-9478",
    "website": "https://svdpgardencitysc.org/",
    "description": "IF YOU NEED HELP CONTACT US AT843 424 3820 to set up an appointment or find out more information. Our food pantry is open each Wednesday from 4 to 6 PM at Saint Michael Church (Parish activity center) and no appointment is necessary to receive food."
  },
  {
    "addressLine1": "PO Box 529",
    "city": "North Myrtle Beach",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29568",
    "name": "North Strand Housing Shelter",
    "organization": "North Strand Housing Shelter",
    "phone": "(843) 756-9488",
    "website": "http://www.northstrandhousingshelter.org/",
    "description": "NSHS is able to provide food, bath and bed for those seeking our services. We offer programs to give a holistic approach that will help meet spiritual, physical and emotional needs as we offer an atmosphere of dignity and respect.\n\nMission Statement: To train and equip leaders...in assisting the underserved (e.g., homeless, hungry and needy) in the most appropriate way. To find, secure and provide facilities to house the homeless. To educate those who lack the necessary knowledge to be productive citizens in society using all means available to include spiritual awareness. To build character, integrity and sound spiritual values.\n\n\nNorth Strand Housing Shelter is under the umbrella of Worldview Ministry International, Inc., a 501 (c) 3 organization"
  },
  {
    "addressLine1": "1580 Middleton Street",
    "city": "Orangeburg",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29115",
    "name": "Samaritan House Homeless",
    "organization": "Samaritan House Homeless",
    "phone": "(803) 809-1090",
    "website": "https://www.samaritanhouseorangeburgsc.org/",
    "description": "The Samaritan House provides temporary housing, outreach programs and transitional services to the homeless in Orangeburg, SC\n3 types of Program Levels available:\n\nProgram Levels*\n\n    Emergency Program: Up to 90 days stay - An individual may stay in an Emergency Program (bed) for up to 90 days. During this time they receive all services. By the end of the 90 days the resident must decide if they are ready to move into another bed level and start working towards stabilizing their life.\n    Stabilization Program: Up to 6 months including the previous three months (depending upon bed space) - The program will provide case management services and short-term housing up to 6 months, including the previous two months (depending upon bed space), to individual homeless men and women who are motivated and ready to participate in a structured program of recovery, including increasing their income and securing permanent housing. Provides services and housing that allow homeless people the opportunity to stabilize from their crisis and develop a plan to improve their employment, housing, health care, mental health, and addiction issues as needed.\n\n    Extended Program: Up to 8 months including the last six months (depending upon bed space) - Provides housing to adequately address personal obstacles so that the clients can achieve self-sufficiency, improve skills, increase knowledge and change behaviors to maintain permanent housing. Clients must meet all program requirements and also are expected to obtain and sustain income (from employment, benefits, or both) and to save money once they have income. Clients will work more intensively with a Case Manager to improve skills and knowledge and change behaviors so that they can attain and maintain appropriate permanent housing. Each need will be assessed, and a plan will be designed to assist him or her to enter the workforce and budget his or her money.\n\n*Exceptions for the Program Level extensions with documented valid reason. The Executive Director must provide approval.\n"
  },
  {
    "addressLine1": "155 Lovell Street",
    "city": "Orangeburg",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29115",
    "name": "DNA Homes",
    "organization": "DNA Homes",
    "phone": "(803) 339-0578",
    "website": "https://www.dnahomes.org/",
    "description": ""
  },
  {
    "addressLine1": "404 East Main St",
    "city": "Rock Hill",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29730",
    "name": "Family Promise of York County",
    "organization": "Family Promise of York County",
    "phone": "(803) 329-2456",
    "website": "https://familypromiseyc.org/",
    "description": "Mission\n To provide a comprehensive and compassionate program of meals, shelter and case management services to homeless families through a community network of congregations and staff that foster long-term self-sufficieny, independence and success for families.\nFamily Promise of York County is a shelter program for families.  We do not have programs for single men or single women.  In order to enter our program, all adult family members (including children 18 and over) must complete an assessment with program staff.  To schedule an assessment, please contact us at (803) 329-2456\nInterfaith hospitality network\n\nFourteen York County congregations utilize classrooms and other facilities to offer homeless families with minor children overnight shelter, meals, and hospitality. Each congregation hosts the guest families for a week at a time, about four times a year, on a rotating schedule. Seven other congregations assist the hosts by providing volunteer services. Family Promise of York County is able to serve up to 4 families at a time in this program and provides a unique and valuable service to the area by accepting one and two parent families. Unlike other programs serving the homeless, fathers and teen aged boys are able to remain with their families. Pregnant women also qualify as a family unit."
  },
  {
    "addressLine1": "546 Z South Cherry Rd",
    "city": "Rock Hill",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29732",
    "name": "The Haven Men's Shelter",
    "organization": "The Haven Men's Shelter",
    "phone": "(803) 328-1143",
    "website": "https://www.thehavenrh.org/",
    "description": ""
  },
  {
    "addressLine1": "236 W Main St",
    "city": "Rock Hill",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29730",
    "name": "Pilgrims' Inn",
    "organization": "Pilgrims' Inn",
    "phone": "(803) 327-4227",
    "website": "https://pilgrimsinn.org/",
    "description": ""
  },
  {
    "addressLine1": "125 South Charlotte Ave.",
    "city": "Rock Hill",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29730",
    "name": "Salvation Army Center of Hope",
    "organization": "Salvation Army Center of Hope",
    "phone": "(803) 324-5141",
    "website": "https://www.salvationarmycarolinas.org/",
    "description": "Salvation Army Shelter for women and children.\n\nLocated two miles north of Uptown Charlotte, the Center of Hope sleeps an average of 300 women and children every night. An active member of the Homeless Services Network, The Salvation Army is a leader in providing families with a successful way out of homelessness. Each program is graduated to step clients from the point of crisis to the point of resolution. These programs include emergency shelter, transitional housing, rapid rehousing, and shelter diversion.\n\n\nThere is no single portrait of homelessness. Sometimes families lose their homes because of money; women grab their children and run from abusive husbands; an illness strips a person of work; a layoff comes unannounced. In addition to basic needs, clients receive case management, intervention programs, health care, child care for young children, and guidance for school-age children and teens. Shelters are only a temporary solution. Homeless families need help getting back on their feet."
  },
  {
    "addressLine1": "816 Peaceful Glen Rd",
    "city": "Charlotte",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "28273",
    "name": "Discovery Home Care Inc",
    "organization": "Discovery Home Care Inc",
    "phone": "(980) 201-9145",
    "website": "http://www.discoveryhomecare.org/",
    "description": "Discovery Home Care INC, a Youth Emergency Care Shelter located in Mecklenburg County, N.C, Gaston County, NC a non-profit organization, licensed by North Carolina Department of Health and Human Service, Division of Social Service, to provide emergency shelter care and Respite Care among other services to children ages 6 to 17 years. Discovery Home Care is a 15 days temporary shelter for youth. We serve children who have been victims of sexual or physical abuse, emotional or physical neglect, abandonment, homeless and runaways. These children may be referred to Discovery Home Care by Social Services or by a law enforcement agency. Or other agencies Discovery Home Care INC emergency shelter is open 24 hours a day, 7 days a week. The shelter has 5 beds to accommodate 5 male or female children. We provide respite care. Discovery Home Care is dedicated to serving. We serve youth in Gaston, Lincoln, Cleveland, Iredell, Stanley, Cabarrus and Mecklenburg Counties, NC\n\nGoal of Service:\nThe goal of Emergency Shelter care is to provide a safe, temporary, confidential place for youth to stay. While helping the child avoid the dangers of living on the streets. We would love to have you Volunteer with our youth shelter Office 980 201-9145 Sandra Williams"
  },
  {
    "addressLine1": "525 East Main Street",
    "city": "Seneca",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29678",
    "name": "Our Daily Rest",
    "organization": "Our Daily Rest",
    "phone": "(864) 482-2040",
    "website": "https://www.ourdailyrest.org/",
    "description": ""
  },
  {
    "addressLine1": "189 North Forest Street",
    "city": "Spartanburg",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29301",
    "name": "Spartanburg Rescue Mission - Miracle Life Mission",
    "organization": "Spartanburg Rescue Mission - Miracle Life Mission",
    "phone": "(864) 583-1628",
    "website": "https://miraclehill.org/",
    "description": "Spartanburg Rescue Mission is an emergency shelter that serves a multitude of people experiencing homelessness, including men, women and mothers with children.\n\nRecommended Arrival Time\n7:00am\n\nIntake Begins\n10:00am\n\nCapacity\n96 beds in dormitory-style rooms\n\nServices Provided\n- Shelter Beds\n- Meals\n- Clinic Services\n- Access to Healthcare\n- Chapel Services\n- Counseling\n- Guest Laundry\n- Guest Gym\n- Case Management\n- Transitional Housing for Men\n- Personal Development Program\n- Cold Weather Shelter\n\nHoused in separate wings, individuals receive the basic needs of shelter, food and clothing along with counseling, educational opportunities and discipleship. In partnership with local volunteers from the medical and dental fields, a free on-site medical clinic provides services once a month for our guests and individuals from the community."
  },
  {
    "addressLine1": "236 Union St",
    "city": "Spartanburg",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29306",
    "name": "SAFE - Home Rape Crisis Coalition",
    "organization": "SAFE - Home Rape Crisis Coalition",
    "phone": "(864) 583-9803",
    "website": "http://shrcc.org/",
    "description": "Non-Profit Domestic & Sexual Violence Organization.  If you are in need of services, call our 24-hour hotline at 800.273.5066.\nOffice Hours 8:30am-5pm M-F\nEmergency Shelter.Transitional Housing - Family"
  },
  {
    "addressLine1": "282 South Church Street",
    "city": "Spartanburg",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29306",
    "name": "The Haven Community Solutions",
    "organization": "The Haven Community Solutions",
    "phone": "(864) 582-6737",
    "website": "https://www.havenupstate.org/",
    "description": "Emergency Shelter Program\n\nOne component of The Haven is the Emergency Shelter Program. This program is designed for families who are homeless. The goal of the program is to provide homeless families shelter & supportive services in order to transition them to a stable, permanent living situation.\nEmergency Shelter Services\n\nThe Haven Emergency Shelter Program provides:\n    A private room for each family\n    Household items\n    Food\n    Clothing\n    Personal Hygiene Items\n    Intensive Case Management\n\nEmergency Shelter Intensive Case Management\n\nIn the Emergency Shelter Program, each family receives intensive case management which includes:\n    Crisis intervention\n    Assessment\n    Resource coordination\n    Information & referral\n    Plan of action development &  monitoring\n    Advocacy\n\nHomelessness Prevention Program\n\nOne component of The Haven is the Homelessness Prevention Program. This program is designed to assist individuals & families who are at risk of becoming homeless. The goal of the program is to prevent individuals & families from becoming homeless through case management & financial assistance to sustain a stable, permanent home.\nHomelessness Prevention Case Management Services\n\n    Crisis intervention\n    Homelessness Risk Assessment\n    Resource coordination\n    Information & referral\n    Personalized individual assistance\n    Assist family to maintain permanent housing\n\nHomelessness Prevention Financial Assistance\n    Rental assistance to prevent eviction\n    Utility assistance to prevent utility cut off\n    Financial assistance to secure permanent, stable housing\n    Financial assistance to prevent homelessness"
  },
  {
    "addressLine1": "821 Central Ave",
    "city": "Summerville",
    "state": "South Carolina",
    "stateAbbreviation": "SC",
    "postal": "29483",
    "name": "Home of Hope",
    "organization": "Home of Hope",
    "phone": "(843) 469-8858",
    "website": "http://www.dcco4homeless.org/",
    "description": "We are a men's homeless shelter in Summerville SC.\n\nAll guests at the Home of Hope must not have any outstanding warrants, no drug or alcohol use is permitted and all guests must be able to and willing to seek full time employment.\n\nOur facility is a homeless shelter that houses 16 men. We are a 501(C)3 non profit organization that is in much need of financial support. Donations can be mailed to our mailing address PO Box 2994 Summerville SC 29484"
  }
]