[
  {
    "addressLine1": "230 W. Market Street",
    "city": "Akron",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44303",
    "name": "ACCESS, Inc.",
    "organization": "ACCESS, Inc.",
    "phone": "330-376-0997",
    "website": "https://www.access-shelter.org/",
    "description": "Business Hours\nM-F 9:00am - 5:00pm\n\nShelter Hours\n24 hours a day\nEmergency Shelter Women and their Children Only\nEmergency Shelter\nWhat is the Purpose of ACCESS?\n    To provide emergency shelter services for women and children.\n    To link women and existing resources in the community.\n    To aid in the attainment of an independent future.\n    To assist in alleviating the situation that caused them to seek emergency shelter.\n    Women may be in need of emergency shelter for many reasons including eviction, unemployment,\n\n    transiency, utility disconnections and all types of crisis circumstances.\n\nWho is Eligible for Shelter at ACESS?\nACCESS opens its doors to any woman who finds herself homeless, not physically battered, alcohol and drug free, reality oriented and 18 years of age or older. Children accompanied by their female guardian meeting this criteria are also welcome.\n\nHow Can Someone enter ACCESS?\nWomen may enter the shelter through referrals from other sources such as welfare or human service agencies, hospitals, law enforcement agencies, churches, or individuals--they may also enter the shelter directly through a phone intake.\n\nWhat is the Cost for Residents?\nThere is no fee.\n\nWhere is ACCESS Emergency Shelter Located?\nThe emergency shelter is located at 230 W. Market St. Click here for directions to the ACCESS Emergency Shelter.\n\n\nStep II Transitional Housing\n\nWhat is the Purpose of Access Step II?\nThe Step II program provides transitional housing for single homeless women with the purpose of meeting the following goals:\n    Establishing residential housing stability.\n    Increasing income and work skill levels.\n    Creating greater self-determination.\n\nWho is Eligible for Transitional Housing at Step II\n\nWomen who:\n    Are homeless.\n    Are 18 years of age or older.\n    Have no children or do not have custody of their children.\n    want to make improvements in their lives through educational, job, or other programs to prevent further homelessness.\n\nWhat Service Does Step II Provide?\n    Transitional housing for homeless single women for up to 24 months.\n    On-site and community-based supportive services, including case management individual, vocational, group and substance abuse counseling, job placement, permanent housing placement and life training.\n\n    Continued supportive services following completion of the program for an additional six months.\n\nHow Does a Women Enter Step II?\nThe ACCESS Emergency Shelter serves as the referral source for Step II. Homeless women who are interested in Step II must first enter the Emergency Shelter. The program also occasionally accepts participants from other programs.\n\nWhere is Step II Located?\nThe Step II facility is located across from the Polsky Building and next to St. Bernard's Church at 245 S. High Street in downtown Akron, Ohio. Refer to the link below for a map to the facility."
  },
  {
    "addressLine1": "175 East Market Street",
    "city": "Akron",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44309",
    "name": "Haven of Rest Ministries",
    "organization": "Haven of Rest Ministries",
    "phone": "(330) 535-1563",
    "website": "https://havenofrest.org/",
    "description": "Haven of Rest's doors are open 24 hours a day, 365 days a year.\n\nEmergency Shelter for Men\nHaven of Rest Ministries\nClient Services Center\n207 E. Market St. Door #3,\nAkron, OH 44308\n(330)535-1563\n\nEmergency Shelter for Women and Women with Children\nHaven of Rest Ministries\nClient Services Center (7:00 a.m. - 6:00 p.m.)\n207 E. Market St. Door #2,\nAkron, OH 44308\n\nHarvest Home Women and Children's Shelter (7:30 p.m.- 7:00 a.m.)\n24 N. Prospect St., Akron, OH 44304\n(330)434-1149\n- Three meals daily\n- Clothing, toiletries\n- Shower and laundry services\n- Physical and spiritual counseling\n- Job and life skills counseling\n\nCase Management: Assess need, develop goals, assist with ID's, birth certificates, housing and job referrals, connect to community resources.\n\nMen and Women's Day Rooms, Meals, shower and laundry facilities, case management consultation.\n\n\nMen's Shelter and Meal Check-in Times Single men 18+\n(330) 535-1563\n- Lunch check-in: Mon - Sat 10:30 - 11:00 a.m., Sun 1:15 p.m. ' 1:45 p.m.\n- Dinner and Shelter check-in: 6:00 - 6:45 p.m.\n\nHaven of Rest Ministries\nMain Mission Building\n175 E. Market St.,\nAkron, OH 44308\n\nAllowances made for those with verifiable employment or special extenuating circumstances.\n- Chapel services required.\n\nWomen's Shelter and Meal Check-in Times' Single women 18+ and women with children\n(330) 434-1149\n- Lunch check-in: 10:30 - 11:00 a.m., Sun 1:15 p.m.- 1:45 p.m.\n- Dinner and Shelter check-in: 6:00 - 6:45 p.m.\n\nHaven of Rest Ministries\nMain Mission Building\n175 E. Market St.,\nAkron, OH 44308\nAllowances made for those with verifiable employment or special extenuating circumstances.\n- Chapel services required."
  },
  {
    "addressLine1": "24 North Prospect Street",
    "city": "Akron",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44304",
    "name": "Harvest Home Shelter For Women and Children",
    "organization": "Harvest Home Shelter For Women and Children",
    "phone": "(330) 434-1149",
    "website": "https://www.havenofrest.org/",
    "description": "Client Services Center (7:00 a.m. 6:00 p.m.)\n207 E. Market St. Door #2\n\nHarvest Home Women and Childrens Shelter (7:30 p.m. 7:00 a.m.)\n\nThree meals daily\nClothing, toiletries\nShower and laundry services\nPhysical and spiritual counseling\nJob and life skills counseling\nCase Management Assess need, develop goals, assist with IDs, birth certificates, housing and job referrals, connect to community resources.\n\nWomens Shelter and Meal Check-in Times Single women 18+ and women with children\n(330) 434-1149\nLunch check-in: 10:30 11:00 a.m., Sun 1:15 p.m. 1:45 p.m.\nDinner and Shelter check-in: 6:00 6:45 p.m.\nHaven of Rest Ministries\nMain Mission Building\n175 E. Market St.,\nAkron, OH 44308\nAllowances made for those with verifiable employment or special extenuating circumstances.\nChapel services required.\n\n\nHarvest Home is a homeless shelter for women and children. It offers shelter, crisis intervention, and supportive services. They can house up to 52 women and children at one time.\n\nHomeless women and children. No males over 12 allowed due to close quarters.\n\n\nServices: Homeless Shelter for Families and Single Parent Families\n\nThe purpose of Haven of Rest Ministries is to serve and glorify God through a Christ-centered outreach of love and compassion the responds to the physical, emotional, and spiritual needs of disadvantaged men, women, and children without regard to their race, color, creed or social standing."
  },
  {
    "addressLine1": "P.O Box 10076",
    "city": "Akron",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44310",
    "name": "Family Promise of Summit County",
    "organization": "Family Promise of Summit County",
    "phone": "(330) 253-8081",
    "website": "https://www.familypromisesc.org/",
    "description": "Emergency shelter for homeless families.\n\nProvides basic living for free as long as they are with us.\n\n\nProvides a pet friendly shelter for the families in the shelter. The facility offers all the comforts of home: a kitchen, place to do laundry and computers to search for jobs and permanent housing. Four families can stay at the shelter at a time during the day. At night, they are transported to various churches while their pets stay in the kennels. Last year, the organization served 26 families; so far this year they have already helped 24 families.\n\n\n\nThe kennel area can house four dogs and four cats and was added as part of the renovation, said Wilhite."
  },
  {
    "addressLine1": "190 South Maple Street",
    "city": "Akron",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44302",
    "name": "Booth Manor Homeless Shelter",
    "organization": "Booth Manor Homeless Shelter",
    "phone": "(330) 762-8481",
    "website": "https://oh.salvationarmy.org/Akron-Summit/homeless_shelter",
    "description": "Currently four individual units can be provided to single or married parents with minor children in need of housing assistance.  Families are homeless due to many unforeseen circumstances including loss of job, loss of subsidized housing, and court eviction.  The families are provided housing, supplies and intensive case management during their four to six week stay.\n\nWhile staying in Booth Manor, each family is required to meet with their caseworker daily to ensure their case plan is actively progressing.  The family is responsible for attending Life Skill classes twice a month at The Salvation Army to encourage good decisions with nutrition, budgeting and other needed skills.  Booth Manor residents are encouraged to utilize the Learning Zone preschool program to enable employment flexibility.  If necessary, the children may also attend tutoring provided by Project RISE through the Akron Public Schools.  Project RISE is responsible for transportation to allow the children to stay in their home school whenever possible.\n\n\nThe Booth Manor Homeless Shelter participates in the Continuum of Care (CoC) within Summit County a benefit of receiving funding through the Ohio Development Services Area (ODSA) for the shelter. "
  },
  {
    "addressLine1": "175 East Market St",
    "city": "Akron",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44308",
    "name": "Haven of Rest Ministries Emergency Shelter For Men",
    "organization": "Haven of Rest Ministries Emergency Shelter For Men",
    "phone": "(330) 535-1563",
    "website": "https://havenofrest.org/",
    "description": "Haven of Rests doors are open 24 hours a day, 365 days a year.\nHaven of Rest Ministries\n175 East Market Street\nAkron, OH 44308\n(330) 535-1563\n\nHarvest Home\n24 N. Prospect Street\nAkron, OH 44304\n(330) 434-1149\n\nClient Services Center\n207 East Market Street\nAkron, OH 44308\n\n\nMens Shelter and Meal Check-in Times Single men 18+\n(330) 535-1563\n\nLunch check-in: Mon Sat 10:30 11:00 a.m., Sun 1:15 p.m. 1:45 p.m.\nDinner and Shelter check-in: 6:00 6:45 p.m.\n\nAllowances made for those with verifiable employment or special extenuating circumstances.\nChapel services required.\n\n Three meals daily\n Clothing, toiletries\n Shower and laundry services\n Physical and spiritual counseling\n Job and life skills counseling"
  },
  {
    "addressLine1": "47 N Arlington Street",
    "city": "Akron",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44305",
    "name": "The Homeless Charity & Village Food Pantry",
    "organization": "The Homeless Charity & Village Food Pantry",
    "phone": "(234) 417-0711",
    "website": "http://thehomelesscharity.org/",
    "description": ""
  },
  {
    "addressLine1": "1211 Anita Dr",
    "city": "Kent",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44240",
    "name": "Miller Community House",
    "organization": "Miller Community House",
    "phone": "(330) 673-0034",
    "website": "https://fcsserves.org/program/miller-community-house/",
    "description": "Miller Community House exists to provide emergency shelter to those adults and children in a housing crisis, while also providing support, advocacy, and referrals to encourage self-sufficiency and movement to permanent housing.\n\n\n\n\nEligibility\nHomeless or at risk of becoming homeless! Last permanent address in Portage County, currently Sober and is not actively psychotic, Suicidal or Homicidal. Does not have any active warrant out for arrest! Does not have any active warrants out for arrest. Does not have a violent criminal History!\n\n\nMiller Community House provides emergency shelter and supportive services to men, women, and children experiencing a housing crisis. Essential to our mission is improving the quality of life for our residents by providing a 30-day shelter that includes case management and advocacy, information and referrals to area resources and collaborative agencies.\n\nMiller Community House has been opened since 1985 and recently expanded though the building of a new facility that provides 20 beds.\n\nMiller Community House is currently staffed by three full-time positions, which includes the Resident Advocate, Child and Youth Advocate, and Program Manager. The staff also includes 9 part-time Housing Specialists. The Resident Advocate meets regularly with the shelter residents to establish and implement a plan that includes housing, income, education, or job training, counseling, financial planning, and other goals. Housing is the primary goal for all residents due to limitations on the length of stay. The Child and Youth Advocate will coordinate services with parents and children to assist with school enrollment, medical insurance and immunizations, counseling, and housing.\n\n\n\n\nThe Program Manager oversees the shelter operation and staff and the Housing Specialists are available around the clock to answer the support line, admit new residents, and provide a supportive environment to the homeless families staying at the shelter.\n\nThe services are available 24 hours a day, 7 days a week.\n\nEligibility\n\n- Homeless or at risk of becoming homeless\n- Lives or plans to relocate in Portage County\n- Is sober\n- Is not actively psychotic, suicidal, or homicidal\n- Does not have any active warrants out for an arrest\n- Does not have a violent criminal history\n\n\nLocation\nThe location is disclosed to Residents upon admittance.\n\nPhone: (330) 673-0034 Fax: (330) 673-7670\n\n\nHours\n24 hours a day, 7 days a week, and every day of the year\n"
  },
  {
    "addressLine1": "4125 Station Ave.",
    "city": "Ashtabula",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44004",
    "name": "Samaritan House Homeless Shelter",
    "organization": "Samaritan House Homeless Shelter",
    "phone": "(440) 992-3178",
    "website": "http://ashtabulasamaritanhouse.weebly.com/",
    "description": "Provides overnight shelter and supportive services such as meals and social service referrals.\n\nThe Samaritan House is the only homeless shelter in Ashtabula County.  Our county residents can stay with us up to 30 days. During that time, the staff connects residents to area agencies that can help them with employment, housing, food, medicine or whatever they need to get back on their feet again.  Transients or non-county residents are limited to a two day stay.\n\n\nOur shelter serves clients daily with intakes beginning at 4:00 p.m. on a first come, first served basis.  Residents leave during the day to work on goals, obtain services and seek housing. We recently opened the shelter 24/7 with help from grants. Residents can come back through out the day to get ready for interviews, have appointments, and on most days can come back for lunch.  As part of their stay, we provide food, laundry facilities, sleeping areas, bathrooms and television rooms for our residents.\n\nCurrently, the shelter has a dedicated staff.  The full-time Director and House Manager work together with the part-time Bookkeeper, 5 Intake Specialists, and a custodian.\n\n\nOur hours are all day long with intakes starting at 4:00 p.m.\nYou must have a valid photo ID.\nAfter completing an intake interview and assessment, eligibility is determined for services.\nCurrent Ashtabula County residents are eligible to stay at the shelter for up to 30 nights based upon need and maintaining good status.\n\nOut of county residents, including out of state and transient residents, are eligible to stay at the shelter for a maximum of 2 nights."
  },
  {
    "addressLine1": "25 Freedom Rd.",
    "city": "Painesville Township",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44077",
    "name": "Project Hope for the Homeless Ecumenical Shelter Network of Lake County Inc.",
    "organization": "Project Hope for the Homeless Ecumenical Shelter Network of Lake County Inc.",
    "phone": "(440) 354-6417",
    "website": "https://projecthopeforthehomeless.org/",
    "description": "Our program has three phases and a maximum stay of 45 days. Guests are able to arrive at 7 p.m. each evening with a reservation. Reservations can be secured by calling 211 from any land line in Lake County or 800-654-5465 from a cell phone. Guests depart at 6:30 a.m. and are transported to the Salvation Army at 69 Pearl St., Painesville.\n\nShelter Routine\n    6 to 6:30 p.m.\n    Catch the LakeTran bus at the Lake County Sheriff's Office\n    7 to 8 p.m.\n    Project Hope staff greets guests at the security check-in. Guests sign in, sign up for showers and chores at this time.\n    7:45 to 8:15 p.m.\n    Dinner is served by volunteers\n    8 to 10:15 p.m.\n    Showers are taken in 15-minute intervals\n    8:20 -  8:30 p.m.\n    Smoke break\n    8:30 -9:30 p.m.\n    Complete chores and spend time with volunteers for bible study, music and other scheduled activities. These activities may include:\n    - Visits from Extended Housing, Lake-Geauga Center, nursing students from Lakeland Community College and other community agencies\n    - Bible study, praise and worship music, prayer\n    - Testimonies from former shelter guests or other interested individuals. To learn more about sharing your story, contact us.\n    - Free haircuts once a month from local businesses\n    9:30-10 p.m.\n    Evening chores\n    10:20-10:30 p.m.\n    Smoke break\n    10:30 p.m. -  Lights out\n    5:45 a.m. -  Wake up, make beds\n    6-6:30 a.m.\n    Breakfast when available, chores\n    6:30-6:45 a.m.\n    Leave for the day"
  },
  {
    "addressLine1": "91 Central Ave",
    "city": "Athens",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45701",
    "name": "Good Works Timothy House",
    "organization": "Good Works Timothy House",
    "phone": "(740) 594-3333",
    "website": "https://good-works.net/the-timothy-house/",
    "description": "Provides the only shelter for people without homes in nine southeast Ohio counties.\n\nTimothy House operates 24 hours daily. The Timothy House has provided around 100-200 men, women and children with about 3500 to 4500 nights of shelter. Anyone seeking shelter at The Timothy House must contact us first by telephone at 740.594.3333. We do not accept people into the house until they complete a telephone interview. After the telephone interview, a time for a face-to-face interview will be set. In most cases, this can occur within 24 hours."
  },
  {
    "addressLine1": "841 Old Mcarthur Rd",
    "city": "Logan",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43138",
    "name": "Hocking Hills Inspire Shelter",
    "organization": "Hocking Hills Inspire Shelter",
    "phone": "(740) 385-5116",
    "website": "https://hockinghillsinspireshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "2403 Old St. Rt. 32",
    "city": "Batavia",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45103",
    "name": "James Sauls Homeless Shelter",
    "organization": "James Sauls Homeless Shelter",
    "phone": "(513) 732-6464",
    "website": "http://www.cccsi.org/shelter.html",
    "description": "Clermont County Community Services operates the only homeless shelter in Clermont County besides the YWCA Battered Women's Shelter. The shelter is available to any homeless persons with priority given to Clermont County citizens and is open 365 days a year 24 hours a day. Three meals are provided daily along with laundry services free of charge. Once a person enters the shelter they must adhere to standards including a curfew, no drugs or alcohol, and shelter guidelines. Case Management services are provided to assist clients with goals and obtaining housing. Financial Assistance is available for rent and security deposits for persons exiting the shelter.\n\nThe shelter is located at 2403 Old St. Rt. 32 behind the Central Joint Fire Station. The number for the shelter is 513-732-6464. It is through the numerous donors that give every year that helps make the program a success."
  },
  {
    "addressLine1": "55 S. Fourth St",
    "city": "Batavia",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45103",
    "name": "YWCA House of Peace Shelter",
    "organization": "YWCA House of Peace Shelter",
    "phone": "(800) 540-4764",
    "website": "http://www.ywcacincinnati.org/",
    "description": "House of Peace Hotline\n\nProvides crisis counseling, risk assessment, information and referrals, safety planning, and support for survivors in Clermont,  Brown and Adams counties 24 hours a day.\n\nLOCAL: 513-753-7281\n"
  },
  {
    "addressLine1": "1836 Brewster Avenue",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45207",
    "name": "The Swan House",
    "organization": "The Swan House",
    "phone": "(513) 531-9111",
    "website": "http://www.iamsomebodyministries.org/",
    "description": "This home houses women who have been battered and abused, homeless women, and women that need a new start in life.\n\n\nThe women that come through these doors have an opportunity for resurrection wholeness in Christ with the leading of the Holy Spirit, and the assistance of the Swan House personnel and the I Am Somebody Ministries.\n\nThe Swan House along with a network of faith-based and other support organizations provides the residents with a home, where they receive everything from the emotional, physical and spiritual needs, food, clothing and shelter, job training, employment/vocational opportunities, and one on one mentoring/coaching to assistance with court proceedings, when necessary. The women are allowed to stay in the Swan House for up to 2 years and upon successful completion of the program, after care services will be provided."
  },
  {
    "addressLine1": "55 Whittlesey Ave.",
    "city": "Norwalk",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44857",
    "name": "The Salvation Army",
    "organization": "The Salvation Army",
    "phone": "(419) 668-4090",
    "website": "",
    "description": "The Salvation Army is a food pantry. .\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "3333 Eoff St.",
    "city": "Wheeling",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "26003",
    "name": "The Salvation Army",
    "organization": "The Salvation Army",
    "phone": "(304) 233-4413",
    "website": "http://www.salvationarmyusa.org/",
    "description": "Emergency Shelter Provided at this location."
  },
  {
    "addressLine1": "P.O. Box 1165",
    "city": "Bowling Green",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43402",
    "name": "Cocoon Shelter - Domestic Violence Shelter",
    "organization": "Cocoon Shelter - Domestic Violence Shelter",
    "phone": "(419) 352-1545",
    "website": "https://thecocoon.org/",
    "description": "Services Include: 24-hour Access to Advocacy and Support; Crisis Intervention; Emergency Safe Housing; Safety Planning; Information and Referrals; Provision of emergency clothing, food, and basic needs; Transportation; Support Groups, Assistance with Civil Protection Orders; Court Advocacy, Medical Advocacy, Rape Kits (performed within 96 hours of a sexual assault- provided to all survivors at no cost), Economic Empowerment and Financial Literacy assistance; Computer Use/Internet Access; Follow-Up and Outreach"
  },
  {
    "addressLine1": "435 Eastern Ave",
    "city": "Toledo",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43609",
    "name": "La Posada Family Emergency Shelter",
    "organization": "La Posada Family Emergency Shelter",
    "phone": "(419) 244-5931",
    "website": "https://catholiccharitiesnwo.org/la-posada/",
    "description": ""
  },
  {
    "addressLine1": "669 Indiana Ave.",
    "city": "Toledo",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43604",
    "name": "Family House Toledo",
    "organization": "Family House Toledo",
    "phone": "(419) 242-5505",
    "website": "https://familyhousetoledo.org/",
    "description": "Largest shelter for families who are homeless in northwest Ohio. Shelter and food provided, as well as intensive, individualized case management and supportive services.\n\nThe goal at Family House is to help families in crisis to find permanent housing, to regain control over their lives, and reclaim their independence. Help from Family House is a hand up not a hand out.\n\n\nFamily House admits residents 24 hours a day, whether in an emergency situation women experiencing domestic abuse; flood, fire or tornado victims, or victims of unemployment or financial burden. We take in families appearing at our door and those from other relief organizations, including Job & Family Services, Lucas County Children Services, Toledo Police or the American Red Cross.\n\nFamily House exists to provide shelter, food and basic needs to homeless families, and to lead residents to the appropriate resources for their situation. We pride ourselves on teaching residents and those in need how to get their own needs met.\nAre you or do you know a family in crisis? If you are a married couple with or without children; an unmarried couple with children; a same-sex, cohabiting couple with or without children; a single parent; or a single pregnant woman, please call 419-242-5505 to find out more about our programs or to schedule an intake appointment.\n\nWe offer a structured program with restrictions for the safety of all our residents in a secured, drug/alcohol/weapon-free facility.\nTo enroll in our program, you need a state-issued photographic ID and a birth certificate for each child, and you must not be a registered sex offender, have an open felony warrant or have been convicted of any crime against children."
  },
  {
    "addressLine1": "1501 Monroe St",
    "city": "Toledo",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43614",
    "name": "Cherry Street Mission Toledo",
    "organization": "Cherry Street Mission Toledo",
    "phone": "(419) 214-3007",
    "website": "https://cherrystreetmission.org/",
    "description": "Mission: Cherry Street Mission Ministries (Cherry Street) mission serves all who come to us in need, and provides purposeful discipleship by rescuing the downtrodden, restoring hope to the hopeless, and releasing God's greatness to our communities. Cherry Street has been a guiding light for thousands upon thousands of the most vulnerable in our community since 1947, rescuing them from dire circumstances, restoring their self-respect and self-sufficiency, and releasing them back to the community as active, contributing members of society.\n\n \nServices: Since 1947 Cherry Street Mission Ministries (Cherry Street), located in Toledo, Ohio, has provided to our homeless and poor community members free shelter, food, clothing, biblical support, recovery services, educational and vocational programs and services. Anyone can take part in most of Cherry Street's services.\n\n\nEach night, Cherry Street provides safe, free shelter for nearly 230 men and women who would otherwise sleep on the street or remain in an abusive situation. For some, it's the first night they've slept safely in a very long time.\n\nWe provide in-take at any time of day or night. We serve all who come to us so we do not have a waiting list.\n\nMen's Housing\n105 17th Street\nToledo, OH 43604\nPhone: 419.242.0068\nFax: 419.321.1831\n\nWomen's Housing\nSparrow's Nest\n436 W. Delaware Street\nToledo, OH 43610\nPhone: 419.321.1835\nFax: 419.321.1837\nMAC STREET CAFE\n\n1501 Monroe Street (Inside the Life Revitalization Center)\nToledo, OH 43604\n\nMeals served daily\nBreakfast 7 8:30 a.m.\nLunch 12 1:30 p.m.\nDinner 5:00 6:30 p.m.\nPhone: 419.214.3007\n\n"
  },
  {
    "addressLine1": "703 Phillips Ave",
    "city": "Toledo",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43612",
    "name": "Rebekah's Haven Women's and Children's Shelter",
    "organization": "Rebekah's Haven Women's and Children's Shelter",
    "phone": "(419) 243-0403",
    "website": "https://tgrm.org/rebekahs-haven-1",
    "description": ""
  },
  {
    "addressLine1": "230 13th street",
    "city": "Toledo",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43604",
    "name": "St. Paul's Community Center",
    "organization": "St. Paul's Community Center",
    "phone": "(419) 255-5520",
    "website": "https://spccdev.stpaulscommunitycenter.org/",
    "description": "St. Paul's offers a variety of programs targeted to helping individuals in need. For the Shelter, call 211 and follow the prompts, for the Lunch Program and Supportive Services, just walk-in during designated hours, for the Payee Program, call 419 255 5520 ext. 215\n\nSt. Paul's specializes in servicing adults and/or individuals with severe mental illness\n\n\nSt. Paul's aims at shortening the length of stay at St. Paul's as we believe that every individual is entitled to housing. The maximum length of stay is 90 days\n\n\nShelter\nOur Shelter program provides more than 12,000 nights of shelter to the homeless each year. 90% of shelter residents are severely and persistently mentally ill.\nBeyond food, shelter and basic needs, we also provide case management focused on permanent housing solutions and guidance on how to navigate community resources.\nOur 35 Bed Facility provides:\nSafe temporary/emergency shelter for men and women.\nAssistance in resolving issues related to homelessness\nStaff with links to treatment, support services and permanent housing\nPriority is given to homeless individuals with severe and persistent mental illness\n\n\nTransitional Housing\nThe Dwelling Place is a 12-one bedroom apartment complex that provides transitional housing for up to 24 months. With the assistance of staff, residents learn the necessary skills to live in-dependently and become self-sufficient\n\nSupportive housing program\nHome Base:\n16-apartment facility accommodating single men and women.\nMedication monitoring assisting clients with treatment compliance.\n\nSupport services helping residents acquire necessary life skills and resources to maintain independent living."
  },
  {
    "addressLine1": "1917 Jefferson Ave",
    "city": "Toledo",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43604",
    "name": "Toledo Gospel Rescue Mission",
    "organization": "Toledo Gospel Rescue Mission",
    "phone": "(419) 242-6642",
    "website": "https://tgrm.org/",
    "description": "Men's Shelter: 419-242-6642\n\nRebekah's Haven: 419-243-0403\n\nOutreach Center: 419-478-1005\nMen's Shelter. At the men's shelter we provide night-to-night shelter for homeless men who are over eighteen years of age.\nMen desiring to stay in the shelter must be sober & cooperative and in by 6:00PM.\n\nEach night they receive a message of hope in a chapel service, eat a nutritious balanced meal, shower, and sleep in a clean, warm bed. In the morning, they eat a solid breakfast before they leave.\nAlso offered is the Work Skills Program under which selected men receive life skills training, work ethics training, and work therapy. Men involved in this program also have midday devotions offered to them throughout the week in conjunction with their lunch.\n"
  },
  {
    "addressLine1": "915 North Erie St",
    "city": "Toledo",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43604",
    "name": "Beach House Family Shelter",
    "organization": "Beach House Family Shelter",
    "phone": "(419) 241-9277",
    "website": "http://www.lfhtoledo.org/",
    "description": ""
  },
  {
    "addressLine1": "436 West Delaware Avenue",
    "city": "Toledo",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43607",
    "name": "The Sparrow's Nest",
    "organization": "The Sparrow's Nest",
    "phone": "(419) 321-1835",
    "website": "",
    "description": "24/7 facilities where we serve women who come to us at all hours of the day for help.\n\nThe Sparrow's Nest is a 54 bed facility. The first floor is primarily used in service to those who are in emergency need or are candidates for our Ready For Life (RFL) Program. The second floor is used for the women in our RFL."
  },
  {
    "addressLine1": "203 E Main St",
    "city": "Bradford",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45308",
    "name": "Manna Meals Ministry",
    "organization": "Manna Meals Ministry",
    "phone": "(937) 621-4995",
    "website": "",
    "description": "Hours: Fridays 8:30am to 11am."
  },
  {
    "addressLine1": "339 South St",
    "city": "Piqua",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45356",
    "name": "Bethany Center Food Pantry and Meals",
    "organization": "Bethany Center Food Pantry and Meals",
    "phone": "(937) 615-9762",
    "website": "http://miamicac.org/new/bethany-center/",
    "description": "OFFICE HOURS:    10:00 a.m. to 3:00 p.m.\n\nOFFICE DAYS:       Tuesday through Thursday\n\nSERVICES:\nServing lunch to those in need\nTuesday through Thursday from 12:00 noon to 1:00 p.m.\nFriday Evening Meal from 5:00 p.m. to 6:00 p.m.\nClothing Bank                   (ALL ITEMS FREE)\n              Tuesday, Wednesday & Thursday from 10:00 a.m.-12:00 noon.\nFriday from 4:00 p.m. to 7:00 p.m.\nFood Bank\n              Wednesday from 1:00 p.m. to 3:00 p.m.\nThursday from 1:00 p.m. to 3:00 p.m.\nReading Room  Wednesday from 10:00 a.m. to 12:00 Noon\n\nELIGIBILITY:          Anyone who comes to the kitchen.\n\nDOCUMENTS NEEDED:\n              None for Kitchen and Clothing Bank.\nFood Bank requires 2 I.D.s and a form to complete\n\nRESTRICTIONS:\n              None for Kitchen and Clothing Bank\n             Food Bank eligibility, once a month\n\nHOW TO USE:                 Just walk-in."
  },
  {
    "addressLine1": "433 E Water St",
    "city": "Greenville",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45331",
    "name": "GRCC - Grace Resurrection Community Center",
    "organization": "GRCC - Grace Resurrection Community Center",
    "phone": "(937) 548-2595",
    "website": "http://www.grccenter.org/",
    "description": ""
  },
  {
    "addressLine1": "10000 Brecksville Rd",
    "city": "Brecksville",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44141",
    "name": "Veterans Administration Vets Domiciliary",
    "organization": "Veterans Administration Vets Domiciliary",
    "phone": "(440) 526-3030",
    "website": "http://www.voago.org/",
    "description": "Emergency Shelter for Men and Women\n    Serves 109 men & women\n    Length of stay in emergency shelter program: Up to 2 months\n    Services:\n        Provides for basic needs: meals, bed, shower, laundry\n        Provides for drug/alcohol assessment and referral to detox unit or treatment\n\n        Provides & facilitates referrals to transitional housing, treatment, or own residence"
  },
  {
    "addressLine1": "2592 W 14th St.",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44120",
    "name": "Family Promise of Greater Cleveland",
    "organization": "Family Promise of Greater Cleveland",
    "phone": "(216) 767-4060",
    "website": "https://familypromisecle.org/",
    "description": "Main office hours:Mondays through Fridays 9am to 5pm.\n\nTo Get HelpFamilies needing shelter or housing assistance access services through our community's Coordinated Intake. This is the FRONT DOOR to Emergency Shelter for individuals and families with no safe place to sleep. Coordinated Intake is open 7 days a week, 8am-8pm, (216) 674-6700 (phone). Coordinated Intake is located at: 2nd Floor of Cosgrove Building - 1736 Superior Avenue, downtown Cleveland.\n\n    You are encouraged to arrive as early in the day as possible.\n    Upon arrival, a brief interview will be conducted to assess your need, develop an action plan, and determine the best way to offer assistance.\n    In order to serve all families equally through Coordinated Intake, placement into a particular shelter is not possible.\n    If it is recommended that Family Promise of Greater Cleveland is the best placement for your family, a short phone interview with a Family Promise case manager will be conducted to learn more about your family's situation and your needs.\n    If you don't need shelter right away, Coordinated Intake will connect you with other community resources to help you avoid having to enter shelter.\n\n\nProvides emergency shelter for 8-10 families each night. Families are transported from the Family Center to one of the network's host congregations in the evening and are transported back to the Family Center each morning. Host congregations provide an evening meal, light breakfast and bag lunch for families. The Family Center offers many amenities including a washer, dryer, shower, crafts room, recreational items, computers and other supplies for job seekers. Support services such as intensive case management, moving assistance, furniture, mentoring, educational/cultural field trips, and follow-up case management for up to one year are available. Guest families create and carry out a plan to regain stable housing. Agency provides a shelter letter after a stay of seven days.\n\n\nServes Cuyahoga County. Accepts people in the following situations: homeless couples with at least one minor child or homeless couples where the woman is pregnant, homeless single parents or legal guardians with at least one minor child (parents/guardians must have custody of child/ren.), pregnant women. Will not accept people in the following situations: women experiencing domestic violence, couples without children (unless the woman is pregnant), those who use a wheelchair, anyone using alcohol or illegal drugs or anyone with an untreated communicable illness. Additional requirements include: parents must be at least 18 years old. If mentally ill, applicants must be stable on medications and able to administer own medication. Family may receive assistance again if the family left because they found housing.\n\nServices:Homeless Shelter for Families and Single Parent Families, Homeless Shelter for Families and Two Parent Families\n\nOperates as a network of diverse faith congregations and community organizations that seek to respond to the needs of homeless neighbors. Provides 24-hour shelter, meals, social services, and compassionate assistance for homeless families in the Greater Cleveland area, as well as limited numbers of eligible other individuals. Local affiliate of Family Promise."
  },
  {
    "addressLine1": "3135 Lorain Avenue",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44113",
    "name": "West Side Catholic Shelter For Women",
    "organization": "West Side Catholic Shelter For Women",
    "phone": "(216) 631-4141",
    "website": "https://www.wsccenter.org/",
    "description": "The West Side Catholic Center offers hot meals, hospitality, clothing and household goods, emergency services, advocacy, a women and children's shelter, and a housing solutions program to those in need at no charge, regardless of religious affiliation.\n\n\nProvides a women's shelter for 7 women and children and 9 individuals. Provides shelter up to 90 days for emergencies.\n\nServices:\nProvides for basic needs: meals, bed, shower, laundry\n\nProvides for mental health & drug/alcohol assessment and referral\nProvides case management to assist clients in developing domestic and parenting skills, higher education, job readiness/training, D/A recovery, emotional stability\nProvides & facilitates referrals to transitional housing, treatment, mental health residential programs, return to family or to own residence"
  },
  {
    "addressLine1": "3020 W 104th",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44111",
    "name": "Next Step Shelter",
    "organization": "Next Step Shelter",
    "phone": "(216) 941-0063",
    "website": "https://www.lutheranmetro.org/",
    "description": "Provides an emergency shelter for youth. Accepts up to 10 children at the shelter for up to 15 days.\n\nNext Step provides shelter care for youth, ages 12-17, who are without a home or a stable living environment.\n\n\nResidents may be runaway youth or children placed by the Cuyahoga County Division of Children and Family Services (DCFS). DCFS placements may be youth who have been removed from their homes during investigations of abuse and/or neglect, or those who are awaiting a foster care placement. Next Step Youth Shelter residents attend their home schools whenever possible. They participate in meal preparation and household chores. Life skills education is offered based on an individual assessment of each resident. Individual and/or group counseling is provided as appropriate as well as opportunities for recreation. Next Step also offers semi-independent living in apartment and group living\nsettings. The program serves youth, ages 16-21, who will be exiting the foster care system. Its emphasis is preparation for living independently. Life skillsbudgeting, cleaning, cooking, relationship building, conflict managementare at the heart of the program. Completing high school and moving on to college is the path taken by some participants, while others seek employment education. Individual counseling as well as alcohol and drug treatment are available when needed. Case managers provide support and encouragement to youth as they seek to remove barriers and acquire the skills to live independently."
  },
  {
    "addressLine1": "4410 Franklin Blvd",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44113",
    "name": "St. Herman's House of Hospitality",
    "organization": "St. Herman's House of Hospitality",
    "phone": "(216) 961-3806",
    "website": "http://sainthermans.com/",
    "description": "Men's Emergency Shelter. We provide housing to 40 men and serve 3 hot meals a day to the community, every day of the year.\nCan stay up to 2 months. Provides beds, meals, shower and laundry. Contact for details and openings."
  },
  {
    "addressLine1": "7200 Franklin Blvd., Suite 100",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44102",
    "name": "Cogswell Hall",
    "organization": "Cogswell Hall",
    "phone": "(216) 961-1568",
    "website": "https://www.ywcaofcleveland.org/cogswell-hall/",
    "description": ""
  },
  {
    "addressLine1": "18120 Puritas Ave",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44135",
    "name": "City Mission Laura's Home Women's Crisis Center",
    "organization": "City Mission Laura's Home Women's Crisis Center",
    "phone": "(216) 472-5500",
    "website": "https://www.thecitymission.org/lauras-home/",
    "description": "Shelter and Crisis Recovery Program for Single Women & Mothers with Children\n168 beds and 55 rooms\n\nMothers with children and single women can call 216-472-5500 or email BeSocial@TheCityMission.org to learn about our Laura's Home Women's Crisis Center and check on room availability. Lauras Home has been full to capacity with a waiting list for several years, so please be sure to call and confirm room availability. We begin taking phone call inquiries at 6am. For more and the most up to date information, please visit www.TheCityMission.org/Lauras-Home.\n\nLength of stay: Lauras Home is primarily an extended stay crisis center. Women must decide within the first 30 days if they would like to sign on for the full program at Lauras Home. If one decides to stay on past 30 days, they must make a commitment to living and learning at Lauras Home for our program, which lasts 6 months or more. We also have emergency shelter space during extreme weather or on a case by case basis. Short term stays can last from 1 night up to 30 days. Please call before arriving for long term and emergency space availability.  \n\nServices\nHelp: To Be Safe and Secure. We provide the basics - meals, bed, shower, laundry, etc.\n\nHeart: To Heal and Renew Hope. Counselors and caseworkers assist with mental health, relationship management, planning for the future, drug/alcohol assessment and referral, and more.\n\n\nHome: To Move Toward Self-Sufficiency. The City Mission facilitates referrals to transitional and long-term housing, assists with job readiness training and applications, continued mental health treatment, encourages maintaining healthy family relationships, and other programs that allow clients to move forward in a self-sustaining way after they leave our campus.\n\nPathways Family Outreach Services: The Pathways program aims to positively impact the lives of the children and youth who come through the doors of Lauras Home by serving Kindergartners through 12th grade students. The program offers several services designed to encourage and support our young guests in a positive, Christ-centered manner. Because of the Pathways, moms at Lauras Home are able to focus on their own coursework and counseling, knowing that their kids are not just in safe hands, but growing alongside them."
  },
  {
    "addressLine1": "8315 Detroit",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44102",
    "name": "Bridgeway Inc. Stricklin Crisis Center",
    "organization": "Bridgeway Inc. Stricklin Crisis Center",
    "phone": "(216) 631-1740",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "5310 Carnegie Avenue",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44103",
    "name": "The City Mission Men's Crisis Center",
    "organization": "The City Mission Men's Crisis Center",
    "phone": "(216) 431-3515",
    "website": "https://www.thecitymission.org/",
    "description": "Crossroads Men's Crisis Center\nMen can call 216-431-3515 with questions about our Crossroads Men's Crisis Center and find out about available bed space.\n\nLaura's Home Women's Crisis Center\nMothers with children and single women can call 216-472-5500 to learn about our Laura's Home Women's Crisis Center and check on room availability. Laura's Home is currently full with a waiting list. Women must call in order to reserve their spot on the list - we are unable to add people to the waiting list through entries in the form below, but can provide you with more information.\n\n\n\nShelter and Crisis Recovery Program for Men126 Beds\n\n\nFor men in crisis and in need of assistance, we are a means to re-enter society as self-sufficient, productive citizens. At Crossroads program offers an array of services, geared at preparing men for positive, valuable futures. Men can call 216-431-3510 or email BeSocial@TheCityMission.org to learn about Crossroads Men's Crisis Center and check on room availability. Please be sure to call and confirm room availability.\n\nWe begin taking phone call inquiries at 6am. For more and the most up to date information, please visit our website.\n\nLength of stay: Crossroads is primarily an extended stay crisis center. Men must decide within the first 30 days if they would like to sign on for the full program at Crossroads. If one decides to stay on past 30 days, they must make a commitment to living and learning at Crossroads for our program, which lasts about 6 months or more. We also have emergency shelter space during extreme weather or on a case by case basis. Short term stays can last from 1 night up to 30 days. Please call before arriving for long term and emergency space availability.\n\nServices\nHelp: To Be Safe and Secure. We provide the basics - meals, bed, shower, laundry, etc.\n\nHeart: To Heal and Renew Hope. Counselors and caseworkers assist with mental health, relationship management, planning for the future, drug/alcohol assessment and referral, and more.\n\n\nHome: To Move Toward Self-Sufficiency. The City Mission facilitates referrals to transitional and long-term housing, assists with job readiness training and applications, continued mental health treatment, encourages maintaining healthy family relationships, and other programs that allow clients to move forward in a self-sustaining way after they leave our campus."
  },
  {
    "addressLine1": "22001 Fairmount Blvd.",
    "city": "Shaker Heights",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44118",
    "name": "Bellefaire JCB Homeless Youth & Street Outreach Programs",
    "organization": "Bellefaire JCB Homeless Youth & Street Outreach Programs",
    "phone": "(216) 570-8010",
    "website": "https://www.bellefairejcb.org/",
    "description": "Bellefaire JCB's Homeless Youth Program provides assessment, linkage and referral to a safe place for homeless youth, 24 hours a day. The Street Outreach Program provides a drop-in center for teens and young adults. Both programs meets children, teens and young adults wherever they are in the community."
  },
  {
    "addressLine1": "1710 Prospect Avenue E #755A",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44115",
    "name": "Harbor Light Complex Emergency Shelter",
    "organization": "Harbor Light Complex Emergency Shelter",
    "phone": "(216) 781-3773",
    "website": "https://easternusa.salvationarmy.org/northeast-ohio/clevelandharborlight/",
    "description": ""
  },
  {
    "addressLine1": "1736 Superior Avenue",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44114",
    "name": "Homeless Coordinated Intake Cleveland",
    "organization": "Homeless Coordinated Intake Cleveland",
    "phone": "(216) 674-6700",
    "website": "http://ohs.cuyahogacounty.us/en-US/information-homeless.aspx",
    "description": ""
  },
  {
    "addressLine1": "2227 Payne Ave",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44114",
    "name": "Norma Herr Women's Center",
    "organization": "Norma Herr Women's Center",
    "phone": "(216) 479-0020",
    "website": "https://www.ywcaofcleveland.org/what-we-do/norma-herr-womens-center/",
    "description": ""
  },
  {
    "addressLine1": "2100 lakeside",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44114",
    "name": "Men's Shelter at 2100 Lakeside and Emergency Youth Shelter - Lutheran Metropolitan Ministry",
    "organization": "Men's Shelter at 2100 Lakeside and Emergency Youth Shelter - Lutheran Metropolitan Ministry",
    "phone": "(216) 566-0047",
    "website": "https://www.lutheranmetro.org/home-page/what-we-do/housing-shelter/",
    "description": ""
  },
  {
    "addressLine1": "12832 Euclid Avenue",
    "city": "East Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44112",
    "name": "Broken Connections",
    "organization": "Broken Connections",
    "phone": "(216) 721-9527",
    "website": "https://www.brokenconnections.org/",
    "description": "Provides emergency housing and supportive services for runaway, homeless and street youth between the ages of 10-21 through its Basic Center Program (BCP)."
  },
  {
    "addressLine1": "210 S Main St",
    "city": "Bryan",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43506",
    "name": "Sanctuary of Williams County Shelter",
    "organization": "Sanctuary of Williams County Shelter",
    "phone": "(419) 636-2460",
    "website": "https://www.facebook.com/SanctuaryShelter/?ref=py_c",
    "description": "The Sanctuary Homeless Shelter of Williams County exists to provide clothing, food, and shelter to the homeless all in the name and love of Jesus Christ."
  },
  {
    "addressLine1": "1933 E 2nd Street",
    "city": "Defiance",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43512",
    "name": "Northwestern Ohio Community Action Commission - NOCAC Emergency Shelter",
    "organization": "Northwestern Ohio Community Action Commission - NOCAC Emergency Shelter",
    "phone": "(419) 784-5136",
    "website": "https://www.nocac.org/",
    "description": ""
  },
  {
    "addressLine1": "710 N 4th St",
    "city": "Cambridge",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43725",
    "name": "Freedom House Shelter",
    "organization": "Freedom House Shelter",
    "phone": "(740) 432-7747",
    "website": "http://www.calledtofreedomfellowship.com/",
    "description": ""
  },
  {
    "addressLine1": "404 S 7th Street",
    "city": "Coshocton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43812",
    "name": "Second Chance Emergency Shelter",
    "organization": "Second Chance Emergency Shelter",
    "phone": "(740) 622-3632",
    "website": "mailto:tableofhumanity@yahoo.com",
    "description": "Emergency Shelter. Stay Only 1-7 days."
  },
  {
    "addressLine1": "120 N 4th St",
    "city": "Coshocton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43812",
    "name": "Kno-Ho-Co Ashland Emergency Shelter Program",
    "organization": "Kno-Ho-Co Ashland Emergency Shelter Program",
    "phone": "(419) 281-8001",
    "website": "https://www.knohoco.org/emergency-services-program",
    "description": ""
  },
  {
    "addressLine1": "515 Putnam Ave",
    "city": "Zanesville",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43701",
    "name": "Salvation Army Zanesville",
    "organization": "Salvation Army Zanesville",
    "phone": "(740) 452-8350",
    "website": "https://easternusa.salvationarmy.org/northeast-ohio/zanesville/",
    "description": "Homeless Shelter is available 24/7. Clients may stay on a daily basis, up to 90 days. If client had medication, they will need to verify that it is a prescription medication.\nWalk-ins; Must have current picture ID; Social Security card or printout of Social Security number; Be able to pass a drug and alcohol test. If no income, must be seeking employment.Soup Kitchen, M-F 4:30-5:30 p.m.. Shelter residents 7 days a week, 3 meals a day. Food pantry, emergency food every 90 days, M-F 1-3:00 p.m. Homeless shelter, emergency shelter, 24 hours a day 7 days a week. Angel Tree Christmas gift program, food baskets. Furniture and apartment set up for homeless, furniture for free of charge. Coats for kids, October. Columbia Gas in April, monies available to help with gas bills once yearly, disconnects only.\n\n\nComprehensive Emergency Assistance (Monday-Friday)Food Pantry open 10:00am - 12:00pm & 1:00pm - 3:00pm\n    Shut off notices for Columbia Gas help once a year (when funds are available)\n    Neighbor-to-Neighbor Program for AEP disconnects & shut off's (when funds are available)\n    Rent and Utility assistance (when funds are available)\n    Emergency Homeless Shelter\n    Soup Kitchen | Monday - Friday | 4:00pm - 5:30pm\n    Clothing Room Assistance"
  },
  {
    "addressLine1": "801 - 807 Putnam Ave",
    "city": "Zanesville",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43701",
    "name": "Trulight Ministries",
    "organization": "Trulight Ministries",
    "phone": "(740) 704-8531",
    "website": "https://trulightministries.org/",
    "description": ""
  },
  {
    "addressLine1": "8111 US. 127 N.",
    "city": "Camden",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45311",
    "name": "Higher Heights Church of God Food Pantry",
    "organization": "Higher Heights Church of God Food Pantry",
    "phone": "(937) 452-3600",
    "website": "https://www.facebook.com/pages/Higher-Heights-Church-of-god/1014462281905998",
    "description": ""
  },
  {
    "addressLine1": "308 Eaton-Lewisburg Rd",
    "city": "Eaton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45320",
    "name": "Preble CAP Pantry",
    "organization": "Preble CAP Pantry",
    "phone": "(937) 456-2800",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "715 Second St NE",
    "city": "Canton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44702",
    "name": "Refuge of Hope",
    "organization": "Refuge of Hope",
    "phone": "(330) 453-1785",
    "website": "http://www.refugeofhope.org/",
    "description": "Office Hours\nMonday through Friday\n8:30 a.m. to 4:30 p.m.\n\n66 bed men's shelter in Downtown Canton. Emergency overflow of an additional 11 cot beds. Showers, laundry and 3 meals a day everyday free.Community means provided daily except for Sunday, Call for details.\n\nRefuge of Hope's shelter is not just a place where a homeless man can sleep at night. Provides a support center, in a safe environment, where men can come to grips with the personal, economical and societal issues that caused them to become homeless. We provide a hand up to encourage homeless men, to help them realize that positive life changes are possible regardless of their current circumstances.\n\nOur goal is to help homeless men understand the love of Jesus Christ and achieve the stability necessary to be a positive contributor in our community.\n"
  },
  {
    "addressLine1": "211 East High Avenue-Rear",
    "city": "New Philadelphia",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44663",
    "name": "Friends of the Homeless of Tuscarawas County",
    "organization": "Friends of the Homeless of Tuscarawas County",
    "phone": "(330) 602-6100",
    "website": "http://fothtusc.org/",
    "description": "Friends of the Homeless of Tuscarawas County operates the area's only emergency homeless shelter.\n\nServices & Programs\nFriends of the Homeless strives to assist residents in breaking the cycle of homelessness, and that to do so, individuals and families need to be equipped with the life and employment skills necessary to survive and thrive in independent living.\nIn an effort to provide residents with the means to acquire these skills, Friends of the Homeless has created a system by which each individual and family's needs are assessed through one-on-one case management. Residents are made aware of their mandatory groups, as determined for each case, and are provided with the opportunity to participate in a number of additional programs designed to provide education and personal enrichment.\n\nEvery program offered by Friends of the Homeless is free of charge, and while there are many that are listed, some may not be. Please feel free to contact the shelter at 330-602-6100 to learn more about what programs are currently being offered to our residents or how you can get involved with our programming."
  },
  {
    "addressLine1": "411 Gest Street",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45202",
    "name": "David and Rebecca Barron Center for Men",
    "organization": "David and Rebecca Barron Center for Men",
    "phone": "(513) 721-0643",
    "website": "https://www.shelterhousecincy.org/mens-center/",
    "description": "Shelterhouse offers the essentials: housing, help, hope to people experiencing homelessness. We provide a refuge of unconditional care and compassionate assistance for both men and women,  reaching out our hand to encourage and empower those without resources to move from homelessness and destitution to shelter and stability.\n\nMen's Center:\n\nThe David and Rebecca Barron Center for Men ensures homeless men in Cincinnati have access to basic human needs such as shelter, food, emergency clothing items, basic toiletries, and safety.\n    150 beds for homeless men 18+\n    Non-dormitory sleeping quarters\n    Serving three daily meals\n    State of the art kitchen facilities\n    Individualized Case Management Support Services\n    Full day treatment services tailored to each mans specific needs\n    Fully operational on site medical and dental clinics\n    Daytime Programming\n    Full Laundry Services\n    3,600 Sq. Foot Private Outdoor Courtyard\n    10,000 Sq. Foot Winter Shelter operating December to February.\n\nGOAL\nTransition into permanent housing in 30 days or less with an increase in income."
  },
  {
    "addressLine1": "27 West 12th Street",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45210",
    "name": "Tender Mercies",
    "organization": "Tender Mercies",
    "phone": "(513) 721-8666",
    "website": "https://www.tendermerciesinc.org/",
    "description": "Permanent Housing and Caring Support\n\nTender Mercies provides more than housing. Each resident has his/her own room with a key. All buildings have round the clock staffing and residents are provided with ongoing support from compassionate and experienced staff. Living in a welcoming community with security & dignity is essential for recovery.\n\nHousing Services Outreach Services.\nWe accept referrals from anyone. The first step is to meet with one of our helpful Outreach Workers and complete an application for services. Applicants must be homeless with a history of mental illness.\n\nResidency Details\n149 single-occupancy rooms with 24-hour staff coverage at these locations:\nHaven Hall\n27 West 12th Street\n13 Female\n26 Male\n30% of income\nDana Hotel\n15 West 12th Street\n41 rooms - Coed\n30% of income\nHarkavy Hall\n24 West 12th Street\n29 targeted toward Males\n30% of income\nTransitional Housing\n29 West 12th Street\n16 rooms - Coed\n30% of income\nThese locations have staff support available (not 24-hour support):\nRace Street Residence\n1214 Race Street\n12 targeted toward Females\n$215-225 a month\n\nNew Morning House\n1209 Elm Street\n11 targeted toward Males\n$205-245 a month\n\nAll of our rooms include a twin bed, a dresser or wardrobe and a small refrigerator. Shared bathroom facilities are available on each floor. Shared kitchen and laundry facilities are also available.\n\nAlthough Tender Mercies does not serve 3 meals a day, on most days at least one meal is provided by community volunteers. There are often donated food items available and residents are provided with information about local pantries and soup kitchens.\n\n\nUpon moving in, residents can be provided with some basic assistance (sheets, towels, clothing, hygiene items) if needed. There is a $50 security deposit for all buildings.\n"
  },
  {
    "addressLine1": "1841 Fairmount Avenue",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45214",
    "name": "Bethany House Services",
    "organization": "Bethany House Services",
    "phone": "(513) 381-7233",
    "website": "https://bethanyhouseservices.org/",
    "description": "We provide emergency shelter, mental health assessments, transitional housing, and permanent housing.\n\nEmergency Shelter\n\nBHS provides a sanctuary for desperate homeless families in need of help to achieve stable housing and income. Our shelters meet each familys immediate needs for safety, housing, food and other necessities. While in shelter, parents receive the resources and information needed to help them obtain a living income, organize a comfortable home, and provide a nurturing environment for their children. Perhaps most important, parents themselves feel cared for and realize that they will develop a realistic plan for a better future for themselves and their children while they are guests of BHS.\n\n\n\nHousing\n\n\n\n\n\n\n\n\n\nRapid Re-Housing programs, considered by the Department of Housing\n& Urban Development (HUD) to be the best housing practice for\n\nalleviating homelessness, provides financial assistance and supportive\nservices to families experiencing homelessness. The goal of the program\nis to expedite housing and stabilization of the family as quickly as\npossible. It is easier and more efficient for families to sign up for\nbenefits or apply for jobs when they have the stability that a home\nprovides. They are also less stressed and better organized at home than\nwhen in shelter.\n\nThe program provides several forms of assistance, including:\nidentification of affordable housing suitable for the familys needs;\nshort-term or medium-term rental assistance and housing relocation and\n\nstabilization services, including such activities as mediation, credit\ncounseling, security or utility deposits, utility payments, moving cost\nassistance, and case management. Housing case managers and a housing\nspecialist assist each family to develop a housing plan, serve as\nliaison between family and landlord, and manage complex issues such as\nlease options, contracts and apartment inspections.\n\n\nShelter DiversionShelter diversion programs are identified by the National Alliance to\nEnd Homelessness as best practice for prevention of homelessness for\nfamilies seeking to enter a shelter. This strategy avoids the trauma of\nhomelessness for families by helping them to identify immediate\nalternative housing arrangements while connecting them with the services\nand financial resources needed to achieve permanent housing. The case\nmanager guides the family through the process of developing a\n\ncomprehensive, reality-based plan for ensuring a secure future in stable\nhousing.\nThis program conserves shelter beds and assistance for those who\ntruly have no resources of their own and no options other than a\nhomeless shelter or the streets.\n"
  },
  {
    "addressLine1": "PO Box 128808",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45212",
    "name": "Lydia's House",
    "organization": "Lydia's House",
    "phone": "(513) 549-7752",
    "website": "https://stlydiashouse.org/",
    "description": "About: Supportive and stable environment for women and children in crisis. Lydias House is a home for women and children who are in transition or crisis. Some guests have been homeless. Others are refugees from other countries. One or two volunteers also live in the house. We all share much of life with one another, including space and many meals. By having our lives overlap in this way we can support one another and learn new ways of being.\n\nHow to Apply: Fill out an online application on the website provided.\n\n\n\nThe mission of Lydias House is to provide a supportive and stable environment for women and children in crisis. Each guest will be helped to move into long term housing at the end of her stay; however, housing at Lydias House is as stable as possible in nature. It is a place of hope and healing as well as a springboard from which guests can seek training, new skills, and work that will provide for their needs. Women live in community, share life and meals with one another, and are encouraged in their personal spiritual journeys."
  },
  {
    "addressLine1": "1805 Dalton Avenue",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45214",
    "name": "City Gospel Mission",
    "organization": "City Gospel Mission",
    "phone": "(513) 241-5525",
    "website": "https://www.citygospelmission.org/",
    "description": "City Gospel Mission is a food pantry. .\n\n* Make sure you check by\ncalling the food pantry to confirm that they still are in operation and\nthe hours have not changed.\n\nSince 1924, City Gospel Mission Has Served Hurting, Needy, And Homeless People, Providing Help And Hope In Ever-Increasing Numbers Through The Years. The Mission Provides A Caring, Supportive Environment Where Homeless And Hurting People Are Treated With Respect And Encouraged To Accept Responsibility For Rebuilding Their Lives In An Atmosphere Of Love And Acceptance. Our Services Help Meet The Physical, Spiritual, And Emotional Needs Of People Who Have Lost Hope And Are Least Able To Meet Their Own Needs. The Daily Meals, Clothing Days, Safe Overnight Shelter, Recovery Programs, And Other Need-Based Services All Have This In Common: God'S Love And His Message Of Hope Are Shared In Practical, Christ-Like Ways. This Has Been Changing The Lives Of Those In Need At City Gospel Mission For More Than Eighty Years."
  },
  {
    "addressLine1": "4230 Hamilton Ave",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45223",
    "name": "Grace Place Cincinnati",
    "organization": "Grace Place Cincinnati",
    "phone": "(513) 591-2246",
    "website": "http://www.cainministry.org/graceplace.html",
    "description": ""
  },
  {
    "addressLine1": "113 E 12th St",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45202",
    "name": "Cincinnati Homeless Coalition",
    "organization": "Cincinnati Homeless Coalition",
    "phone": "(513) 421-7803",
    "website": "https://cincihomeless.org/",
    "description": "Office Hours: Mondays through Fridays 9am to 5pm.\n\nNeed Help?\nAre you currently homeless or are you on the edge of homelessness? If so, there are a number of agencies in the Greater Cincinnati area that may be able to help you get out of homelessness or prevent you from becoming homeless.\n\nCAP Line/Intake Process\nIf you need shelter, call the Cincinnati shelter hotline (513) 381-SAFE (7233). This is the Central Access Point (CAP) a centralized intake system for families and individuals who are currently experiencing homelessness or who are at risk of becoming homeless.\nIntake Specialists screen callers based on their immediacy of need and make appropriate referrals into a partner agencys program. Be prepared for a wait time. Unfortunately, due to the high need, Greater Cincinnati shelters are frequently full.\n\n\nCAP accepts call from 9:00 AM to 8:00 PM Monday through Friday and 10:00 AM to 2:00 PM Saturday and Sunday.\nThe only way to get in to the following shelters is through this hotline: Bethany House Services, Interfaith Hospitality Network, Mercy Franciscan at St. John, the Salvation Army, Mt. Airy Center (to see if you qualify for these shelters)"
  },
  {
    "addressLine1": "898 Walnut Street",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45202",
    "name": "YWCA of Greater Cincinnati (Women) Shelter and Transitional Housing",
    "organization": "YWCA of Greater Cincinnati (Women) Shelter and Transitional Housing",
    "phone": "513-241-7090",
    "website": "https://www.ywcacincinnati.org/",
    "description": "Domestic Violence Shelter and Crisis Hotline\nThe YWCA provides safe protective shelter, crisis line assistance and necessary supportive services for adults and their children to move them toward self-sufficiency, independence and freedom from abuse.\n\nYWCA hotline advocates can provide: peer counseling and moral support, assistance with creating a safety plan and determining if shelter is appropriate for you, and information about restraining orders.\n\nHamilton County - YWCA Domestic Violence Shelter\nYWCA Domestic Violence Hotline:\nLocal: 513-872-9259\nToll-Free: 888-872-9259\n24-hour Hotline Assistance\n\nTTY Accessible\n    Only domestic violence shelter in Hamilton County\n    Shelters up to 72 adults and children\n    Case management, advocacy and referral\n    24-hour crisis hotline including TTY services and an International Language Line\n    Services for immigrant women\n    Employment Resource Program\n    Children's Program\n    Pet protection services"
  },
  {
    "addressLine1": "2499 Reading Road",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45202",
    "name": "Esther Marie Hatton Center for Women",
    "organization": "Esther Marie Hatton Center for Women",
    "phone": "(513) 562-1980",
    "website": "http://www.shelterhousecincy.org/",
    "description": "Shelterhouse offers the essentials: housing, help, hope to people\nexperiencing homelessness. We provide a refuge of unconditional care and\n\ncompassionate assistance for both men and women reaching out our hand\nto encourage and empower those without resources to move from\nhomelessness and destitution to shelter and stability.\n\nWomen's Center\n\nThe Esther Marie Hatton Center for Women ensures homeless women in Cincinnati have access to basic human needs such as shelter, food, emergency clothing items, basic toiletries, and safety.\n60 beds for homeless women 18+\nNon-dormitory sleeping quarters\nServing three daily meals\nState of the art kitchen facilities\nIndividualized Case Management Support Services\nFull day treatment services tailored to each womans specific needs\nFully operational on site medical clinic\nDaytime Programming\nFull Laundry Services\n9,000 Sq. Foot Private Outdoor Courtyard\nGOAL\nTransition into permanent housing in 30 days or less with an increase in income.\n"
  },
  {
    "addressLine1": "2314 Iowa Ave",
    "city": "Cincinnati",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45206",
    "name": "Lighthouse Sheakley Center for Youth",
    "organization": "Lighthouse Sheakley Center for Youth",
    "phone": "(513) 569-9500",
    "website": "https://www.lys.org/services/shelter-and-resources-for-homeless-young-adults-18-24/sheakley-center-f",
    "description": "Lighthouse offers shelter to young adults ages 18-24 who are motivated to move from homelessness to safe and stable housing.\n- Shelter where homeless young adults learn self-reliance and life skills\n\n- Each young adult works with a case manager who helps the young adult develop a case plan and implement it.\n- The goal: move young adults from the center into safe and stable housing within 30 days\n\nWhen homeless young adults enter the Lighthouse Sheakley Center for Youth, they often experience their first sense of hope for a better future. Young people who live on the streets lack the guidance and support so many of us take for granted. Thats why Lighthouse has a dedicated and trained team of case managers who provide consistent, personalized, and comprehensive case management services. They assess each young persons needs, provide crisis intervention if needed, coordinate the necessary care, and develop an individualized plan to provide support. Our end goal is to guide young people off the streets and into secure housing."
  },
  {
    "addressLine1": "634 Scott St.",
    "city": "COVINGTON",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "41011",
    "name": "Emergency Shelter of Northern Kentucky",
    "organization": "Emergency Shelter of Northern Kentucky",
    "phone": "(859) 291-4555",
    "website": "http://emergencyshelternky.org/",
    "description": ""
  },
  {
    "addressLine1": "205 West Pike St.",
    "city": "Covington",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "41011",
    "name": "Welcome House Shelter",
    "organization": "Welcome House Shelter",
    "phone": "(859) 431-8717",
    "website": "https://www.welcomehouseky.org/",
    "description": "The Welcome House Emergency Shelter provides a safe place for approximately 30 homeless women and children. Guests of the shelter work with Service Coordinators and other Welcome House staff to increase income and access affordable housing while removing any challenges or barriers to success.\n\nWhile working toward greater stability, clients are offered a safe place to live, warm meals, any needed hygiene supplies, and extra assistance (such as help with transportation and referrals to area resources). Shelter residents benefit from the caring support of a 24 hour staff member, various volunteers, and donors who help meet their needs.\n\n\nIn 2015, 135 children were part of the many individuals who stayed in Shelter. Fifty-two percent of the children served were under six years of age. Children who stay in the shelter (as well as those of other families working with Welcome House) have the support of a staff member dedicated to meeting their needs and protecting their rights. Mothers are offered assistance in enrolling children into school and daycare, and in meeting the material needs of their school-aged children.\n\nThe average length of stay at the shelter was 35 days. During their shelter stays in 2015:\n\n    100% of shelter clients accessed support services while at the shelter, such as the care of visiting nurses, mental health and substance abuse referrals, and parenting and life skills coaching.\n     73% of our clients exited shelter to positive housing outcomes\n\n     68% of 185 households had income at exit (and more residents accessed non-cash benefits such as WIC, SNAPS benefits, and health insurance enrollment while in shelter).\n"
  },
  {
    "addressLine1": "260 West Pike Street",
    "city": "Covington",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "41012",
    "name": "Fairhaven Rescue Mission",
    "organization": "Fairhaven Rescue Mission",
    "phone": "(859) 491-1027",
    "website": "https://www.fairhavenmission.org/",
    "description": ""
  },
  {
    "addressLine1": "336 West",
    "city": "Newport",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "41071",
    "name": "Family Promise of Northern Kentucky, Inc.",
    "organization": "Family Promise of Northern Kentucky, Inc.",
    "phone": "(859) 360-0905",
    "website": "https://www.nkyfamilypromise.org/",
    "description": ""
  },
  {
    "addressLine1": "13-15 East 20th St",
    "city": "Covington",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "41014",
    "name": "Homeward Bound Shelter",
    "organization": "Homeward Bound Shelter",
    "phone": "(859) 581-1111",
    "website": "https://www.brightoncenter.com/",
    "description": "Emergency shelter for runaways ages 11 - 17 years old.\nHomeward Bound Shelter is a 24-hour emergency shelter location in Covington, KY, that provides a safe environment and short-term services for runaway, homeless, abused, neglected, and dependent youth ages 11-17.\n\n\nIntakes are conducted to gather information for eligibility, appropriateness and development of initial service plan\n\nProvide basic support that includes shelter, food and clothing\nA bio-psycho-social assessment is completed to identify issues\nTreatment Team meets weekly to discuss new admissions, bio-psycho-social, and goals to be addressed in the service plan\nIndividual counseling is conducted weekly for each youth\nCrisis Intervention and Referral Services are offered for local non-residential youth and families\nRecreation activities are offered weekly for community recreational activities\n\nLife skills are taught daily and groups held weekly\nWe use Positive Youth Development and Trauma-Informed best practices in our approach with youth.\n\n"
  },
  {
    "addressLine1": "1320 Washington Ave.",
    "city": "Cleveland",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44113",
    "name": "Stella Maris Cleveland",
    "organization": "Stella Maris Cleveland",
    "phone": "(216) 781-0550",
    "website": "https://www.stellamariscleveland.com/",
    "description": "Shelter for Men with drug and alcohol addiction\n    Serves 20 single men with alcohol and drug addiction\n    Length of stay in program: four to six months\n    Services:\n        Provides intensive outpatient services\n        Provides a therapeutic community\n        Provides job readiness and permanent housing referrals\n   "
  },
  {
    "addressLine1": "61 East Mound Street",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43215",
    "name": "Open Shelter Inc.",
    "organization": "Open Shelter Inc.",
    "phone": "(614) 461-0407",
    "website": "http://theopenshelter.org/",
    "description": "Day Shelter\nBag Lunches are prepared and delivered by the dedicated volunteer groups who have been part of our meals program for years. On a daily basis, meals are provided to 100 people.\nLunches are prepared off-site and transported by dedicated volunteers. On a daily basis, meal groups provide lunches for 100 people.\n\nDinners are also prepared off-site, transported and served by dedicated volunteer groups. Meals are served on Monday, Tuesday, and Thursday evenings through Broad Street United Methodist Church\nTo make arranges to provide meals, please contact Harry Yeprem during regular business hours\n"
  },
  {
    "addressLine1": "Po Box 06157",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43206",
    "name": "Choice Women's Emergency Shelter",
    "organization": "Choice Women's Emergency Shelter",
    "phone": "(614) 224-4663",
    "website": "https://lssnetworkofhope.org/choices/",
    "description": "Provides housing for women and children who are victims of domestic violence. Average stay based on safety and individual need. Provides counseling, legal and social service advocacy and referrals, substance abuse assessment/referral, youth services, outreach and domestic violence education.\n\n\n\n\nThe fact that CHOICES offers temporary shelter is well known, but the location is kept confidential for safety purposes. A dedicated staff has ensured the shelter's operation 24 hours a day, 7 days a week, since 1977, making ours the longest-running domestic violence shelter in Franklin County.\n\n\n\n\nHundreds of volunteers have donated their time and skills to keep the shelter running efficiently for over 30 years. Thousands of women and children have used this residence as a safe, temporary home during times of crisis.\n"
  },
  {
    "addressLine1": "599 E. Eighth Avenue",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43201",
    "name": "FAITH MISSION - Emergency Shelter for Men",
    "organization": "FAITH MISSION - Emergency Shelter for Men",
    "phone": "(888) 474-3587",
    "website": "https://lssnetworkofhope.org/faithmission/",
    "description": "Provides shelter for homeless men. Intake is done 24 hours Mon-Sun. Support services include case management, meals, showers and on-site medical care provided by volunteer physicians. Also offers resource center with computer access. Intake for Faith Mission is done at 315 East. Long Street (near North 6th Street 24-hour hotline 888-4SHELTR (888-474-3587).\nFaith Mission is the largest shelter system in central Ohio with two\n\nmens shelters and one womens shelter. The shelters are open 365 days a\nyear, serving up to 237 people every night and more during cold\nweather. We provide shelter for approximately 1,900 people every year.\n\nLocated at 315 E. Long Street, Faith Mission is known by many as not only a place for a hot meal and a warm bed, but a haven of hope as well. Since 1966, Faith Mission has served the homeless community by offering a secure, Christian-based environment for homeless men and women on an emergency walk-in basis. The agency provides shelter, food and clothing, while helping individuals with access to longer term solutions such as housing, employment assistance, medical, dental and vision care, counseling and support groups."
  },
  {
    "addressLine1": "924 East Main Street",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43205",
    "name": "Friends of the Homeless",
    "organization": "Friends of the Homeless",
    "phone": "(614) 274-7000",
    "website": "http://www.fohcolumbus.com/",
    "description": "Friends of the Homeless provides residential support to homeless men and women through shelters, transitional housing, and permanent supportive housing. Since 1983, Friends of the Homeless has provided residents with the opportunity to reestablish themselves as members of the Columbus community.\n\nOur Programs\n\nMen's Emergency Shelter\nThis essential program provides shelter to 130 men, 24-hours-a-day, 365 days a year. The Mens Emergency Shelter provides basic life-sustaining services while residents work to rebuild their lives.\n\nNew Horizons Transitional Housing\nNew Horizons Transitional Housing offers housing to chronically homeless and seriously mentally ill individuals who have moved beyond the need for immediate emergency shelter. This program also offers supportive case management and stability while residents learn basic living skills and secure a more permanent housing solution.\n\nSuccess in Housing\nA Supportive Housing program to persons living with certain medical conditions that assists them in resolving housing crises quickly and linking them with community resources and supports to avoid homelessness in the future.  The program services referred clients that live in the Delaware, Fairfield, Franklin, Licking, Madison, Morrow, Pickaway and Union Counties.\nBridges to Success\nThe Bridges to Success Program helps referred clients who are returning to the community from psychiatric hospitalization or crisis unit placement avoid homelessness, find ongoing treatment, housing, and support services, and increase stability in the community. "
  },
  {
    "addressLine1": "33 N. Grubb St.",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43215",
    "name": "The Homeless Families Foundation",
    "organization": "The Homeless Families Foundation",
    "phone": "(614) 461-9247",
    "website": "https://www.homeforfamilies.org/",
    "description": "If you are currently homeless and seeking shelter call 1-888-4-SHELTR (1-888-474-3587).\n\nProvides individual furnished apartment units for up to 3 months for homeless families with minor children. Must be willing to live drug free and participate in agency self-improvement programs. For immediate shelter, call the YWCA Family Center at 253-7970 24 hours Mon-Sun.\n\n\nThe Homeless Families Foundation operates the Emergency Shelter program for homeless families with children up to the age of 18. The program operates two sites with a total of 44 units. There are 2 four-bedroom, 26 two-bedroom and 4 one-bedroom townhouse units, 12 efficiency apartments. Families are permitted to stay for a period of up to three months while they work with Case Managers and search for employment and housing. Each shelter unit is furnished with all the basics including beds and bedding, sofa and chairs, lamps, kitchen table, dishes, pots and pans, towels and toiletries, cleaning supplies and a starter food basket.\n\nThe Homeless Families Foundation currently uses a housing first approach in working with families which move them from emergency shelter into their own home. At the very core, HFF serves children and their families living in poverty, helping them to secure housing and resources to stabilize their lives, while providing educational programming and support for kids. We believe that educating at risk and impoverished youth and stabilizing families is crucial to break the cycle of homelessness.When families leave our care, they are empowered to help themselves and provide a stable living environment for their kids. When children leave our care, they will understand the value of education and be prepared for lifelong learning."
  },
  {
    "addressLine1": "1421 Hamlet Street",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43201",
    "name": "Huckleberry House Emergency Overnight Shelter",
    "organization": "Huckleberry House Emergency Overnight Shelter",
    "phone": "(614) 294-5553",
    "website": "http://huckhouse.org/",
    "description": "Provides crisis counseling and shelter for adolescents 12-18 years. Provides outreach to at-risk youth willing to work toward reconciling family problems. Offers short-term family and individual counseling with special emphasis on adolescent maltreatment, abuse, suicide and family violence.\n\nWho Can Come\n    Ages 12-17\n    Youth who have run away from home or are experiencing a crisis \n\nWhat is Provided\n    A safe place to stay and think things over\n    Group activities\n    Individual counseling\n    Breakfast, lunch and dinner\n\nWhat to Expect\n    The Crisis Shelter runs on a regular schedule that includes time for:\n        Journaling\n        Activities such as yoga and four square\n        Down time to do crafts, play games, watch a movie, etc.\n        Phone privileges\n    Youth will meet new people\n    Daily counseling is provided\n\nCommon Misconceptions\n    The Shelter is strict-like a jail\n    Youth will not be able to talk to family and friends while they are staying in the Shelter\n    It is a bad place to be\n    Youth have to be homeless or abused to stay at the Shelter\n    Youth will be forced to stay at the Shelter\n-The average stay is 3-5 days and youth can leave whenever they want"
  },
  {
    "addressLine1": "900 Harvey Court",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43219",
    "name": "YWCA Family Center",
    "organization": "YWCA Family Center",
    "phone": "(614) 253-3910",
    "website": "https://www.ywcacolumbus.org/what-we-do/support-those-in-need/ywca-family-center/",
    "description": "Offers transportation assistance, furnished apartments, food and case management services for maximum of 90 days. Assists with locating housing, making referrals to employment and educational services and linking clients to agencies that address barriers to homelessness. Families must be homeless; must have custody and possession of 1 or more minor children; must be referred through the YWCA/Interfaith Hospitality Network and must demonstrate a willingness to participate and work with a case manager. For immediate shelter, call the YWCA Family Center at 253-3910 24 hours Mon-Sun.\n\nMen's Shelter Also..\nProvides emergency shelter with 40 beds and supportive services for homeless men. Effective Wednesday, April 21, 2010 all single adults in need of shelter should go to Faith Mission's intake center at 315 East Long Street or call 1-888-4SHELTR (1-888-474-3587)."
  },
  {
    "addressLine1": "900 Harvey Court",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43219",
    "name": "YWCA Family Center, Emergency Housing for Families",
    "organization": "YWCA Family Center, Emergency Housing for Families",
    "phone": "(888) 474-3587",
    "website": "http://www.ywcacolumbus.org/",
    "description": "Are you homeless and in need of immediate assistance?\nCall the homeless hotline,\nopen 24 hours a day: 614-274-7000\nThis center is by referral only.\n\nWe no longer accept walk ins. Please call: 888-474-3587 first.\nOffers homeless families with children homeless prevention/intervention services, emergency shelter and supportive services, including short-term lodging, meals, housing and employment assistance. Other services include physical, mental health and substance abuse issues; financial literacy; parenting classes; licensed preschool; and after-school and summer camp activities. Shelter clients may generally stay 14-21 days, and staff work with clients to try and locate housing. Through partnership with Columbus City Schools, 90 percent of children remain in their home school, a key factor in helping families adjust in difficult times. Call for space availability.\n\n\nHours: 10a-8p Mon-Fri 1p-8p Sat, Sun Homeless family intake"
  },
  {
    "addressLine1": "16 West Long Street",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43215",
    "name": "Southeast Coast Friends of the Homeless Columbus",
    "organization": "Southeast Coast Friends of the Homeless Columbus",
    "phone": "(614) 274-7000",
    "website": "http://www.fohcolumbus.com/",
    "description": "Office hours: Mondays, Wednesdays, Thursdays, Fridays 8am to 5pm.\nTuesdays 8am to 8pm.\n\n"
  },
  {
    "addressLine1": "245 North Grant Avenue",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43215",
    "name": "LSS Faith Mission",
    "organization": "LSS Faith Mission",
    "phone": "(614) 224-6617",
    "website": "http://www.lssnetworkofhope.org/",
    "description": "For those seeking shelter in Franklin County, there is a Centralized Point of Access for single adults and families (adults with children).\nSingle adults should call 1-888-4SHELTR (1-888-474-3587) 24/7.\n\nFamilies (adults with children) should call the 24/7 Family Center hotline at (614-253-7970) for assistance.\nOur ServicesAt Faith Mission, our services help clients meet their basic food and shelter needs, while also giving them the resources and support to improve their lives. These services include:\nShelterFoodEmployment ReadinessHealth CenterCase ManagementVeterans Services\n\nShelterFor more than 50 years weve seen the effects of homelessness and have been there to help not only with immediate needs like shelter, food and clothing, but also with long-term solutions such as housing, employment and supportive case management.\nFoodFaith Mission has the only community kitchen in Franklin County that serves breakfast, lunch and dinner every day of the year. We provide about 600 meals a day to anyone in the community who is hungry and are thankful for the donated goods that allow us to operate on a minimal budget.\n\nEmploymentThe Faith Mission Resource Centers provide clients with access to phones and personal voicemail, a fax machine, computers with Internet access, bus passes and directories of Columbus services.\nHealth CenterFaith Mission addresses the medical needs of our clients at the Faith Mission Health Center. Local health care professionals volunteer to staff this clinic and offer a variety of services at no cost to homeless individuals. These services include dental, podiatry, vision and general medical services."
  },
  {
    "addressLine1": "624 Harmon Avenue",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43223",
    "name": "Volunteers of America - Men's Services & Veterans Resource Center",
    "organization": "Volunteers of America - Men's Services & Veterans Resource Center",
    "phone": "(614) 849-0145",
    "website": "https://www.voaohin.org/",
    "description": ""
  },
  {
    "addressLine1": "595 Van Buren Drive",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43223",
    "name": "YMCA Van Buren Center - YMCA family shelter at Van Buren Center",
    "organization": "YMCA Van Buren Center - YMCA family shelter at Van Buren Center",
    "phone": "(614) 715-2515",
    "website": "http://ymcacolumbus.org/vanburen",
    "description": ""
  },
  {
    "addressLine1": "1791 Alum Creek Dr.",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43207",
    "name": "Maryhaven Columbus",
    "organization": "Maryhaven Columbus",
    "phone": "(614) 445-8131",
    "website": "https://maryhaven.com/",
    "description": "Hours of Operation: 24 hours daily\n(after hours admissions by appointment only)\nOVERNIGHT SHELTER FOR INTOXICATED INDIVIDUALS\nMaryhavens Homeless Programs serves as a lifeline to homeless men, women and families.\n\nThe Engagement Center at Maryhaven provides a refuge for publicly inebriated homeless men and women, and we extend numerous invitations to help people begin rebuilding their lives. The center shelters 42 men and eight women per night and is open year round.\n\n\nIn order to be admitted to the program, individuals must be:\n\n    18 years of age or older\n    Transported by Reach Out Workers or Safety Officers\n    Permanently or temporarily without a home\n    Publicly under the influence of alcohol and/or drugs\n\nThe Maryhaven Outreach Program, travels throughout the community to reach those living \"on the land\" to encourage and assist them in finding housing and treatment.\n\nOur Commons at Chantry support services team joins the Community Shelter Boards Rebuilding Lives network, striving to help formerly homeless, men, women and families achieve sobriety and help them restore their lives from addictive disorders allowing opportunity for them to sustain stable housing.\n"
  },
  {
    "addressLine1": "1675 s. High Street",
    "city": "Columbus",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43207",
    "name": "The Salvation Army Adult Rehabilitation Center, Columbus OH",
    "organization": "The Salvation Army Adult Rehabilitation Center, Columbus OH",
    "phone": "(614) 221-4269",
    "website": "https://columbusarc.salvationarmy.org/columbusarc/",
    "description": "Our centers provide a safe place for recovery, while rebuilding a lifestyle free and safe from substance abuse. Our six month program offers a place to sleep, food to eat, and a new beginning - with no income or insurance required. Our rehabilitation ministry provides housing, clothing, educational aid and work experience to men who are seeking help for a drug or alcohol addiction. We focus rehabilitation around the spiritual fulfillment that comes through a personal relationship with Christ, offering a variety of programs that enhance this spiritual ideal."
  },
  {
    "addressLine1": "35 N. Washington",
    "city": "Delaware",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43015",
    "name": "Family Promise of Delaware County Temporary Family Shelter",
    "organization": "Family Promise of Delaware County Temporary Family Shelter",
    "phone": "(740) 362-7817",
    "website": "http://www.familypromise-delawareohio.org/",
    "description": "Churches providing temporary shelter to homeless families. Call for details during office hours."
  },
  {
    "addressLine1": "100 Huffman Avenue, Ste. 305",
    "city": "Dayton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45403",
    "name": "Mary Queen of Peace House",
    "organization": "Mary Queen of Peace House",
    "phone": "(937) 938-5784",
    "website": "mailto:stephendevol@Catholic-ITV.net",
    "description": "By Appointment only.\nWe are association of sober houses for homeless people in recovery from addictions.\nWe only accept new members who have recently completed a 30-day inpatient treatment program for addictions and are referred by addiction treatment centers.\n\nWe are not accepting drop-in visitation at this time due to COVID pandemic.\nPlease call or email to schedule an appointment or to obtain more information on qualifying for sober house coop membership.\n\nThe Dayton Catholic Worker Movement operates the 501(c)3 nonprofit Catholic Internet Television Network Coop, Inc. (CITVN) to produce and distribute documentary videos and webcast events. 100% of CITVN net operating income is dedicated to providing sober house funding options, social services coordination for homeless people seeking abstinence-based recovery solutions, and peer advocacy for homeless people who are experiencing difficulties in obtaining housing, government and nonprofit social services. Call (937) 938-5784 or email me at Stephen@Catholic-ITV.net"
  },
  {
    "addressLine1": "605 S Patterson Blvd",
    "city": "Dayton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45402",
    "name": "Daybreak",
    "organization": "Daybreak",
    "phone": "(937) 461-1000",
    "website": "https://daybreakdayton.org/",
    "description": ""
  },
  {
    "addressLine1": "1133 Edwin C. Moses Blvd. Suite 308",
    "city": "Dayton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45417",
    "name": "St. Vincent de Paul Dayton",
    "organization": "St. Vincent de Paul Dayton",
    "phone": "(937) 222-7349",
    "website": "http://stvincentdayton.org/",
    "description": "St. Vincent de Paul operates two 24-hour emergency homeless shelters. The St. Vincent de Paul Gateway Shelter for Women and Families serves single women and families with children. The St. Vincent de Paul Gettysburg Gateway serves single men. Both shelters provide three meals daily, clothing, personal care items, mail and message services, and access to case management to assist them in exiting the shelter into appropriate permanent housing. On any given night there are 350 or more men, women and families in the shelters 20% of whom are children 17 and under.\n\n\n\nContact:\n\nSt. Vincent de Paul Gettysburg Gateway for Men\n\n1921 S. Gettysburg Ave. Dayton, OH 45417\n\nPhone: (937) 222-7350, ext. 278\n\n\n\nSt. Vincent de Paul Gateway Shelter for Women & Families\n\n120 W. Apple St. Dayton, OH 45402\n\nPhone: (937) 461-7837, ext. 105"
  },
  {
    "addressLine1": "141 E 3rd St",
    "city": "Dayton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45402",
    "name": "YWCA of Dayton",
    "organization": "YWCA of Dayton",
    "phone": "(937) 222-7233",
    "website": "http://www.ywcadayton.org/",
    "description": "This is an excellent shelter, with many programs available for different needs.\n\n\nThe YWCA Dayton operates Montgomery County's only shelter for victims of domestic violence. In addition, we co-sponsor and staff the 24-hour Domestic Violence Hotline. Our confidential services are available 24-hours a day, 365 days a year, free of charge to victims, their friends and family members, and other professionals.\n\n\n\n24-Hour Domestic Violence Hotline 937-222-SAFE\n\n\n\nOur shelter provides a full range of services to help women on the road to self-sufficiency. These services include crisis intervention, case management, individual advocacy, individual and group counseling, support and educational groups, goal planning, referrals, children's programs and basic material needs.\n\n\n\nHomeShare\n\nThe HomeShare program provides transitional/supportive housing and social services to homeless women and their children while they gain training and education toward self-sufficiency. The HomeShare program is much more than temporary shelter. Those accepted into the program must be willing to work hard toward goals and accomplishments that will improve their ability to gain living wage employment. These goals may include attending college or training and/or apprenticeship programs.\n\n\n\nSingle Room Occupancy (SRO)\n\nThe SRO program provides permanent housing and social services to single women while they gain employment and build toward self-sufficiency. Permanent housing is provided depending on a woman's need and eligibility for rental subsidy.\n\n"
  },
  {
    "addressLine1": "700 Buckeye St.",
    "city": "Warren",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44120",
    "name": "Haven House For Veterans",
    "organization": "Haven House For Veterans",
    "phone": "(330) 409-9139",
    "website": "https://fcsserves.org/program/veterans-haven/",
    "description": "Veterans Haven goal is to promote housing stability, case management and outreach service coordination to male and female veterans of Ohio and their families. We meet these needs by providing a wide range of supportive services designed to resolve the immediate crisis of homelessness and promote housing stability. The program is designed for low-income veterans and their families.\n\nELIGIBILITY\n\nHave a disability or be 50 years of age or older\nServed active duty\nMust be a veteran or head of house hold must be a veteran\nHave an honorable discharge\nVery low income\nHomeless or at risk of becoming homeless"
  },
  {
    "addressLine1": "247 N Prospect St",
    "city": "Marion",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43302",
    "name": "Be Ministries Emergency Housing",
    "organization": "Be Ministries Emergency Housing",
    "phone": "(740) 382-9507",
    "website": "http://www.be-church.com/",
    "description": ""
  },
  {
    "addressLine1": "326 West Fairground St.",
    "city": "Marion",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43302",
    "name": "Marion Shelter Program Inc.",
    "organization": "Marion Shelter Program Inc.",
    "phone": "(740) 387-4550",
    "website": "https://heartofohiohomelessshelter.org/",
    "description": "Men's Shelter at this location.\n\n"
  },
  {
    "addressLine1": "510 West Main Cross St.",
    "city": "Findlay",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45840",
    "name": "The City Mission of Findlay",
    "organization": "The City Mission of Findlay",
    "phone": "(419) 423-9151",
    "website": "https://www.findlaymission.org/",
    "description": "Residential Services.\nAll services to those who stay at the City Mission are provided without charge. The Refuge, Life House and Next Steps programs are available for both men and women. These programs are designed to build upon one another to give residents more time to address life issues.\n\nThe Refuge is the entry point into the Mission for each resident.  It is here that short-term emergency shelter is offered. The Refuge is designed to assist guests with immediate food and shelter. Refuge stays are one to seven nights\n\n\nIf someone staying in the Refuge chooses and he or she desires to work toward ending homelessness in his or her life the Life House is designed to provide for basic needs, guidance and support.  The Life House offers individuals both the time and resources to begin looking for work and a solution to their homelessness.  Life House stays are not limited by time. Instead, the length of someone's stay is based upon completion of program goals.\n\nNext Steps works with individuals who choose to go deeper into the root causes of homelessness in their lives.  Next Step residents are required to go through the Life House before entering this phase of City Mission programming. In the Next Steps residents continue to work and save. Residents in the Next Steps work with the support of program staff to make choices that lead to change.  Again, Next Steps stays are not limited by time, but by the completion of program goals.\n\nThe NLDP (New Life Directions Program) is a long term, discipleship ministry of The City Mission.  Our goal is to see men become fruitful and faithful followers of Jesus Christ. We facilitate this through structured work, Biblical counseling, Bible study, and life skills classes.  Interested applicants will enter into an application process which consists of homework aimed toward examining the fruit and true nature of our hearts.  Upon review of this material the candidate will be either welcomed into the program or guided to a more suitable plan of action.  Currently we only offer this program for men. If a resident completes this six month program, he may enter Next Steps in order to begin saving toward independence.\n\nDay Center Services.\nThe Day Center was founded in 2011 by a community collaboration aimed at meeting the very real need for daytime shelter and work space for the homeless in the area. A test program was started at the City Mission of Findlay, and has since become wholly integrated into the Mission's daily operations and programming. Not only does the Day Center offer daytime shelter, it also has daily life skills and spiritual growth group meetings, refreshments, a noon meal, job and housing search assistance, resume building, as well as continued support and encouragement to all who come in.\nThe Day Center is located in the front of the City Mission and is open 7 days a week from 8 am-3 pm.\nSchedule.\n Monday - Friday\n  8:00am - Open\n  9:00am - Life Skills Group\n10:15am - Spiritual Growth Group\n12:00pm - Lunch (provided for Day Center participants only)\n  3:00pm - Close\n\nFood Services.\nThe food services offered at the City Mission are available to anyone who has need. People are welcome seven days a week at 4:30 pm. Please enter through the Day Center entrance on the front porch at the City Mission.\nThe City Mission provides meals for its residents and a nightly meal for the community at 4:30 pm.\n"
  },
  {
    "addressLine1": "16371 W. Pattison Ave.",
    "city": "Kenton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43326",
    "name": "New Hope Ministry Park Shelter",
    "organization": "New Hope Ministry Park Shelter",
    "phone": "(419) 673-1063",
    "website": "https://www.kentonnewhope.com/",
    "description": "New Hope Church also hosts a fully-functioning Homeless Shelter for Men, Women, and Families in need at our Ministry Park location. We offer a short term overnight housing as well a Residential Program.\n\n"
  },
  {
    "addressLine1": "1421 E. State St.",
    "city": "Fremont",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43420",
    "name": "Liberty Center of Sandusky County",
    "organization": "Liberty Center of Sandusky County",
    "phone": "(419) 332-8777",
    "website": "https://www.libertycenterfremont.org/",
    "description": "    Temporary shelter for up to 60 days\n    Nutritious Meals\n    Toiletries and personal needs\n    Life skills classes\n    Support to develop a plan of action\n    Case Management\n    Domestic Violence Advocate services\n    Job and housing referrals\n    Continued contact beyond placement\n\nFacility\n\nThe temporary shelter includes: administrative offices, kitchen, dining room, dormitory style sleeping rooms, restrooms, living rooms, play room, showers, and laundry. A play area for children is located outside in the yard.\nFinance\n\nThe Liberty Center operates on the contributions of local churches, private donations, corporate gifts, service groups donations, fund-raising and grants. Please consider remembering the shelter in your will or estate planning.\nAdmissions\n\nApplications for admittance are available Monday through Friday from 9:00am to 4:00pm. Referrals to the shelter are accepted from local agencies and churches. Walk-in applicants are welcome but we are NOT a walk-in shelter.  There is an application process.  All applications are recorded in a confidential registry. A criminal background investigation and intake interview are completed before an intake is scheduled.\nHouse Rules\n\n    Be cooperative\n    Respect others and their property\n    Strictly comply with curfew\n    Refrain from using alcohol or drugs\n    Look for job daily if not employed\n    Attend house meetings\n    Attend life skill classes\n    Work toward self-sufficiency\n    Follow case plan\n    Complete assigned chores\n    No weapons"
  },
  {
    "addressLine1": "249 W Main St",
    "city": "Norwalk",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44857",
    "name": "Catholic Charities - Miriam House",
    "organization": "Catholic Charities - Miriam House",
    "phone": "(419) 663-6341",
    "website": "https://catholiccharitiesnwo.org/miriam-house/",
    "description": "Two-year transitional housing facility for homeless women with children, pregnant or trying to reunify with children in foster care. Intensive life skills program, case management; secure and safe. To help women and their families become self-sufficient and thrive.\n\nLocated in Norwalk, Miriam House is a transitional housing program that offers safe and stable housing to homeless women and their children.  Catholic Charities staff help residents identify issues that have contributed to their homelessness.  Clients receive resources and guidance to rebuild their lives and to develop the skills necessary to regain self-sufficiency and to secure stable, independent housing.\n\n\nIf you are seeking shelter at the Miriam House, please contact Catholic Charities Case Manager  at 419-668-3073 for intake information and more details about the Miriam House."
  },
  {
    "addressLine1": "98 South Main Street",
    "city": "South Norwalk",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "06854",
    "name": "Norwalk Economic Opportunity Now Inc. (NEON)",
    "organization": "Norwalk Economic Opportunity Now Inc. (NEON)",
    "phone": "(203) 899-2420",
    "website": "https://www.facebook.com/Sonoccinc/",
    "description": "Emergency Shelter"
  },
  {
    "addressLine1": "90 Fairfield Avenue",
    "city": "Stamford",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "06904",
    "name": "Shelter for the Homeless New Covenant House of Hospitality (soup kitchen)",
    "organization": "Shelter for the Homeless New Covenant House of Hospitality (soup kitchen)",
    "phone": "(203) 964-8228",
    "website": "http://www.nchstamford.org/",
    "description": "Soup Kitchen and Day Shelter.\n\nWe are open every day to the public and provide three meals daily to anyone hungry. We also have a food pantry program that distributes bagged groceries to individual and families every Tuesday each month. New Covenant House is the only soup kitchen in the greater Stamford area."
  },
  {
    "addressLine1": "597 Pacific St.",
    "city": "Stamford",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "06902",
    "name": "Pacific House Shelter",
    "organization": "Pacific House Shelter",
    "phone": "(203) 348-2792",
    "website": "https://pacifichouse.org/",
    "description": "24 hours a day, 7 days a week, food - breakfast and dinner.\nPacific House is a men's emergency shelter which typically serves 60-85\n\nmen each night but often serves 100 or more men during the winter\nmonths. It operates 365 days, 24 hours per day, and provides breakfast\nand dinner daily. Individuals are allowed to seek shelter regardless of\nsobriety as long as their behavior is appropriate and they follow the\nAgency rules and regulations.\nThe mission of Pacific House is to provide emergency food and shelter for homeless men in lower Fairfield County and to help them live more fulfilling lives through providing support services designed to help them find employment and stable long-term housing.\n"
  },
  {
    "addressLine1": "141 Franklin St",
    "city": "Stamford",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "06901",
    "name": "Inspirica",
    "organization": "Inspirica",
    "phone": "(203) 388-0100",
    "website": "https://www.inspiricact.org/",
    "description": "NOTE: We are part of a coordinated access network in the state of CT, so the only way to actually get into the shelter system here is to call 211\n\nWe are one of the largest providers of homeless services in CT.\n\n\nWe serve single women, families, people with mental illness, and persons living with HIV/AIDS, working across the spectrum of people who are homeless rather than just one segment. We address not just the physical part of homelessness, but all the reasons a person becomes homeless. \n\nRESIDENTIAL PROGRAMS\n\nOur residential services cover the spectrum of housing: emergency shelters; transitional housing; permanent supportive housing; deeply affordable housing; and, rapid rehousing.\nHOUSING PLACEMENT\nOur Housing Placement program is a unique combination of real estate professional and social services provider.\n\nExperienced professionals help clients navigate every step of the process to secure permanent housing including: identifying, locating, and inspecting housing; reviewing contracts/leases; and, moving in. They also help clients take that final emotional step to moving out on their own again.\n\n"
  },
  {
    "addressLine1": "550 High St",
    "city": "Hamilton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45011",
    "name": "Haven House",
    "organization": "Haven House",
    "phone": "(513) 863-8866",
    "website": "https://havenhouseshelter.org/",
    "description": "On behalf of Haven House Emergency Shelter, please allow me to thank you for your interest in our Christian ministry.\n\nHaven House Emergency Shelter, the only shelter in Butler County that accepts children and does not utilize government funding, has been in existence for 32 years.\n\n\nWe are able to continue helping those in need 24 hours a day, 7 days a week solely from contributions made by individuals, churches and local businesses. As a result of the various donations our shelter receives, we are able to stay open 365 days a year.\n\n"
  },
  {
    "addressLine1": "622 East Ave",
    "city": "Hamilton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45011",
    "name": "Serve City Chosen",
    "organization": "Serve City Chosen",
    "phone": "513-737-8900",
    "website": "https://www.serve-city.org/",
    "description": "Serve City is an outreach center in Hamilton, Ohio, dedicated to serving the needs of Butler County's low-income and homeless individuals and families, offering help and hope to our neighbors in need.\nChosen is a 24-hour shelter with 40 beds for men and 12 beds for women. Serve City is a Homeless Shelter and Food Pantry serving those in need in the Bulter County area.\n\nServe City is an outreach center in Hamilton, Ohio, dedicated to serving the needs of Butler County's low-income and homeless individuals and families.\n\nFull Information Per Facebook page:\nOur programs include: The Serve City Food Pantry - open to all of our neighbors in the City of Hamilton and Butler County and focused on providing nutritious food for those dealing with hunger, food insecurity or just need a bit of help.\nQualifying Requirements Over 18 - Photo I.D. only and proof of Butler County residence Under 18 - Birth certificate or insurance card only.\nHours of Operation Tuesday, Thursday & Saturday 10:00 a.m. - 12:00 p.m.\nDonations are gladly accepted at the Pantry Monday through Saturday, 10:00 am to 2:00 pm.\nThe Serve City Emergency Shelter - An emergency overnight shelter for our neighbors in need of a place to say for a night or two. Intake is done from 5pm-10pm and beds are limited to 15 on a first-come, first-served basis. Those arriving before 6pm will have the opportunity to eat dinner with us.\n\nThe Serve City CHOSEN Shelter - A homeless shelter designed for those who are wishing to end the cycle of homelessness and move forward into housing stability and independence. Intake is done between 7am-10pm. Requirements include proof of residence in Butler County, some form of identification, and a clean sex-offender record. (Other rules and requirements will be shared at intake). Neighbors can stay at the Shelter for up to 90 days.\n\nParticipation with our Support Services Coordinators is required. Serve City Transitional Housing - Serve City has both Group Living and Independent Living apartments available to our low-income neighbors in our shelter and our community. Applications are available upon request at the Shelter.\n\n"
  },
  {
    "addressLine1": "P.O. Box 95",
    "city": "Hamilton",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45012",
    "name": "Family Promise of Butler County",
    "organization": "Family Promise of Butler County",
    "phone": "(513) 444-2033",
    "website": "https://www.familypromisebutlercounty.com/",
    "description": ""
  },
  {
    "addressLine1": "120 S broad st",
    "city": "Middletown ",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45044",
    "name": "SHALOM - Serving the Homeless with Alternate Lodging Of Middletown",
    "organization": "SHALOM - Serving the Homeless with Alternate Lodging Of Middletown",
    "phone": "(513) 423-7821",
    "website": "http://www.shalomhomeless.com/",
    "description": "S.H.A.L.O.M. is a Winter time, night time only, church based homeless shelter. S.H.A.L.O.M. is currently in operation during the months of December - March. S.H.A.L.O.M. does not have the facilities to house during the daytime. Our guests must sign in each day at 4pm at the S.H.A.L.O.M. office which is located in the lower level of the First United Methodist Church. We request that all guests and visitors please enter door #8 which is located on the West side of the church. Our guests are provided with dinner, breakfast, showers and all bedding items that are needed. S.H.A.L.O.M. does not have any residential requirements and accepts men, women and families. We have a maximum limit of 30 guests per evening. We do not accept registered sex offenders or anyone who has an active warrant for their arrest. Both of these items are verified before acceptance into S.H.A.L.O.M."
  },
  {
    "addressLine1": "322 Charles St",
    "city": "Middletown",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45042",
    "name": "Mission of Hope Day Shelter",
    "organization": "Mission of Hope Day Shelter",
    "phone": "(513) 217-2027",
    "website": "https://www.instagram.com/hopehousemission/",
    "description": "Homeless Day Center."
  },
  {
    "addressLine1": "P.O. Box 1373",
    "city": "Hebron",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43130",
    "name": "Mary's Safe House",
    "organization": "Mary's Safe House",
    "phone": "(614) 743-4774",
    "website": "mailto:maryssafehouse@yahoo.com",
    "description": "Our Vision: To offer a safe stable home for homeless single mothers. We will identify the steps needed for them to achieve and maintain stability in their own homes.\n\n"
  },
  {
    "addressLine1": "115 Wilson Street",
    "city": "Newark",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43055",
    "name": "St. Vincent Haven Emergency and Transitional Living Shelter",
    "organization": "St. Vincent Haven Emergency and Transitional Living Shelter",
    "phone": "(740) 670-0822",
    "website": "http://svdphaven.org/",
    "description": "St. Vincent Haven is a 26-bed emergency and transitional living shelter serving males 18 years and older who are homeless.\nNormal length of stay is 30 days but that can be extended if the resident is making solid efforts to secure the resources necessary to allow them to obtain and maintain permanent housing.\n\n\nPotential residents can request intake starting at 8:30 a.m. on Saturdays and Sundays and at 4:00 p.m. other days.\nSt. Vincent Haven is open 24 hours on Saturdays and Sundays and 4:00 p.m. until 8:00 a.m. other days.\nWhat services do residents receive?\nServices begin with a comprehensive intake process which provides us with information about the resident and the services they may need to move toward self-sufficiency.\nResidents receive:\n-  Assistance to develop and implement an Exit Plan and a Savings Plan\n-  Assistance to identify potential employers, complete job applications, prepare resumes and practice interviewing\n          skills\n-  Assistance to secure veterans and/or public benefits\n-  Referrals and collaborative case management for housing, mental health and substance abuse issues.\n\n-  Assistance with legal issues through a partnering community service provider\n-  Encouragement to further their educational qualifications through GED preparation assistance and materials and\n          assistance to identify, apply and find financial support for community college or a four-year institution.\n-  Computer and internet access for use for training, education, and obtaining employment\n-  Meals, clothing, personal items\n-  Transportation to appointments, interviews and employment\n\n"
  },
  {
    "addressLine1": "145 Homestead Avenue",
    "city": "Hillsboro",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45133",
    "name": "Highland County Homeless Shelter",
    "organization": "Highland County Homeless Shelter",
    "phone": "(937) 393-0634",
    "website": "http://hcshelter.org/",
    "description": "The Highland County Homeless Shelter is open 365 days a year.\n\nWe can offer assistance & support for up to 28 men, women, and children, for a maximum of 90 days.\n\n\nWe provide beds, food, and shelter, along with access to essential programs & services that enable homeless individuals to rebuild their confidence, and their lives.\n\nWe are happy to serve Highland County & surrounding area's, and we are proud to serve those less fortunate. There is HOPE"
  },
  {
    "addressLine1": "36 Gallup Street",
    "city": "Wilmington",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45177",
    "name": "Women and Children's Shelter Clinton County",
    "organization": "Women and Children's Shelter Clinton County",
    "phone": "(937) 382-6272",
    "website": "http://www.clintoncountyhomelessshelter.com/",
    "description": "The Women and Children's Shelter is located at 36 Gallup Street in Wilmington. This property is our flagship location and first opened in 1988. It houses women, children and also has a couple of family rooms."
  },
  {
    "addressLine1": "390 W Main St",
    "city": "Wilmington",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45177",
    "name": "Clinton County Homeless Shelter",
    "organization": "Clinton County Homeless Shelter",
    "phone": "(937) 382-6272",
    "website": "http://www.clintoncountyhomelessshelter.com/",
    "description": "The Clinton County Homeless Shelter provides emergency shelter, compassionate care and support to the homeless and underprivileged remembering that each resident is a person of worth regardless of age, creed, race, sex or personality."
  },
  {
    "addressLine1": "216 E Wayne St",
    "city": "Lima",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45801",
    "name": "Lima Rescue Mission",
    "organization": "Lima Rescue Mission",
    "phone": "(419) 224-6961",
    "website": "https://www.limamission.org/",
    "description": "Faith-based organization that is funded by donation from local businesses, churches, and individuals. Has a Men's and Youth's Ministry. One free meal served per day, and overnight beds are available. Free clothing is distributed after breakfast. Worship is offered daily.\nCheck In: Check-in time for our overnight dorm is 7 PM, a mandatory chapel service is held at that time. Clothing and personal care items are available.\n\n\nMeal Times: Meals are served twice each day, breakfast is at 6:45 AM and supper is at 5 PM.\n\nMen's Ministry\nFood, Clothing & Shelter\nA free meal is served each night, and breakfast is served in the morning. Clothing is distributed at various times.\nAll those wishing to stay here must be in a service at 7:00 each night, which is conducted by area churches and individuals. After that they will be signed up for a bed in the dorm. They will be given a towel, washcloth, soap, shampoo and razor. Private rooms are available on a limited basis after the individual has spent seven consecutive nights in the dorm. The dorm is a temporary facility only. Each individual is also interviewed after his arrival by a staff member to determine more about his particular situation. We will then work to assist everyone with needs that they may have.\nSpiritual and Individual Care\nBible studies and classes are held throughout the week. Gospel services are held each night. One on one spiritual counseling is also available to any men that are interested."
  },
  {
    "addressLine1": "129 S. Pierce St.",
    "city": "Lima",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45801",
    "name": "Family Promise Lima-Allen County",
    "organization": "Family Promise Lima-Allen County",
    "phone": "(419) 879-4600",
    "website": "http://www.familypromiseoflimaohio.com/",
    "description": "Family Promise Lima in Allen County is a Family Homeless Shelter.\nOther Services:\nHomeless Prevention\nGraduate Support Services\nCommunity Initiatives\n\n"
  },
  {
    "addressLine1": "800 W 6th Ave",
    "city": "Lancaster",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43130",
    "name": "The Foundation Shelters",
    "organization": "The Foundation Shelters",
    "phone": "(740) 653-1960",
    "website": "http://www.foundationshelters.org/",
    "description": ""
  },
  {
    "addressLine1": "1743 East Main Street",
    "city": "Lancaster",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43130",
    "name": "LFCAA Emergency Homeless Family Shelter",
    "organization": "LFCAA Emergency Homeless Family Shelter",
    "phone": "(740) 653-4146",
    "website": "https://www.faircaa.org/",
    "description": ""
  },
  {
    "addressLine1": "1681 East Main Street",
    "city": "Lancaster",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43130",
    "name": "LSS Faith Mission of Fairfield County",
    "organization": "LSS Faith Mission of Fairfield County",
    "phone": "(740) 653-2012",
    "website": "https://lssnetworkofhope.org/faithmissionfc/",
    "description": "Shelter Hours: Open Daily at\n5:30 pm-7:30 am 365 days a year\n\n24 bed facility shelter for single adults (16 men and 8 women).We provide a bed, shower, meals, laundry facilities, short-term case management.\nCan stay up to 30 days.\nServices:\nEmergency Shelter and Food\nCase Management\nPermanent Supportive Housing\nSober Housing\nVeterans Housing and Supportive Services\n\n"
  },
  {
    "addressLine1": "PO Box 215",
    "city": "Lancaster",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43130",
    "name": "The Lighthouse Domestic Violence Shelter",
    "organization": "The Lighthouse Domestic Violence Shelter",
    "phone": "(740) 687-4423",
    "website": "https://www.lancasterlh.org/",
    "description": ""
  },
  {
    "addressLine1": "1536 E 30th St",
    "city": "Lorain",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44055",
    "name": "Haven Center Homeless Shelter",
    "organization": "Haven Center Homeless Shelter",
    "phone": "(440) 277-9272",
    "website": "https://myneighborhoodalliance.org/index.php/shelter/",
    "description": "Lorain County's only 24-hour, 365-day emergency shelter for men, women and children. But we do more than offer a full-service, 68-bed facility that provides meals, toiletries, laundry, clothing, and just about anything other item our clients need including connect them with items they will need to transition into independent housing.\n\nWe help our clients break the cycle of no income and no housing. We develop case plans for our clients which include referrals for work, vocational rehab programs, GED classes, bus tickets for transportation, and help them apply for affordable housing.\n\n\nOur facility always has a waiting list. With less resources available to people who become homeless in our county, we are continually forced to do more with less and we rely on our partner organizations and nonprofit groups that help us serve our clients."
  },
  {
    "addressLine1": "2726 Caroline Ave",
    "city": "Lorain",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44055",
    "name": "St. Joseph Overnight Shelter",
    "organization": "St. Joseph Overnight Shelter",
    "phone": "(440) 242-0056",
    "website": "https://www.ccdocle.org/locations/st-elizabeth-center",
    "description": "Shelter hours/days: Monday - Sunday, 5:00pm - 8:00am (October through mid-May).\n\nMen's Overnight Shelter\n\nOpen seven days a week 365 days a year, our Men's Overnight Emergency Shelter serves adult men in Lorain County who are homeless or at risk of homelessness. We provide shelter for up to 50 men, with a focus on supporting those with special needs."
  },
  {
    "addressLine1": "440 West Lorain Street",
    "city": "Oberlin",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44074",
    "name": "Family Promise of Lorain County",
    "organization": "Family Promise of Lorain County",
    "phone": "(440) 774-6743",
    "website": "https://www.familypromiselorainco.org/",
    "description": "The Lorain County Family Promise IHN program utilizes a cost-efficient and effective community response to the local declining housing situation. We strive to provide a way to house families who are experiencing homelessness by uniting 5 distinct components:\nhost congregations\nvolunteers\nsocial service agencies\na day center and transportation\nGuests in the program are Moms, Dads, or couples with children.\nDuring the day, guest families stay at a day center. While there the Network Director, who manages all components of the program, works intensively with the families as they seek childcare, housing, jobs, and other needed resources.\n\nAt night, guest families stay at a host congregation which provides shelter, meals, and support.\nVolunteers prepare meals, provide supplies, host evening activities, sleep overnight, staff the day center, and most importantly provide human compassion.\nA Network van is available to transport guests between host congregations and the day center; children are transported to their schools of origin, providing for continuity in their education during a time of instability.\n\nThe Guest Guidelines call for a maximum stay of 30 days. However, Network Directors often extend the stay as long as the family is making good-faith efforts to secure housing. For this reason families typically stay for 60 days or more.\n\nThere is no cost to join the Network. The cost for hosting is about $200 per year, based on minor supply needs. Members of the congregation and local businesses often donate the necessary supplies."
  },
  {
    "addressLine1": "124 W. Third St.",
    "city": "Mansfield",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44902",
    "name": "Harmony House Homeless Services",
    "organization": "Harmony House Homeless Services",
    "phone": "(419) 522-2323",
    "website": "http://harmonyhousehomeless.org/",
    "description": "Shelter for homeless men, women and children, 90 day maximum stay, referrals, case management, afterschool program and tutoring, medical screening, transportation, laundry, comprehensive case management.\n\nWE PROVIDE\n    Clean and safe shelter through our 65 bed emergency shelter facility\n    Case management services\n    Weekly Job Readiness and Life Skills meetings\n    Transportation for job searches\n    Assistance with first-month rent and deposit\n    After school and summer tutoring and SAFE Programs for children at Mansfield City Schools\n    Provision of socks, underwear, personal care items, and bedding\n    Laundry services\n    Medical Screening and Referrals\n    Permanent Housing\n    Education in utilizing community resources\n    Resolution to educational, employment, medical, mental health and legal problems in a supportive atmosphere\n\n\nAdmission Criteria\n    Homeless Status\n    Age 18 (unless accompanied by legal guardian)\n    Not actively using alcohol/drugs\n    Willingness to follow case plan\n    Willingness to follow program rules"
  },
  {
    "addressLine1": "401 West Vine Street",
    "city": "Mount Vernon",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43050",
    "name": "Winter Sanctuary Homeless Shelter",
    "organization": "Winter Sanctuary Homeless Shelter",
    "phone": "(740) 392-9277",
    "website": "http://wintersanctuary.com/",
    "description": "Seasonal overnight shelter\nThe shelter operates at 401 W. Vine St. in Mount Vernon, with separate sleeping quarters accommodating up to 18 men and 8 women, as well as bathroom, kitchen and laundry facilities.\nWe provide a warm, clean, well-maintained and secure facility for men and women who have had to camp in the open, sleep in cars, or stay with friends or relatives.\nThe shelter is open Nov. 1-April 1.\n"
  },
  {
    "addressLine1": "27375 Ohio 7",
    "city": "Marietta",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45750",
    "name": "Cornerstone Messianic Congregation and Ministries",
    "organization": "Cornerstone Messianic Congregation and Ministries",
    "phone": "(740) 374-5381",
    "website": "https://www.facebook.com/people/Cornerstone-Messianic-Congregation-and-Ministries/100064506889495/",
    "description": "Emergency shelter and services provided.\n\nCMCM is a 24/7 Emergency Ministry working with individuals, families and the community to provide emergency shelter, food, and guidance. Our extended programming also includes education in a variety of areas including alcohol and substance abuse, domestic violence, stress management, relationships, communications, and Biblical inquiries."
  },
  {
    "addressLine1": "PO Box 122",
    "city": "Marietta",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45750",
    "name": "EVE, Incorporated",
    "organization": "EVE, Incorporated",
    "phone": "(740) 374-5819",
    "website": "https://eveshelter.com/",
    "description": "The hotline is staffed 24 hours a day, 7 days a week by trained staff - 800-974-3111\n\nEmergency shelter and other services for domestic violence and sexual assault victims.\n\nServes men, women and children.\n\nServices offered include Emergency Shelter, Transitional Housing Program, Transitional Aftercare Program, Legal Advocacy,Counseling, Groups, Children's Program, R.H.I.S.C.O. (The Rural Homelessness Initiative of South Central Ohio: a collaboration with Washington-Morgan Community Action), Drug and Alcohol Prevention Education, and a Supervised Visitation and Exhange Center.\n\nEVE is totally grant and donation funded and relies heavily on donations from the community, both financial and physical, to continue providing services free-of-charge to our clients."
  },
  {
    "addressLine1": "2735 Ohio 7",
    "city": "Marietta",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45750",
    "name": "Cornerstone Ministries Faith Based Shelter",
    "organization": "Cornerstone Ministries Faith Based Shelter",
    "phone": "(740) 374-5381",
    "website": "https://www.emeraldjennyfoundation.org/listing/cornerstone-ministries-emergency-shelter/",
    "description": ""
  },
  {
    "addressLine1": "1725 Latrobe St",
    "city": "Parkersburg",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "26101",
    "name": "Latrobe Street Mission",
    "organization": "Latrobe Street Mission",
    "phone": "(859) 443-0735",
    "website": "https://www.latrobestreetmission.org/",
    "description": "The Latrobe Street Mission offers emergency housing to anyone in need. There is no minimum or maximum length of stay.\n\nIf you need a place to stay, please come to the Mission between 4-6 pm. If you can NOT come between 4 to 6 pm, come through the glass double doors on the parking lot side of Latrobe. Come to the front desk and ask for Brenda.\n\nResident Schedule\nWake-up: 7:00 am\nBreakfast: 7:15 am\nMorning Devotional: 8:00 to 8:15 am\nCheck-out: 8:30 am\nCheck-in: 4:00 to 6:00 pm\nShowers: 4:30 to 5:30 pm\nFamily showers: 5:30  to 6:30 pm\nOther showers: 6:30 to 9:00 pm\nQuiet Time: 9:00 pm\nCurfew: 9:00 pm\nLights Out: 11:00 pm\nThe Emergency Shelter fulfills immediate basic needs (food, shelter, clothing), connects individuals with available resources, and guides them toward experiencing freedom and self-sufficiency.\n\nIndividuals seeking emergency shelter can check-in at any point during the day to complete an in-take form and drug screening. Shelter services are available to men, women and children. Separate, secure areas separate men from the women and children.\n\n\nOn week days, local churches and groups provide dinner for all residents. Hot showers and laundry services are also available to any resident. Shelter doors are locked at 9pm each night and residents are only permitted to leave with approval from the Shelter Manager (Exception are made for those who work later than 9pm).\n\nLight breakfast snacks are available each morning. Residents are required to exit the facility no later than 8:00 a.m. each morning.\n\nEvery resident must:\n\n    Have a photo ID\n    Pass a background check, be free of any open warrants and cannot be on the sex-offender registry\n    Pass an initial drug screening to be permitted to stay, as well as agree to random testing throughout their stay\n\n    Complete a tracking card which tracks referrals to area services such as identification services, job resources, veteran assistance, etc. A standing-meeting is held every Tuesday at the Mission which brings these resources to the resident.\n    Agree to a maximum stay of eight weeks in the Mission. Any exceptions must be approved by the Shelter Manager.\n    Agree to follow all posted rules\n\nGrace Project:\nThe Grace Project is Latrobe Street Missions long-term recovery program designed to assist individuals to attain and maintain a life of freedom from addiction and other life-dominating behaviors. The Grace Project is not an addictions treatment program, rather, it is a lifestyle recovery program.\n\nMeals: The Latrobe Street Mission provides dinner Monday through Friday at 6:00 pm. Old Man Rivers provides a meal on Saturdays and Sundays at 4:30 pm. (Meals on Saturdays and Sundays at 4:30 pm are open to the community. You do NOT need to be a Latrobe resident to join us for those meals.)\n\nClothing\nClothing is provided to anyone staying at the shelter. If youre not staying at Latrobe, but are in need of clothing come to the shelter on Thursday from 11 to 2 or contact the shelter (304) 893-9248 in case of an emergency need."
  },
  {
    "addressLine1": "413 8th Street",
    "city": "Parkersburg",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "26101",
    "name": "House To Home",
    "organization": "House To Home",
    "phone": "(304) 893-5353",
    "website": "https://www.housetohomepkb.com/",
    "description": ""
  },
  {
    "addressLine1": "534 5th Street",
    "city": "Parkersburg",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "26101",
    "name": "Salvation Army Parkersburg Shelter",
    "organization": "Salvation Army Parkersburg Shelter",
    "phone": "(304) 485-4529",
    "website": "http://salvationarmymwv.org/get-help/emergency-shelters/",
    "description": "Emergency shelter, transitional housing program, other services.\nServices:\nserve the homeless by providing food and overnight lodging.\nprovide educational, counseling and vocational services to homeless and destitute individuals and families for extended periods.\n\naddress long-term specific issues of youth for whom family care is undesirable or unavailable. Education, counseling, health care and specific training seek to meet the needs of such groups as pregnant teens, emancipated minors, and wards of the juvenile court.\naddress specific health or societal driven needs of particular populations."
  },
  {
    "addressLine1": "1978 Mount Vernon Rd.",
    "city": "Dunwoody",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "30338",
    "name": "Family Promise of North Fulton - DeKalb",
    "organization": "Family Promise of North Fulton - DeKalb",
    "phone": "(770) 609-5407",
    "website": "http://www.familypromisenfd.org/",
    "description": "Non-denominational, non-sectarian organization for families in transition. Family Promise links to existing community resources (social service agencies) to more effectively and efficiently work with families. Host congregations provide lodging, meals and hospitality\n\nFamily Promise works with homeless families to tailor individualized plans to help them take the necessary steps toward lasting independence.  Families rotate on a weekly basis between congregations, with congregations hosting for one week a quarter, up to four times per year.\n\nAll Family Promise guest families receive:\n    Overnight accommodations at a local congregation\n    3 meals a day\n    Intensive case management\n    Family Day Center with internet access, laundry, and showers\n    Social support from volunteers\n    Linkage with needed social and educational services\n\nHost Congregations (places of worship that physically house our families each week):\n    Temple Sinai\n    Dunwoody United Methodist Church                              \n    Mount Vernon Presbyterian Church and Bnai Torah\n    St. Lukes Presbyterian Church                                     \n    Roswell United Methodist Church                                  \n    Northminster Presbyterian Church                                   \n    Temple Beth Tikvah\n    Roswell Presbyterian Church\n    Kingswood United Methodist Church\n    Alpharetta Presbyterian Church\n    St. Dunstan's Episcopal Church and Holy Innocent's Episcopal Church\nDay CenterWe have a Day Center where families can come during the day, that has computers, internet access, laundry and shower facilities. We also offer case management, employment resources, and the support of the North Fulton/Dekalb community.\n\n"
  },
  {
    "addressLine1": "995 Roswell Street NE, Suite 100",
    "city": "Marietta",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "30060",
    "name": "Center for Family Resources Housing Assistance",
    "organization": "Center for Family Resources Housing Assistance",
    "phone": "(770) 428-2601",
    "website": "http://thecfr.org/",
    "description": "The Center for Family Resources places families in their own apartments, providing safety and security away from a group shelter environment. CFR's housing programs provide affordable, independent living options that include supportive services like childcare assistance, transportation, budgeting workshops and other life-skills classes. CFR is able to provide these housing services to the community with the partnership and participation from various apartment complexes in Cobb County.\nShort-Term Housing\nCFR's short-term housing program is a temporary \"shelter\" in a fully-furnished two-bedroom apartment for families that are currently or imminently homeless.\nRapid Re-Housing\nOur Rapid Re-Housing program assists currently homeless families in obtaining a permanent place to live by providing financial assistance for deposits, move-in costs and other obstacles toward obtaining an apartment.\n\nTenant-Based Rental Assistance\nThe TBRA program assists families who have a temporary inability to maintain housing. In cases of unexpected financial setback, TBRA can provide assistance to help families stay in their current home or obtain a new lease.\n\nIn order to be admitted into any of our housing programs, you must:\n1. Be a Cobb County resident\n2. Have resided in Cobb County for at least the past two months\n3. Have at least one minor child (under 18) in your household\n"
  },
  {
    "addressLine1": "995 Roswell Street, NE, Suite 100",
    "city": "Marietta",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "30060",
    "name": "The Center For Family Resources",
    "organization": "The Center For Family Resources",
    "phone": "(770) 428-2601",
    "website": "http://thecfr.org/",
    "description": "Services Provided: Assistance with: Rent, utilities, prescriptions, emergency shelter, employment services, life management skills, budget counseling, and food pantry available.\n\nHours of OperationsMonday: 8:30am - 7:00pmTuesday: 8:30am - 5:00pmWednesday: 8:30am - 5:00pmThursday: 8:30am - 5:00pmFriday: 8:30am - 5:00pm\n\nIntake hours\nare on a first come, first serve basis. You must bring a Picture I.D. and Social Security Card for yourself, and a Social Security Card or Birth Certificate on all household members. You must meet residency requirements and income eligibility.\n\nTypes of Housing Programs\nShort Term Housing\nShort Term Extended Housnig\nTransitional Housing"
  },
  {
    "addressLine1": "55 Elizabeth Church Road",
    "city": "Marietta",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "30060",
    "name": "Elizabeth Inn Emergency Shelter (Marietta)",
    "organization": "Elizabeth Inn Emergency Shelter (Marietta)",
    "phone": "(770) 427-9862",
    "website": "http://www.mustministries.org/",
    "description": "Shelter for men women and children. Please arrive no earlier than 4:30 pm daily to stand in line. Space is limited and is offered on a first come first served basis, depending on availability. The priority is given to families and returning prospective guests (from the day before).\n\n\nThe shelter sleeps 64 people - 40 beds for men and 24 beds for women and children.\n\n\n\nRequirements to stay in the shelter are the following: You must have a photo ID, if you have children, either a social security card or birth certificate is needed for each child. You must be clean and sober and remain clean and sober in order to stay at the Elizabeth Inn.\n\nServices\nGroceries\nHot Meals (pantries, distribution sites, and service kitchen)\nEmergency Shelter\nSupportive Housing\nClothing\nEmployment Services\nSeasonal Outreach (Summer Lunch and Christmas Toy Shop)\nDonation Center"
  },
  {
    "addressLine1": "34 South Main Street",
    "city": "Middletown",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45044",
    "name": "Middletown Hope House",
    "organization": "Middletown Hope House",
    "phone": "(513) 849-2025",
    "website": "https://hhmission.org/",
    "description": ""
  },
  {
    "addressLine1": "1218 W. State Street",
    "city": "New Castle",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "16101",
    "name": "The Crisis Shelter of Lawrence County",
    "organization": "The Crisis Shelter of Lawrence County",
    "phone": "(724) 652-9036",
    "website": "https://www.crisisshelter.org/",
    "description": "Temporary emergency shelter for up to 36 individuals fleeing abuse.\n\nEmergency Shelter\n\nThe agency provides temporary shelter to women and children who are in need of emergency housing as a result of abuse or threats of abuse.\n\n\nEmergency shelter is available to residents of Lawrence County as well as outside the county. Preference is given to Lawrence County residents if space is limited.\n\n\nThe facility maintains 11 bedrooms that can accommodate up to 36 individuals. Cribs and trundle beds are available as needed. The units are designed to accommodate family needs depending on size and special circumstances. There is one completely handicapped assessable unit.\n\nArrangements for male victims of domestic violence who need emergency shelter may be provided, including referrals to community resources, utilizing legal options, and counseling services.\n\nThree play areas for children are available too outside areas and one inside playroom. Childcare, supervised by part time staff, is offered to allow individuals to attend groups, meet with a counselor or case manager, or attend appointments outside the agency. Tutoring is offered on site to adults and children.\n\n\nService plans are designed to address individual needs focusing on life skills including finances, housing, education, employment, and self esteem. Counseling and groups are available on site. Referrals to community services are provided and every attempt is made to provide food, toiletries, linens and emergency clothing.\n\nIf a family needs to relocate from the area, staff will assist in making the transition.\n\nStays are funded for 30 days with extensions available depending on individual needs.\n\nEmergency shelter operates on a 24 hour basis, 7 days a week. All staff members have received 80 hours of domestic violence, sexual assault and crime victim training.\n\n\n\n\n\nFull list of Services:\n\n24 hour hotline answered by trained staff and volunteers who offer counseling and information about options and services available\n\nTemporary emergency shelter for up to 36 individuals fleeing abuse\n\nFour transitional housing apartments with residency for up to two years\n\nProtection From Abuse (PFA) screenings and accompaniment\n\n\nIndividual and group counseling and workshops for victims of domestic violence and sexual assault\n\n24-hour medical and legal advocacy and accompaniment\n\nSystem and individual advocacy\n\nAssistance to victims of juvenile offenders\n\nAssistance to victims of other serious crimes with emphasis on the elderly\n\nCommunity education including a speakers bureau for groups, churches, civic organizations and others\n\nPrevention education in all nine county schools\n\nTraining for professionals (social service agencies, hospital personnel, courthouse staff, and others) includes intervention practices\n\nFood pantry and personal products for shelter residents\n\n"
  },
  {
    "addressLine1": "1018 Rebecca Street",
    "city": "New Castle",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "16101",
    "name": "City Rescue Mission Women's Ministry",
    "organization": "City Rescue Mission Women's Ministry",
    "phone": "(724) 652-4349",
    "website": "https://cityrescuemission.org/",
    "description": "Providing Temporary, Emergency Shelter for HomelessWomen and Children.\n\nProvides temporary, emergency shelter for homeless women and children. Those in need of shelter or referring agencies should contact the Covenant House staff prior to arrival.\n\n\nAs the City Rescue Mission is a Christian ministry, all shelter guests are required to participate in daily devotions, bible studies and spiritual counseling."
  },
  {
    "addressLine1": "25 West Rayen Avenue",
    "city": "Youngstown",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44503",
    "name": "YWCA Barbara Wick Transitional House",
    "organization": "YWCA Barbara Wick Transitional House",
    "phone": "(330) 746-6361",
    "website": "https://www.emeraldjennyfoundation.org/listing/ywca-barbara-wick-transitional-house/",
    "description": "Services for women and women with children. Transitional housing, permanent supportive housing. Must be Mahoning County resident.\n\nComplete description\nA  8 month program designed to meet the needs of low- or no-income homeless women, 18 years and older, with or without children.  This program provides communal  and apartment style housing (single room occupancy) with supportive services.\n\nEmergency items such as food, bus fare coupons, and personal items as needed\n\nAssistance in locating child care services, permanent housing, and health services\nCase management services including information and referrals to legal, substance abuse, mental health services, vocational training, and support groups\nEnrichment activities for children\nHousehold management skills training\nRelationship and parenting skills training\nAccess to Ohio Benefits Bank"
  },
  {
    "addressLine1": "319 S Croton Avenue",
    "city": "New Castle",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "16103",
    "name": "City Rescue Mission For Men",
    "organization": "City Rescue Mission For Men",
    "phone": "(724) 652-4321",
    "website": "https://cityrescuemission.org/",
    "description": "Emergency Shelter Meals Clothing. Open 24 hours per day, 7 days per week. Provides temporary, emergency shelter for homeless men. This program provides men with food, shelter, spiritual counseling, casework, and networking.\n\nAs the City Rescue Mission is a Christian ministry, all shelter guests are required to participate in spiritual counseling as well as attend daily devotions and traditional evening Church services.\n\n\nCrossroads Emergency Shelter: Provides temporary, emergency shelter for men experiencing homelessness.  This program provides men with food, shelter, spiritual counsel, casework, and networking.\nMen's Recovery Program: Admittance to program is after successful evaluation as a Crossroads Shelter guest.  A structured, residential program for men with addictions or other life issues.  This program focuses on biblical discipleship and ministers for life change through Bible-based recovery.\n"
  },
  {
    "addressLine1": "962 M. L. King Blvd",
    "city": "Youngstown",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44501",
    "name": "Rescue Mission of Mahoning Valley",
    "organization": "Rescue Mission of Mahoning Valley",
    "phone": "(330) 744-5485",
    "website": "https://rescuemissionmv.org/",
    "description": "Emergency Shelter Food Pantry for Community.\nA PLACE TO SLEEP\nRESCUE MISSION OF THE MAHONING VALLEY IS THE ONLY EMERGENCY SHELTER IN MAHONING COUNTY AND WE ARE BLESSED TO BE ABLE TO HELP YOU!\n\nIf you find yourself in need of a place to sleep, the best thing to do is call 330-744-5485. Men should ask to speak with Mens Services and Women and Families should ask for Family Services.\n\n\nA staff member will be able to answer your questions and let you know if there are any open beds.\n\nThe Mission provides shelter for men (Mens Services) and also has beds for families, single women, single women with children and single men with children (Family Services).\n\nThree full meals daily are offered to everyone who stays at the Mission.\n\nTransitional Program\nClients in our Transitional Program are permitted a fixed number of overnight stays at The Mission per month.\nBasic services provided include food, shelter, clothing, overnight provisions, limited social service casework, personal information entered in Homeless Management Information System (HMIS).\nFood\nTwo full meals are served daily to the public at our Emergency Shelter located at 962 Martin Luther King Jr. Blvd. in Youngstown\n    Breakfast: 6:15 a.m.-7:15 a.m.\n    Dinner: 6:00 p.m.-7:00 p.m.\nShelter\nThe Mission turns no one away who is need of a warm bed for the night. During our severe Ohio winters, The Mission has literally been a lifeline for those with nowhere to seek shelter. We provide three full meals to everyone staying at the shelter.\nIndividuals and families who stay at The Mission, whether just for a night or for longer periods, find that life there is orderly and filled with purpose. The Mission has firmly established rules and regulations concerning on-site provisions for our clients.\n\nThe Mission is a drug-, alcohol- and tobacco-free environment. Residents and Staff are subject to random testing for all three. Further, everyone staying at The Mission has a daily work assignment, with designated areas of responsibility and accountability throughout the facility. Privileges and penalties are applied without bias.\nThe Rescue Mission of Mahoning Valley  provides non-denominational chapel services and Bible studies. Residents are encouraged to learn more about Jesus Christ and His teachings on love, compassion and mercy.\nIf you are in need of emergency shelter or know of someone who is, please call 330-744-5485 and ask for a Client Advisor."
  },
  {
    "addressLine1": "1555 Belmont Ave",
    "city": "Youngstown",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44504",
    "name": "Helping Hands Ministry Day Shelter",
    "organization": "Helping Hands Ministry Day Shelter",
    "phone": "(330) 480-0810",
    "website": "https://hhmin.org/",
    "description": "Provides a homeless day shelter and food pantry. Call for more details."
  },
  {
    "addressLine1": "238 Tod Lane",
    "city": "Youngstown",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44504",
    "name": "Beatitude House",
    "organization": "Beatitude House",
    "phone": "(330) 744-3147",
    "website": "http://www.beatitudehouse.com/",
    "description": "Serves: Women and children, homeless and formerly homeless, low income; mental health; families; low-income; domestic violence.\n\nTransitional Housing\nOur transitional housing program, A House of Blessing, provides a family with a fully-furnished apartment while mothers work on their educational goals and employment. A woman's length of stay is dependent on her needs and progress toward goals. To be eligible, a woman must be homeless according to HUD definition.\n\nPermanent Supportive Housing\nIn addition to the transitional housing program, Beatitude House also offers a permanent supportive housing program. To be eligible, a woman must be homeless with a documented disability."
  },
  {
    "addressLine1": "615 Eighth Street",
    "city": "Portsmouth",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45662",
    "name": "Friends of Scioto County Homeless Shelter",
    "organization": "Friends of Scioto County Homeless Shelter",
    "phone": "(740) 353-4085",
    "website": "https://www.sciotogives.org/",
    "description": "Mission:\nOperation Safety Net, the Scioto County Homeless Shelter, a caring family-oriented facility which recognizes the need for a safe, yet motivational and inspirational environment, aims to ensure the highest quality short-term stay during a family or individual's transitional period. We seek to aggressively provide services designed to successfully move persons from emergency shelter to permanent housing.\n\n\nPrograms and Services:\nProvides emergency shelter in a clean, well-run facility.\n\nAssists clients in securing decent affordable housing.\nOffers budget management classes, case management and coordination, goal setting, service referrals, permanent housing placement, nutrition education, daily living skills, time and stress management, parenting skills and substance abuse referrals.\nProvides mental health referrals through on-site evaluations and assessments.\nGives direct assistance to clients needing deposit and rental aid in maintaining to obtaining.\n\nOffers job seeking skills and resume writing classes.\nOperates a food pantry."
  },
  {
    "addressLine1": "109 W. Second St.",
    "city": "Waverly",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45690",
    "name": "Bridgehaven Homeless Shelter",
    "organization": "Bridgehaven Homeless Shelter",
    "phone": "(740) 941-4348",
    "website": "http://www.pikecountyoutreach.com/",
    "description": ""
  },
  {
    "addressLine1": "204 S Mary Ellen St",
    "city": "204 S Mary Ellen St",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45065",
    "name": "Bernie's Homeless Shelter",
    "organization": "Bernie's Homeless Shelter",
    "phone": "(513) 494-2307",
    "website": "https://www.newhousingohio.org/",
    "description": ""
  },
  {
    "addressLine1": "14390 Laplaisance Road Suite 106",
    "city": "Monroe",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "48161",
    "name": "Family Counseling and Shelter",
    "organization": "Family Counseling and Shelter",
    "phone": "(734) 241-0180",
    "website": "https://twitter.com/fcssmc",
    "description": "Emergency Shelter Direct Domestic Viloence Services"
  },
  {
    "addressLine1": "300 Miami street",
    "city": "Urbana",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "43078",
    "name": "The Caring Kitchen",
    "organization": "The Caring Kitchen",
    "phone": "(937) 653-8443",
    "website": "http://www.caringkitchen.org/",
    "description": "Emergency Shelter\n    Case management with referrals to other professional agencies\n    On-site emergency shelter\n    Tutoring\n\n    Social activities\n    Three meals a day\n    Clothing\n\nLength of stay is 2 weeks to 3 months. Each case is evaluated on an individual basis.\n\nHours:\n7 days a week/24 hours a day\n\nWheelchair accessible\nNightly bed capacity is 17\nFood Pantry\n\nA 3-day supply of food will be provided to those in need. Appointments are to be made for the food pantry. Please call 937-653-8443 to make an appointment.\n\nHours:\nMonday - Friday\n10:00 AM - Noon\nSoup Kitchen\n\nEveryone is welcome to come in and enjoy a good, hot, balanced meal. There is no charge to the community for this service.\n\nHours:\nLunch: Monday - Friday\n11 AM - 12:30 PM\nDinner: Monday - Thursday\n6 PM - 7 PM"
  },
  {
    "addressLine1": "155 Tod Ave NW",
    "city": "Warren",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "44485",
    "name": "Warren Family Mission",
    "organization": "Warren Family Mission",
    "phone": "(330) 394-5437",
    "website": "https://warrenfamilymission.org/",
    "description": "The mission has a women's 1 year program, women and children's program, and a shelter for men.\n\n\nHannahs House is a one-year Christian faith-based program helping women of all ages to overcome life-controlling problems, substance abuse and challenges in their lives. The residents of Hannahs House are taught and encouraged to grow emotionally and spiritually in order to turn their lives around and to experience hope, healing and freedom.\n\n\n\n\nHannahs House offers: Christian Foundational Classes, GED Readiness, Life Skills Classes, Coping Skills, Job Readiness, 12-Step Faith Based Program, Counseling, After Care Program, Agency Referral, WOW ministry of creative arts.\n\n\nMen's Home\n\n\nDISCIPLESHIP PROGRAM INCLUDES: (One Year Duration) Life Skills, Referral Help, GED Readiness, Money Management Training, Spiritual Guidance (inter-denominational), Job Search Assistance, Christ Centered Recovery, Client Advisory\n\n\n\nResidential Program Clients of the rescue mission receive daily meals, laundry facilities, toiletries, clothing, and transportation to appointments such as medical clinics, to and from work and to rehabilitation outpatient appointments.\n\nHOW WE ARE HELPING THE COMMUNITY\nListed below are some of the services that we offer. We also do referrals and work closely with many Teen Challenge locations around the country. Feel free to call us and see how we can help you.\nGENERAL SERVICES TO THE PUBLIC\nDaily Community Meals\nMonday Friday: Lunch 12:00-12:30\nMonday Friday: Dinner 4:00-4:30\nSaturday: Lunch & Dinner 12:00-12:30\nSunday Only: Breakfast 8:30-9:00\n(Times are subject to change. Please check our Facebook Page for any announcements)\nHost the Summer Lunch Program for children 18 and under Mon.-Fri. 12:00-12:30\nProvide Food for 2 other Feeding Sites\nMonthly Supplemental Food Bags Open: Tues-Thurs 9:30-12:00 & 1:00-3:00 Current Photo ID Required or\nProof of Residency\nBreads & Sweets When Available\nClothing Room Open: Tues-Thurs 9:30-12:00 & 1:00-3:00 Current Photo ID Required or Proof of Residency\nHousehold Items - Open: Tues-Thurs 9:30-12:00 & 1:00-3:00\n\nHoliday Community Dinners (Easter; Thanksgiving; & Christmas)\nSchool Backpack Distribution for low income families\nChristmas Toy Distribution for low income families"
  },
  {
    "addressLine1": "11483 State Route 41",
    "city": "West Union",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45693",
    "name": "Adams County Ohio Shelter for the Homeless",
    "organization": "Adams County Ohio Shelter for the Homeless",
    "phone": "(937) 544-8164",
    "website": "mailto:charbrown@adamscountyhomeless.org",
    "description": ""
  },
  {
    "addressLine1": "1080 E. Main Street",
    "city": "Xenia",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45385",
    "name": "Miami Valley CAP Donnellan Shelter",
    "organization": "Miami Valley CAP Donnellan Shelter",
    "phone": "(937) 376-3111",
    "website": "https://miamivalleycap.org/",
    "description": ""
  },
  {
    "addressLine1": "124 S Detroit Ave",
    "city": "Xenia",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45385",
    "name": "Schneider House of Hope",
    "organization": "Schneider House of Hope",
    "phone": "(937) 372-0705",
    "website": "http://ihnofgreeneco.org/",
    "description": "The Schneider House of Hope Office hours are from 8:00 AM to 5:00 pm Monday through Friday except for holidays.\n\n\nOpen to families with children. call for appt to apply for residency. housing is dormitory style and 3 meals are served daily.\nThe mission of Interfaith Hospitality Network of Greene County is to reflect Gods love by providing short term housing and assistance for displaced families through a united community network.\nLength of Stay: Up to 60 daysBeds: 24 beds\n"
  },
  {
    "addressLine1": "190 S. Orange Street",
    "city": "Xenia",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45385",
    "name": "Harding Place Transitional Housing",
    "organization": "Harding Place Transitional Housing",
    "phone": "(937) 376-7747",
    "website": "https://miamivalleycap.org/",
    "description": ""
  },
  {
    "addressLine1": "1087 W 2nd St",
    "city": "Xenia",
    "state": "Ohio",
    "stateAbbreviation": "OH",
    "postal": "45385",
    "name": "Bridges of Hope",
    "organization": "Bridges of Hope",
    "phone": "(937) 708-8286",
    "website": "http://skbridgesofhope.org/",
    "description": ""
  }
]