[
  {
    "addressLine1": "53 E. Bel Air Avenue Suite 3",
    "city": "Aberdeen",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21001",
    "name": "Harford Family House, Inc.",
    "organization": "Harford Family House, Inc.",
    "phone": "(410) 273-6700",
    "website": "https://harfordfamilyhouse.org/",
    "description": "Harford Family House serves families experiencing homelessness with children. This could be a mom and children, a dad and children or a married couple with children. It could also be another adult, such as a grandmother or aunt, with legal custody of children under the age of 18. We also serve unaccompanied young adults ages 18 to 24 who are experiencing homelessness.\nHarford Family House currently receives all service referrals from the Harford Community Action Agency who screens prospective families for eligibility. harfordcaa.org\n\n\nEmergency Shelter ProgramThis temporary six month program moves a family from homelessness into safe, basic and decent housing. A fully furnished one or two bedroom apartment greets the family as they begin their journey towards self-sufficiency. Once stabilized, the family can begin to work on their individual goals which may include: identify and apply for housing; credit repair; increasing marketable job skills; finishing a GED program; finding employment; and addressing medical and mental health needs, positioning the family for independence and self-sufficiency.\n\nPermanent Supportive Housing\nFamilies who have one family member with a diagnosed disability are eligible to receive permanent supportive housing. The goal is the same: to transition these families to permanent stable housing and a better life. This may take longer than a year and look differently because of the increased barriers families with disabilities face. Families in this program work on individual goals which may include: obtaining disability benefits; applying for subsidized housing programs; participating in supported work programs; and stabilizing their medical and/or mental health needs."
  },
  {
    "addressLine1": "1221 C Brass Mill Road",
    "city": "Belcamp",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21017",
    "name": "Welcome One Emergency Shelter",
    "organization": "Welcome One Emergency Shelter",
    "phone": "(410) 272-2229",
    "website": "https://welcomeoneshelter.com/",
    "description": ""
  },
  {
    "addressLine1": "80 West Street",
    "city": "Annapolis",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21401",
    "name": "Anne Arundel County Department of Social Services, Homeless Services",
    "organization": "Anne Arundel County Department of Social Services, Homeless Services",
    "phone": "(410) 269-4500",
    "website": "https://twitter.com/aacountygovt",
    "description": "Anne Arundel County DSS (Department of Social Services), Homeless Services. This department handles all of Anne Arundel County Homeless Services.\n\nFor assistance with crises: Provides emergency services to adults and families in crisis who are homeless. Assistance may be provided to one of the area's homeless shelters. Counseling, brokering community resources/services, and advocacy also available.\n\n\nTo be eligible: Must report available income and other financial sources. Must not receive benefits from another jurisdiction. Clients must have all mental and/or physical health prescriptions in their possession to be eligible for shelter referral. Adults and families in crisis who are homeless and in need of assistance. Must be substance free. Must apply in person to the AADSS office for assistance."
  },
  {
    "addressLine1": "10 Hudson St",
    "city": "Annapolis",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21401",
    "name": "Light House - Homeless Prevention Support",
    "organization": "Light House - Homeless Prevention Support",
    "phone": "(410) 349-5056",
    "website": "http://www.annapolislighthouse.org/",
    "description": "The Light House is both a facility and a program. We provide emergency shelter and affordable housing solutions for individuals and families who are homeless or at risk of becoming homeless.\n\nEmergency Shelter at 10 Hudson Street\nOur 24,400 square foot facility at 10 Hudson Street is a central location that houses our many programs and services. This location acts as the emergency shelter for our Residential Program clients, and shelters 45 individuals and 5 families with up to 20 children.\n\nResidential clients are provided with:\n\n    Basic Needs: food, shelter, clothing, transportation to appointments, etc.\n    Case management: mental health stabilization, substance abuse prevention support, health care and support program enrollment Financial assistance: prescriptions, vital documents, etc.\n    Housing search and placement\n    Employment support programs and services: adult basic education, financial empowerment, expungement clinics, job search/placement, meetings with Light House Employment Specialist\n\n"
  },
  {
    "addressLine1": "1570 Crownsville Rd",
    "city": "Crownsville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21032",
    "name": "Chrysalis House Inc",
    "organization": "Chrysalis House Inc",
    "phone": "(410) 974-6829",
    "website": "https://www.chrysalishouses.org/",
    "description": "Treatment center for women. Drug and alcohol drug treatment assistance. 45 beds at this location. Also allows women who have children.\n\nChrysalis House, Inc. is a nonprofit organization which provides full treatment services to women suffering with the disease of addiction. We offer long-term care and outpatient services to pregnant and post-partum women with children.\n\n\nChrysalis House, Inc. is one of the leading agencies in Maryland, providing addiction treatment and prevention services for women and their at-risk children. The nonprofit organization operates three state certified residential treatment facilities: Crownsville, Rockville, and Baltimore. Along with residential treatment services, the organization provides an outpatient treatment program located in Crownsville, Maryland and a transitional program, which is housed in Baltimore, Maryland.\n\nOur programs are certified by the Maryland State Department of Health and Mental Hygiene, Office of Health Care Quality. We receive support from grants, foundations, and individuals who support the mission of our nonprofit organization."
  },
  {
    "addressLine1": "1517 Ritchie Highway (Office Only)",
    "city": "Arnold",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21012",
    "name": "YWCA of Annapolis and Anne Arundel County Domestic Violence Shelter",
    "organization": "YWCA of Annapolis and Anne Arundel County Domestic Violence Shelter",
    "phone": "(410) 222-6800",
    "website": "http://www.annapolisywca.org/",
    "description": "YWCA of Annapolis and Anne Arundel County. Domestic Violence Hotline\nProvides support services for victims of domestic violence.\n\nSERVICES:\n1) EMERGENCY SHELTER/SAFE HOUSE: Provides shelter for 10 days to 1 month to women who have been physically and/or sexually abused by their partners. Children can remain in shelter with parent.\n2) HOTLINE: Provides a 24 hour domestic violence and sexual assault hotline.\n\n3) COUNSELING: Offers individual and group counseling for domestic violence issues to shelter residents and others interested who do not live in the shelter.\n4) SUPPORT GROUPS: Offered at the main YWCA on Tues, Wed, and Thurs from 6:30-8PM to shelter residents and others who do not live in the shelter. Also provides in-house support group sessions for shelter residents only.\n5) CASE MANAGEMENT: Plans are made for evaluation, treatment and support services for shelter residents. Case management is also available for others who do not live in the shelter but who need or want services.\nEligibility Women 18 and older and their children who are in immediate danger; no income limits."
  },
  {
    "addressLine1": "4 N Central Ave",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21202",
    "name": "Baltimore Rescue Mission",
    "organization": "Baltimore Rescue Mission",
    "phone": "(410) 342-2533",
    "website": "https://baltimorerescuemission.org/",
    "description": ""
  },
  {
    "addressLine1": "701 South Charles Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "00000",
    "name": "Baltimore Outreach Services Emergency Shelter",
    "organization": "Baltimore Outreach Services Emergency Shelter",
    "phone": "(410) 752-1285",
    "website": "http://www.baltimoreoutreach.org/",
    "description": "EMERGENCY SHELTER: Offers emergency shelter for single women and women with children . Can stay for up to 90 days.\nEligibility - Homeless women and their children\nProgram fees - Sliding scale based on income\n\nThe mission of Baltimore Outreach Services is to provide comprehensive services and programs to homeless women and their children. These services include emergency shelter, supportive housing, educational programming, health and mental health services, job training and employment counseling. The emergency shelter is located in the basement of Christ Lutheran Church, in the Inner Harbor area of Baltimore City.\n\nSupportive Housing\n"
  },
  {
    "addressLine1": "1029 East Baltimore St",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "00000",
    "name": "Helping Up Mission",
    "organization": "Helping Up Mission",
    "phone": "(410) 675-7500",
    "website": "https://helpingupmission.org/",
    "description": "Office Hours: Mondays through Fridays 7am to 5pm.\n\nIf you or someone you love is struggling with addiction or homelessness, Helping Up Mission may be able to provide immediate help. Do you need:\nTemporary help due to a short-term crisis\nOvernight Guest Services provides a night of shelter for men experiencing homelessness. There are 50 available beds, allocated on a first-come, first-serve basis. Check in begins at 2:30 pm. Overnight guests receive a bed for the night, two full hot meals (dinner and breakfast), toiletries for showering, clean clothes, and an evening chapel message. If they realize a personal need for recovery, they may apply to our Spiritual Recovery Program.\nComprehensive, long-term recovery services\nThe Spiritual Recovery Program is a one-year residential program for men fighting addiction and homelessness. If necessary, detox services are available through partnerships with local hospitals. Participants will live in a 12-Step therapeutic community, experiencing grace, accountability, and personal growth that equips them for lasting success on their recovery journey.\n\nApplicants for the Spiritual Recovery Program must be:\n    Male, at least 21 years old.\n    U.S. citizens or legal aliens.\n    Suffering from alcohol or substance abuse.\n    Able to abide by a 45-day initial in-house restriction.\n    Willing and able to perform work therapy assignments.\n\n    Ready to become involved in all aspects of the program.\n    Agreeable to all program policies and procedures.\n    Available for a pre-entry personal interview on site (no telephone interviews).\nFinally, applicants must NOT have open court dates or outstanding warrants. And no outside employment is permitted for the first six months of the program.\n\nBecause Helping Up Mission is a non-profit organization sustained by private donations, there are no fees for initial entry in the program.\n"
  },
  {
    "addressLine1": "301 North High St",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21202",
    "name": "Maryland Center for Veterans Education and Training - MCVET",
    "organization": "Maryland Center for Veterans Education and Training - MCVET",
    "phone": "(410) 576-9626",
    "website": "https://www.mcvet.org/",
    "description": "Intake Days\n\nMonday through Friday (Holidays excepted), and on the last (every fourth) Saturday of each month. Applications will only be accepted on the days of the actual intake. Applicants should enter on the Exeter Street side of the property.\nRestriction Period:\n\nVeterans accepted into the program will be restricted to the facility for the first 30 days.\nChecklist of Items to Bring To Intake\n\n    DD 214 (Military separation papers) if available.\n    Personal identification.\n    30 Day supply of any currently prescribed medications.\n    Clothing and personal hygiene items. (Optional - MCVET has a limited supply of these items for veterans without possessions. Limited locker space is provided).\n\n    Do not bring cologne, mouthwash, or other alcohol based products, automobiles, phones, pagers, nail files or other objects that could be used as a weapon.\n\nDetoxification\n\nDetox services are not provided by MCVET. All veterans with recent substance use must be detoxed prior to entry. Detox services may be available for eligible veterans at the Baltimore VA Medical Center on Greene Street.\n\nDrop In Facility\nThe Day-Drop provides homeless veterans who are in need of a facility that affords a degree of comfort during the day and a feeling of camaraderie with other veterans in similar circumstances. In the Day-Drop, veterans have access to shower facilities, clothing, water and vending machines, crisis intervention counseling and a quiet haven to rest. The Facility has a 50 person capacity.\n\nEmergency Housing\nThe Emergency Housing component is actually the first phase for veterans committing to the MCVET program. The Emergency Housing program has a capacity of 50 beds and is available to residents for a period not to exceed thirteen (13) weeks. During the 13 weeks, residents' military status is confirmed and they receive VA benefits counseling. They are also assigned to a case manager who works with the resident to identify the causes of the homelessness and to outline employment and education goals.\n\nTransitional Housing\nThe Transitional Housing Program has 120 beds and provides up to two years of transitional housing and supportive services to veterans who have successfully completed the Emergency Shelter Program and need continued supportive services in order to return them to employment and permanent housing.\n\nSingle Room Occupancy\nThe Single Room Occupancy (SRO) Program is a gateway leading towards permanent housing with essential component to the overall continuum of care. The SRO functions in conjunction with the existing Emergency Shelter and Transitional Housing Programs provides a full continuum of housing, counseling and job placement services to veterans in need. Veteran applicants from outside MCVET's program, including female veterans, are also eligible for the SRO units.\n\n"
  },
  {
    "addressLine1": "1814 Maryland Avenue",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21201",
    "name": "Project PLASE",
    "organization": "Project PLASE",
    "phone": "(410) 837-1400",
    "website": "https://projectplase.org/",
    "description": "Project PLASE, Inc. addresses homelessness in Baltimore by providing transitional housing, permanent housing and supportive services to homeless adults. We serve the most vulnerable and underserved, including persons with mental illness, HIV/AIDS, addiction, developmental disabilities, and ex-offenders, etc. We treat, restore and rehabilitate the whole person. We empower each individual to function at the highest level possible.\nTemporary Housing\n\nThe goal of Project PLASEs Temporary Housing Program is to shelter and serve homeless adults. Including 24-hour supported supervision, on-site nursing and counseling services, and case management for our residents, this program focuses on helping the individual function at their highest level.\nResidents are provided three meals daily, linens, bus tokens when available, assistance with medical appointments, and clothing as needed making it easier for residents to focus on their goals.\n\nEach resident is assigned a counselor, to assist the individual in meeting their needs and moving beyond their crisis situation. Linkages to community based services and resources are made as appropriate, including: health, mental health, substance abuse treatment, life skills, job readiness and placement, education, and legal services.\n\n\nFamily Stability and Shelter Diversion\n\nThe Family Stability and Shelter Diversion Program is an alternative to traditional (congregate) shelters. Families who have lost their housing are diverted to temporary housing instead of a shelter and provided housing location and landlord negotiation, comprehensive case management, financial assistance and life skills training. This helps families to move out of homelessness quickly and transition back to permanent housing and self-sufficiency.\n\n\n\nSubsidized Permanent Housing\n\nOur Subsidized Housing Programs provide permanent, subsidized housing for individuals and families. This encompasses our Rental Assistance Program, Single Room Occupancy, PLASE Apartments, and our Celebration Housing Program.\n\nThe Rental Assistance Program is open to all homeless individuals and provides case management, a housing subsidy, and linkages to needed community resources.\n\n\nOur Single Room Occupancy includes 10 single rooms with five clients sharing a bathroom and living area. PLASE Apartment contains 5 apartments, housing two clients each. These programs include case management and linkages to needed resources, same as our other permanent housing programs.\n\nThe Celebration Housing Program is designed to help homeless veterans achieve and maintain housing stability. Project PLASE puts an emphasis on individualized case management which maximizes the veterans opportunities to realize his or her goals. Individual homeless veterans and veteran headed households may apply. The priority focus is assisting those who have been chronically homeless.\n\n"
  },
  {
    "addressLine1": "140 W. West Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "00000",
    "name": "South Baltimore Station",
    "organization": "South Baltimore Station",
    "phone": "(410) 752-4454",
    "website": "https://baltimorestation.org/",
    "description": "We are an innovative therapeutic residential treatment program supporting veterans and others who are transitioning through the cycle of poverty, addiction, and homelessness to self-sufficiency.\nAre You a Veteran Experiencing Homelessness & Addiction?\nWe do not charge any program fees to participants.\n\nAt The Baltimore Station, we concentrate on helping those we know most about - those we can do the most for - men who have valiantly served our country and have fallen on hard times. We know that they suffer a special kind of hell, returning to society with the effects of combat (including Post Traumatic Stress Disorder), often turning to drugs to silence the trauma. We know the cycle that can spin out of control, leading to poverty, estrangement and homelessness. We know what it takes to break that cycle, a highly structured environment, because most of our staff is in recovery themselves and half are veterans. Recovery is not a quick fix battle. Its a long tough war."
  },
  {
    "addressLine1": "1 N. Charles St. 1st Floor",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21201",
    "name": "Turnaround Inc. - Domestic Violence Shelter",
    "organization": "Turnaround Inc. - Domestic Violence Shelter",
    "phone": "(410) 837-7000",
    "website": "https://turnaroundinc.org/",
    "description": "TurnAround offers a hotline, emergency shelter, housing, individual and group counseling for domestic violence victims."
  },
  {
    "addressLine1": "435 E. 25th Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21218",
    "name": "Manna House",
    "organization": "Manna House",
    "phone": "(410) 889-3001",
    "website": "http://mannahouseinc.org/",
    "description": ""
  },
  {
    "addressLine1": "1932 W North Ave",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21203",
    "name": "Mission Possible Ministries Shelter For Men",
    "organization": "Mission Possible Ministries Shelter For Men",
    "phone": "(410) 728-0353",
    "website": "http://www.mpministries.com/",
    "description": "Shelter for men. Job training Counseling\n\nMPM's \"10 Commandments\" for the men's Shelter:\n\n    Sign \"MPM's\" guest registry upon arrival (no aliases, please).\n    Talk to a residential manager about their circumstances. Must get a job within 2 weeks of arrival and give a monetary love offering to misson each payday of $20 per week. (No cash or check Money orders Only)\n\n    Be mindful that weapons, alcohol, mind-altering substances, smoking, profanity, drunken behavior and borrowing money WILL NOT BE TOLERATED.\n    Be permitted to carry in 2 small personal belongings ( which must be searched) that will fit under the bed, and adopt a hands-off policy towards others' belongings. (MPM is not liable for residents' personal belongings).\n    Once in, commit to remaining in the shelter until the following morning and assisting the residential managers where needed.\n    Bathe or shower before bedtime (either upon arrival at the shelter or after dinner).\n    Observe the dinner hour from 5:30 to 6:30pm daily (NO FOOD IS TO BE TAKEN UPSTAIRS AFTER ANY MEAL).\n    Participate in ministry  service ( prayer, Bible-study or guest presentations) after from 7:00 to 8:00 p.m.\n\n    Retire to bed by 9 p.m. (unless ministry is called for) and observe the early-morning wake-up call, attending to personal hygiene and bedding before breakfast.\n    Observe the breakfast hour from 6 to 7 am, followed by the morning worship service and dismal from the premises at 8 am ( Residents may sign up for one-on-one counseling, if desired, before departing the shelter for the day).\n\n\nRESIDENTS MAY RETURN THE NEXT EVENING BETWEEN 5:00 AND 6:00 P.M. DOORS                                        ARE LOCKED AT 6:00 P.M.\nYOU HAVE 2 DAYS TO RETRIEVE YOUR BELONGINGS WHEN CHECKING OUT OF THE MISSION, AFTER 2 DAYS WE WILL NOT BE RESPONSIBLE FOR YOUR BELONGINGS."
  },
  {
    "addressLine1": "949 Gorsuch Avenue",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21218",
    "name": "Marian House Headquarters",
    "organization": "Marian House Headquarters",
    "phone": "(410) 467-4121",
    "website": "https://www.marianhouse.org/",
    "description": "For homeless & unemployed women. Transitional housing to permanency(Marion House I - women only)(Marion House II - women can be reunited with children)\nFor intake and referral inquiries, please contact us at 410-467-4121 or info@marianhouse.org.\n\n\n\n\nMARIAN HOUSE I is the transitional housing and intensive rehabilitation phase which provides comfortable, structured community living at our headquarters on Gorsuch Avenue. Central to this first phase of Marian House are the supportive services we provide, including meals and personal supplies, rehabilitation counseling, life skills training, job readiness, pre-GED and GED education, referrals for medical care, and a savings program to prepare women for independent living. On average, a woman spends nine months to one year at Marian House I. She is then given the opportunity to move into a more independent living environment in the second phase of our program, Marian House II.\n\nMARIAN HOUSE II allows women to continue to live in community settings with other women striving to achieve similar goals for independent, healthy living. In this phase of the program, women continue to receive supportive services such as counseling, case management, education, and employment assistance as they pursue their rehabilitation goals in this more independent living environment.\n\n\nThe TRANSITIONAL FAMILY PROGRAM serves women who are ready and able to reunite with their children. The Family Tower can house four families in four three-bedroom apartments for up to two years. In addition, 10-12 families are housed in shared living environments. Residents of this program have access to all Marian House I supportive services including individual, family and child therapy as well as education and employment assistance. The children living in these units also have access to tutoring and enrichment services as needed. Often, women placed in the family program are initially in Marian House I, but referrals are also taken from family shelters in the community.\n\n"
  },
  {
    "addressLine1": "1228 E. Baltimore Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21202",
    "name": "Karis Home - Baltimore Rescue Mission",
    "organization": "Karis Home - Baltimore Rescue Mission",
    "phone": "(410) 342-1323",
    "website": "https://baltimorerescuemission.org/ministries/karis-home",
    "description": "Eligibility:   Single women 18 years or older, pregnant women, and women with children. Women with children can have boys 9 years and under, and girls of all ages accepted. Will accept drug/alcohol-free women (no methadone) in a substance abuse program for at least one month.\n\nHours: Every day from 5pm to 8am.\nIntake hours: Mondays through Fridays from: 8am to 5:30pm.\n\n Provides shelter, clothing, meals, showers, a 6:30PM gospel service and medical screenings to homeless women, pregnant women and women with children. Lodgers are permitted to stay for an initial period of one month, however, they must vacate the shelter from 8AM-4PM each day. Women who do not return to Karis Home by 5PM for more than one night will lose their space unless they are hospitalized, proof is required. Individuals should call during Intake hours, seven days a week, 8AM-1PM. Women with children can have boys 9 years and under, and girls of all ages accepted. They do not have anyone there that can assist Spanish speakers."
  },
  {
    "addressLine1": "2201 Argonne Drive",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21218",
    "name": "House of Ruth",
    "organization": "House of Ruth",
    "phone": "(410) 889-0840",
    "website": "https://hruth.org/",
    "description": "Battered women and their children. Emergency/transitional shelter. Meals, Counseling. Legal assistance\nWe offer immediate access to services through:\n\n24 Hour Hotline (410) 889-RUTH (7884)\nClient Service Coordinators who work with victims in House of Ruth Maryland services and in the community providing safety planning, basic needs assistance, and resource referral;\nEmergency Shelter with 23 private rooms, with 84 available beds, for women and children in imminent danger, onsite, state licensed childcare and health clinic; six transitional apartments and supportive services\n\nLegal Clinic services providing free legal advice and representation in securing Protective/Peace Orders; divorce and custody\nIndividual and group counseling, for adults, children and youth\nTherapeutic and enrichment services for children of victims through our comprehensive Childrens Program.\nAbuse Intervention through our Gateway Project and Si Puedo which provides psycho-educational programs to individuals (men and women) who are emotionally, physically, or sexually abusing their partner; assists and educate victims to ensure their safety.\n\n"
  },
  {
    "addressLine1": "425 N Chester St",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21231",
    "name": "Bea Gaddy's Family Center, Inc.",
    "organization": "Bea Gaddy's Family Center, Inc.",
    "phone": "(410) 563-2749",
    "website": "http://bea-gaddy.org/",
    "description": "Our mission, since 1981, has been and always will be to assist in providing our neighbors with food, clothing and other items. We also provide a safe haven from the storms of life for women and children on a transitional basis.\n\nBea Gaddy Women and Childrens Shelter provides shelter and safe haven for homeless women and children. Women and their families are allowed stay for up to six months on a fee basis. While residing in the shelter the women are required to attend training and seek other resources to reestablish their selves in the community."
  },
  {
    "addressLine1": "123 W. Mulberry Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21201",
    "name": "My Sister's Place",
    "organization": "My Sister's Place",
    "phone": "(410) 727-3523",
    "website": "https://www.facebook.com/mysistersplaceccmd/",
    "description": "Daytime drop-in shelter. Emergency assistance. Case management."
  },
  {
    "addressLine1": "411 Cathedral Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21201",
    "name": "Our Daily Bread",
    "organization": "Our Daily Bread",
    "phone": "(410) 659-4022",
    "website": "https://www.catholiccharities-md.org/services/our-daily-bread-employment-center/",
    "description": ""
  },
  {
    "addressLine1": "1501 North Dukeland Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21223",
    "name": "Agape House Homeless Services",
    "organization": "Agape House Homeless Services",
    "phone": "(410) 566-5007",
    "website": "http://www.agapehouseinc.com/",
    "description": "OVERVIEW: Provides housing for single men; food; clothing; job training; day and after school mentoring and day camp programs.\n\nSERVICES:\n1) RESIDENTIAL PROGRAM: Provides 2 emergency housing programs for single men and 1 emergency housing for women in Harford county who are currently working or are willing to work. Will provide: transportation to jobs, food and clothing to participants. Each participant must pay $100 per week. Shared rooms with a common area. Call 410-566-5007 for eligibility and space availability.\n\n2) FOOD AND CLOTHING: Provided to those in need. Register at 11AM on Sundays, also on Wednesdays at 5:30PM. Photo ID required and social security cards for each child.\n\n\n3) SATURDAY SCHOOL: Program offering computer and homework tutoring with volunteer teachers to youth ages 4-16 years. Scheduled from 12-4PM. Participants don't have to be involved with the Residential Program.\n\n4) DAY CAMP: Offered for youth ages 4-16 years Mondays-Fridays, 8AM-3PM during the month of July. Activities include bible study, swimming, and field trips.\n\n5) MENTORING: Offered for girls ages 10-18 every Saturday morning.\n\n6) JOB TRAINING: Provides training in catering. Participant must be willing to work towards GED (if not already acquired). A social worker will coordinate support services if requested."
  },
  {
    "addressLine1": "425 North Chester Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21231",
    "name": "Bea Gaddy Family Center Homeless Services",
    "organization": "Bea Gaddy Family Center Homeless Services",
    "phone": "(410) 563-2749",
    "website": "http://www.bea-gaddy.org/",
    "description": "Patterson Park Emergency Food Center and Emergency Homeless Shelter for women.\nProvides an array of social services to anyone in need.\nSERVICES:\n1) FOOD PANTRY: Offers groceries to individuals and families. Register to receive food weekly by coming in Wed or Fri, 10:30AM-2PM. Must have picture ID, proof of address and proof of children (ex: a budget letter). If you do not want to register there is \"free food\" days on Mon and Thur, 12-2PM. Still need to bring documentation.\n2) EMERGENCY SHELTER: Operates a shelter for women with children. Must have income and a picture ID. Call ahead to see if space is available. Self-referrals are accepted. There is a fee that increases dependent upon the number of people going into emergency shelter. The fee begins at $100 per month for one person and increase from there. Items are given out including soap, toothbrushes and personal items. No boys over 12 years.\n\n3) CLOTHING: Offers a free clothing closet at 425 North Chester St. Call in advance to check availability.\n4) SUBSTANCE ABUSE: Provides informal counseling for drug/alcohol addiction and refers individuals to substance abuse programs.\n5) INFORMATION AND REFERRAL: Provides free information and referral to services that assist low-income, unemployed and homeless persons.\n6) JOB READINESS: Offers informal counseling to increase self-esteem and provides information to help individuals begin their job search.\n7) HOLIDAY ASSISTANCE 2010:\nTHANKSGIVING: Meal will be served Thanksgiving day at Patterson Park Recreation Center, 11AM-3PM at 2601 East Baltimore Street. Call in advance to order dinner for people who are not able to leave their home. Sign up for pre- ordering beginning 10/17/2010.\nCHRISTMAS : CLOSED Call to register children, from 5-12 years of age, for the Christmas Party on Dec. 18th from 2-4PM. Limited to 200 spaces only. Toys will be given. Sign up begin 12/6/10.\n\nMost services are free. Call ahead for details.\nMonday - Friday 9am - 5pm."
  },
  {
    "addressLine1": "400 S. Bond Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21231",
    "name": "Beans and Bread Outreach Center",
    "organization": "Beans and Bread Outreach Center",
    "phone": "(410) 732-1892",
    "website": "http://www.vincentbaltimore.org/",
    "description": "Provides financial assistance a housing program, a day resource center and holiday assistance to residents in their catchment area.\n\nA homeless day resource program that serves 300 people daily with meals, healthcare, showers, laundry, employment services, case management, housing referrals and placements, mail receipt, and telephone access.\n\nSERVICES:\n1) FINANCIAL ASSISTANCE: Will provide financial assistance towards birth certificates and IDs on the first weekday of the month. Will only take 8 people, so clients should get to the center at 8AM to line up.\n2) MEAL PROGRAM: Meals served Mon, Tues, Thurs, Fri, Sat and last Sun of the month, 10:15AM-12:45PM. No age restriction.\n\n3) DAY RESOURCE CENTER: Provides mail & telephone services; addiction, mental health and employment referrals; case management services; health screenings & referrals; recreational activities; and documentation services. Showers are open from 10AM-12:30 Noon.\n4) HOME CONNECTIONS: Housing First program for chronically homeless individuals (must have disability). Provides permanent housing with supportive case management.\n5) CLOTHING: Clothing closet available to those in need at the day resource center.\n6) HOLIDAY ASSISTANCE 2010: Offered to anyone in need. Walk-in\nTHANKSGIVING: Meal offered on Nov 25th, 10:15AM-12:45PM.\nBaskets will also be offered at the same time on a first come, first serve basis.\nCHRISTMAS: Meal offered on Dec 25th, 10:15AM-12:45PM.\n\n\nHours Of OperationLast Sun of the month,10:45AM-12:45PM.\nMon: 9:30AM 5PM\nTue: 9:30AM 5PM\nWed: 9:30AM 5PM\nThu: 9:30AM 5PM\nFri: 9:30AM 5PM\nSat: 10:45AM 12:45PM\n\nOpen to anyone. Walk-in or call for information."
  },
  {
    "addressLine1": "10 North Pulaski Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21223",
    "name": "Bon Secours Women's Resources And Day Shelter",
    "organization": "Bon Secours Women's Resources And Day Shelter",
    "phone": "(410) 362-3547",
    "website": "https://www.bonsecours.com/",
    "description": "Offers a variety of services for women, including hospitality services (laundry, meals, showers), a job skills bank, domestic violence counseling and support groups. They assist women with children and single women. They will also assist married women as long as their name is on an eviction notice.\nSERVICES:\n1) DAY-TIME DROP-IN CENTER: Shower facilities, washers & dryers and telephones are available for use.\n2) FINANCIAL ASSISTANCE: Only accept 5 applications per month. Limited eviction prevention assistance offers up to the last $200 (bring eviction notice, photo ID, SS card, proof of income, and lease information), information and referral, supportive housing, and other services. Assists all of MD. Will assist single women and women with children. Will assist those in section 8/public housing. Monies available at the beginning of each month. Can be utilized once per year (12 month period).\n\n3) PARENTING & ANGER MANAGEMENT CLASSES: Offered the 1st & 2nd Thurs, 2PM.\n4) CASE MANAGEMENT: Provides information and referral services, case management, a resource library and health-related workshops, as well as spiritual support and guidance.\nCall for information, or walk-in. Registration required for parenting classes.\nEligibility Women ages 18 and older.\n\nThe Womens Resource Center is a daytime drop-in center where women who are struggling with a range of life challenges, including substance abuse, domestic violence, homelessness, anger, depression and other mental health issues can find relief and help. The Center provides social and education services and connects them to essential health services. Women are provided a place to shower, wash their clothes, rest and have a hot breakfast.\n"
  },
  {
    "addressLine1": "3506 Lucille Ave",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21215",
    "name": "HolBrock Estates Assisted Living",
    "organization": "HolBrock Estates Assisted Living",
    "phone": "(804) 715-7033",
    "website": "http://www.holbrockestates.com/",
    "description": "We are located in the city of Baltimore. Our facility is geared towards helping individuals recover their spot in socitey by offering the housing and assistance to help start them on their journey. We work alongside Social Services and other state organizations and are will to help all individuals and accomodate them, as best we can!"
  },
  {
    "addressLine1": "10 N. Gilmor Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21223",
    "name": "Pleasant Housing Supportive Housing",
    "organization": "Pleasant Housing Supportive Housing",
    "phone": "(410) 566-0094",
    "website": "http://pleasanthousing.org/",
    "description": "We accept women and men ages 25 and up... There is a fee of $125.00 per week.\n\nPleasant Housing Supportive Program is a non-profit 501(c)(3) located in Baltimore City that provides programs that teach independence and life skills to the often neglected members of our community including the mentally ill, substance abusers, ex-offenders, people infected with HIV, and those diagnosed with cancer."
  },
  {
    "addressLine1": "P.O.BOX 1462",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21203",
    "name": "Women Affairs of Almumtahinah Home Inc(AMH)",
    "organization": "Women Affairs of Almumtahinah Home Inc(AMH)",
    "phone": "(443) 965-0555",
    "website": "http://www.almumtahinahhome.org/",
    "description": "Our Program is entitled: Helping others. The purpose of this program is to provide relief to the poor, distressed and underprivileged women and children of our community in their time of need.EMERGENCY TEMPORARY Transitional Home.\n\nWe provide sisters,families and their children a safe place to stay for a period of 45 days, in certain situations they can stay for a longer period.\n\nLIFE SKILLS TRAINING\n\nAssisting sisters and families to obtain employment, financial literacy, religious studies, parental skills and health education.\n\nINFORMATION AND REFERRAL\n\nSisters and families are encouraged to apply for benefits-that they are eligible for as well as seeking employment to become self sufficient."
  },
  {
    "addressLine1": "411 Millington Ave.",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21229",
    "name": "Mi Casa Su Casa Supportive Housing Program",
    "organization": "Mi Casa Su Casa Supportive Housing Program",
    "phone": "(443) 759-5791",
    "website": "http://www.mycasaliving.org/",
    "description": "We provide transitional and supportive housing to young adult males, age 25 and older, that are returning citizens (re-entry),recovering from drugs, homeless veterans and /or individuals that have been thrown out or aged out of a system. Our organization will provide supportive services to assist each Mi Casa Su Casa family member with becoming self sufficient, positive members of their communities."
  },
  {
    "addressLine1": "5115 Liberty Heights Ave",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21207",
    "name": "Muslimat Al Nisaa",
    "organization": "Muslimat Al Nisaa",
    "phone": "(410) 466-8686",
    "website": "http://www.mnisaa.org/",
    "description": "A culturally sensitive, faith-based shelter home environment for homeless Muslim women and children and Muslim women victims of domestic violence allowing them to accomplish and/or return to self-sufficiency. Muslimat Al Nisaa is not a institutional shelter, but a home for those who were homeless."
  },
  {
    "addressLine1": "4605 Asbury Avenue",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21230",
    "name": "Hyacinth Independent/Transitional Living Home, INC",
    "organization": "Hyacinth Independent/Transitional Living Home, INC",
    "phone": "(443) 531-4340",
    "website": "http://www.hitlivinghome.org/",
    "description": "Hyacinth's Independent/Transitional Living Home positions itself as a transitional home for homeless victims who have maximized their stay at regular shelters, but still have need for accommodation and support services to live independently. Most Shelters accommodate clients for approximately 90 days.\n\nIf they are able to find alternate housing through case management support, they can transit out independently.\n\n\nThe reality is that most become \"Shelter Shoppers\", moving from one shelter to another or returning to their original conditions. While our home is set up for paid accommodation, we try to work within the clients' budgets and assist them to access social services benefits, employment and permanent housing.\n\nOur objective is to subsidize any short falls through DONATIONS/GRANTS from individuals, businesses, government and corporations. There is no time limit on how long a person can remain in our home, once we can secure funding."
  },
  {
    "addressLine1": "3116 E Monument Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21205",
    "name": "Lifematics Homes and Support",
    "organization": "Lifematics Homes and Support",
    "phone": "(607) 684-4383",
    "website": "http://www.lifematicshomes.com/",
    "description": ""
  },
  {
    "addressLine1": "1814 Maryland Ave",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "00000",
    "name": "Project PLASE Maryland Ave",
    "organization": "Project PLASE Maryland Ave",
    "phone": "(410) 837-1400",
    "website": "https://projectplase.org/",
    "description": "Intake 24 hours a day.\nProject PLASE, Inc. addresses homelessness in Baltimore by providing transitional housing, permanent housing and supportive services to homeless adults. We serve the most vulnerable and underserved, including persons with mental illness, HIV/AIDS, addiction, developmental disabilities, and ex-offenders, etc. We treat, restore and rehabilitate the whole person. We empower each individual to function at the highest level possible.\nTemporary Housing\n\nThe goal of Project PLASEs Temporary Housing Program is to shelter and serve homeless adults. Including 24-hour supported supervision, on-site nursing and counseling services, and case management for our residents, this program focuses on helping the individual function at their highest level.\nResidents are provided three meals daily, linens, bus tokens when available, assistance with medical appointments, and clothing as needed making it easier for residents to focus on their goals.\n\nEach resident is assigned a counselor, to assist the individual in meeting their needs and moving beyond their crisis situation. Linkages to community based services and resources are made as appropriate, including: health, mental health, substance abuse treatment, life skills, job readiness and placement, education, and legal services.\n\n\nFamily Stability and Shelter Diversion\n\nThe Family Stability and Shelter Diversion Program is an alternative to traditional (congregate) shelters. Families who have lost their housing are diverted to temporary housing instead of a shelter and provided housing location and landlord negotiation, comprehensive case management, financial assistance and life skills training. This helps families to move out of homelessness quickly and transition back to permanent housing and self-sufficiency.\n\n\n\nSubsidized Permanent Housing\n\nOur Subsidized Housing Programs provide permanent, subsidized housing for individuals and families. This encompasses our Rental Assistance Program, Single Room Occupancy, PLASE Apartments, and our Celebration Housing Program.\n\nThe Rental Assistance Program is open to all homeless individuals and provides case management, a housing subsidy, and linkages to needed community resources.\n\n\nOur Single Room Occupancy includes 10 single rooms with five clients sharing a bathroom and living area. PLASE Apartment contains 5 apartments, housing two clients each. These programs include case management and linkages to needed resources, same as our other permanent housing programs.\n\nThe Celebration Housing Program is designed to help homeless veterans achieve and maintain housing stability. Project PLASE puts an emphasis on individualized case management which maximizes the veterans opportunities to realize his or her goals. Individual homeless veterans and veteran headed households may apply. The priority focus is assisting those who have been chronically homeless."
  },
  {
    "addressLine1": "1114 N Mount St",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21217",
    "name": "Sarah's Hope Mount Street",
    "organization": "Sarah's Hope Mount Street",
    "phone": "(410) 396-2204",
    "website": "https://www.vincentbaltimore.org/",
    "description": "Sarahs Hope, Mount Street\nComprehensive 130 bed shelter serving homeless families in Baltimore City. Services include meals, youth activities and tutoring, adult education classes, case management, housing placement and referrals.\n\nServices include: intensive case management, meals, service linkage, health screenings, on-site infant childcare and early Head Start services, public school enrollment, youth activities and tutoring, adult education classes, and housing placement and referrals.\n\n\n\nPlease call us to check availability."
  },
  {
    "addressLine1": "620 Fallsway",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21202",
    "name": "Code Blue Shelter Baltimore - Weinberg Housing and Resource Center",
    "organization": "Code Blue Shelter Baltimore - Weinberg Housing and Resource Center",
    "phone": "(667) 600-3230",
    "website": "https://www.catholiccharities-md.org/services/weinberg-housing-resource-center/",
    "description": "The Weinberg Housing and Resource Center (WHRC) is a low barrier emergency shelter that provides homeless services to over 275 adult men and women each night in the City of Baltimore. Our services include shelter, convalescent care, breakfast and dinner, showers, laundry, case management and a variety of life skills and empowerment classes with a focused goal of assisting residents in obtaining permanent housing."
  },
  {
    "addressLine1": "701 S. Charles Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21230",
    "name": "Christ Lutheran Place Shelter",
    "organization": "Christ Lutheran Place Shelter",
    "phone": "(410) 752-1285",
    "website": "https://www.christinnerharbor.org/social-ministry-programs/",
    "description": "Baltimore Outreach Services is a 40 bed homeless shelter for women and their children."
  },
  {
    "addressLine1": "1031 East Monument St",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21202",
    "name": "Aunt CC's Harbor House Shelter",
    "organization": "Aunt CC's Harbor House Shelter",
    "phone": "(410) 576-6968",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "1114 N. Calvert Street",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21202",
    "name": "Salvation Army Booth House",
    "organization": "Salvation Army Booth House",
    "phone": "(410) 685-8878",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "11 W. Clement St.",
    "city": "Baltimore",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21223",
    "name": "American Rescue Workers Shelter",
    "organization": "American Rescue Workers Shelter",
    "phone": "(410) 566-3300",
    "website": "https://arwmd.square.site/",
    "description": ""
  },
  {
    "addressLine1": "55 Wade Ave",
    "city": "Catonsville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21228",
    "name": "Spring Grove Alumni Museum",
    "organization": "Spring Grove Alumni Museum",
    "phone": "410-402-7856",
    "website": "http://canconnects.org/",
    "description": "Contact Baltimore County Department of Social Services to be referred\ninto a CAN shelter at 410-853-3000 ext. 2.\n\nWe are a 100+ bed facility housing homeless men in Baltimore County. Our goal is to provide a safe and secure place for men to come too terms with their present situation and provide resources that will enable them to become self sufficient.\n\nWe are operated by Community Assistance Network, Inc a 501(c)3 organization, a member agency of Community Action Partnership.\n\nCase Management\nCase managers deliver one-on-one counseling and programming to build life skills, cultivate job readiness and improve financial literacy.\n \nRapid Re-Housing Programs\nRapid re-housing specialists ensure that guests are able to live independently before finding them permanent, secure housing. In the last year, over 150 individuals were housed through the Rapid Re-Housing Program.\n \nAftercare Coordination\nAftercare Coordinators act as a resource navigator and community advocate for guests as they exit the shelter by working with the Rapid Re-Housing Program, CAN's Community Outreach Program, along with community partners, to ensure that shelter guests receive all inclusive community-based supportive services to help move them toward self-sufficiency.\n \nSamaritan Housing\nThe Samaritan Housing Initiative Program is a federally (HUD) funded housing project. To support HUD's goal of improving housing accessibility for persons with disabilities, the project houses chronically homeless men and women in Baltimore County who have been diagnosed with a disabling condition."
  },
  {
    "addressLine1": "7728 Woodmont Avenue",
    "city": "Bethesda",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20814",
    "name": "Bethesda Cares Day Shelter",
    "organization": "Bethesda Cares Day Shelter",
    "phone": "(301) 907-9244",
    "website": "http://www.bethesdacares.org/",
    "description": "Only a day shelter. Hours Monday through Friday, 9am-12:30pm and 2pm-4pm.\n\nOur main office serves as both a Drop-In Center for clients experiencing homelessness, and the site for most of our services. Open five days a week, our Drop-In Center always offers hot coffee, snacks and a place that clients can come in for a respite from the weather. Importantly, its also a place where they know they will be greeted with smiles, and not be asked to move along.\n\n\nOur Center provides access to our Outreach Team, a social worker and psychiatric care, who work closely together to move clients out of homelessness. We also try to ease our clients lives, by providing vouchers for our Clothing Closet and our weekly shower program, both at nearby sites. We hold mail for nearly 400 clients, offer a phone for client-use, and keep a steady supply of toiletries available, too."
  },
  {
    "addressLine1": "1301 Piccard Dr",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20850",
    "name": "Montgomery County HHS",
    "organization": "Montgomery County HHS",
    "phone": "(240) 907-2688",
    "website": "https://www.montgomerycountymd.gov/homelessness/contact-us.html",
    "description": "Provides coordination of services to homeless individuals and families. Services include: outreach, emergency shelter, transitional housing, and permanent supportive housing. Services are provided primarily through partnerships and contracts with community non-profit organizations. DHHS Housing Stabilization staff provide emergency assessment services to homeless families with children. Emergency shelter capacity for individuals expands during the winter months. Case management services are provided to all homeless clients to link clients to needed services, including housing referrals, treatment, employment and entitlements.\nService(s):     Homeless Shelter\nLow Income\nHomeless Families\nHomeless Men\nHomeless Women\nTarget Population:     \nInformation Number:     240-907-2688\n\nLocation(s):     \nMidCounty DHHS Building\n\n1301 Piccard Drive, Rockville, MD 20850\nDHHS Silver Spring Center\n\n8818 Georgia Avenue, Silver Spring, MD 20910\nUpCounty Regional Services Center\n\n12900 Middlebrook Road, Germantown, MD 20874\nNeighborhood Opportunity Network (NON) at Catholic Charities\n\n12247 Georgia Avenue, Silver Spring, MD 20906\nTakoma East Silver Spring (TESS) Center\n\n8513 Piney Branch Road, Silver Spring, MD 20901\nNeighborhood Opportunity Network (NON) at Family Services\n\n610 East Diamond Avenue (Suite 500), Gaithersburg, MD 20877"
  },
  {
    "addressLine1": "3601 Taylor Street",
    "city": "Brentwood",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20722",
    "name": "Prince George's County Family Crisis Center Shelter",
    "organization": "Prince George's County Family Crisis Center Shelter",
    "phone": "(301) 731-1203",
    "website": "https://www.fccpg.org/",
    "description": "Provides domestic violence resources.\n\n\nSERVICES:\n\n1) SHORT-TERM SHELTER: Provides 24-hour shelter for women and their children who are victims of domestic violence. May stay 30 to 90 days.\n\n\n2) BATTERERS INTERVENTION: Counseling & anger management teaching individuals and families how to relate to each other without the use of violence.\n\n\n\n3) GROUP COUNSELING: For both survivors and abusers of both sexes.\n\n\n4) YOUTH SERVICES: Summer day camp for youth ages 8-12. Social skills training for 4th grade students in Prince George's County Schools. Teaches students non-violent problem solving skills. Children's counseling and teen dating violence prevention program.\n\n\n5) LEGAL ASSISTANCE: Provides legal information and representation in English and Spanish. Helps clients fill out required paperwork and prepare for legal cases.\n\n\n\n\nHours Of Operation Counseling: Mon-Wed, 10AM-7:30PM; Thurs, 8:30AM-5PM; Fri, 10AM-5PM.\n\n\n\n\n\nEligibility Men and/or women who are involved in a domestic violence crisis.\n\n\n\n\nSliding fee scale for abuse intervention program & supervised visitation. Other services free.\n\n"
  },
  {
    "addressLine1": "920-A Rhode Island Avenue Ne",
    "city": "Washington",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20018",
    "name": "Virginia Williams Family Resource Center",
    "organization": "Virginia Williams Family Resource Center",
    "phone": "(800) 535-7252",
    "website": "http://www.dccfh.org/",
    "description": ""
  },
  {
    "addressLine1": "627 Race Street",
    "city": "Cambridge",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21613",
    "name": "Dorchester County DSS",
    "organization": "Dorchester County DSS",
    "phone": "(410) 901-4100",
    "website": "https://dhs.maryland.gov/local-offices/dorchester-county/",
    "description": ""
  },
  {
    "addressLine1": "200 Washington Street",
    "city": "Cambridge",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21613",
    "name": "Salvation Army Cambridge MD",
    "organization": "Salvation Army Cambridge MD",
    "phone": "(410) 228-2442",
    "website": "https://twitter.com/salarmymidshore",
    "description": ""
  },
  {
    "addressLine1": "126 Port Street",
    "city": "Easton",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21601",
    "name": "Neighborhood Service Center, Inc.",
    "organization": "Neighborhood Service Center, Inc.",
    "phone": "(410) 822-5015",
    "website": "https://www.facebook.com/neighborhoodservicecenter/",
    "description": "Transitional & emergency housing, transportation, meals, counseling, case management, tutoring. Heating & electric bill assistance. Rent Assistance. 911 (after-hours emergencies)"
  },
  {
    "addressLine1": "109 Goldborough St",
    "city": "Easton",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21601",
    "name": "Talbot Interfaith Homeless Shelter",
    "organization": "Talbot Interfaith Homeless Shelter",
    "phone": "(410) 253-5414",
    "website": "http://www.talbotinterfaithshelter.org/",
    "description": "TIS is a facility where families and individuals who are facing homelessness can have respite from bills and the stress of finding shelter so they are able to return to being productive members of our community. TIS has limited transitional housing for families who qualify.\n\nTIS provides overnight shelter and support for men, women, and families in a home environment. TIS is alcohol and drug free.\n\nTalbot Interfaith Shelter is an alcohol and drug free facility. Potential guests must pass a drug test and background check, and appear for an in-person interview prior to being accepted into Eastons Promise.\n\nIs Talbot Interfaith Shelter at Eastons Promise right for you?\nDo you have a clean criminal history and no history of drug abuse?\nWould you be comfortable in a home-like setting alongside families with children?\nDo you value your privacy, and can you respect the privacy of others?\nAre you willing to adhere to program rules and requirements?\nAre you open to making new social connections to volunteers from our local\ncommunity?\n\nIf you answered yes to all of these questions, TIS and Eastons Promise may be a good fit. Call our Operations Manager at 410-253-5414 to find out more.\n"
  },
  {
    "addressLine1": "1400 Doewood Lane",
    "city": "Capitol Heights",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20743",
    "name": "United Communities Against Poverty, Inc. (UCAP)",
    "organization": "United Communities Against Poverty, Inc. (UCAP)",
    "phone": "(301) 322-5700",
    "website": "https://www.ucappgc.org/",
    "description": "Emergency Shelter for Women and Children. Our 100bed emergency facility is operated and monitored 24 hours a day, 365 days a year by caring professionals. Our case management staff uses the Continuum of Care Model, which helps to effectively coordinate and link clients to resources. Our primary goal is to provide a clean and safe environment for our residents with the ultimate goal of their obtaining transitional or permanent housing.Program Services:\nThree balanced and nutritious meals every day\nFree fully equipped day care (for children 6 weeks 5 years old)\n\nAfterschool program (for children 5 to 12 year old)\nPermanent and transitional housing assistance\nEducation and employment services\nTransportation assistance\nHealth care, including mental health and substanceabuse services\nEvening and weekend recreational, entertainment and social activities\n\nSupportive Social Services:\nPhysical and mental health care assistance\nSubstance abuse counselling\nEmployment assistance (i.e., job training, searching, placement and retention)\nEducation (i.e., GED, Microsoft Certified software instructions, and professional trade skill certifications)\nHousing (i.e., transitional, permanent and homeownership)\nOther supportive services as needed and required\n"
  },
  {
    "addressLine1": "603 Addison Road South",
    "city": "Capitol Heights",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20743",
    "name": "Transition Center at Prince George's House",
    "organization": "Transition Center at Prince George's House",
    "phone": "(301) 808-5317",
    "website": "",
    "description": "Emergency shelter. Transitional housing. Meals, housing, counseling, substance abuse counseling. Mental health counseling. Employment & training services"
  },
  {
    "addressLine1": "1400 Doewood Lane",
    "city": "Capitol Heights",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20743",
    "name": "Shepherd's Cove Women's Shelter",
    "organization": "Shepherd's Cove Women's Shelter",
    "phone": "(301) 386-4444",
    "website": "http://www.ucappgc.org/",
    "description": "CCSI Hotline - 1-888-731-0999\n\nCapacity: 20 beds for women, 80 beds for families.\nPopulation: Residents of Prince George's County; women and children only.\n\nServices: Case management services with linkages to all appropriate resources & services; educational training, GED, computers, resumes and transitional housing\n\n\nUCAP's Shepherd's Cove is one of the largest shelters in Prince George's County, offering emergency housing and comprehensive social services for women and children. In 2006, the shelter served over 800 women and children. Happy Places = Happy Faces organizers chose to makeover this former elementary school to ensure that residents could live in a warm and inviting space that not only supported their efforts to become self sufficient, but also enhanced their sense of self worth.\n"
  },
  {
    "addressLine1": "311 68th Place",
    "city": "Seat Pleasant",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20743",
    "name": "Community Ministry of PG County Warm Nights Shelter",
    "organization": "Community Ministry of PG County Warm Nights Shelter",
    "phone": "(301) 499-2319",
    "website": "https://cmpgc.com/",
    "description": "Emergency winter shelter. Transitional housing. End of November to end of March. Shelter Hotline: 1-888-731-0999"
  },
  {
    "addressLine1": "107 N. Liberty Street",
    "city": "Centreville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21617",
    "name": "Queen Anne's County DH&CS Housing & Community Services",
    "organization": "Queen Anne's County DH&CS Housing & Community Services",
    "phone": "(410) 758-3977",
    "website": "https://dhs.maryland.gov/local-offices/queen-annes-county/",
    "description": "Emergency shelter placement. Eviction prevention. Heating & electric bill assistance"
  },
  {
    "addressLine1": "350 High Street",
    "city": "Chestertown",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21620",
    "name": "Kent County DSS",
    "organization": "Kent County DSS",
    "phone": "(410) 810-7600",
    "website": "https://www.kentcounty.com/government",
    "description": "Emergency shelter placement. Food vouchers. Assistance with applying for benefits. Homelessness prevention (financial assistance). Heating & electric bill assistance"
  },
  {
    "addressLine1": "PO Box 44",
    "city": "Chester",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21619",
    "name": "Haven Ministries",
    "organization": "Haven Ministries",
    "phone": "(410) 739-4363",
    "website": "http://haven-ministries.org/",
    "description": "Shelter Location: Seasonal shelter, year round transitional housing.\nShelter location:\nKent Island United Methodist Church\nFellowship Hall\n2739 Cox Neck Road\nNear corner of Cox Neck Road and Route 50\n\nHaven Ministries homeless shelter is open December 1 - mid April. Sign in time is 6-7pm every night. No daytime services available.\n\nHaven Ministries Transitional Housing Program is open year round with case management services.\n\n\nHaven Ministries Shelter is a temporary winter shelter serving the homeless of Queen Anne's County and surrounding areas. The shelter is open from December into April and is operated by some staff members along with a volunteer force made up of area Christian churches and community members. Haven Ministries Shelter is the result of the planning and support of Haven Ministries, an alliance of Christian churches working as one body to help those in need in the name of Jesus Christ.\n\nHaven Ministries Transitional Housing Program a transitional housing opportunity that offers safe and affordable housing along with an intensive case management program. Haven Ministries Transitional Housing Program is also the result of the planning and support of Haven Ministries, an alliance of Christian churches working as one body to help those in need in the name of Jesus Christ."
  },
  {
    "addressLine1": "6700 Freetown Road",
    "city": "Columbia",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21044",
    "name": "Grassroots Crisis Intervention",
    "organization": "Grassroots Crisis Intervention",
    "phone": "(410) 531-6006",
    "website": "https://www.grassrootscrisis.org/",
    "description": "Provides free 24-hour telephone and walk-in crisis counseling, emergency shelter, transitional housing, and community education in the Central Maryland area. Also offers a mobile crisis team for psychiatric emergencies.\n\nFAMILY AND WOMEN'S SHELTER: Provides 33-bed shelter for individuals or families. Provides meals, case management, individual and group counseling, supportive services and transportation. Length of stay determined on an individual case basis.\n\n\nMEN'S SHELTER: 18-bed shelter is available for men in need. Offers the same services as the emergency shelter. Length of stay determined on an individual case basis.\n\nCOLD WEATHER SHELTER: Operates during the winter months (usually Nov-Mar). Offers overnight shelters, food and case management services. Residents must leave during daytime hours. Shelter revolves around several, faith based communities in the Columbia, MD area.\n\nHPRP: Financial assistance is available for eviction prevention, rental assistance and security deposits. Do not have to have children to qualify.Potential recipients must meet the following eligibility:\nHoward County resident\nHave the proven ability to maintain stable housing\nBe employed or are employable\nHave an eviction notice or have a written letter from a landlord about a pending eviction\nIncome must be at 50% of the median income as determined by HUD\n\nMust be homeless if in need of a security deposit or rental assistance\n24-HOUR CRISIS INTERVENTION AND REFERRAL: Offers a hotline and walk-in counseling center for those in need of immediate assistance with a personal, situational, or mental health crisis. Services are free of charge and confidential. Certified suicide prevention center."
  },
  {
    "addressLine1": "9520 Berger Road, Suite 311",
    "city": "Columbia",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21046",
    "name": "Bridges to Housing Stability",
    "organization": "Bridges to Housing Stability",
    "phone": "(410) 312-5760",
    "website": "https://bridges2hs.org/",
    "description": "HOUSING STABILITY PROGRAMBridges assists Howard County households who are homeless or in danger of losing their housing.What Bridges Offers: Housing Advocacy (case management aimed at housing stability) A supportive environment Goal planning for future housing stability Referrals to community resources Budgeting Problem solving approach Mediation with landlordsWhy Contact Bridges: Howard County resident or your organization is assisting a Howard County resident Behind on rent Facing future eviction Paying most of income for housing Poor credit and/or rental history Willing to work with a Housing Advocate Homeless and seeking stable housingBridges services are directed toward long term housing stability.We do NOT offer immediate crisis services for homeless families or for those about to be evicted."
  },
  {
    "addressLine1": "6700 Freetown Rd",
    "city": "Columbia",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21044",
    "name": "Grassroots Crisis Intervention Family Shelter Program",
    "organization": "Grassroots Crisis Intervention Family Shelter Program",
    "phone": "(410) 531-6006",
    "website": "http://www.grassrootscrisis.org/",
    "description": "Family Shelter ProgramGrassroots operates the only general emergency shelter in Howard County at 6700 Freetown Road in Columbia, MD.  The program has 33 beds for families and single adult women experiencing a shelter crisis"
  },
  {
    "addressLine1": "6700 Freetown Road",
    "city": "Columbia",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21044",
    "name": "Randy Sands Men’s Shelter",
    "organization": "Randy Sands Men’s Shelter",
    "phone": "(410) 531-6677",
    "website": "http://www.grassrootscrisis.org/",
    "description": "The  Randy Sands Mens Shelter can serve up to 18 single adult men. The program serves about 55 75 men per year. Each resident has a primary counselor or case manager and an individualized housing plan which could include employment, a savings plan, addictions treatment, psychiatric treatment, training or GED, and debt management. All of the support services available to families are also provided to our male residents. The structure of the residents length of stay applies to the mens shelter as well"
  },
  {
    "addressLine1": "311 Laurel Avenue",
    "city": "Laurel",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20707",
    "name": "Laurel Advocacy & Referral Services",
    "organization": "Laurel Advocacy & Referral Services",
    "phone": "(301) 776-0442",
    "website": "https://www.laureladvocacy.org/",
    "description": "HOURS OF OPERATION\nMonday: 9:00a.m. - 2:00p.m. & 5:00p.m. - 7:30p.m.\nWednesday: 9:00a.m. - 2:00p.m.\nFriday: 9:00a.m. - 2:00p.m.\n\nLARS serves homeless and low-income families and individuals in Laurel, Maryland. Our service area includes parts of Prince George's (zip codes 20707 and 20708), Howard (20723), and Anne Arundel (20724) Counties.Services including: short-term financial assistance to prevent evictions and utility stoppage; assistance with security deposits and first months rent; vouchers for eyeglasses, hearing aids, clothing and furniture; referrals for shelter; and a food pantry which can be utilized by clients. LARS can assist homeless clients with obtaining ID cards and birth certificates, prescriptions and other minor health expenses, drug treatment referrals , and mental health needs."
  },
  {
    "addressLine1": "146 Bedford Street",
    "city": "Cumberland",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21502",
    "name": "Family Crisis Resources Center",
    "organization": "Family Crisis Resources Center",
    "phone": "(301) 759-9246",
    "website": "http://www.familycrisisresourcecenter.org/",
    "description": "24/7 Crisis Support Hotline: 301.759.9244\n*NEW* Text Message (SMS) Support Line: 301.970.4242\nFamily Crisis Resource Center, Inc., offers a variety of services to victims/survivors of domestic violence and sexual assault, including a 24 hour hotline, shelter, counseling, advocacy, accompaniment, and referrals.\n\n\nVictims of domestic violencerape/sexual assault assistance\nTemporary safe shelter\nMeals, counseling\nProgram for male (including counseling)\nTransitional housing for women"
  },
  {
    "addressLine1": "205 Baltimore Avenue",
    "city": "Cumberland",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21502",
    "name": "Central YMCA",
    "organization": "Central YMCA",
    "phone": "(301) 724-5445",
    "website": "https://www.cumberlandymca.org/housing.html",
    "description": "Emergency shelter\nTransitional housing\nChild care program\nPermanent housing for single men\nCase management\nInformation & referrals\nEmployment training"
  },
  {
    "addressLine1": "16 Gulf Memorial Drive",
    "city": "Cumberland",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21502",
    "name": "Union Rescue Mission of Western Maryland",
    "organization": "Union Rescue Mission of Western Maryland",
    "phone": "(301) 724-1585",
    "website": "https://urmcumberland.org/",
    "description": "Emergency shelter. Meals, Counseling. Serves handicapped individuals. This is a religious organization."
  },
  {
    "addressLine1": "1 Frederick Street",
    "city": "Cumberland",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21501",
    "name": "Allegany County Department of Social Services",
    "organization": "Allegany County Department of Social Services",
    "phone": "(301) 784-7020",
    "website": "https://www.facebook.com/ACDSSCumberland/",
    "description": "The department of Social Services provides homeless assistance with emergencies. This includes motel placement along with assistance applying for benefits including cash assistance for women with children.\n\nThis service is for everyone in emergency situations."
  },
  {
    "addressLine1": "19 Frederick St",
    "city": "Cumberland",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21502",
    "name": "Allegany County Human Resources Women's Transitional Housing",
    "organization": "Allegany County Human Resources Women's Transitional Housing",
    "phone": "(301) 777-8286",
    "website": "",
    "description": "Provides transitional housing for women and women with children. Other services provided: Case management, Information, Assistance applying for benefits, Utility Assistance, 1 month's rent and security deposit assistance (rent assistance)."
  },
  {
    "addressLine1": "10241 Lincoln Highway",
    "city": "Everett",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "15537",
    "name": "BEDFORD Human Services Administrator",
    "organization": "BEDFORD Human Services Administrator",
    "phone": "(814) 623-2002",
    "website": "",
    "description": "This is not a homeless shelter, This is an area homeless resource. If you are in the area of BEDFORD Human Services Administrator, call them for help regarding their Homeless Assistance Programs."
  },
  {
    "addressLine1": "P.O. Box 5",
    "city": "Denton",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21629",
    "name": "Mid-Shore Council on Family Violence",
    "organization": "Mid-Shore Council on Family Violence",
    "phone": "(410) 479-1149",
    "website": "https://mscfv.org/",
    "description": ""
  },
  {
    "addressLine1": "300 Market Street",
    "city": "Denton",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21629",
    "name": "Caroline County Department of Social Services, Homeless Program",
    "organization": "Caroline County Department of Social Services, Homeless Program",
    "phone": "(410) 819-4500",
    "website": "",
    "description": "Provides non-monetary assistance to households with a pending eviction. Provides resources to help families and individuals who are at risk for eviction to stay in their rental homes. Early intervention is also available to avoid possible eviction.\n\nEligibility Homeless men, homeless women, including women with children.\n\nHours: Monday - Friday 8am - 5pm."
  },
  {
    "addressLine1": "409 Aldersgate Dr",
    "city": "Denton",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21629",
    "name": "His Hope Ministries",
    "organization": "His Hope Ministries",
    "phone": "443-448-7297",
    "website": "https://hishopeministries.org/",
    "description": "His Hope Haven is a cold weather homeless shelter program providing a compassionate, energetic life-saving community resource and ministry. It is a faith-based, non-profit organization striving to provide a spiritually and physically safe Winter Haven for people experiencing homelessness. \nWe provide guidance and temporary housing in a safe and dignified environment and strive to help our guests regain productive and independent lives.Services Provided:  \n\nHis Hope Haven accepts single men and women, as well as family groups, as guests. Potential guests MUST be referred through the Caroline County Dept. of Social Services. \nThe shelter opens at 5:30 PM and guests are provided with dinner, breakfast the next morning, and a packed lunch. Shower facilities are available. Guests leave at 7 AM each morning. Guests without transportation are driven into Denton, and picked up there later. Volunteers accepted and donations appreciated."
  },
  {
    "addressLine1": "14374 Benedictine Lane",
    "city": "Ridgely",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21660",
    "name": "Saint Martin's House - Transitional Housing Women",
    "organization": "Saint Martin's House - Transitional Housing Women",
    "phone": "(410) 634-2537",
    "website": "http://www.stmartinsministries.org/",
    "description": "SMH is a two-year transitional housing program to assist homeless women and their children in gaining educations, self-knowledge and life skills. Requires commitment and desire to change behaviors. Check website and facebook for further information."
  },
  {
    "addressLine1": "P. O. Box 3909",
    "city": "Dundalk",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21222",
    "name": "Family Crisis Center",
    "organization": "Family Crisis Center",
    "phone": "(410) 285-7496",
    "website": "http://www.familycrisiscenter.net/",
    "description": "Shelter\n410.285.7496\n24 Hours/ 7 Days A Week\n\nCrisis Hotline\n410.828.6390\n24 Hours/ 7 Days A Week\n\nProvides assistance to individuals and families experiencing a domestic violence situation.\n\nEMERGENCY SHELTER PROGRAM: The Family Crisis Center Emergency Safe Shelter provides 90 days of anonymous safe shelter to adult and child victims of domestic who are forced to flee their homes to avoid further conflict or violence. While residing in the Emergency Safe Shelter clients are provide with services that will assist them in addressing the violence and finding a violence-free life after their stay at the shelter. These services include: shelter and meals for themselves and their children, crisis intervention and ongoing counseling, case management services (housing advocacy, medical referrals, job preparation, legal advocacy, resources and referrals) transportation expenses, support groups, parenting groups, childrens play groups, and school placement for children.\n\nTRANSITIONAL PROGRAMS: Provides transitional housing, up to 18 months for victims who first reside in the Emergency Safe Shelter.\n\nCOUNSELING: Provides individual and family counseling for those experiencing conflict and/or violence in their relationships.\n\nVICTIM ADVOCATE SERVICE: Provides advocates to make contact with victims whose abusers are enrolled in court ordered treatment at Family Crisis Center. Police/ Advocate home intervention with identified domestic violence cases reported to the police. Safety planning, information about legal resources and court room accompaniment.\n\nEligibility Family members attempting to end the conflict or violence in their relationships.\n\n"
  },
  {
    "addressLine1": "P.O. Box 2137",
    "city": "Elkton",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21922",
    "name": "Cecil County Domestic Violence Shelter",
    "organization": "Cecil County Domestic Violence Shelter",
    "phone": "(410) 996-0333",
    "website": "https://www.cecilhelp4u.com/Domestic-Violence-Rape-Crisis.html",
    "description": ""
  },
  {
    "addressLine1": "168 W Main St",
    "city": "Elkton",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21921",
    "name": "Settlement House - Cecil County Men's Shelter",
    "organization": "Settlement House - Cecil County Men's Shelter",
    "phone": "(410) 392-8066",
    "website": "https://meetingground.org/transitional-housing-for-men/",
    "description": "Emergency shelter, transitional shelter. Counseling Day shelter and meals(both males and females have access today shelter)\n\nThe Cecil County Men's Shelter, often referred to as Settlement House, provides transitional housing for men who are experiencing a period of homelessness in their lives. The Men's Shelter is within walking distance to medical services, social services, and employment opportunities. The men to move toward independence, greater self-sufficiency and increased hope and wholeness by receiving referrals to medical and mental health providers, help with a job search or improving education, case management, the hospitality of food and friendship, and individual and small group interaction.  The Men's Shelter works closely with the Veterans Administration and reserves eight of the fifteen beds for veterans who are experiencing homelessness."
  },
  {
    "addressLine1": "107 Delaware Avenue",
    "city": "Elkton",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21921",
    "name": "Wayfarer's House",
    "organization": "Wayfarer's House",
    "phone": "(410) 398-4381",
    "website": "",
    "description": "Emergency & transitional shelter. Meals Counseling"
  },
  {
    "addressLine1": "P.O. Box 2137",
    "city": "Elkton",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21921",
    "name": "Cecil County Department of Social Services",
    "organization": "Cecil County Department of Social Services",
    "phone": "(410) 996-0333",
    "website": "http://www.cecilhelp4u.com/Domestic-Violence-Rape-Crisis.html",
    "description": "Cecil County Department of Social Services, Domestic Violence Rape Crisis Program\n\nProvides services for victims and their family of domestic violence with assistance from community based programs.\nSERVICES:\n1) 24-HOUR HOTLINE: For persons with questions or concerns regarding domestic violence or sexual assault.\n2) SHELTER: Provides shelter for women, with or without children. Must have a history of serious domestic abuse or have been recently abused. Maximum 8-week stay. Case management. Provides referrals to men's shelters.\n\n3) BATTERERS' PROGRAM: 26-week anger management program designed to confront the violent behaviors of those individuals (men and women) who physically abuse their spouses and/or families. Self and court referrals accepted.\n4) COUNSELING PROGRAM: Individual and group counseling provided to adolescent and adult victims of domestic violence and sexual assault abuse.\n5) REFERRALS LEGAL SERVICES: Referrals to legal services for emergency domestic violence situations.\n6) ADVOCACY/SUPPORT: Accompanies victims of sexual assault and domestic violence to hospitals, courts and police stations.\n\nEligibility Ages 14 and older for counseling\nSliding scale fee for Shelter."
  },
  {
    "addressLine1": "401 North St",
    "city": "Elkton",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21921",
    "name": "Meeting Ground Emergency Rotating Shelter",
    "organization": "Meeting Ground Emergency Rotating Shelter",
    "phone": "(410) 620-3128",
    "website": "https://meetingground.org/",
    "description": "Winter Shelter.\n\nThe Meeting Ground Emergency Rotating Shelter provides shelter to individuals and families experiencing The only thing that countshomelessness during the cold winter months. We are blessed to partner with local churches and other organizations to offer this service to the community. The rotation begins in late November and runs through late March. For those interested in securing a place in the rotating shelter, intake takes place at 4PM Monday-Friday, at the Mary Randall Center. Meeting Ground will provide transportation and program management, while the churches will provide space, staffing and food. Thank you to the over 35 local churches who help to make the rotating shelter a beacon of hope to those without homes during the dangerously cold weather. This years ERS opened November 28."
  },
  {
    "addressLine1": "2501 Milltown Rd",
    "city": "Wilmington ",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "19808",
    "name": "Hospitality Center of Northern New Castle County",
    "organization": "Hospitality Center of Northern New Castle County",
    "phone": "(302) 998-2222",
    "website": "https://www.familypromisede.org/",
    "description": "We are an emergency hosting program. We provide emergency shelter for children and their families. We also provide case management, housing assistance and job search assistance.\n\nOur Hospitality Center provides needed temporary shelter to up to 6 families (or 20 individuals) at a time. This additional facility is helping us create twice the promise were now able to prevent & end homelessness for twice as many families annually. The Hospitality Center opened at the end of November 2018, and within 24 hours, it was already at capacity.\n"
  },
  {
    "addressLine1": "2015 20th Street",
    "city": "Fort Meade",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20755",
    "name": "Sarah's House",
    "organization": "Sarah's House",
    "phone": "(410) 421-8416",
    "website": "http://www.catholiccharities-md.org/sarahs-house/",
    "description": "Sarah's House is a supportive housing program, offering emergency and transitional housing with an array of other services for homeless families in Anne Arundel County.Emergency shelter\nTransitional housing\nReferral from DSS needed\nSarah's House is a supportive housing program, offering emergency and transitional housing with an array of other services for homeless families in Anne Arundel County.\n\nWe provide safe shelter, daily meals, and personal, as well as professional, casework support for those in need. As a supportive housing program for homeless families, Sarah's House is much more than just a safe place to sleep. Our goal is to effect positive change in the families we serve by providing the following:\nemergency housing for up to 90 days\ntransitional housing for 18 to 24 months\ncasework assistance for 12 months\nparenting classes\nGED classes\ncomputer classes and workshops\nemployment programs\nlicensed child care center\nvariety of counseling services\ntransportation to and from work and doctor appointments\nthree meals each day\nclothing\n\nWho we serve\nTo be a guest at Sarah's House, you must be referred by Anne Arundel County DSS, and all guests must be from Anne Arundel County."
  },
  {
    "addressLine1": "216 Abrecht Place",
    "city": "Frederick",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21701",
    "name": "Advocates for Homeless Families - Homeless Services",
    "organization": "Advocates for Homeless Families - Homeless Services",
    "phone": "(301) 662-2003",
    "website": "http://www.afhf88.org/",
    "description": "We are located near the intersection of College Avenue and Carroll Parkway just off of West Patrick St.\n\nPairs homeless or at-risk families with a case manager who helps them to identify the problems standing in their way and find solutions. Program requires a two-year commitment from participants and they must be clean and sober for six months prior to entry and must remain that way.\n\nSERVICES:\n1) TRANSITIONAL HOUSING: Housing fee is 30% of family's income. Parents must be involved in an educational or training program which will prepare them to secure permanent housing on their own. Parents must attend weekly workshops and support groups provided by the agency. Case manager provides support and makes weekly visits to ensure that needs are being met and that clients are progressing toward an independent lifestyle.\n\n2) FAMILIES FORWARD: Connects low-income families in economic crisis with appropriate resources to help them keep from losing their homes. These families receive the same comprehensive services as transitional housing families and must enroll in any education or job training program offered by the agency.\n\n\n3) DONATIONS: Accepts donations of small appliances and automobiles that are in working condition as well as gift cards from grocery and department stores. Items can be dropped off during business hours at 216 Abrecht Place, Frederick.\n\n4) HOLIDAY DONATIONS: In need of gift cards and monetary donations to provide Christmas gifts to established clients.\nHours: Mon-Fri, 9AM-5PM.\n\nTransitional Housing Program\nThe Transitional Housing Program is a two-year structured and holistic program provided to families who are homeless. The program, which includes individualized case management and Life Skills Workshops, is designed to support families in their transition to stable and independent living.\n\nThe Families Forward Program is designed to be preventative for families who are at-risk of becoming homeless. A two-year structured and comprehensive program providing individualized case management and Life Skills Workshops to support families in maintaining their self-sustainability and improve their standard of living."
  },
  {
    "addressLine1": "100 South Market Street",
    "city": "Frederick",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21701",
    "name": "Frederick Community Action Agency",
    "organization": "Frederick Community Action Agency",
    "phone": "(301) 600-1506",
    "website": "http://www.cityoffrederick.com/fcaa",
    "description": "Provides programs and services that assist mentally ill, disabled, homeless, and low-income residents.\nSERVICES:\n1) EDUCATION PROGRAM: Offers General Education Development (GED) classes Tues, Thurs, 7-9PM.\n\n2) SOUP KITCHEN: See separate listing. Frederick CAA, Soup Kitchen.\n3) FREDERICK FOOD PANTRY: Provides emergency food 6 days/week. Mon, Tues, Thurs and Fri, 2-4PM; Wed, 7-9PM; Sat, 11AM-1PM. Bread available, 1st come/1st served, Mon-Sat during business hours to community residents. Located at 14 E. All Saints Street.\n4) FREDERICK TRANSITIONAL SHELTER: Offers a 31-bed shelter with supportive services to homeless families with children and adults with physical disabilities.\n5) HEALTH CARE FOR THE HOMELESS (ATC) and PRIMARY ADULT CARE PROGRAM (PAC): See separate listing.\n6) HOUSING ASSISTANCE: Offers HUD-approved housing counseling that provides pre-purchase, default, delinquency and foreclosure housing counseling. Also provides information on rehabilitation loans and grants.\n7) PATH PROJECT: Provides case management and outreach services to people who are homeless and seriously mentally ill.\n\n8) PRESCRIPTION SERVICES: See separate listings - Medbank of Maryland, Inc. and Primary Adult Care Program.\n9) SUMMER FOOD SERVICE PROGRAM: Offers a free lunch to school age children. Lunch is offered Monday-Friday, 12-1PM.\n10) TRANSITIONAL APARTMENTS: Provides up to 24 months of transitional housing and supportive services for families. Families residing in transitional apartments must first be admitted and stabilized in transitional shelter.\n11) VAN RUN: Operates on Monday-Friday, 9AM-12PM. to transport clients to a variety of local human service agencies, including social services, citizens services, health department, social security, job service and Frederick Community College. Also offers van run to VA center in Martinsburg VA on the 1st and 3rd Friday at 9AM."
  },
  {
    "addressLine1": "27 DeGrange Street",
    "city": "Frederick",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21701",
    "name": "Alan P. Linton Emergency Shelter",
    "organization": "Alan P. Linton Emergency Shelter",
    "phone": "(301) 631-2670",
    "website": "http://www.thereligiouscoalition.org/programs-services/emergency-shelter/",
    "description": ""
  },
  {
    "addressLine1": "419 W South St",
    "city": "Frederick",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21701",
    "name": "Frederick Rescue Mission - Beacon House",
    "organization": "Frederick Rescue Mission - Beacon House",
    "phone": "(301) 695-6633",
    "website": "http://www.therescuemission.org/",
    "description": "Transitional shelter for homeless men, operated by the Frederick Rescue Mission.\n\nAn average of 70 men each year enter the doors of the Frederick Rescue Mission with the intention of getting their lives back on track after stints of homelessness, addiction, and/or jail time. What began as a ten-bed shelter in 1964, now can house up to 40 men participating in the Mission's year-long Changed Life Recovery Program. Men who go through the program attempt to attain these 8 goals:\n1 \"Be passionate about Jesus Christ\n2 \"Be victorious over addiction\n3 \"Be connected to a local church\n4 \"Have a mentor and/or be part of an accountability group\n5 \"Obtain education for the future\n6 \"Find safe and affordable housing\n7 \"Obtain a financially sustaining job\n8 \"Be reconciled to his family as much as possible\nAll men are required to participate in work therapy while they're in the program, which consists of helping to run the services the Mission provides to the community. Men will be assigned to areas such as the kitchen, recycling, the front desk, or facilities.\nA typical day for the men starts with quiet time, Bible study, and recovery curriculum. They then use their afternoons for work therapy. Their evenings are filled with recovery programming such as chapel, Celebrate Recovery, Bible classes, and/or relaxation and fun such as game nights or field trips.\n\nDuring his time in the program, a man has the opportunity to gain his GED, obtain his driver's license, work on his resume, and settle any ongoing court issues. The men are subjected to random drug, alcohol, and nicotine tests, with zero tolerance for using while in the program.\nIt is the Mission's hope to restore these men back to their families and communities as upstanding, influential men making a stand for lives of integrity"
  },
  {
    "addressLine1": "10 Distillery Drive",
    "city": "Westminster",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21157",
    "name": "Human Services Programs of Carroll County",
    "organization": "Human Services Programs of Carroll County",
    "phone": "(410) 857-2999",
    "website": "http://www.hspinc.org/",
    "description": "HSP is the point-of-entry for accessing a variety of community services and is a private, non-profit 501c3 corporation.\n\nHomeless Shelters\n    Intact Family Shelter  The purpose of this program is to provide a safe place for homeless families to stay together. Through case management, all families are offered individual time, resources and tools they need to address the causes of homelessness and provide encouragement to reach realistic goals as established in HSP's service agreement to ensure housing stability at the end of 12 weeks.\n\n    Women's & Children's Shelter  The purpose of this program is to provide a safe shelter environment for homeless women and their dependent children that will support their efforts to achieve self-sufficiency. Through case management, all residents are offered individual time, resources and tools they need to address the causes of homelessness and provide encouragement to reach realistic goals as established in HSP's service agreement with the client.\n\n   \nMen's Shelter  The purpose of this program is to provide a safe place for homeless men (8) to stay while establishing an income and looking for housing. Through case management, all residents are offered individual time, resources and tools they need to address the causes of homelessness and provide encouragement to reach realistic goals as established in HSP's service agreement with the individual.\n   \nSafe Haven Shelter The purpose Safe Haven is to offer low-demand services while providing safe, warm lodging, hot meals, bathing and laundry facilities to homeless mentally ill adults.\n    The goals set for each resident in this shelter vary depending upon their abilities and needs. Some of these goals are to maintain stability, increase daily living skills, increase alternative income support through establishing eligibility for entitlements, and eventually to engage in treatment and move into more permanent housing. Length of stay varies for each resident.\n  \n Cold Weather Shelter  The purpose of this program is to provide protection from freezing weather conditions during the winter months for homeless adults in Carroll County. This seasonal shelter operates from November 15th until March 30th.\n\nTo access Homeless Shelter services please call HSP's main number at 410.857.2999."
  },
  {
    "addressLine1": "511 S. Crain Highway",
    "city": "Glen Burnie",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21061",
    "name": "Winter Relief for the Homeless Arundel House of Hope",
    "organization": "Winter Relief for the Homeless Arundel House of Hope",
    "phone": "(410) 863-4888",
    "website": "https://www.facebook.com/Arundel-House-of-Hope-130811513618888/",
    "description": "Emergency shelter November - April. Rotate weekly as host-site locations (all prospective clients must be screened & referred by the Salvation Army, Glen Burnie at number listed, by 3:30 pm each day)"
  },
  {
    "addressLine1": "514 North Crain Highway, Suite K",
    "city": "Glen Burnie",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21061",
    "name": "Arundel House of Hope, Day Resource Center",
    "organization": "Arundel House of Hope, Day Resource Center",
    "phone": "(410) 863-4888",
    "website": "http://www.arundelhoh.org/",
    "description": "DROP-IN: Provides hospitality such as coffee, snacks, showers, use of phones and computers, clothing and toiletries. Case management and referral to services are provided for applications for benefits, medical care, job assistance, substance abuse treatment programs, housing and other identified issues.\n\nEligibility Homeless men and women over 18 years old.\n\n\nWalk-in for services. Some may require a sign in, such as case management and referral."
  },
  {
    "addressLine1": "514 North Crain Highway, Suite K",
    "city": "Glen Burnie",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21061",
    "name": "Safe Haven for Men - Arundel House of Hope",
    "organization": "Safe Haven for Men - Arundel House of Hope",
    "phone": "(410) 863-4888",
    "website": "http://www.arundelhoh.org/",
    "description": "Provides permanent housing for homeless men with mental health and/or substance abuse issues. Case management is provided for referral to appropriate services.\n\nEligibility Chronically homeless men over 18 years old who have mental health and/or substance abuse issues and are not yet in recovery or in a formal recovery program.\n\nOffers a sliding fee scale.\n\nDocuments Required Referral required from case worker. Will need Picture ID and medical/psychiatric records."
  },
  {
    "addressLine1": "514 North Crain Highway, Suite K",
    "city": "Glen Burnie",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21061",
    "name": "Women in Safe Haven - Arundel House of Hope",
    "organization": "Women in Safe Haven - Arundel House of Hope",
    "phone": "(410) 863-4888",
    "website": "http://www.arundelhoh.org/",
    "description": "Provides permanent housing for chronically homeless women who have mental health and/or substance abuse issues. Case management is provided for referral to appropriate services.\n\nEligibility Chronically homeless women over 18 years old who have mental health and/or substance abuse issues\n\nDocuments Required Referral required from case worker. Will need Picture ID and medical/psychiatric records."
  },
  {
    "addressLine1": "116 W. Baltimore Street",
    "city": "Hagerstown",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21740",
    "name": "CASA: Citizens Assisting and Sheltering the Abused",
    "organization": "CASA: Citizens Assisting and Sheltering the Abused",
    "phone": "(301) 739-4990",
    "website": "http://www.casainc.org/",
    "description": "For battered/homeless women & their children. Emergency shelter. Meals, Counseling. Case management, Employment assistance. Support group. 301-739-8975 (CASA Hotline). TDD - 301-739-8975"
  },
  {
    "addressLine1": "534 W. Franklin Street",
    "city": "Hagerstown",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21740",
    "name": "Salvation Army - Hagerstown",
    "organization": "Salvation Army - Hagerstown",
    "phone": "(301) 733-2440",
    "website": "https://www.facebook.com/SalvationArmyUSA",
    "description": "Emergency and transitional shelter. Meals, Counseling"
  },
  {
    "addressLine1": "117 Summit Ave",
    "city": "Hagerstown",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21740",
    "name": "Washington County Community Action Council, Inc",
    "organization": "Washington County Community Action Council, Inc",
    "phone": "301-797-4161",
    "website": "https://www.wccac.org/",
    "description": "Emergency shelter (for families).\nAdditional Services:\nFinancial assistance\nFood\nCase management\nRental allowance program\nHeating & electric bill assistance\n"
  },
  {
    "addressLine1": "140 West Franklin Street, Suite 300",
    "city": "Hagerstown",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21740",
    "name": "REACH of Washington County",
    "organization": "REACH of Washington County",
    "phone": "(301) 733-2371",
    "website": "http://www.reachcaregivers.org/",
    "description": "REACH assists the often forgotten members of our community...the poor and homeless through the following programs:\n\nCrisis Intervention\nSummer Hours: Mon-Thur, 9am-1pm\nMon - Shower and Laundry for the homeless\nTue/Thur - Crisis Intervention for county residentsVolunteers provide assistance to those facing housing and utility emergencies as well as other basic needs. Program includes 24-hour emergency shelter assistance.\n\nCold Weather Shelter\nProvides homeless adults a safe shelter of last resort to avoid the risk of death or bodily harm from hypothermia. Operates from the last Sunday of October to the first Sunday of April each year."
  },
  {
    "addressLine1": "125 N. Prospect Street",
    "city": "Hagerstown",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21740",
    "name": "The Hope Center at Hagerstown Rescue Mission",
    "organization": "The Hope Center at Hagerstown Rescue Mission",
    "phone": "(301) 739-1165",
    "website": "https://www.hagerstownhopecenter.com/",
    "description": "Hours: 24 hours a day, 365 days a year.\n\nShelter for men only.\n\nAt this time we do not have enough space to accomodate day guests.  In addition, we encourage people staying here to be out and about looking for work and actively working their way out of homelessness.\n\nDue to limited space we currently have no place to store your belongings. We recommend that you come with the minimum amount you can get along with. Hopefully this will fit in a backpack that you can take with you.\n\n\nWhile a guest at The Hope Center you are provided three free meals a day. This allows you to save your money towards your future housing needs. In addition to The Hope Center, there are a few other places that serve meals.\n\nDo you allow people to come there from jail, prison or on parole?\nYes, we know that many people being released have no where to go and we, like Jesus, do not discrimate due to your past. If you are on parole from another county, we will ask you to communicate with your current agent and have them seek a transfer before coming.\n\n\nCan I bring a vehicle?\nYou may bring your vehicle and park it here overnight but it must be off property during the day. If you have a special circumstance you may request a short term exception.\n\n\nDo you have private rooms?\nUnfortunately due to space limitations we do not. Overnight guests sleep in an open area and mattresses are given out each night.\n\nHow long can I stay?\nGuests are allowed to stay for up to thirty (30) days if they follow our rules. Futhermore, if they follow the rules they may request two (2) one week extensions. However, if you are professionally homeless it will be up to the discretion of the evening chaplains if they will grant any of these extensions. Simply put they are not a right.\n\n\nWhat about in the winter months?\nIn the winter the stay can be longer but we still encourage everyone to seek long term work and housing during their stay.\n\nDo I have to attend religious services?\nYes, there is a ten (10) minute devotional before Soup Line (lunch) and an hour long service before the evening meal. Refusal to attend will cause you to miss a meal or even lose the privilege of staying."
  },
  {
    "addressLine1": "236 W. Martin Street",
    "city": "Martinsburg",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "25402",
    "name": "Berkeley County Outreach Office",
    "organization": "Berkeley County Outreach Office",
    "phone": "(304) 263-8522",
    "website": "https://epecwv.org/",
    "description": "24 hour hotline: 304.263.8292\n\nIf you think you are in an abusive relationship, need emergency shelter because of your violent partner or have been sexually assaulted, you can call EPEC 24 hours a day, 7 days a week, 365 days a year. Our hotline is completely confidential. You do not have to give your name to the operator if you don't want to."
  },
  {
    "addressLine1": "216 E John St",
    "city": "Martinsburg",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "25401",
    "name": "Community Networks Inc. - Bethany House",
    "organization": "Community Networks Inc. - Bethany House",
    "phone": "(304) 263-3510",
    "website": "https://www.facebook.com/CommunityNetworksInc/",
    "description": ""
  },
  {
    "addressLine1": "608 W. King St",
    "city": "Martinsburg",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "25401",
    "name": "Martinsburg Union Rescue Mission",
    "organization": "Martinsburg Union Rescue Mission",
    "phone": "(304) 263-6901",
    "website": "http://www.martinsburgrescuemission.com/",
    "description": "The Rescue Mission currently operates a guest shelter and four residential rehabilitation programs. Our current facilities have the capacity to provide shelter for up to 78 men.\n\nGuest Shelter Program: provides emergency and short-term shelter, food and clothing to adult males. Needs evaluation counseling is conducted within three days of a new man's arrival. A TB/Health check is required within seven days. Guest length of stay is limited to seven days per calendar month and a total of twenty-eight days per calendar year. After assessing a new man's needs, he may be referred to an alternative community program or organization. These include, but are not limited to Eastridge Health Systems, Veteran's Administration, Telemon, Department of Health and Human Resources, Congregational Cooperative Action Program, Red Cross, Shalom Resource Center and Salvation Army. During the 7-day period men may receive job search assistance through access to Mission telephones, computers, and the Internet. Resume preparation assistance is available.\n \nResidential Programs\n \nSupport-Rehab Program is the core mission program that new men enter into. It is a Christ-centered approach to recovery, whether suffering from drug or alcohol addiction, mental illness, or any number of other difficulties. Through the daily practice of Christian teachings, prayer, non-denominational chapel services, scripture study, and one-on-one spiritual counseling with staff and senior program participants, individuals begin to transform their lives, turning it over to a power greater than themselves. The core program brings structure and order to the men's lives through required daily routines: prayer, shared meals, personal hygiene, work, and chapel service attendance.\n \nThis regular structure and required labor helps restore dignity. It boosts self-esteem and self-confidence in participants by building a healthy work ethic, job skills, teamwork, problem solving skills, and leadership skills. A strict, no-tolerance-for-drugs-and-alcohol environment is maintained. Social skills are developed through peer and community interaction. Participation in church, social, and civic groups is strongly encouraged. If needed, involvement with Alcoholics Anonymous and similar groups are encouraged. Participants can avail themselves of life skills training, conducted by partner organizations on topics like household budget preparation and management, meal preparation, grocery shopping, apartment rental, and proper health care. They may also complete GED requirements while in the rehab program if desired.\n\n \nA staff employee provides individualized counseling to help participants obtain qualifying social service benefits, job skill training, permanent housing, GED assistance, and employment opportunities, so participants can return to productive lives in the community.\n \nJob assignments for participants in the Support-Rehab Program include warehouse helpers, who assist with the recycling program; cook helpers, who assist with preparing and serving meals; housekeepers, who clean and perform light building maintenance; driver's assistants, who help with community donation pick-ups and store deliveries; and grounds maintenance workers, who care for the mission's grounds.\n \nJob-Training Program is available to those who desire to continue their education. These residents are required to participate in the Mission's core recovery program while attending classes at a post secondary educational facility in the community.\n\n \nCommunity-Employment Program is a halfway program that allows men to reside at the Mission while employed in the community. Employment may be full-time or a combination of part-time in the community and part-time at the Mission. These men are also required to participate in the Mission's core recovery program.\n \nPermanent-Supportive-Housing Program is designed to allow men to continue in the Mission's core recovery program while providing avenues for increased responsibility and authority. A participant in this program assumes a residential staff position in administration, food services, housekeeping, transportation, store operations or facilities and grounds maintenance.\n \nIn return the men are provided room, board, clothing, toiletries, and a small weekly stipend. Participants in this program have found that they need the daily supportive structure of the mission to maintain their sobriety and live productive lives. Many of these men have no family support and are ineligible for social services or health care programs.  The mission is their home and their family support.\n \nNon-Residential Programs\n \nClothing, Emergency Food, Emergency Furniture Program: serves the needs of community families and individuals.  It is available to anyone in need. Three meals are served at the mission daily, of which families or individuals may partake without cost. Additionally, families and individuals can receive free monthly vouchers to shop for clothing in the mission's thrift store. Free food boxes and furniture are also available to families or individuals on an emergency basis when referred by churches or local aid-assistance organizations. Hundreds of families are served each year.\n"
  },
  {
    "addressLine1": "PO Box 613",
    "city": "Hughesville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20637",
    "name": "Catholic Charities Angel's Watch Shelter",
    "organization": "Catholic Charities Angel's Watch Shelter",
    "phone": "(301) 274-0680",
    "website": "https://www.catholiccharitiesdc.org/housinghelp/angelswatch/",
    "description": ""
  },
  {
    "addressLine1": "3470 Rockefeller Court",
    "city": "Waldorf",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20602",
    "name": "Robert J. Fuller Transitional House Homeless Advocacy Assn., Inc.",
    "organization": "Robert J. Fuller Transitional House Homeless Advocacy Assn., Inc.",
    "phone": "(301) 645-2933",
    "website": "https://www.lifestylesofmd.org/robert-j-fuller-transitional-house",
    "description": "Transitional and emergency housing for men. Meals"
  },
  {
    "addressLine1": "200 Kent Avenue",
    "city": "La Plata",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20646",
    "name": "Charles County Department of Social Services",
    "organization": "Charles County Department of Social Services",
    "phone": "(301) 392-6724",
    "website": "https://twitter.com/charlescdss",
    "description": "Assists the family with crises, including food and shelter emergencies, and provides counseling services to assist the family to overcome problems of parenting, parent-child conflict and family dysfunction.\nEligibility: Families with children and vulnerable adults.\nHours: Mon-Fri, 8AM-5PM"
  },
  {
    "addressLine1": "200 Kent Avenue",
    "city": "LaPlata",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20646",
    "name": "Charles County DSS",
    "organization": "Charles County DSS",
    "phone": "(301) 392-6400",
    "website": "https://www.facebook.com/CharlesCountyDSS/",
    "description": "Emergency shelter placement. Food Counseling, case management. Assistance with benefits applications. 301-934-2222 (after-hours)"
  },
  {
    "addressLine1": "23110 Leonard Hall Drive",
    "city": "Leonardtown",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20650",
    "name": "St. Mary's County DSS - Joseph D. Carter Bldg.",
    "organization": "St. Mary's County DSS - Joseph D. Carter Bldg.",
    "phone": "(240) 895-7001",
    "website": "",
    "description": "Emergency shelter placement. Counseling, case management. Assistance with applying for benefits. Job development. Lexington Park: 240-725-5700/5701, 301-475-8016 (DSS Crisis Line)"
  },
  {
    "addressLine1": "484 Main St",
    "city": "Prince Frederick",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20678",
    "name": "Project Echo Inc",
    "organization": "Project Echo Inc",
    "phone": "410-535-0044",
    "website": "https://projectecho.net/",
    "description": "Emergency shelter. Meals Area agency referral. Our \"new\" 40 bed house was built in 2010.\n\nTemporary Shelter for up to 90 days\nWhat kind of shelter are we:\nWe are a transitional shelter.  Our aim is to create a living area where the residents can take time out from surviving and focus on getting their lives in order in a safe, drug and alcohol free environment so they can move on to being productive and happy members of society.  Various types of counseling, both individually and as a group, are available.\nECHO's goal is to help re-integrate our homeless into the community. Individuals may stay up to 90 days at the shelter. Residents are required to actively pursue housing and employment goals, as well as education, job training and drug and alcohol treatment as needed. The shelter manager assesses their needs and coordinates with county agencies to provide support. Residents are not charged a fee for their time at the shelter. Instead, they are required to open a savings account and contribute to it during their stay. These savings provide them with a security deposit and first month's rent for their own residence when they leave the shelter\nHours to apply:\nAlthough the shelter is open 24/7, the preferred time to take applicants is between 9:00am and 6:00pm.  However, exceptions will be made depending on circumstances.  If possible, call before showing up to insure there is space available.\nWho do we take:\nAlthough it is always at the discretion  of the house manager, if there is space available, we generally take anyone who shows up sober, is not a registered sex offender, is a resident of Calvert County, and has not used up his previous stay allowance.\nNumber of beds:     20 for men,  20 for women and children.\nLength of stay:\nUp to 90 days. At times the House Manager may add up to an additional 30 days.  After one year, a person is eligible for an additional 90 day stay.  A person can     not stay more than three times up to 90 days each.\nCondition of applicant upon acceptance:     Sober and mentally stable\nConditions of acceptance:\na. Alcohol and drug free\nb. Photo ID\nc. Calvert county residents given priority.\nd. Not a registered sex offender.\ne. Agree to abide by house rules.\nf. Turn over all prescription medications and agree to take them as prescribed.\ng. Approval of House Manager.\nNote:\nWe are dealing with people, not objects or animals.  We will from time to time deviate from the above rules depending on our judgment of the individual and circumstances."
  },
  {
    "addressLine1": "200 Duke Street",
    "city": "Prince Frederick",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20678",
    "name": "Calvert County Department of Social Services",
    "organization": "Calvert County Department of Social Services",
    "phone": "(443) 550-6900",
    "website": "http://dhr.maryland.gov/bureau-of-homeless-services/",
    "description": "Assists families with crises, including crises with food and shelter. Also provides counseling services to enhance parents ability to create a safe, stable and nurturing home environment that promotes healthy child development and family functioning.\n\nCan provide case management which include Adult Protective Services.\n\n\nEligibility - Families with children, eldery & vulnerable adults.\n\nHours: Monday - Friday 8am - 5pm."
  },
  {
    "addressLine1": "12747 Old Bridge Road",
    "city": "Ocean City",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21842",
    "name": "Diakonia - Food Distribution Center",
    "organization": "Diakonia - Food Distribution Center",
    "phone": "(410) 213-0923",
    "website": "https://diakoniaoc.org/",
    "description": "Provides a 40 bed emergency shelter for homeless men, women, and families with children. Also offers an emergency food pantry for food assistance.\n1) EMERGENCY HOUSING: Operates a 40 bed emergency shelter for homeless men, women and families with children. Adult clients must obtain employment within three days. Residents have opportunity to move to transitional shelter. The shortest stay is one day, the longest stay is 24 months.\n\n\n2) EMERGENCY FOOD PANTRY: Provides food to those in need every 30 days. Formula and baby items are sometimes available. Photo ID and proof of local residence is required.\n \n3) ESG Funding - temporary financial assistance for those who qualify. Call to check eligibility.\n\nCall and ask to speak with Jerome Jackson about ESG funds.\nDiakonia was originally established by the Mennonite church in 1972. In 1984, it became a separate, 501(c)(3) non-denominational organization. Diakonia operates two buildings in West Ocean City, Maryland where it provides emergency and transitional housing, emergency food services and counseling and assistance for its guests.\nDiakonia is more than just a shelter, however. Diakonia attempts to address the root causes of homelessness through a variety of programs and initiatives."
  },
  {
    "addressLine1": "299 Commerce Street",
    "city": "Snow Hill",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21863",
    "name": "Worcester County DSS",
    "organization": "Worcester County DSS",
    "phone": "(410) 632-2705",
    "website": "",
    "description": "Emergency shelter referrals. Food, Assistance with applying for benefits. Case management. 911 (after-hours)"
  },
  {
    "addressLine1": "814 Fourth Street",
    "city": "Pocomoke City",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21851",
    "name": "Samaritan Shelter",
    "organization": "Samaritan Shelter",
    "phone": "(410) 957-4310",
    "website": "https://twitter.com/lsconnector/status/883336608753307648",
    "description": "Emergency shelter, meals. Emergency food pantry"
  },
  {
    "addressLine1": "P.O. Box 779",
    "city": "Prince Frederick",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20678",
    "name": "Associated Catholic Charities",
    "organization": "Associated Catholic Charities",
    "phone": "(410) 535-0309",
    "website": "",
    "description": "Emergency shelter placements. Food pantry, Financial assistance for utilities, mortgage, eviction, medical(prescriptions) as funds permit."
  },
  {
    "addressLine1": "22121 Royal Oak Road",
    "city": "Quantico",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21856",
    "name": "Veterans Service Centers of America-VSCOA",
    "organization": "Veterans Service Centers of America-VSCOA",
    "phone": "(410) 873-2500",
    "website": "http://www.vscoa.org/",
    "description": "Veterans Support Centers of America or VSCOA is a nonprofit organization formed to serve our rural disabled and homeless Veteran community. We do this by providing opportunity, shelter, needed support and access to services. Our extensive network of service providers, knowledge of the Veterans Administration system and professional staff have come together to form a unique and successful program of services to support the needs of the rural veteran."
  },
  {
    "addressLine1": "119 South Blvd",
    "city": "Salisbury",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21804",
    "name": "HALO Center of Hope",
    "organization": "HALO Center of Hope",
    "phone": "(410) 742-9356",
    "website": "https://haloministry.org/",
    "description": ""
  },
  {
    "addressLine1": "334 Barclay Street",
    "city": "Salisbury",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21804",
    "name": "Christian Shelter, Inc.",
    "organization": "Christian Shelter, Inc.",
    "phone": "(410) 749-5673",
    "website": "https://www.christianshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "334 Barclay Street",
    "city": "Salisbury",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21804",
    "name": "Christian Emergency Shelter",
    "organization": "Christian Emergency Shelter",
    "phone": "(410) 749-5673",
    "website": "http://christianshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "12041 Reisterstown Road",
    "city": "Reisterstown",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21136",
    "name": "Sarah's Hope At Hannah More",
    "organization": "Sarah's Hope At Hannah More",
    "phone": "(410) 773-0320",
    "website": "http://www.vincentbaltimore.org/our-programs",
    "description": "Offers emergency shelter and case management services for 90 days. Residents receive 3 meals per day, case management, life skills training, referrals to various community services including substance abuse and job readiness programs for established clients. Also provides housing counseling.\n\nEligibility Homeless single women, married couples, and one or two parent families. Single men with children (No individual single men).\n\n\nAccepts referrals from Baltimore County Department of Social Services.\n\nComprehensive 85 bed shelter serving homeless families in Baltimore County. Services include meals, youth activities and tutoring, adult education classes, case management, housing placement and referrals."
  },
  {
    "addressLine1": "7509 Windsor Mill Rd",
    "city": "Windsor Mill",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21244",
    "name": "Night of Peace Family Shelter, Inc.",
    "organization": "Night of Peace Family Shelter, Inc.",
    "phone": "(410) 922-4357",
    "website": "http://www.nightofpeace.org/",
    "description": ""
  },
  {
    "addressLine1": "600-A East Gude Drive",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20850",
    "name": "Home Builders Care Assessment Center (HBCAC) Men's Emergency Shelter",
    "organization": "Home Builders Care Assessment Center (HBCAC) Men's Emergency Shelter",
    "phone": "(301) 217-0314",
    "website": "http://mcch.net/emergency-shelter/",
    "description": "Home Builders Care Assessment Center (HBCAC) Mens Emergency ShelterHBCAC is the County's only 24/7 emergency shelter serving approximately 750 men annually.\n\nServices provided at HBCAC include case management, medical, psychiatric and dental care, employment services, breakfast, lunch, and dinner, bathrooms and showers.\n\n\nMontgomery County Coalition for the Homeless operates three emergency shelter programs to meet the urgent needs of more than 800 men and women currently experiencing homelessness each year. Each program provides shelter, food and supportive services to help clients return to stable housing as quickly as possible."
  },
  {
    "addressLine1": "622 N. Horners Lane",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20850",
    "name": "Helping Hands Shelter",
    "organization": "Helping Hands Shelter",
    "phone": "(301) 340-2796",
    "website": "",
    "description": "Accommodates up to 24 women and children each day, year-round.\n\nProvides a safe haven for homeless women with children since 1986;\n\n\nResidents receive case management, private bedrooms, laundry facilities, referrals and three meals a day as they work toward ending their homelessness."
  },
  {
    "addressLine1": "215 W. Montgomery Avenue",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20850",
    "name": "Rainbow Place (Women Only)",
    "organization": "Rainbow Place (Women Only)",
    "phone": "(301) 762-1496",
    "website": "http://www.rainbowplace.org/",
    "description": "Emergency winter shelter. Open at night only (7pm. 7am.) Open November 1 to March 31. Meals"
  },
  {
    "addressLine1": "P.O. Box 712",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20848",
    "name": "Stepping Stones Shelter",
    "organization": "Stepping Stones Shelter",
    "phone": "(301) 251-0567",
    "website": "http://steppingstonesshelter.org/",
    "description": "Emergency housing: up to 30 days. Meals, Counseling. Case management\n\nThe Emergency/Assessment Shelter, the most well-known Stepping Stones program, provides shelter and services for up to 6 families at any one time, generally housing around 30 families each year, including more than 100 individuals. These families represented two-parent families, single moms, single dads, and multi generational households both those headed by and those including retired grandparents. Families included family members with disabilities, who needed additional resource support. Many of our single parents (nearly half of all our families) were young mothers, between the ages of 18-25, a group whose needs are very unique, as their own needs compete with those of their children.\n\nPermanent Supportive Housing\n\nHope Housing\nStepping Stones Hope Housing program provides permanent housing and on-going support services for 2 families, each with a disabled head of household. This 10-year partnership with the Montgomery County Coalition for the Homeless has been a lifeline for these families. Through the extraordinary efforts of program coordinator, Jill Hurd, and the support of the community, including the staff at their neighborhood schools, the Hope Housing program has helped these families remain together and stably housed.\n\nHousing Initiative Program (HIP)\nStepping Stones Shelter provides service coordination for six formerly homeless families placed into permanent housing under Montgomery Countys Housing Initiative Program (HIP). Stepping Stones service coordinators provide referrals to needed services in the community and make sure the families pay their rent and utilities on time to ensure that they remain housed."
  },
  {
    "addressLine1": "600 C East Gude Drive",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20850",
    "name": "Chase Partnership Men's Shelter",
    "organization": "Chase Partnership Men's Shelter",
    "phone": "(301) 424-1380",
    "website": "http://www.cmrocks.org/",
    "description": "Provides transitional housing for 36 homeless men in a dormitory style setting, coordinated with substance abuse treatment and counseling, case management, and a required day treatment program. Also includes a computer lab where clients can get assistance with GED and employment preparation (resume writing), and evening programs offering life skills training, discussion groups, relapse prevention groups and in-house 12-step meetings. Two year residency limit average stay is 12 months.\nSliding fee scale: 30% of income.\n"
  },
  {
    "addressLine1": "5320 Marinelli Road",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20850",
    "name": "Dorothy Day Place Women's Shelter",
    "organization": "Dorothy Day Place Women's Shelter",
    "phone": "(301) 762-8314",
    "website": "mailto:jazzbattle@yahoo.com",
    "description": "Dorothy Day Place is a transitional shelter for single adult women who are homeless and over the age of 18.  Case management services at the shelter include job readiness, educational services, life skills training, mental health support and substance abuse counseling.\n\nIntake: Enrollment in Dorothy Day Place is made through referrals only by a case manager, social worker, psychiatrist, nurse or substance abuse counselor. All applicants must be female, 18 years of age or older and with no dependents. For intake, please call (301) 762-8314."
  },
  {
    "addressLine1": "14705 Avery Road",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20853",
    "name": "Avery House Treatment Center For Women Halfway House",
    "organization": "Avery House Treatment Center For Women Halfway House",
    "phone": "(301) 762-4651",
    "website": "http://www.chrysalishouses.org/",
    "description": "Avery House, a halfway house for women and their children, provides a transitional program which fosters recovery through the love and care of a home community.\n\nServices are provided through a contract between Montgomery County, Maryland and Chrysalis House, Inc. under a federal grant administered by the state of Maryland Alcohol and Drug Abuse Administration. Additional sources of support include grants and foundations.\n\n\nAt Avery House, the needs of recovering mothers and their children are met in a structured, supportive, and sober environment. The facility provides a variety of ethnic and cultural halfway house services up to nine months.\n\nAvery House is run by Chrysalis House, Inc. a nonprofit organization which provides full treatment services to women suffering with the disease of addiction. We offer long-term care and outpatient services to pregnant and post-partum women with children."
  },
  {
    "addressLine1": "2 Taft Court, Suite 100",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20850",
    "name": "Interfaith Works Women’s Center",
    "organization": "Interfaith Works Women’s Center",
    "phone": "(301) 770-2413",
    "website": "https://www.iworksmc.org/wp-content/cache/all/iw-womens-center/index.html",
    "description": "The IW Women's Center is a 70-bed emergency shelter serving approximately 300 women per year. Case managers work with women to facilitate recovery and stability, as well as connect them with housing, medical, mental health, and social services.\n\nThe Interfaith Works Womens Center is now located at:\n\n2 Taft Court, Suite 100, Rockville, Md., off Gude Drive (lower level of the building, around the back)"
  },
  {
    "addressLine1": "2301 Research Blvd, Suite 200",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20850",
    "name": "Montgomery County Coalition for the Homeless",
    "organization": "Montgomery County Coalition for the Homeless",
    "phone": "(301) 217-0314",
    "website": "https://mcch.net/",
    "description": "The Montgomery County Coalition for the Homeless is a leading organization dedicated to preventing and ending homelessness, by providing a range of programs and housing options.\n\nOur housing and shelter programs:\nCordell Place - MCCH's newest award winning program provides permanent housing to 32 single men and women in downtown Bethesda, in a facility featuring Personal Living Quarters, shared kitchens, a community room, and other amenities. All tenants receive on-site case management as well as the opportunity to engage in a range of community events and activities.\nCreative Housing Initiative Pilot Project (CHIPP) Provides housing to 16 formerly homeless individuals including those who have been frequent users of the emergency medical and corrections systems with permanent supportive housing and case management, in a apartment complex in Germantown.\n\nHome Builders Care Assessment Center (Formerly known as the Men's Emergency Shelter) A year round, 24/7 emergency shelter for over 800 men experiencing homelessness in our community each year. The shelter offers a range of services and amenities including showers, bunks, meals, case management, medical care, and job training and vocational counseling services.\nHome First - A permanent supportive housing program for 30 chronically homeless, single adults. Residents receive case management and psychiatric rehabilitation services, in apartments in one building and scattered sites in Silver Spring.\nHope Housing - A partnership providing permanent supportive housing to formerly homeless individuals and families with disabilities. MCCH, as well as Interfaith Works and Stepping Stones Shelter, provide the direct services to 40 individuals and 2 families, while MCCH coordinates and oversees the operations and finances.\nPartnership for Permanent Housing - A collaborative program with county government, the Housing Opportunities Commission, and private foundations. As the county's pilot Housing First initiative, Partnership for Permanent Housing (PPH) combines the case management component of transitional housing programs with quicker access to permanent housing by providing subsidized permanent housing and supportive services to over 180 households.\n\nSafe Havens - A low demand housing program for 40 chronically mentally ill, homeless adults. Safe Havens provides case management, counseling, life skills development, and on-site psychiatric services with the goal of helping clients transition to a healthy life with permanent housing.\nSeneca Heights Apartments - An award winning, innovative model combining housing, services and amenities. Seneca Heights serves as permanent housing for 40 formerly homeless single adults and 17 families. All tenants receive on site case management and social services as well as the opportunity to engage in a wide variety of community events and activities.\n\n"
  },
  {
    "addressLine1": "600-B East Gude Drive",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20850",
    "name": "Safe Havens",
    "organization": "Safe Havens",
    "phone": "(301) 217-0314",
    "website": "https://mcch.net/",
    "description": "Safe Havens is an emergency housing program for men and women with severe and persistent mental illness who have experienced homelessness, often for long periods of time. Safe Havens provides a safe and welcoming living environment with 24/7 support from clinical and non-clinical staff for more than 60 clients living in four residences throughout Montgomery County.\n\n\n Safe Havens helps clients stabilize psychiatrically and then move into permanent housing with appropriate supportive services.Services include:Case managementPsychiatric servicesLife skills training to prepare for more independent livingConnection to medical care, vocational training, day treatment programs and other appropriate community resourcesMontgomery County Coalition for the Homeless operates three emergency shelter programs to meet the urgent needs of more than 800 men and women currently experiencing homelessness each year.\n\nEach program provides shelter, food and supportive services to help clients return to stable housing as quickly as possible."
  },
  {
    "addressLine1": "600-B East Gude Drive",
    "city": "Rockville",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20850",
    "name": "Veterans Affairs Safe Havens",
    "organization": "Veterans Affairs Safe Havens",
    "phone": "(301) 217-0314",
    "website": "http://mcch.net/",
    "description": "The U.S. Department of Veterans Affairs (VA) Capitol Health Care Network, which includes the Baltimore and Washington DC VA Medical Centers, awarded MCCH funding in 2014 to provide Safe Havens emergency housing for veterans experiencing homelessness.\n\nEach year, we serve 50 men and women with severe mental illness in group residences in Darnestown, Rockville, Laytonsville and Silver Spring.Services include:Case managementPsychiatric servicesLife skills training to prepare for more independent livingConnection to medical care, vocational training, day treatment programs and other appropriate community resources"
  },
  {
    "addressLine1": "8106 Georgia Ave",
    "city": "Silver Spring",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20910",
    "name": "Shepherd’s Table",
    "organization": "Shepherd’s Table",
    "phone": "(301) 585-6463",
    "website": "https://shepherdstable.org/",
    "description": "Day shelter. Resource center. Outreach services. Hours 8am to 5pm"
  },
  {
    "addressLine1": "8210 Dixon Avenue (formerly 8210 Colonial Lane)",
    "city": "Silver Spring",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20912",
    "name": "Community Vision of Interfaith Works",
    "organization": "Community Vision of Interfaith Works",
    "phone": "(301) 762-8682",
    "website": "https://www.iworksmc.org/",
    "description": "Interfaith Works Community Vision Program is a day program for chronically street homeless men and women in Montgomery County, MD. From November 1st through April 1st each year we run one of the County's winter weather shelters housing 70 people each night. Our day program provides individualized help through case management, basic services that include: breakfast and lunch Monday through Friday, showers, laundry, a variety of low barrier classes, as well as classes to assist people achieve self-sufficiency, and vocational counseling and preparedness."
  },
  {
    "addressLine1": "4326 14th Street, NW",
    "city": "Washington",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20011",
    "name": "Coalition for the Homeless - Webster Transitional House",
    "organization": "Coalition for the Homeless - Webster Transitional House",
    "phone": "(202) 722-4544",
    "website": "http://www.dccfh.org/",
    "description": "Provides residential housing and supportive services to 12 homeless men. Services include food, substance abuse counseling, case management, employment and housing placement assistance. Washers and dryers are available on-site. Dormitory style sleeping for 2-3 men per room.\n\nHours: 9:00 am - 5:00 pm, Monday - Friday (administrative); Program Open 24 hours\n\n"
  },
  {
    "addressLine1": "401 Washington Avenue Suite 300",
    "city": "Towson",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "21204",
    "name": "Turnaround, Inc.",
    "organization": "Turnaround, Inc.",
    "phone": "(443) 279-0378",
    "website": "http://www.turnaroundinc.org/",
    "description": "Emergency shelter services for victims of domestic violence.\n\nProvides counseling and support services to victims of rape, incest and domestic violence and to increase community awareness and understanding of these problems.\n\n\n24-Hour Helpline 443.279.0379For Immediate Assistance"
  },
  {
    "addressLine1": "10395 Berry Road",
    "city": "Waldorf",
    "state": "Maryland",
    "stateAbbreviation": "MD",
    "postal": "20603",
    "name": "Poiema Movement, Inc",
    "organization": "Poiema Movement, Inc",
    "phone": "301-645-1007",
    "website": "https://www.poiemamovement.com/",
    "description": "We provide a 12-month transitional living program for women."
  }
]