[
  {
    "addressLine1": "1928 W. College Ave.",
    "city": "Appleton",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54911",
    "name": "Pillars Adult Shelter",
    "organization": "Pillars Adult Shelter",
    "phone": "(920) 734-9192",
    "website": "https://pillarsinc.org/",
    "description": "Safe, overnight shelter for adults experiencing homelessness.\n\nHours of operation: Open daily, year round, 4:30 p.m. to 8 a.m."
  },
  {
    "addressLine1": "400 N. Division St.",
    "city": "Appleton",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54914",
    "name": "Pillars Adult & Family Shelter",
    "organization": "Pillars Adult & Family Shelter",
    "phone": "(920) 734-9192",
    "website": "https://pillarsinc.org/",
    "description": "Safe, 24/7 shelter for adults and families experiencing homelessness.\nHours of operation: Open daily, year round, 24 hours"
  },
  {
    "addressLine1": "449 High Ave",
    "city": "Oshkosh",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54901",
    "name": "Day by Day Warming Shelter",
    "organization": "Day by Day Warming Shelter",
    "phone": "(920) 203-4865",
    "website": "http://www.warmingshelter.com/",
    "description": "Day by Day Warming Shelter seeks to provide temporary emergency shelter for adult men and women who have no other sheltering options in Oshkosh, WI. All services and assistance are offered in the context of the furtherance of human dignity with the primary goal of harm reduction during the coldest weather months of the year.\n\nShelter Hours: 6:00 PM to 8:00 AM (Seasonal)\nOffice Hours: 9am-5pm"
  },
  {
    "addressLine1": "1062 N. Koeller St.",
    "city": "Oshkosh",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54902",
    "name": "Father Carr's Place 2b",
    "organization": "Father Carr's Place 2b",
    "phone": "(920) 231-2378",
    "website": "https://fathercarrs.org/",
    "description": "Holy Family Villa and Bethlehem Inn\nOur homes are welcome to those in need of a temporary residence and have demonstrated an ability to contribute to a safe environment. We welcome people for as long as necessary. Our expectations are for each person to be chemically free, respectful,  helpful and to follow our guidelines. Holy Family Villa supports our women and children and Bethlehem Inn supports our men.\nWe provide a comfortable room, bed, bathroom and 3 meals each day. Our volunteers provide guidance and resources. Our goal is to offer support while our residents gain independence and stability. Father Dave shares spiritual guidance for those who desire. Many have experienced hope and love while staying at Father Carr's and we will continue to be here for others.\n\nSt. Martin De Porres Food Bank\nOur food bank is open to the public every Friday from 9:00 am 11:45 am. All are welcomed with a smile and bags of groceries. We serve up to 200 families each week and are fortunate to be helped by individuals, businesses, schools, churches and other caring organizations. We are also thankful to have generous benefactors such as Festival Foods, Roundy's, Copp's, Pick 'n Save, Kwik Trip, Breadsmith, Sara Lee's Holsum Bakery and many others.\n\nDaily Bread For Others\nWe have bread and other bakery products available Monday through Friday from 9:00am to 9:00pm in the entrance to our Family Wellness Center. Thanks to companies like Festival Foods, Breadsmith, Roundy's, Copps Food Center and Sara Lee's Holsum Bakery, we are able to share these items to help others."
  },
  {
    "addressLine1": "1816 Harrison",
    "city": "Beloit",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53512",
    "name": "The Sparrow's Nest",
    "organization": "The Sparrow's Nest",
    "phone": "(608) 362-8215",
    "website": "https://twitter.com/homelesssheltersofbeloit",
    "description": "emergency shelter for men, women and children."
  },
  {
    "addressLine1": "203 W. Sunny Lane road",
    "city": "Janesville",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53546",
    "name": "Rock Valley Community Programs",
    "organization": "Rock Valley Community Programs",
    "phone": "(608) 741-4500",
    "website": "https://www.rvcp.org/",
    "description": "Rock Valley Community Programs, Inc. (RVCP) has renovated 24 studio apartments (each with separate kitchenette and bathroom) to offer transitional housing and supportive services to homeless veterans. Each unit provides housing for 2 homeless veterans so we will be able to serve 48 homeless veterans at a time. RVCP works in conjunction with our supportive service providers at the Department of Veteran Affairs Madison Medical Center as well as local agencies to offer a comprehensive menu of services and supports that can readily adjusted to meet each individual's needs and pathways."
  },
  {
    "addressLine1": "482 S. Pine Street",
    "city": "Burlington",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53105",
    "name": "Burlington Transitional Living Center",
    "organization": "Burlington Transitional Living Center",
    "phone": "(262) 767-1478",
    "website": "http://www.tlcburlington.com/",
    "description": "Our mission is to provide families and individuals with temporary shelter and basic necessities while assisting them in gaining skills to become self-sufficient, employed, and independent.\nThe problem of homelessness is complex. It requires a collaborative effort that begins with meeting immediate needs but extends much further to help people achieve independence and to alleviate the root causes of poverty.\n\nWhether you are compelled by the national movement to end homelessness or you just believe that no one in your community should go without a safe, stable place to call home you have the opportunity to make a difference. Thanks to the work being done at Transitional Living Center (TLC) we are able to make a difference in the lives of the families we serve by providing them with the services they need to be successful.\n\nInformation and Referral\nTLC acts as the first responder in Western Racine County for homeless individuals. Staff networks with other local agencies requesting programming that will best suit the individuals needs and current location.\n\nEmergency Shelter\nTLC can provide emergency shelter to women and children up to 14 nights. When the family has a male over the age of 12 or a single adult male needs housing TLC can provide a hotel voucher or make a referral to another shelter. TLC can provide the transportation necessary to get individuals to the appropriate shelter.\n\nTransitional Living Services\nThose meeting the program requirements can be provided services up to 90 days. Clients are housed in the shelter or Morrow House.  Morrow House shelters intact families, adult males with children or families with male children over the age of 12.  Programming required of all participants includes job search, life skills development, AODA counseling, mental health treatment, medication management, financial mentoring, parenting education, and case management."
  },
  {
    "addressLine1": "21425 Spring St",
    "city": "Union Grove",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53182",
    "name": "VETS Place Southern Center - Center for Veterans Issues",
    "organization": "VETS Place Southern Center - Center for Veterans Issues",
    "phone": "(262) 878-9151",
    "website": "http://www.cvivet.org/",
    "description": "VPSC is a 30 bed transitional living facility for homeless veterans with full wrap-around programming and services.All veterans who live in CVI residential facilities enjoy a wide breadth of support services:"
  },
  {
    "addressLine1": "W9665 US Hwy 14",
    "city": "Darien",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53114",
    "name": "Twin Oaks Homeless Shelter",
    "organization": "Twin Oaks Homeless Shelter",
    "phone": "(262) 724-3662",
    "website": "https://community-action.org/housing/twin-oaks-shelter-for-homeless/",
    "description": ""
  },
  {
    "addressLine1": "1995 Beulah Avenue",
    "city": "East Troy",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53120",
    "name": "Gerard's Embrace - Shelter For Pregnant Women",
    "organization": "Gerard's Embrace - Shelter For Pregnant Women",
    "phone": "(262) 684-2027",
    "website": "https://www.gerardsembrace.com/",
    "description": "We are a shelter for homeless pregnant women. Apply online on our website."
  },
  {
    "addressLine1": "8 S Farwell St",
    "city": "Eau Claire",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54702",
    "name": "Hope Gospel Mission",
    "organization": "Hope Gospel Mission",
    "phone": "(715) 552-5566",
    "website": "https://www.twitter.com/HopeGospel",
    "description": "Hope Gospel Mission is a food pantry. .\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "2517 Moholt Drive",
    "city": "Eau Claire",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54703",
    "name": "Ruth House: Hope Gospel Mission Women's Shelter",
    "organization": "Ruth House: Hope Gospel Mission Women's Shelter",
    "phone": "(715) 834-4000",
    "website": "https://www.hopegospelmission.org/",
    "description": "Women's shelter.\n\nThe single female residents enrolled in any of our three programs stay at the Ruth House.\n\nOur SaFE Work Readiness Program is a place of intentional, faith-based healing. Our women live in community as they go through the program and help each other become the women that God created them to be. Our facilities are clean, safe, and handicap accessible.\n\n2517 Moholt Drive\nEau Claire, WI, 54703\nPhone: (715) 834-4000\nCall after 5:00pm or leave a message\nHours\nMon - Fri: 5pm - 8am\nSat and Sun: 8am - 7pm\n"
  },
  {
    "addressLine1": "309 E. Lake St.",
    "city": "Eau Claire",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54701",
    "name": "Beacon House",
    "organization": "Beacon House",
    "phone": "(715) 834-4357",
    "website": "http://www.beacon-house.org/",
    "description": "Sponsored by Eau Claire Interfaith Hospitality Network. Serves families and single pregnant women. Capacity: about 25 depending on family sizes.\n\nThe Beacon House, located in downtown Eau Claire, can serve six families at a time.\n\n\nWith the incredible volunteer efforts of over 20 area faith-based organizations, emergency shelter, meals, and hospitality are provided to families and single pregnant women for up to 30 days. Families are accepted from all counties although priority is given to current Eau Claire county residents and those showing a strong intent to remain in the area."
  },
  {
    "addressLine1": "618 South Barstow St.",
    "city": "Eau Claire",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54701",
    "name": "Sojourner House",
    "organization": "Sojourner House",
    "phone": "(715) 514-5556",
    "website": "http://cclse.org/the-sojourner-house/",
    "description": "We are a safe haven for single adult men and women, offering a safe, clean place, regardless of what their ambitions or hopes are. Guests can sleep overnight, shower, wash their clothes, and eat breakfast while ensuring their personal dignity, respect and safety.\n\nThe Sojourner House is open year round from 7 pm in the evening to 8 am in the morning. We can provide sleeping arrangements for up to 32 men and 16 women (capacity of 48). In order to receive sleeping facilities, laundry and shower privileges, guests must have a 0.0 alcohol level. However, we also have space for up to 4 additional guests in a special recliner facility, helping these guests to get in out of the elements into a safe environment. Everyone is accepted into the shelter unless they are presenting with unruly or boisterous behavior. A safe environment will be maintained. No substances or weapons will be permitted on the premises. A core staff is employed by Catholic Charities, with a large supplement of volunteers for support! This is a first-come, first-serve basis. All are welcome!"
  },
  {
    "addressLine1": "802 W Broadway St",
    "city": "Winona",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "55987",
    "name": "Winona Catholic Worker Transitional Housing",
    "organization": "Winona Catholic Worker Transitional Housing",
    "phone": "(507) 454-8094",
    "website": "http://www.winonacatholicworker.org/",
    "description": "Monday-Fridays from 4-7 p.m. we have \"open hospitality\" at Bethany House.\nDinner is served at 6 p.m.;\nAll are welcome. Use the shower, do laundry, and drink coffee and play games as well!\n\nEvery Monday night at 5:15 p.m., join us for a simple prayer service in the Dan Corcoran House prayer room (in the \"garage\").\n\nBethany House\n832 W. Broadway\n(507) 454-8094\n\nDan Corcoran House\n802 W. Broadway\n(507) 457-3451\n\nThe Winona Catholic Worker is a diverse faith community that serves people experiencing homelessness in the tradition of Peter Maurin and Dorothy Day. We operate two houses of hospitality (Bethany House has a meal program and Dan Corcoran House provides overnight hospitality for single women). We have open community meals five times a week."
  },
  {
    "addressLine1": "301 Mather Street",
    "city": "Green Bay",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54303",
    "name": "New Community Shelter",
    "organization": "New Community Shelter",
    "phone": "(920) 437-3766",
    "website": "http://newcommunityshelter.org/",
    "description": "The New Community Shelter helps adults experiencing homelessness.\n\nThe New Community Shelter was established in 1994 to provide shelter and supportive services to adult men and women experiencing homelessness. The mission is to provide shelter, to meet the basic needs of homeless men and women, and to provide supportive services that assist people in their transition to permanent housing and a self-sustaining lifestyle.\n\n\n\n\nThe major programs include: Emergency Shelter, Transitional Living, Professional Case Management & Supportive Services, and a Community Meal Program. The Emergency Shelter program, the program we would like to ask you to consider funding, provides ninety-eight emergency shelter beds for men and women. Linens, pillows, personal hygiene items, laundry soap, and clothing are provided (available mostly through in-kind donations). Free laundry facilities and detergent are provided. Breakfast and an evening meal are provided every day of the year. A noon meal is offered on Weekends and Holidays (when the local Salvation Army noon meal is closed). Additionally, a bag lunch is available to all residents who are working.\n\n\n\nThe New Community Shelter provides another important piece in the housing continuum-a Transitional Living Program. This program was expanded from sixteen to twenty efficiency apartments in 2011. Four of the units are dedicated to veterans with chronic mental health and/or substance abuse issues. A resident may participate in the Transitional Living Program for up to twenty-four months.\n\n\n\n\nThe New Community Shelter also partners with the local community by offering a Community Meal Program that provides an evening meal everyday of the year and a noon meal on all weekends and holidays for anyone in need of supplementing their nutrition, including adults and children. The only requirements for this program are sobriety and peacefulness.\n\nTRANSITIONAL LIVING PROGRAM\n\nOn site housing is available in 20 single-occupancy apartments - three apartments are for Military Veterans only. Residents participate in a program designed to resolve issues that might prevent transition into permanent housing. Maximum length of stay is two years.\n\nTransitional Living Program Mission:\nThe Transitional Living Program's mission is to provide a safe and supportive environment in which individuals experiencing homelessness can move toward greater self-sufficiency and independence including transitioning within 24 months into stable, permanent housing.\n\nTransitional Living Program Admission Information:\nMeets general admission requirements of the Emergency Shelter Program\nPay a monthly program fee\nEmployed, employable or have a source of income\nRemain alcohol/drug free while in the program and willing to submit to screening if suspected of use.\nWilling to set up and work on individualized short and long term goals agreed upon with assigned case manager."
  },
  {
    "addressLine1": "411 St John St",
    "city": "Green Bay",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54301",
    "name": "St. John the Evangelist Homeless Shelter",
    "organization": "St. John the Evangelist Homeless Shelter",
    "phone": "(920) 436-9344",
    "website": "http://www.stjohnhomelessshelter.org/",
    "description": "St. John the Evangelist Homeless Shelter (SJEHS) seeks to provide night-to-night temporary emergency shelter to adult men and women. All services and assistance are offered in the context of the furtherance of human dignity with the primary goal of harm reduction during the coldest weather months of the year.\n\nAll people have the right to meet their basic human needs for food, clothing, shelter and medical care. SJEHS allows shelter guests an opportunity for engagement with mainstream shelter and housing resources, mental health and healthcare providers and other social service agencies.\n\n\nNightly Emergency Shelter from November through April 5pm - 9am.\n\nSt. John the Evangelist Homeless Shelter, in living the Gospel mandate to care for the poor and vulnerable, believes that all human beings have the right to the basic needs of food, clothing, shelter and medical care.\n\nEligibility:\n- Single adults 18 years and older. Families will be referred to the Crisis Center.\n- The individual has no other housing option available to them at that time.\n- The individual conducts himself/herself in a peaceful and respectful\n-manner.\n- The individual provides complete intake information.\n- The individual agrees to a background check, law enforcement and Department of County Human Services, New Community Shelter, and Outreach Health Care and signs the form.\n\n- The staff will consult with appropriate agencies such as law enforcement and Brown County Human Services if there are any safety concerns."
  },
  {
    "addressLine1": "1660 Christiana Street",
    "city": "Green Bay",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54303",
    "name": "House of Hope Green Bay",
    "organization": "House of Hope Green Bay",
    "phone": "(920) 884-6740",
    "website": "https://www.houseofhopegb.org/",
    "description": "House of Hope provides programming, services and shelter to homeless youth and families.\nThey serve:\nFamilies with children Unaccompanied homeless youth 0-17 years oldYoung parents ages 17-24 and their children of any age.\n\nEach family receives:\n- A private, furnished bedroom\n- Storage space for food and necessities\n- A welcome basket of hygiene products and other living needs\n- Shared use of kitchen, bathroom, living rooms and play yard\n\n- Shared use of telephone (for local calls) with an answering machine\n- A postal address to receive mailDonation Hours:\n\nMon - Fri: 8am - 5pm\n\n"
  },
  {
    "addressLine1": "2997 Street Anthony Drive",
    "city": "Green Bay",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54311",
    "name": "Freedom House Green Bay",
    "organization": "Freedom House Green Bay",
    "phone": "(920) 432-4646",
    "website": "https://freedomhouseministries.org/",
    "description": "Brown County's only homeless shelter that serves all types of families with children.\n\nAt Freedom House, our purpose is to serve Brown County area families who find themselves in dire need of emergency housing. Our program involves a step-by-step action plan individualized for each family aimed at obtaining permanent housing and employment, and restoring the family unit. We, in compassion, provide for the short-term needs of homeless families and children, and in love, empower these families with long-term solutions to end their cycle of homelessness. The result is a positive and beneficial environment that encourages families to live more productive, healthy and fulfilling lives."
  },
  {
    "addressLine1": "430 S. Clay St.",
    "city": "Green Bay",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54301",
    "name": "The Transformation House",
    "organization": "The Transformation House",
    "phone": "(920) 857-9611",
    "website": "https://www.transformationhousegb.org/",
    "description": "Life Transitioning for Men\nOur facility operates 24/7, 365 days a year.  Intake hours are Monday thru Thursday 9am-3pm and Friday 9am-11am.\n 46 bed housing facility that also houses a soup kitchen, food pantry, and drug/alcohol abuse recovery service. We are committed to maintaining a supportive and secure environment through a rigorous and holistic program.\n"
  },
  {
    "addressLine1": "700 E. Walnut St",
    "city": "Green Bay",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54301",
    "name": "Micah Center - Day Shelter",
    "organization": "Micah Center - Day Shelter",
    "phone": "",
    "website": "",
    "description": "New Day Shelter.\nThe center is expected to open in late October 2014, before the overnight homeless shelter opens for the season, officials said. The daytime center will be open year round from 9 a.m. to 4:30 p.m., Monday through Friday.\n\nOperated by the Catholic Diocese of Green Bay. They will assist the homeless with finding employment and housing."
  },
  {
    "addressLine1": "320 Lincoln St",
    "city": "Janesville",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53545",
    "name": "House of Mercy Homeless Shelter",
    "organization": "House of Mercy Homeless Shelter",
    "phone": "(608) 754-0045",
    "website": "https://mercyhealthsystem.org/house-of-mercy/",
    "description": "Homeless shelter for single women and families.\nThe House of Mercy is a 25-bed homeless center in Janesville that offers homeless families short-term emergency shelter and access to housing, job placement, and child care resources. Staff at the Center assist the homeless in assessing their needs, obtaining appropriate referrals and services, and designing an action plan aimed at achieving more stable housing."
  },
  {
    "addressLine1": "407 W. Van Buren Street",
    "city": "Janesville",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53545",
    "name": "The Shelter",
    "organization": "The Shelter",
    "phone": "(608) 931-9085",
    "website": "mailto:mtearman@gmail.com",
    "description": "Currently a Christ Centered day shelter for homeless men."
  },
  {
    "addressLine1": "4314 39th ave",
    "city": "Kenosha",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53143",
    "name": "Shalom Center",
    "organization": "Shalom Center",
    "phone": "(262) 658-1713",
    "website": "http://shalomcenter.org/",
    "description": "The mission of the Shalom Center is to serve the community by providing emergency food, shelter, and support in ways that meet immediate needs and respect human dignity.\n\nIndividuals in Need of Nightly Shelter (INNS)\nThe INNS Program provides temporary emergency nightly shelter for homeless individuals. This program operates in our building at 4314 39th Avenue in Kenosha 365 days per year with an average of about 30 guests each night. Guests receive a bed for the night plus an evening meal in our soup kitchen, breakfast, lunch, and personal care items. Case managers engage with these guests weekly to work on individual goals and action plans to find employment, to schedule clients for classes, housing and other supportive services to meet their needs. Our shelter programs are staffed by a Shelter Director, Shelter Manager, 3 full-time case managers, 18 part-time employees and many volunteers.\n\nEmergency Family Shelter\nThe Emergency Family Shelter provides residential shelter to families experiencing homelessness in Kenosha County. It offers a safe, stable and supportive environment for families in crisis. We provide families with three meals a day, clothing, and transportation assistance. Families receive daily support  and case management and are encouraged to attend meetings and classes that offer training in family dynamics, job searches, personal/family development, and financial stability. Families also receive individual case management to develop and implement a plan of action to move towards independence and self-sufficiency. We can accommodate 9 families and average 32 individuals (75% children) every day. Our shelter programs are staffed by a Shelter Director, Shelter Manager, 3 full-time case managers, 18 part-time employees, many volunteers and on occasion, college interns and fieldwork experience students.\n\nSoup Kitchen:\nServing every day at:\nShalom Center 4314 39th Avenue, from 5:00pm 6:00pm\n\nShalom Centers Soup Kitchen Meals That Matter program has volunteers and staff who prepare and serve a complete balanced and nutritious meal to needy children, families and individuals. The kitchen provides a hot meal including soup, entre, vegetable or potato, choice of sandwich, fruit, desert, milk, juice or coffee. For more than 30 years a daily meal has been served seven days a week, 365 days per year. We currently average 150 guests each evening. There are no eligibility requirements; everyone who attends receives a meal. The soup kitchen is staffed by a full-time soup kitchen manager, part-time soup kitchen supervisors and 50 different volunteer groups that provide 10-12 volunteers per night.\n\nMeals also served from 5:00pm 6:00pm at these locations:\n\nMonday Immanuel United Methodist 5410 Sheridan Road\nTuesday Christ the King Church 5934 8th Avenue\nWednesday Grace Lutheran 2006 60th Street\nThursday Bethlehem Temple 2528 Roosevelt Road\nFriday Blessing Center 1925 65th Street\n"
  },
  {
    "addressLine1": "2000 De Koven Avenue, Unit 1",
    "city": "Racine",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53403",
    "name": "Halo, Inc.",
    "organization": "Halo, Inc.",
    "phone": "(262) 633-3235",
    "website": "https://haloinc.org/",
    "description": "The Homeless Assistance Leadership Organization (HALO) is a non-profit organization that operates 24/7/365, and offers assistance to men, women, and families that are experiencing homelessness. It also provides these individuals with the resources and knowledge so that they can achieve self-sufficiency and housing stability. HALO offers different programs such as: emergency shelter, supportive services, and housing. HALO has 120-beds.\nHALO is divided into 2 sections, which places men on the east end side and women/families on the west end side of the building. On each side, there are sleeping rooms that are dorm-room type with bunk beds. There is also on each side a kitchen, dinning room and day-room with televisions. The dining rooms on both sides are used for overflow sleeping at nighttime.  \n\nAdditionally, there is a secure outdoor play area for children on the women/families side of the shelter.\n\n\n\nBasic Services Provided:\nClothing  Personal Hygiene Laundry FacilitiesThree meals daily\n\n\nPlease contact the office for additional information.\n"
  },
  {
    "addressLine1": "1030 Washington Ave",
    "city": "Racine",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53403",
    "name": "SAFE Haven of Racine - Youth Shelter",
    "organization": "SAFE Haven of Racine - Youth Shelter",
    "phone": "(262) 637-9559",
    "website": "https://safehavenofracine.org/",
    "description": "The Youth Shelter program provides food, clothing, shelter, and case management services to runaway, homeless, neglected and abused, and trafficked youth age 10 through 17.\nA runaway teen makes an easy target for fraud, robbery, or exploitation through human trafficking. Many become involved with drugs, pornography, survival sex, or teen prostitution.\n\nIn a small number of cases, some have been abducted or murdered. Those who do manage to survive on the streets are at risk for sexually transmitted diseases, pregnancy, alcohol or other drug abuse, and suicide.\n \nProgram Goals\n    Provide crisis intervention services for runaway, homeless, abused and other troubled youth and families in need, 24 hours a day.\n    Reunite youth with their families, when appropriate, and encourage the resolution of intrafamilial problems through counseling and other services.\n    Strengthen family relationships and encourage stable living condition for youth.  \n    Help youth decide upon constructive courses of action.\nYouth staying at the shelter receive\n    Food\n    Shelter\n    Clothing\n    Case Management\n    Information & Referral\n    Aftercare\nYouth are required to follow all shelter rules, such as\n    Must attend school and complete homework assignments.\n    Abstain from tobacco, alcohol and drug use.\n    Weapons, violence or gang paraphernalia prohibited.\nYouth who comply with rules may be able to stay for up to 14 days."
  },
  {
    "addressLine1": "919 Hood Street",
    "city": "La Crosse",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54601",
    "name": "A Place of Grace Catholic Worker House Day Shelter",
    "organization": "A Place of Grace Catholic Worker House Day Shelter",
    "phone": "(608) 782-6224",
    "website": "mailto:placeofgrace.cw@gmail.com",
    "description": ""
  },
  {
    "addressLine1": "17304 Havenwood Road",
    "city": "Sparta",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54656",
    "name": "Family Promise of Monroe County",
    "organization": "Family Promise of Monroe County",
    "phone": "(608) 269-0308",
    "website": "https://familypromiseofmonroecounty.com/",
    "description": "We specifically accept families with children and help to get them through the homelessness that they are facing and back to being on stable ground. We are available to contact from 8:30am - 4:30pm Monday - Friday."
  },
  {
    "addressLine1": "N4355 State Highway 27/ PO Box 42",
    "city": "Ladysmith",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54848",
    "name": "Rusk County Lighthouse Shelter",
    "organization": "Rusk County Lighthouse Shelter",
    "phone": "(715) 609-9600",
    "website": "https://www.ruskcountylighthouse.org/",
    "description": "We don't receive mail at the street address and anyone wanting to come to the shelter needs to call first.\n\nServices Provided:- Emergency overnight stays\n- Short term shelter stays\n- Case Management services\n- Low income housing information\n\nMissionTo work together as a non-profit organization of community organizations and individuals, to address the housing needs of homeless people in Rusk County.Company OverviewWelcome to the Rusk County Lighthouse Facebook page.\n\nThere is HOPE for the homeless of this community. Rusk County Lighthouse serves families and individuals with emergency overnight stays, short term shelter stays, and case management. You can help support the Rusk County Lighthouse in several ways.\n\n\nOne is as easy as putting your Gordy's County Market receipts into the collection can located at the Pioneer Branch Bank located right at Gordy's County Market (in Ladysmith). We would also ask you to consider making a financial contribution to our shelter. Foreclosures, job loss, increased living expenses and the general state of the economy has resulted in an increase in the number of families and individuals requesting shelter and services. Shelter and services are provided at no cost to the client. We need you to help ensure that these services are available."
  },
  {
    "addressLine1": "1107 Heart Island Parkway",
    "city": "Rice Lake",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54868",
    "name": "Benjamin's House Emergency Shelter",
    "organization": "Benjamin's House Emergency Shelter",
    "phone": "(715) 736-2437",
    "website": "https://www.benjamins-house.org/",
    "description": "New Resident Information\nImportant Information for New Residents:  All potential residents must have a pre-screening interview prior to being accepted into our program. Individuals interested in coming to Benjamin's House Emergency Shelter for assistance should read the following information regarding our policies and then call with any questions or to set up an interview (715-736-2437).  \nIndividuals Ineligible for Residency\n\n    Candidates who fail a background check are ineligible.\n    Individuals who are under the influence of alcohol or other drugs will not be admitted\n\n    Individuals who are deemed by the executive director or case manager to be dangerous to themselves, others, or the property are not candidates for residency.\n    Each household must be headed by an adult who is at least 18 years of age.\n\n\nServices Provided\n\n    When there is a scheduled meal volunteer, evening meals are provided and are served family-style.  All other meals are self-serve.\n    An individual case plan will be completed under the guidance of a case manager.\n    Referrals to community agencies will be made as needed.\n\n\nSelection of Residents\n\n    Priority of selection:\n\n    Barron county resident family with dependent children.\n    Barron county resident.\n    Out-of-county resident family with dependent children.\n    Out-of-county resident.\n\n    Priority also based on:\n\n    Clear need/low risk\n    Clear need/some risk\n    Questionable need\n    High risk\n\n    At times when all shelter units are occupied, a waiting list will be developed.\n\n\nIntake Procedures\n\n    An initial intake phone or in-person interview will be conducted by a staff person to determine eligibility and priority assignment.\n    An intake application will be completed along with all other intake paperwork.\n\n    Rules and regulations will be reviewed and agreements signed.\n    We are required as an agency to utilize WISP. Please review our Consumer Notice for Wisconsin ServicePoint.\n\n\nLimitations of Residency\n\n    Resident stay  at Benjamin's House is for a period of up to 90 days total, with progress evaluated at 30 and 60 days.\n    Admissions are limited to once per twelve-month period. Repeat admissions must first write a letter to the executive director explaining the changes that will be made during the second stay that will allow for a successful outcome.\n\n\nConsequences for Violations of Shelter Program Rules\n\n    Benjamin's House is a zero tolerance facility for drugs and alcohol.  If a resident is found to possess or use drugs or alcohol, he or she will be asked to leave immediately.\n     If a resident is found in violation of any of the program rules, they will be issued a written warning. Three infractions will result in immediate dismissal.\n    In the case of gross misconduct, the resident will be evicted immediately from the premises.  \n\n\n\nQuestions and Answers:\n\nQ)  What criteria must a resident meet to be admitted to Benjamins House?\nA)  All residents must complete a pre-screening interview prior to being accepted into the program as well as a background check.  Residents are required to be able to care for themselves and/or their family, as well as be mentally stable and able to successfully reside in a communal home.  Those with an excessively violent background or with any sexual assault history will not be considered.  \n\n \nQ)  Can the victims of domestic violence and other abusive situations come to the shelter?\nA)  No.  The shelter does not have the security necessary to provide the required safety for victims of domestic violence. However, Benjamins House provides referrals to the appropriate organizations to help assist abuse victims get the help and support needed.\n\nQ)  Does the shelter house people under the influence of drugs or alcohol?\nA)  No.  Benjamin's House strictly enforces a zero tolerance policy regarding drugs and alcohol.  Any resident found under the influence will be asked to leave.\n \nQ)  Does Benjamins House allow people to stay for just a couple of nights?\nA)  No.  Benjamins House is a program-based shelter requiring each resident to develop an individual case plan to help achieve successful independent living.  This includes twice weekly 1:1 meetings with a case worker and other support programs to assist them in securing jobs and housing.  Benjamins House does not accept people who need a place to stay for just one or two nights.\n\nQ) Can residents become repeat visitors?\nA) Admissions are limited to one time in a twelve-month period.  \n\nQ)  How do people get in contact with Benjamins House when they are in need?\n\nA)  Potential residents can be referred by another person or organization or call (715) 736-2437 to set up an interview.  Everyone will be required to go through an interview process with staff before they can become a resident.\n\nQ)  Who helps residents look for employment?\nA)  The shelter employs a full time case manager who will work with individuals on employement search and resources for housing.\n\nQ)  How many people can stay at the shelter at one time?\nA)  There are 17 rooms that can house up to 24 adults and up to 30 individuals including children.\n \nQ)  Are residents required to do chores while living at Benjamins House?\nA)  Yes.  Residents have basic cleaning and housing duties they must complete as part of their stay.  They are also required to do their own laundry, however machines and detergent are provided to all residents.\n \nQ)  Is there a curfew?\nA)  Yes.  Adults have a curfew of 11pm to be in the building and midnight to be in their rooms for the night.  Children under 12 have a bedtime of 8:30 pm, while teens are required to be in bed by 10 pm.\n \nQ)  Are meals provided?\nA)  Yes.  An evening community dinner is provided by individuals, churches, and civic organizations who prepare and serve meals for the residents.  Additionally, there is a fully stocked pantry and freezer. Residents are welcome to use any of the food provided.\n\nQ)  Is religious counseling required for residents?\nA)  No.  Benjamins House is a secular organization and does not provide religious guidance.   However, churches can and do provide outreach and offer to take residents to church services or bible studies.\n\nQ)  How many staff work at the shelter at any given time?\n\nA)  We are a 24/7 facility. As such, there is always at least one staff member on duty.  The Executive Director oversees general operations and a Case Manager works directly with residents to assist with their personal goals and plans.\n \nQ)  How can you personally help Benjamins House?\nA)  There are many opportunities to get involved including fundraising, providing transportation, tutoring, cooking meals, performing clerical duties, teaching skills to residents (i.e. budgeting), or even painting and cleaning.  The shelter operates on a very tight operating budget  and all monetary donations are greatly appreciated!  The donation of  household items including cleaning supplies, toilet paper, bleach, paper toweling, and laundry detergent are always needed.  Other items such as gift certificates for haircuts and gas are a welcome gift to our residents."
  },
  {
    "addressLine1": "328 E Washington Ave",
    "city": "Tomahawk",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54487",
    "name": "Our Sisters House",
    "organization": "Our Sisters House",
    "phone": "(715) 224-3520",
    "website": "http://www.oursistershousetomahawk.org/",
    "description": "Temporary Homeless Shelter for Women, Men and Children.\n\nOur mission is to provide temporary housing and living essentials to those in need, in a safe environment that fosters a sense of self-worth, promotes self-sufficiency and strives for independent living.\n\n\nWe providing immediate temporary housing to individuals and families; to offer assistance in attaining employment and finding permanent housing, furthering education, helping residents get needed medical care or counseling, and to raise awareness about homelessness in Lincoln County. Residents will be allowed to stay up to 3 months. No drugs or alcohol allowed; sex offenders will not be accepted and minors must be accompanied by an adult."
  },
  {
    "addressLine1": "122 N 4th Ave",
    "city": "Iron River",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "49935",
    "name": "Awakenings Homeless Shelter",
    "organization": "Awakenings Homeless Shelter",
    "phone": "(906) 265-5960",
    "website": "mailto:awakeningshome@gmail.com",
    "description": "Men's Homeless Shelter."
  },
  {
    "addressLine1": "128 E. Olin Ave, Suite 202",
    "city": "Madison",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53713",
    "name": "Interfaith Hospitality Network (IHN) Shelter program",
    "organization": "Interfaith Hospitality Network (IHN) Shelter program",
    "phone": "(608) 294-7998",
    "website": "http://trhome.org/",
    "description": "Hours:\nOffice 8:00 a.m. -5:00 p.m. Monday-Friday\nDay Center 8:00 - 5:00 p.m. 7 days a week\n\nThe IHN Shelter program provides emergency shelter to homeless families with children through a network of Madison area churches and synagogues. Volunteers from these congregations provide overnight shelter, three meals per day and evening activities for the families. Daytime shelter and case management services are provided at The Road Home office and day center. Families staying in shelter must work with a case manager to seek housing, employment and other community services and attend educational workshops. Transportation between locations is provided by The Road Home.\nThe IHN Shelter program began in 1999 with a dozen congregations dedicated to providing shelter to homeless families with children. IHN is now very proud to say that there are 54 congregations and more than 1,500 active volunteers. Together with The Road Home, IHN provides a safety net for families facing a housing crisis so they can recover and get back on their feet."
  },
  {
    "addressLine1": "128 E. Olin Ave., Suite 202",
    "city": "Madison",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53713",
    "name": "The Road Home Dane County",
    "organization": "The Road Home Dane County",
    "phone": "(608) 294-7998",
    "website": "http://www.trhome.org/",
    "description": "The Road Home Dane County serves homeless families with children by providing shelter, case management and housing programs.\n\nNeed Shelter?\nCall the Housing Resource Line at 1-855-510-2323\n\nInterfaith Hospitality Network (IHN) Shelter program\nThe IHN Shelter program provides emergency shelter to homeless families with children through a network of Madison area churches and synagogues. Volunteers from these congregations provide overnight shelter, three meals per day and evening activities for the families. Daytime shelter and case management services are provided at The Road Home office and day center. Families staying in shelter must work with a case manager to seek housing, employment and other community services and attend educational workshops. Transportation between locations is provided by The Road Home.\n\n\nThe IHN Shelter program began in 1999 with a dozen congregations dedicated to providing shelter to homeless families with children. IHN is now very proud to say that there are 54 congregations and more than 1,500 active volunteers. Together with The Road Home, IHN provides a safety net for families facing a housing crisis so they can recover and get back on their feet."
  },
  {
    "addressLine1": "630 East Washington Avenue",
    "city": "Madison",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53703",
    "name": "Salvation Army Single Women's Shelter",
    "organization": "Salvation Army Single Women's Shelter",
    "phone": "(608) 250-2226",
    "website": "http://salvationarmydanecounty.org/",
    "description": "The Salvation Army offers our community's only single women's shelter. Single Women's shelter provides temporary nighttime only shelter to single homeless women (age 18 or older). The facility may accommodate up to 30 women per night. Cold weather exceptions apply (please see below). An individual's stay is limited to 30 nights, but extensions up to 60 nights may be granted to women working with a case manager to secure housing. In addition to shelter and case management, women are provided meals, shower/laundry facilities and skill-building workshops.\n\nWomen in need may arrive at The Salvation Army at 5:00 pm. If need exceeds capacity, a lottery system will be activated. All women will be issued a ticket with a number; and corresponding numbered tickets will be drawn from a hat. Ladies whose number is chosen will be guaranteed a bed for the evening.\n\n\nOn nights of extreme weather conditions or cold (i.e. 20 degrees or colder), all single women in need are welcome to use shelter despite usual capacity or shelter night limits. Space may be crowded, but The Salvation Army of Dane County will not deny shelter to any single woman in need. Please note: Behavioral issues and rule violations may result in suspension of shelter access even on cold weather nights.\n\nFirst come first serve\nCapacity 30 women. Sleep on pull outs in gym\nShelter Office is open from 6:30pm - 5pm.\nResidents must be off property from 8am - 5pm.\nShower and laundry on site.\nDinner, snack, breakfast are provided. dinner 5pm, breakfast 6:30am.\nresidents are allowed 30 nights shelter each year.\nPlease do not arrive before 5pm."
  },
  {
    "addressLine1": "1350 MacArthur Road",
    "city": "Madison",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53714",
    "name": "The Elizabeth House: Maternity and Parenting Residential Program",
    "organization": "The Elizabeth House: Maternity and Parenting Residential Program",
    "phone": "(608) 259-1605",
    "website": "https://www.elizabethhousedane.org/",
    "description": "The Elizabeth House is a residential maternity and parenting program. We offer safe and stable housing to pregnant homeless single women, ages 18 and older. The Elizabeth House, a program of Care Net Pregnancy Center of Dane County, is an eight bed maternity and parenting program. Office hours are on our website: https://www.elizabethhousedane.org/contact/All of our services are free of charge, but there is a high accountability and expectation of participation in The Elizabeth House programming which includes but is not limited to nutrition, financial education, case management, obtaining and maintaining employment, parenting education,\"Heart chats,\" and devotions. Please adhere to our criteria. If you have any questions feel free to contact our office.Applicant criteria: 18+, single, first time pregnant woman or pregnant woman with one additional child under the age of 2, currently homeless or unstable housing. Must have commitment to full participation in Case Management and house programming. The Elizabeth House is not treatment based (mental health or AODA) nor is it emergency shelter.What applicants can expect:A thorough intake process that determines if the applicant is appropriate for community living. (All applicants are subject to drug screening upon first initial interview and a background check). All applicants are evaluated for substance use/abuse, motivation to participate and engage case management, ability to follow house policies, and live cooperatively in a structured community setting. All accepted residents are to actively engage in house functions, which includes, managing chores, house maintenance, curfew, and abiding house policy and procedures. Additionally, all residents are required to either attend school or find employment and participate in Case Management Services provided by staff of The Elizabeth House."
  },
  {
    "addressLine1": "108 E Pleasant St",
    "city": "Portage",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53901",
    "name": "River Haven Shelter",
    "organization": "River Haven Shelter",
    "phone": "(608) 742-7687",
    "website": "https://www.facebook.com/pages/River-Haven-Shelter-Portage-WI/109882112386959",
    "description": "Families with children, individual women, and individual men are welcome at the shelter, though we have a separate shelter for the men.\n\nWe do not accept violent individuals or ones with a history of violence.\n\nWe also do not accept individuals with a criminal history and felony drug use within the past 3 years.\nThe maximum number of residents at one time is 16. Thirty days in any one-year period is the maximum stay. However, a stay can be shortened if house rules are broken. Some rules:\nNo alcohol or smoking allowed on the premises; residents must clean their rooms and community areas; curfew hours and quiet hours also pertain; no visitors are allowed in the house.River Haven Homeless Shelter educates its residents about services such as the food pantry, rental assistance, medical assistance, mental health programs, the food share program, child care, W2, or anything else to help them make better choices.\n\nWe also require them to report job search information to a case manager if a resident is not employed but could be. River Haven is staffed 24 hours a day, with a case worker on duty 7 days a week. The case worker makes sure that house rules are followed. The project is always looking for volunteers to act as mentors when the opportunity arises.\n"
  },
  {
    "addressLine1": "1110 S 10th Street",
    "city": "Manitowoc",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54220",
    "name": "Hope House of Manitowoc County",
    "organization": "Hope House of Manitowoc County",
    "phone": "(920) 686-1436",
    "website": "http://www.hopehousemc.org/",
    "description": "Our mission is to mobilize volunteers and resources to help families at risk of homelessness move toward self-sufficiency.\n\n\n\nHope House is the shelter program of the Lakeshore Interfaith Hospitality Network of Manitowoc County (LIHN), an affiliate of Family Promise and is a 501(c)(3) nonprofit organization. In 2010, Hope House served more than 45 families and provided more than 2,000 nights of shelter.\n\n\n\nOur Services:\n\nShelter Program, Bridges Outreach Program and Operation Independence Program.\n\n\n\nOur Work:\n\nDevelop individualized plans to identify and address any barriers that may be getting in the way of living independently.\n\n\n\nLink guests to community agencies that will assist them as they move toward self-sufficiency once again.\n\n\n\n\nAssist families in establishing safe, stable housing arrangements.\n\n\n\nHelp families in locating and securing suitable employment.\n\n\n\nWork with families in identifying problems related to financial management.\n\n\n\nProvide life skills training to better equip families for successful independent living.\n\n\n\n\nSupply resources to complete basic GED/HSED education."
  },
  {
    "addressLine1": "710 Pennsylvania Avenue",
    "city": "Sheboygan",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53081",
    "name": "Salvation Army Emergency Shelter Sheboygan",
    "organization": "Salvation Army Emergency Shelter Sheboygan",
    "phone": "(920) 458-3723",
    "website": "http://www.sasheboygan.org/",
    "description": "The Salvation Army Emergency Lodge is a 45 bed emergency shelter. It is available 24 hours a day, 7 days a week to assist members of Sheboygan County who are homeless. This is a 30 day program with extension stays available.\n\nDuring their stay, clients are provided with intensive case management and given the opportunity to set realistic goals and work toward them. This action plan will ultimately result in permanent and affordable housing. Case Managers meet weekly with clients to determine action plan progress.\n\n"
  },
  {
    "addressLine1": "603 Mann St.",
    "city": "Marinette",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54143",
    "name": "Haven of Hope",
    "organization": "Haven of Hope",
    "phone": "(715) 735-3684",
    "website": "https://www.homelessshelterdirectory.org/shelter/none",
    "description": "This is a shelter to help single homeless people. Our mission is to reach out to people who are in need of a safe place to stay and guidance to a better way of life."
  },
  {
    "addressLine1": "1406 10th Ave",
    "city": "Menominee",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "49858",
    "name": "Abundant Life Mission Center",
    "organization": "Abundant Life Mission Center",
    "phone": "(906) 424-4429",
    "website": "http://www.alcmission.org/",
    "description": "Abundant Life Mission is a Faith-based shelter located in Menominee, MI. We accept anyone in need but you must be have proper state issued identification and be able to pass a background check and not be on the sexual registry."
  },
  {
    "addressLine1": "212 E. Third St",
    "city": "Marshfield",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54449",
    "name": "The Hannah Center",
    "organization": "The Hannah Center",
    "phone": "(715) 387-6300",
    "website": "https://www.hannahcenter.com/",
    "description": "The Hannah Center is a home for women in crisis. Our mission is to assist women in crisis through compassion and guidance in a nurturing environment.\n\nThe Hannah Center also offers items from our Clearinghouse to families in need. Many families and residents look to us for maternity, children and baby clothing, cribs, strollers, diapers, household items, hygiene products and of course MANY other baby items!"
  },
  {
    "addressLine1": "169 North Central Ave",
    "city": "Marshfield",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54449",
    "name": "St. Vincent de Paul Thrift Store",
    "organization": "St. Vincent de Paul Thrift Store",
    "phone": "(715) 387-4425",
    "website": "https://www.stvincentdepaulmarshfield.com/",
    "description": "Our desire is to provide you with the assistance you need to reach your goal of becoming self-sufficient and secure permanent housing. Our shelter houses individuals from different walks of life, with different ethnic and socioeconomic backgrounds, diverse values, and different beliefs. We respect the individuality of everyone who lives and works in our shelter. Although the Frederic Ozanam Transitional Shelter provides a supportive Christian environment, it places no religious requirement on any resident or volunteer, nor does it discriminate against anyone because of race, creed, ethnicity, or religion.\n\nOur mission is to provide emergency transitional housing for homeless families. Our primary focus is to move families from homelessness to self-sufficiency by reducing their dependence on public assistance, improving their living skills, and securing permanent housing.\n\n\nOur immediate aim is to help families meet their basic needs by providing a temporary transitional home environment. We further aim to assist with transportation, food, job skill training, clothing, and appropriate resources so that families may return to self-sufficient and productive lives."
  },
  {
    "addressLine1": "1600 Briggs St",
    "city": "Stevens Point",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54481",
    "name": "Salvation Army Stevens Point Hope Center",
    "organization": "Salvation Army Stevens Point Hope Center",
    "phone": "(715) 341-2437",
    "website": "http://www.salvationarmywi.org/wum/stevens_point_programs_services",
    "description": "The Hope Center is just that, a place of hope for those who have little or none left. With a family-type environment, the Hope Center provides a warm bed for those who are in need of emergency shelter for a given period of time.\nResidents meet with an advocate to create a plan, just for them, to get back on their feet again. The Hope Center is not a place for a hand out, it's a place for a hand up.\n\nHot meals are served daily for those who are in need of something at breakfast, lunch or dinner. Simply sign in and enjoy. The meals are prepared that same day and served in a cafeteria-style dining facility."
  },
  {
    "addressLine1": "830 N 19th St",
    "city": "Milwaukee",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53202",
    "name": "Joy House - Milwaukee Rescue Mission",
    "organization": "Joy House - Milwaukee Rescue Mission",
    "phone": "(414) 344-2211",
    "website": "https://milmission.org/programs/joy-house",
    "description": "Milwaukee Rescue Mission Program for women and children.\n\nJoy House is our family shelter, offering a range of short- and long-term solutions, with the goal of helping families become self-sufficient and stable. Hot meals provided along with other types of help."
  },
  {
    "addressLine1": "830 North 19th Street",
    "city": "Milwaukee",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53233",
    "name": "Milwaukee Rescue Mission",
    "organization": "Milwaukee Rescue Mission",
    "phone": "(414) 344-2211",
    "website": "https://www.milmission.org/",
    "description": "Safe Harbor (for men)\nThe men's programs at the Milwaukee Rescue Mission give our guests the strength and support to transform their lives. Our educational and vocational counseling, addiction recovery programs, biblical instruction, and life-skills training give them a ticket off the streets.\n\nJoy House (for women & children)\nThe women and children who come to us for emergency or long-term support rely on the safety, love and warmth of Joy House and its many services. We nourish and nurture them through training, education and spiritual guidance so they can make better lives for themselves and for their kids."
  },
  {
    "addressLine1": "1216 North 13th Street",
    "city": "Milwaukee",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53205",
    "name": "Guest House of Milwaukee",
    "organization": "Guest House of Milwaukee",
    "phone": "(414) 345-3240",
    "website": "https://www.guesthouseofmilwaukee.org/",
    "description": "Homeless emergency shelter for men. Provides up to 30 days of emergency stay. Provides meals."
  },
  {
    "addressLine1": "2815 N. 28th St.",
    "city": "Milwaukee",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53210",
    "name": "Aline's Room and Board",
    "organization": "Aline's Room and Board",
    "phone": "(414) 213-0454",
    "website": "mailto:jdagons@yahoo.com",
    "description": "Aline's Room and Board offers short-term,long-term and Respite care. Aline's Room and Board is aimed at providing safety and stability for individuals experiencing mental health issues and homlessness.Aline's Room and Board also offers emergency shelter needs.(please call for availability)"
  },
  {
    "addressLine1": "209 W. Orchard St",
    "city": "Milwaukee",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53204",
    "name": "Hope House of Milwaukee",
    "organization": "Hope House of Milwaukee",
    "phone": "(414) 645-2122",
    "website": "http://www.hopehousemke.org/",
    "description": ""
  },
  {
    "addressLine1": "7833 W. Capitol Drive, Suite #1",
    "city": "Milwaukee",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53222",
    "name": "Port of Missions Outreach Ministries",
    "organization": "Port of Missions Outreach Ministries",
    "phone": "(414) 759-4575",
    "website": "http://www.portofmissions.org/",
    "description": "Services\n\n\nAffordable Housing\nPort of Missions strives to be the central intake point for anyone in Milwaukee metropolitan area who is experiencing a housing crisis. Today, every county or region has an agency that has been assigned this role. We provide a centralized approach to identifying the most helpful resources for those facing a housing crisis, whether that be:\n \n    Homelessness prevention assistance for those at imminent risk of homelessness\n\n    Housing search assistance for anyone seeking to secure stable, affordable housing\n    Rapid re-housing assistance for those currently homeless\n    Referral to shelter services or other housing assistance\n    Referral to other supportive services that can help to stabilize housing\n\nFood Ministries\nThe Food Pantry is stocked with donated non-perishable food items. Donated food or monetary gifts come from corporate grocer donations, government programs such as the USDA, local food drives, or personal gifts to the Pantry.\n\nClothing Ministries\nThe Clothing Closet is filled with donated new or gently used clothing. Donated clothing is provided by individuals, donations by corporate retail organizations, or through monetary donations with which needed items are purchased."
  },
  {
    "addressLine1": "1301 E. Moreland Blvd",
    "city": "Waukesha",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53186",
    "name": "Jeremy House",
    "organization": "Jeremy House",
    "phone": "(262) 549-8735",
    "website": "http://www.hebronhouse.org/",
    "description": "Mental illness homeless shelter."
  },
  {
    "addressLine1": "505 N. East Avenue",
    "city": "Waukesha",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53186",
    "name": "The Women's Center",
    "organization": "The Women's Center",
    "phone": "(262) 542-3828",
    "website": "https://twcwaukesha.org/",
    "description": "Domestic violence shelter for women, safe, short-term housing, and support.\nA screening process is required.\n24 hour crisis line: 262-542-3828\nOther Services they Provide:\n24-Hour Hotline 262.542.3828\nSexual Assault & Abuse\nChild Abuse\nHuman Trafficking"
  },
  {
    "addressLine1": "111 E. Main St",
    "city": "Waukesha",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53186",
    "name": "Hebron House of Hospitality",
    "organization": "Hebron House of Hospitality",
    "phone": "(262) 549-8722",
    "website": "http://www.hebronhouse.org/",
    "description": "The Hebron House serves single women and families that find themselves in a housing crisis. While at the shelter guests work on obtaining permanent housing, employment and goals to help stabilize their lives."
  },
  {
    "addressLine1": "445 Madison Street",
    "city": "Waukesha",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53188",
    "name": "Salvation Army of Waukesha - Emergency Lodge",
    "organization": "Salvation Army of Waukesha - Emergency Lodge",
    "phone": "(262) 547-7367",
    "website": "https://www.facebook.com/salvationarmywaukesha/",
    "description": "The Emergency Lodge provides emergency shelter to single men experiencing homelessness in Waukesha County. During their participation in the Emergency Lodge program clients are provided with assistance meeting their basic needs and case management services to assist them with addressing their homeless issues.\n\nContact: Monday-Friday 5pm-9am\nSaturday-Sunday 3pm-9am\nOpen beds are assigned based on waiting list. Call during open hours to be placed on waiting list. Beds cannot be held.\n\nMust be 18 years of age or older\nMust have a photo ID\nMust be sober and willing to submit to a breathalyzer and drug screen.\nMust be willing to cooperate with all rules and policies of the Emergency Lodge program."
  },
  {
    "addressLine1": "P.O. Box 378",
    "city": "Monroe",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53566",
    "name": "Family Promise of Green County, WI",
    "organization": "Family Promise of Green County, WI",
    "phone": "(608) 328-2600",
    "website": "http://www.familypromisegreencounty.org/",
    "description": "Serving Green County residents. We provide a rotating shelter,meals and case management services to families with children who are residents of Green County, WI"
  },
  {
    "addressLine1": "514 S. Chicago Ave.",
    "city": "Freeport",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "61032",
    "name": "Chicago Ave Mission",
    "organization": "Chicago Ave Mission",
    "phone": "(815) 233-0435",
    "website": "https://www.faccfreeport.com/",
    "description": "The Chicago Avenue Mission is a 16 bed emergency homeless shelter whose mission is to give homeless adult men and women a safe and warm place to stay. Our goal is to help all of our homeless guests attain the skills, tools, and resources they need to become permanently housed once again.\n\nThe Mission is open daily from 6 p.m. to 8 a.m. from October 1st through May 31st each year and serves 50 to 60 unduplicated homeless men and women each year. Evening meal at 6:30 p.m. and breakfast every morning. Shower and laundry facilities also available.\n\n"
  },
  {
    "addressLine1": "W6733 Shawpokasic Street",
    "city": "Neopit",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54150",
    "name": "Eagles Nest Emergency Shelter",
    "organization": "Eagles Nest Emergency Shelter",
    "phone": "(715) 756-2576",
    "website": "https://www.menominee-nsn.gov/governmentpages/Department.aspx?departmentID=5101",
    "description": "On the Menominee Indian Reservation. Emergency shelter for all. Provides numerous services. Call for details."
  },
  {
    "addressLine1": "213 East Green",
    "city": "Shawano",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54166",
    "name": "SAM's House",
    "organization": "SAM's House",
    "phone": "(715) 851-7252",
    "website": "http://www.sam25.org/",
    "description": "Our seasonal shelter is open November through April. SAM's House provides temporary shelter for men, women, and children who are experiencing homelessness during the winter months. Guests are also provided with personal care items and meals to meet their basic needs. Guest Check in is 5:00-9:00 p.m. and Guest Check out: 7:30 a.m."
  },
  {
    "addressLine1": "1345 Water Street",
    "city": "Platteville",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53818",
    "name": "Lutheran Church of Peace Emergency Homeless Shelter",
    "organization": "Lutheran Church of Peace Emergency Homeless Shelter",
    "phone": "(608) 348-9057",
    "website": "https://www.lutheranchurchofpeace.org/",
    "description": "Emergency Shelter for family with 2 or less children or singles"
  },
  {
    "addressLine1": "333 W Cherry St",
    "city": "Lancaster",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53813",
    "name": "Family Promise of Grant County",
    "organization": "Family Promise of Grant County",
    "phone": "(608) 723-3355",
    "website": "https://www.familypromiseofgrantcounty.com/",
    "description": "We provide services to families experiencing homelessness in Grant County. We work with local faith communities to provide meals, shelter, and comprehensive case management to help families achieve sustainable independence.You must call to schedule an intake, and I do intakes up until 3pm each weekday."
  },
  {
    "addressLine1": "1561 Jackson Street",
    "city": "Dubuque",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "52001",
    "name": "Maria House",
    "organization": "Maria House",
    "phone": "(563) 582-6286",
    "website": "https://www.openingdoorsdbq.org/maria-house/",
    "description": "Maria House offers transitional housing for up to two years. Women continue to work on goals, and build skills that empower them toward a goal of becoming self-sufficient. The Case Manager continues to guide and support clients."
  },
  {
    "addressLine1": "1592 Locust St",
    "city": "Dubuque",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "52001",
    "name": "Hope House Catholic Worker",
    "organization": "Hope House Catholic Worker",
    "phone": "(563) 582-9079",
    "website": "https://www.catholicworker.org/",
    "description": ""
  },
  {
    "addressLine1": "1111 Bluff Street",
    "city": "Dubuque",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "52001",
    "name": "Teresa Shelter",
    "organization": "Teresa Shelter",
    "phone": "(563) 690-0086",
    "website": "https://www.openingdoorsdbq.org/",
    "description": ""
  },
  {
    "addressLine1": "398 Main Street",
    "city": "Dubuque",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "52004",
    "name": "Dubuque Rescue Mission",
    "organization": "Dubuque Rescue Mission",
    "phone": "(563) 583-1394",
    "website": "http://www.dbqrescue.org/",
    "description": ""
  },
  {
    "addressLine1": "136 W Grand Ave",
    "city": "Port Washington",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "00000",
    "name": "Family Promise of Ozaukee County",
    "organization": "Family Promise of Ozaukee County",
    "phone": "(262) 268-2723",
    "website": "https://www.familypromiseoz.org/",
    "description": "Day and Evening Shelter\n\nShelter\nThe basic needs of food, shelter and hospitality are provided through the network of Family Promise congregations. The churches are located across the county and are open from 5 pm to 7 am daily. While at the churches, the evening meal is provided along with the morning meal. Foods are made available to be packed for lunch at the day center or at the clients place of employment. During day time hours clients stay at the day center unless they are employed or have other appointments.\n\nFirst call for help\nCallers are asked a series of questions that will help determine what types of resources are needed. If homelessness is not imminent the caller is provided with information on affordable housing and referred to other agencies and resources that can prevent them from becoming homeless. Our goal is to help maintain safe and secure communities by keeping people safely housed or sheltered so they do not have to live in their cars or on the streets."
  },
  {
    "addressLine1": "139 S. Webb",
    "city": "Reedsburg",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53959",
    "name": "Safe Harbor Homeless Shelter For Women",
    "organization": "Safe Harbor Homeless Shelter For Women",
    "phone": "(608) 768-0040",
    "website": "mailto:safeharbor@rucls.net",
    "description": "Women and Children's Shelter."
  },
  {
    "addressLine1": "P.O. Box 1764",
    "city": "Racine",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53403",
    "name": "Women’s Resource CenterRacine",
    "organization": "Women’s Resource CenterRacine",
    "phone": "(262) 633-3274",
    "website": "https://www.wrcracinewi.com/",
    "description": "The Women's Resource Center offers safe secure shelter in a turn of the century home in downtown Racine.  Safe shelter is also available on the west end of the county through a collaborative effort with TLC Burlington.  Male victims or victims with extenuating circumstances are offered motel vouchers.\n\nThe Racine shelter, run by Women's Resource Center, is an eight bedroom, 32 bed home with plenty of community living spaces. Meditation rooms, sun porches and quiet nooks welcome families to the healing and peace within our shelter walls. The Cynthia Murphy Wholeness Wellness Room has exercise equipment and other physical health activities.  Large living rooms and plenty of open spaces are available for kids to do homework or families to gather to spend social time together. Shelter life can never be like home, but WRC's shelter offers a comfortable and welcoming atmosphere.\n\n   \nShelter advocates are available every hour of every day to welcome new residents and to support those staying with us.  Shelter advocates provide healing opportunities in a trauma informed way, understanding that each victim has their own way of regaining strength and empowerment.  Shelter advocates also provide support to families in reaching their goals to achieve a lifetime free of abuse.\nIn addition, WRC offers counseling for adults and children, holistic healing services, legal advocacy and assistance with referrals for other community resources to all shelter residents.\n\nApproximately 350 women and children flee to WRC's shelter each year.  A typical stay is about 45 days.\nIf you are a victim of domestic or sexual violence and are in need of emergency services, please call our 24-hour Crisis Line: 262-633-3233.\n "
  },
  {
    "addressLine1": "P.O. Box 156",
    "city": "Richland Center",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53581",
    "name": "Passages",
    "organization": "Passages",
    "phone": "",
    "website": "https://www.facebook.com/passagesrichlandcenter/?ref=page_internal",
    "description": "Passages in Richland Center is a shelter for victims of domestic violence and sexual assault."
  },
  {
    "addressLine1": "202 Callon St",
    "city": "Wausau",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "54401",
    "name": "Salvation Army",
    "organization": "Salvation Army",
    "phone": "(715) 845-4272",
    "website": "https://centralusa.salvationarmy.org/wausau/contact-us/",
    "description": "Services at this location:\nServices Offered:\nFood & Nutrition\nDisaster Services\nEmergency Financial Assistance\nEmergency Shelter\nFood & Nutrition Programs\nSeasonal Services\nCasework Services\nWorship Services - Church\nChristian Education\nCharacter Building Programs\nResidential Camping Activities"
  },
  {
    "addressLine1": "p.o. box 12875",
    "city": "milwaukee ",
    "state": "Wisconsin",
    "stateAbbreviation": "WI",
    "postal": "53212",
    "name": "All For Him Ministries inc",
    "organization": "All For Him Ministries inc",
    "phone": "(414) 587-1773",
    "website": "",
    "description": "We are a church/shelter which trains men,women, and families to walk in Gods word, to be doers 0f his holy word.we provide shelter,food,clothing,and most important of all the word of GOD. YOU WILL BE TRAINED IN SPIRITUAL WARFARE, YOU WILL PREACH THE Gospel AND GIVE SERMONS AND Bible STUDIES. WE DO ASSIST WITH JOBS AND TRANSPORTATION. WE ACCEPT ANYONE WHO IS TIRED OF WORKING FOR THE DEVIL, AND YOU WANT TO LIVE FOR GOD.WE DONT CARE ABOUT YOUR PAST MISTAKES, BECAUSE NO ONE IS PERFECT BUT GOD! WE ALL FALL SHORT, BUT THAT DOESN'T MEAN YOU CONTINUE I IT. WE ARE OPEN 24 HRS A DAY, WE LOVE YOU AND SO DOES GOD."
  }
]