[
  {
    "addressLine1": "1418 Garfield Ave",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66102",
    "name": "Della Gill - Joyce H. Williams Center",
    "organization": "Della Gill - Joyce H. Williams Center",
    "phone": "(913) 321-0951",
    "website": "http://www.friendsofyates.org/",
    "description": "Emergency Shelter Domestic Violence Victims Only\nThe Della Gill/Joyce H. Williams Center is dedicated to providing a safe, warm and caring environment to victims of domestic violence.  Our supportive services promote and empower domestic violence victims in establishing 'violence free' lives. \n\nOffice Phone: 913-321-1566\nAdministrative Hours: Monday-Friday 8:30am-5:00pm."
  },
  {
    "addressLine1": "1130 Troup Avenue",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66104",
    "name": "Mt. Carmel Community Outreach Ministries",
    "organization": "Mt. Carmel Community Outreach Ministries",
    "phone": "(913) 621-4111",
    "website": "http://www.mtcarmelrc.org/",
    "description": ""
  },
  {
    "addressLine1": "2601 Ridge Ave",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66104",
    "name": "Shalom House",
    "organization": "Shalom House",
    "phone": "(913) 321-2206",
    "website": "https://catholiccharitiesks.org/where-we-work/shalom-house/",
    "description": "Services 24 men of all faiths in need of shelter, food and companionship daily.\n\n\nServices are provided at no charge and include a safe place to sleep, eat dinner and breakfast, shower (toiletries and other necessities provided), do laundry and get clothing. In addition, men get employment assistance as well as referrals for medical care. Most of all, the men have the support of people who genuinely care about their life and future. They find the resources and the encouragement that they need to help them develop a plan to successfully transition to permanent housing.\n\nWe provide a place to sleep, a breakfast and dinner, clothes, showers, and referrals for medical and employment assistance. Each evening the community gathers in prayer to reflect and pray for the needs of the men they served and for those who touched their lives. In all that we do, we strive to practice the discipline of hospitality, whoever the guest.\nWe invite those who are able to work as a member of the live-in staff. Please call for more information on this commitment. Students and recent graduates are encouraged to live and learn with us."
  },
  {
    "addressLine1": "320 E Central",
    "city": "Wichita",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67202",
    "name": "Inter-Faith Inn Homeless Shelter",
    "organization": "Inter-Faith Inn Homeless Shelter",
    "phone": "(316) 264-8051",
    "website": "http://interfaithwichita.org/",
    "description": "The Inter-Faith Inn is a 24-hour full-service facility, providing shelter, meals, clothing and other basic living essentials for individuals, single parents and families.\n\nEmergency Shelter. The Inter-Faith Inn shelter is operated by Inter-Faith Ministries. Over 1,000 individuals, single parents, and families find help, food, and shelter at the Inn. IFM Case managers provide support and assistance to those staying at the Inn so they may transition back to permanent housing. People can stay for two months if they follow the program prescribed by their case manager and are showing improvement in overcoming the obstacles keeping them from living independently.\n\n\n\n\nInter-Faith Ministries (IFM) operates two homeless shelters. Last year 1,100 Individuals received food and shelter. Children account for nearly 20% of this total. IFM provides assistance to help people staying in the IFM shelters move into permanent housing.\n\n\n\nInter-Faith Villas provide 104 affordable one, two, and three bedroom apartments. There are over 40 families living in the Villas who receive supportive services and guidance from Inter-Faith Ministries case management staff."
  },
  {
    "addressLine1": "841 N. Broadway",
    "city": "Wichita",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67214",
    "name": "Inter-Faith Ti'Wiconi Safe Haven",
    "organization": "Inter-Faith Ti'Wiconi Safe Haven",
    "phone": "(316) 264-9303",
    "website": "http://interfaithwichita.org/programs/homeless-shelters",
    "description": "Shelter for the chronically homeless and mentally ill adult men and women in Wichita.\n\nTi'Wiconi Safe Haven is a full-service facility providing shelter, meals, case management and other support services in an effort to promote self-worth and self-sufficiency.\n\n\nTi'Wiconi Safe Haven has the capacity to house 20 individuals who are able to stay up to two years. Staff provide critical case management services on-site in a residential setting."
  },
  {
    "addressLine1": "2800 N. Hillside St.",
    "city": "Wichita",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67219",
    "name": "Union Rescue Mission",
    "organization": "Union Rescue Mission",
    "phone": "(316) 687-4673",
    "website": "https://urmwichita.org/",
    "description": "Come to the shelter at 2800 N. Hillside between 4-6pm to obtain emergency shelter services.\nWe are an evangelical Christian ministry committed to meeting the spiritual, physical, and emotional needs of the homeless and poor in our community.\n\n\nWe operate a 24/7 Emergency Overnight Shelter for homeless men, a 12-month Residential Program for men recovering from a life of homelessness and addiction, and a Community Outreach Program that distributes food boxes, infant formula and diapers free to single mothers and needy families.\nTRANSPORTATION:\nFor men in need of shelter, private buses provide free transportation between the Wichita Downtown area and the URM Overnight Shelter each evening and each morning. The pick-up location is in downtown Wichita at 2nd & Topeka.\n\nFree Food:\nA meal is a precious gift for the homeless men who join us each day for breakfast, lunch, and dinner at the Union Rescue Mission. For many of the men staying with us, it may be the only nutrition they receive.\n\nThe Union Rescue Mission of Wichita provides a full breakfast, lunch, and dinner each and every day of the year for the homeless men staying at the shelter or enrolled in our New Beginnings life-change program.\n\n\nDinner is open here at 2800 North Hillside to the public during 4-6pm, Monday - Sunday.\nCLOTHING\nA clean set of clothing can restore a homeless persons sense of dignity, and can also help them to gain employment. Thats why we keep our clothes closet full of fresh shirts, pants, shoes, socks, underwear, winter coats, and accessories. Since we no longer operate a Thrift Store, we provide clothing as available, at no charge to our homeless guests.\n\nFREE LAUNDRY DONE FOR OUR GUESTS\nAt the Union Rescue Mission, our homeless guests staying with us can have their dirty laundry washed, dried, and delivered back to them within 24 hours.\n\n\nHYGIENE\nPersonal hygiene can provide a homeless person with a new outlook on life. This is why our homeless guests receive hot showers with soap and shampoo every day. Our guests also receive personal hygiene items to take with them.\n\n"
  },
  {
    "addressLine1": "202 N Taylor",
    "city": "El Dorado",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67042",
    "name": "Butler Homeless Initiative Cold Weather Shelter",
    "organization": "Butler Homeless Initiative Cold Weather Shelter",
    "phone": "(316) 323-4122",
    "website": "https://butlerhomelessinitiative.com/",
    "description": ""
  },
  {
    "addressLine1": "900 West Broadway, Building 7",
    "city": "Newton",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67114",
    "name": "New Hope Homeless Shelter",
    "organization": "New Hope Homeless Shelter",
    "phone": "(316) 283-7711",
    "website": "https://www.newhope-shelter.org/",
    "description": "The mission of New Hope Shelter, Inc. is to provide a sanctuary for those experiencing homelessness in Harvey, Marion, and McPherson Counties by uniting the local church into a nurturing community which restores hope through a growing relationship with Christ.\n\nNew Hope Shelter is a 501c3 non-profit funded solely through contributions from area churches, businesses, and individuals.\n\n\nTwenty-six local churches team up on rotation to supply the shelter with volunteer staff and evening meals for a week at a time.\n\nWe house men, women, and families in the Monroe Cottage on the Youthville Campus.\n\nNew Hope Shelter offers two distinct programs:\n\n    7-Day Residency-This program is for those who enter the shelter from outside of our tri-county service area and for those needing emergency short term shelter.\n\n    90-Day Life Restoration Program-This is an intensive, Christ-centered program to restore stability and hope in people's lives. Requirements include: (Monday-Friday) nightly courses in bible study, biblical based job skills, money management/budgeting,Christ-centered recovery, and individual case management.\n"
  },
  {
    "addressLine1": "1119 Merchant",
    "city": "Emporia",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66801",
    "name": "Emporia Rescue Mission",
    "organization": "Emporia Rescue Mission",
    "phone": "(620) 342-3351",
    "website": "http://emporiamission.org/",
    "description": "Faith based, men's only shelter.\nRoom for 18 men\nCheck-in daily at 6:00 p.m.\n\nTHREE Programs\nProgram I   30-Day Stay\nFor those men who experience temporary\nhomelessness. These men typically come\nfrom all walks of life.\n\nProgram II   90-Day Extension\nFor those men who need a place to stay while saving funds for their rent and deposit. They must be working.\n\nProgram III   Transformational Life Coaching (TLC)\nFor those men who have life-controlling problems. Our new TLC program is a Christ-centered coaching program designed to help men learn biblical principles of Christian living."
  },
  {
    "addressLine1": "418 Market Street",
    "city": "Emporia",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66801",
    "name": "Corner House, Inc. VA Women's Facility",
    "organization": "Corner House, Inc. VA Women's Facility",
    "phone": "(620) 342-3015",
    "website": "http://www.cornerhouseinc.org/rg",
    "description": "Corner House, Inc. is a non-profit alcohol and other drug evaluation, substance abuse prevention, treatment, and referral program. We offer Alcohol and other Drug Assessment/Evaluation, Level I Outpatient Treatment, Level II Intensive Outpatient Treatment, Adolescent Outpatient Treatment, and Employee Assistance Program services at the 418 Market St. location. The Adult Outpatient Program serves men and women aged 18 and up. The Adolescent program serves boys and girls 12 -18.\n\nWe have an 18 bed new, homey facility that we partnered with the VA to build for homeless or displaced Women Veterans. It is a beautiful facility and we would love to help our Women Veterans. We have been successfully operating for 37 years as a Prevention and substance abuse treatment center. Now we have built this new facility that offers long term residential care, the opportunity for work or go to school abounds here."
  },
  {
    "addressLine1": "301 W. 11th ave",
    "city": "Emporia",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66801",
    "name": "Bloom House Youth Services Shelter",
    "organization": "Bloom House Youth Services Shelter",
    "phone": "(620) 208-1199",
    "website": "http://www.bloomhouseks.org/",
    "description": "Bloom House is a 501c3 organization, Drop In Center and Shelter, totally inclusive that offers a variety of services for youth up to age 24.\n\nServices:\nShelter\nServices to homeless and runaway youth\nTrauma-informed art therapy\nCase management\nReferrals\nAccess to food\nBathrooms and laundry\nSafe place to study\nAdditional services:\nStaff supervised activities weekly, like Taco Tutoring on Tuesdays, Friday Night Games, and Saturday Breakfast.\nThese are open to youth up to age 24 and their families. We have a Hygiene Closet, Full Bathroom (including shower), and Food Pantry available to youth and their families.\n\nThey offer housing for homeless youth age 16-17, and are working on expanding that age range.\n\n\n\n\n\n\n"
  },
  {
    "addressLine1": "523 SW Limit Street",
    "city": "Leavenworth",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66048",
    "name": "Safe Haven Hope House for Homeless Veterans",
    "organization": "Safe Haven Hope House for Homeless Veterans",
    "phone": "(913) 250-5790",
    "website": "http://rosevilla.us/",
    "description": "Rose Villa Safe Haven works in conjunction with the VA HCHV program to provide supportive services to homeless veterans.\n\nWe provide services for homeless veterans outside of the VA system utilizing a Safe Havens modeled program as an alternative to shelter care or as a placement after unsuccessful discharge from an inpatient or residential treatment program due to relapse-related issues.\n\n\nA Safe Haven is a form of supportive housing that serves hard-to-reach homeless persons with severe mental illnesses and/or substance use disorders.\n\n\nMost of these veterans are on the streets and have been unable or unwilling to participate in more traditional supportive services. This 'low demand' model of service delivery allows clients to engage in treatment and services at their own pace. The goal of our program is to rapidly stabilize Veterans medical, mental health, substance abuse and other psycho-social problems in order to place Veterans in other appropriate transitional or permanent housing within 60 to 90 days, with no more than 180 days without a planned reason for the extension. We have assisted Veterans in relocating to 8 different states and the Philippines."
  },
  {
    "addressLine1": "802 North 5th St",
    "city": "Garden City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67846",
    "name": "Emmaus House",
    "organization": "Emmaus House",
    "phone": "(620) 275-2008",
    "website": "https://emmaushouseks.com/",
    "description": "Emmaus House is a Homeless Shelter, Food Pantry and Soup Kitchen.\nWe can house 29 people. We have two men's dorm, a women's dorm, and two family rooms. If you are needing shelter call 620-275-2008 or go to the police station in Garden City and ask for a referral. Everyone staying has to pass a background check to ensure safety for staff and clients alike.\n\n\nMorning Services, which includes breakfast, showers, access to laundry facilities, mail, and phone messages, are available from 6am until 8am, seven days a week, year-round. No advance registration is required.\n\n\nWinter Sheltering services are available from October 15 through April 30 for any adult in need. Dinner and breakfast, a safe place to sleep, storage space for personal belongings, phone and mail service, access to showers and laundry facilities, and meetings with case managers are all provided free of charge. Intake is from 5:00 p.m. to 7:00 p.m. daily. All residents must be checked in by 7:00 p.m. unless prior arrangements have been made. In order to stay at the Emmaus House, residents must abide by basic behavioral rules.\n\nTransition Program residents work closely with Emmaus House case managers to determine what has led them to homelessness, and what steps they must take to overcome their situation. Transition Program residents must live drug and alcohol free, pay a weekly program fee, and abide by a budget and savings plan. To qualify for the Transition Program residents must have sustainable income that can be verified and an obtainable transition plan. Program residents have the opportunity to stay in a semi-private dorm room, and have some schedule flexibility. The year-round transition program has a maximum stay of nine months."
  },
  {
    "addressLine1": "1015 N Washington",
    "city": "Liberal",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67901",
    "name": "Stepping Stone Shelter",
    "organization": "Stepping Stone Shelter",
    "phone": "(620) 626-6024",
    "website": "https://www.facebook.com/SafeHavenOutreachMission/",
    "description": "Thirty night residential shelter for the homeless.\n\nStepping Stone Shelter is the only residential shelter in southwest Kansas. Other shelters in the region offer only a few days stay with a bed and a meal but no other services. We receive referrals from area hospitals, area agencies, as well as the local Police/Sheriff and community corrections. The most common referrals come from friends and family members.\n\nWe offer a 30 day minimum stay though that can be, and is, extended based upon the individual needs of the client. Our average stay has increased to over 16 days and after omitting those here less than 5 days the average stay went up to 21 days. We believe this coupled with a reduced return rate indicates we are fulfilling our mission statement to prevent future homelessness. We also furnish clothing, meals and hygiene items. Our case management has become the backbone of our endeavor to help those we serve. We network with agencies to find other services available to our clients. Because of the amount of cooking and client supervision required, we are staffed with three eight hour shifts every day.\n\n\nDonations from the community have increased tremendously. We provide as many items as possible to our clients for their new home when they leave. Overflow items are used for \"Sharing Saturday\" a free program we started several years ago. We now see families on Saturday at 6:00 AM waiting for the boxes of goods and continued traffic until the boxes are removed on Sunday afternoon."
  },
  {
    "addressLine1": "400 West 2nd",
    "city": "Hutchinson",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67501",
    "name": "Noel Lodge",
    "organization": "Noel Lodge",
    "phone": "(620) 259-7769",
    "website": "https://www.newbeginnings-inc.org/",
    "description": "The shelter opens each night at 5:30 p.m. and closes at 7:00 a.m. the next morning. Beds are available on a first-come, first-served basis. Dinner and breakfast are provided at the shelter by volunteers. The shelter offers lockers for users to leave their belongings in during the day.\n\nNoel Lodge is a 30 day emergency overnight shelter for men, women and families. Availability is on a first-come, first-served basis.\nCheck in time is from 6:00pm through 7:30pm.\n\nThe Noel Project Emergency Overnight Lodging has three family rooms, a dormitory for single men, and a dormitory for single women. Other features include showers, lockers, a kitchen and dining room. Dinner and breakfast are served on site and prepared in our central kitchen. Noel Lodge opens at 4:00 pm and closes at 7:00 am. At night there is a combination of staff and volunteers present.\n\nDuring the day, New Beginnings will help guests find the community resources and housing that they need. Referrals to community services are available.\n\nFrequently Asked Questions:\n\nQuestion: How long can I stay at NOEL Lodge?\nNOEL Lodge is an emergency shelter and should not be viewed as a long-term solution. Guests may stay at NOEL Lodge for up to 30 nights.\n\nQuestion: What time should I be at the Lodge?\n\nNOEL Lodge is a first come/first serve shelter. You may line up after 4:00 pm.\n\nQuestion: How late can I check in at the Lodge?\n\nCheck in ends at 7:00 pm each night. Only those brought in by law enforcement or clergy will be admitted after 7:00 pm.\n\nQuestion: Once I check in, can I leave?\n\nOnce a guest is checked in, they will need to stay inside the facility to ensure they have a bed for the night. If a guest leaves the facility after checking in, the guest will forfeit the opportunity to stay at NOEL Lodge for 3 nights.\n\nQuestion: Can I smoke in Noel Lodge?\n\nThere is no smoking inside NOEL Lodge or on any New Beginnings Inc. properties. Two smoke breaks will be given each night just off of the property. Those found smoking on the property will be given a notice of no return.\n\nQuestion: What should I bring with me?\n\nAll personal belongings are locked up for the night. You can retrieve your belongings before you leave. Lodge staff will supply you with two meals and hygiene supplies. Items not allowed: weapons of any kind, narcotic medications without a prescription, illegal drugs and alcohol of any kind.\n\nQuestion: Can I stay in the same room as my boyfriend or girlfriend?\n\n\nIf there is enough space, couples will be roomed together. If not, families will have priority.\n\nQuestion: Can I bring my dog/cat?\n\nIf your dog/cat is a documented service animal and you have documentation showing up to date shots, you may bring the animal. It must be crated for the night.\n\nQuestion: What are the rules of NOEL Lodge?\n\nThe staff will go over the rules with guests when the guest checks in.\n\nQuestion: Can I do my laundry at NOEL Lodge?\n\nThe staff will wash one change of clothing for guests during the night and have the clothing ready for guests in the morning.\n"
  },
  {
    "addressLine1": "402 E. 2nd Street",
    "city": "Wichita",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67202",
    "name": "United Methodist Open Door, Inc - Homeless Resource Center",
    "organization": "United Methodist Open Door, Inc - Homeless Resource Center",
    "phone": "(316) 265-9371",
    "website": "https://umopendoor.org/",
    "description": "Homeless Resource Center\nHours: Monday Friday 7:30 a.m. 4 p.m.\n\nThe Homeless Resource Center (HRC) is a comprehensive, daytime assistance center for homeless adults and families in Wichita/Sedgwick County.\n\nThe HRC provides a safe environment for individuals to bathe, launder their clothes, receive mail, eat a daily meal, have a place to store personal belongings, meet with Open Door case managers, have access to the Klothes Kloset and connect with services offered by Open Door and our partner agencies.\n\n\nThe facility offers space for clients, community offices for use by partner agencies, an education room, chapel and on-site access to medical and mental healthcare providers."
  },
  {
    "addressLine1": "307 W. Pecan Street",
    "city": "Independence",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67301",
    "name": "Home Sweet Home Homeless Ministry",
    "organization": "Home Sweet Home Homeless Ministry",
    "phone": "(620) 331-5115",
    "website": "https://hshhomelessministry.org/",
    "description": "Admissions and Counseling Office              \n319 West Laurel Room 212\nIndependence, KS  67301\n\nThe Home, Sweet, Home Alan Runyan Men's Shelter opened its doors on January 4, 2011. We have space for eight guests, each day. A guest may stay up to seven days; on an emergency basis a guest may stay up to 90 days if they show motivation and action for change in their lifestyle. Guests are guided in finding resources for health, counseling, employment and permanent housing."
  },
  {
    "addressLine1": "1112 South 24th St.",
    "city": "Parsons",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67357",
    "name": "Safe Haven Outreach Mission Inc",
    "organization": "Safe Haven Outreach Mission Inc",
    "phone": "(620) 421-4417",
    "website": "http://www.safehavenoutreach.com/",
    "description": "Safe Haven is a faith based, community supported shelter.\n\nOur facility can house 8 people at a time which includes men, women and a family. Each resident MUST pass a drug test upon arrival as well as a background check.\n\nNo violent or sexual felons will be allowed to stay. This is for the safety of all of our residents and staff.\nOur target time frame is 60-90 days a person can stay, but this will be a case by case situation. Residents must look for and maintain work to save for deposits for rent and utilities. While working residents must also pay 15% of their income back to the shelter for their room and board.\nWhile looking for work each resident must help maintain the shelter by doing chores inside and out as well as in the community. The residents will also be doing the cooking. This provides a more family like atmosphere.\n\nWhen our residents are ready to move into their own place, it is our goal to give them starter furniture, so these items are always welcome donations."
  },
  {
    "addressLine1": "1706 S. 21st Street",
    "city": "Parsons",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67357",
    "name": "Hannah's Promise Pregnancy Life Center",
    "organization": "Hannah's Promise Pregnancy Life Center",
    "phone": "(620) 605-6052",
    "website": "http://www.hannahspromise.com/",
    "description": "Emergency shelter is available for six women (18+) who are pregnant and homeless. The faith based shelter provides support during pregnancy including referrals for medical care, parent education, educational resources, employment resources, and life skills.  Residency is designed to last up to 60 days after giving birth but may be extended depending on circumstances. \n\nA background check will be completed upon acceptance.  No violent felons will be accepted.  Residents MUST pass a drug test upon arrival and agree to participate in out-patient services if this has been an issue in the past year.\n\n\nResidents are required to work on education or employment while residing at the center.  Volunteer work in the community may be substituted for this requirement.  Residents rotate cooking the evening meal for all residents and complete daily chores in preparation for maintaining their own home in the near future.  \nDonations of clean used / new items are accepted:  women's maternity clothing, baby clothing & blankets, diapers (all sizes), baby furniture/equipment, household items including furniture, bedding, cleaning supplies, and food items.  Our goal is to help women set up their home once individual housing has been approved."
  },
  {
    "addressLine1": "136 W 3rd St",
    "city": "Junction City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66441",
    "name": "Open Door Shelter",
    "organization": "Open Door Shelter",
    "phone": "(785) 238-3599",
    "website": "https://www.facebook.com/pg/Open-Door-116745611717853/about/?ref=page_internal",
    "description": "Short term emergency shelter. Open 24 hours a day.\n\n"
  },
  {
    "addressLine1": "150 S. 8th Street",
    "city": "Salina",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67401",
    "name": "Ashby House Family Shelter",
    "organization": "Ashby House Family Shelter",
    "phone": "(913) 826-4935",
    "website": "http://www.ashbyhouse.org/",
    "description": "Emergency Shelter. Every year at Ashby House, we strive to help families connect with our community.  At Ashby House, we firmly believe that connected families are strong families.\n\nAshby House Family Shelter is the only full-time family shelter in this area. The shelter is staffed 24 hours a day.  The shelter provides temporary housing for homeless families and single women. The shelter helps families survive homelessness and to re-enter the community with their dignity intact.\n\n"
  },
  {
    "addressLine1": "1716 Summers Road",
    "city": "Salina",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "67402",
    "name": "Salina Rescue Mission",
    "organization": "Salina Rescue Mission",
    "phone": "(785) 823-2610",
    "website": "https://www.salinarescuemission.com/",
    "description": "Emergency Shelter Men Only. Safe, clean environment for homeless men 18 years of age and older. Check-in is at 4:00 p.m. each day and the Saline County Sheriffs Department processes each persons identification.\n\n"
  },
  {
    "addressLine1": "3655 N 1360 Rd",
    "city": "Lawrence",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66046",
    "name": "Lawrence Community Shelter",
    "organization": "Lawrence Community Shelter",
    "phone": "(785) 832-8864",
    "website": "https://www.lawrenceshelter.org/",
    "description": "Shelter is open 24 hours. Adults seeking shelter are advised to call the shelter before arriving.\n\nCase Management\nIntake and assessment, goal setting, and progress meetings, basis for management of all program involvement\nHousing\nOn-site emergency night shelter for 53 families and adults in warm weather, 76 in cold weather, and up to 136 in freezing weather (91 usual maximum), housing applications, referrals and collaborations with local landlords, Lawrence Douglas County Housing Authority, The Salvation Army, and Topeka Rescue Mission\nEmployment\n\"Back-to-Work\" job preparation, job search, job oversight, permanent and temporary employment assistance\"Good Dog! Biscuits and Treats entrepreneurial jobs program on-the-job training for production, marketing, and distribution skills.\nFamily Program\nWe at LCS are committed to assisting families in their time of need. Our family program is designed to empower and improve families. Each family has requirements they must meet. The requirements include, but are not limited to:\nwork with the LCS Family Program case manager\nparticipate in other appropriate available programs, both at LCS and city-wide\nsavings program\nrandom drug screenings\nprovide all necessary medical documentation for children\nsupervise and provide for their own children at all times\n\nBenefits, ID, Legal\nIdentification replacement, food stamp, disability, Medicaid and other applications, Kansas Legal Services, DMV, Social Security office, SRS\n\nIntervention Substance Abuse and Mental IllnessAlcohol and drug counseling, transportation to detox and rehab programs in Topeka, Johnson County, and Kansas City, AA meeting onsite; referrals and collaborations with DCCCA, RADAC, Valeo, and Johnson County Adult Detox Unit, Bert Nash Community Mental Health Center, Lawrence Memorial Hospital, and others\n\nDaytime Services\nbreakfast, laundry, mail, telephone, storage, art therapy, chiropractor, health screenings and education, refuge from extreme weather\n\nNight Services\nsleeping spaces for 53 to 136 families and adults (depending on the season and temperature), dinner, storage, showers, substance abuse intervention, counseling"
  },
  {
    "addressLine1": "9400 Pflumm",
    "city": "Lenexa",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66215",
    "name": "Project 10 20 Cold Weather Shelter",
    "organization": "Project 10 20 Cold Weather Shelter",
    "phone": "(913) 219-3347",
    "website": "https://www.project1020.com/",
    "description": ""
  },
  {
    "addressLine1": "420 E. Santa Fe",
    "city": "Olathe",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66061",
    "name": "Salvation Army - Johnson County Family Lodge",
    "organization": "Salvation Army - Johnson County Family Lodge",
    "phone": "(913) 829-0578",
    "website": "https://centralusa.salvationarmy.org/olathe/",
    "description": "Johnson County Family Lodge provides shelter to families in the Johnson County area that are homeless. Families must have at least one dependent under the age of 18 that is currently in school to be eligible for the program; can stay at the shelter for 3-6 months.\n\nOffice hours:\nMondays through Fridays 9am - 4pm."
  },
  {
    "addressLine1": "600 N. Kansas",
    "city": "Topeka",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66608",
    "name": "Topeka Rescue Mission - Main Shelter",
    "organization": "Topeka Rescue Mission - Main Shelter",
    "phone": "(785) 354-1744",
    "website": "https://www.trmonline.org/",
    "description": ""
  },
  {
    "addressLine1": "600 N. Kansas Ave.",
    "city": "Topeka",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66608",
    "name": "Topeka Rescue Mission Ministries - Hope Center",
    "organization": "Topeka Rescue Mission Ministries - Hope Center",
    "phone": "(785) 354-1744",
    "website": "https://www.trmonline.org/",
    "description": "Shelter for single women and families. Run by the Topeka Rescue Mission.\n\nThe Topeka Rescue Mission is a homeless shelter which has served Topeka, Kansas for more than 58 years. TRM is dedicated to providing food, Priority Sheltering- for the first time in TRM history, we will give priority to those coming from the 5-county surrounding area including:\n\na. Shawnee\nb. Wabaunsee\nc. Jefferson\nd. Jackson\ne. Osage\n\nAll other potential guests will be considered on a case-by-case basis.  Our goal is to decrease the likelihood of having people who enter our facilities from geographic hot spots.  This was not a decision that came easily.  It has always been our desire to serve all who come to our doors seeking help, yet in this critical time and considering our top priority of safety for guests, staff and volunteers it is the soundest decision.\nFood Distribution- At this time we are limiting in-house meals to our guests while continuing to provide sack meals that include items for supper and breakfast to those from the community at large.\n\n\nSack Meals are distributed Monday Friday 6-6:30pm and Saturday and Sunday 5-5:30pm out of the Northwest door of the main Shelter\n\nWe are also continuing to supply food boxes to the community every Tuesday and Thursday from 9 a.m. to 2 p.m. Other items that can be requested when getting a food box are:\n\n- Hygiene items\n- Pet Food\n- Diapers (sizes 1-4)\n"
  },
  {
    "addressLine1": "409 North Ellison Street",
    "city": "Guymon",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "73942",
    "name": "Oaks Of Mamre",
    "organization": "Oaks Of Mamre",
    "phone": "(580) 338-5067",
    "website": "https://www.okdrs.gov/guide/oaks-mamre-homeless-shelter",
    "description": "This is a shelter for single,married couples and families with children,the length of stay max is 90 days,you must look for work while staying here,there is a kitchen where you can cook your own food and sometimes meals are provided donated by local businesses and of course there are rules you must follow to be able to stay here for example no drinking or drugs and etc. and you must go to Police station for a background check."
  },
  {
    "addressLine1": "425 E 63rd ST",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64110",
    "name": "Jewish Family Services",
    "organization": "Jewish Family Services",
    "phone": "(913) 327-8250",
    "website": "http://www.jfskc.org/",
    "description": "JFS Food Pantry is a client choice pantry. Please call to make an appointment to visit with one of our case managers"
  },
  {
    "addressLine1": "6046 Swope Pkwy",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64130",
    "name": "AngelEyes Maternity Home",
    "organization": "AngelEyes Maternity Home",
    "phone": "(816) 368-4994",
    "website": "http://www.angeleyeskc.org/",
    "description": "AngelEyes Maternity Home is a nonprofit organization located in Kansas City, Missouri that provide shelter, resources and training to pregnant young girls between the age of 13 and 21 with no other children in their care.\n\nMission:The mission of AngelEyes Maternity Home is to give pregnant teens a safe place to live during their pregnancy while providing them with the resources, education and job training needed to prepare for motherhood, successful independent living, eliminate future unplanned pregnancies and homelessness."
  },
  {
    "addressLine1": "1520 Cherry Street",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64108",
    "name": "Kansas City Rescue Mission Men's Mission - KCRM",
    "organization": "Kansas City Rescue Mission Men's Mission - KCRM",
    "phone": "(816) 421-7643",
    "website": "https://kcrm.org/",
    "description": "Kansas City Rescue Mission offers its services at no charge (with very rare exceptions) to homeless individuals. Its services and programs are available to any individual, 18 or older, regardless of race, religion, gender, lifestyle or creed."
  },
  {
    "addressLine1": "1100 E. 11th St.",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64106",
    "name": "City Union Mission",
    "organization": "City Union Mission",
    "phone": "(816) 474-9380",
    "website": "http://www.cityunionmission.org/",
    "description": "Hotline for the Homeless: 816-474-4599\n\nMen, women and families who call the Hotline are directed to actual shelter housing when available space is known. The no-charge Hotline provides the Mission and the community with statistical information regarding the availability or lack of availability of emergency shelter space in the greater Kansas City area.\n\nMen's Mission\nEach day, hundreds of men come to City Union Mission Men's Center for clothing, food and temporary refuge from life on the streets.\nHere they find people who care about them, listen to them, and work with them to meet their physical and spiritual needs.\n\nWomen's Mission\nThe Women and Family Center at City Union Mission is a safe haven for families and single women. There are many causes of homelessness in families, including financial setbacks, addiction, family violence, and mental illness. The Women and Family Center provides a safe place to stay, nutritious meals, spiritual counsel, and case management to address and help resolve the issues they face every day."
  },
  {
    "addressLine1": "918 E 9th Street",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64106",
    "name": "reStart Inc.",
    "organization": "reStart Inc.",
    "phone": "(816) 472-5664",
    "website": "http://www.restartinc.org/",
    "description": "Emergency Shelter Nights Only.\n\nOffering a full range of services for Kansas City's homeless men, women, youth, and families, reStart provides everything from emergency overnight shelter to transitional living and permanent housing. Equipped to handle all persons, including those with special needs, reStart offers the tools, assistance, and support to help our clients make the transition to permanent housing.\n\nreStart's Housing Solutions Center (HSC) is at the forefront of a new approach to working with the homeless in our community. Providing street outreach, a drop in center, and hotline to rapidly finding new housing for individuals who have recently lost their homes.\n\nProviding case management and supportive services to disabled and chronically homeless individuals and families, the HSC is a permanent supportive housing program that provides 20 units for families and individuals.\n\n    Youth Services\n    Family Services\n    Single Adult Services\n    Permanent Housing\n    Outreach\n\n\nRESTART, Inc.\n918 East 9th Street\nKansas City, MO 64106-3072\n816.472.5664\nFax: 816.472.6127\n\nYOUTH SERVICES\n816.472.5664 ext. 238\nHotline: 816.309.9048\n \nOVERNIGHT EMERGENCY SHELTER (OES) & Front Desk Monitor\n816.472.5664\n \nHOUSING SOLUTIONS CENTER (HSC)\n1444 East 8th Street\nKansas City, MO 64106\n816.842.1199\nFax: 816.842.6811"
  },
  {
    "addressLine1": "3220 E 23rd St",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64127",
    "name": "Benilde Hall",
    "organization": "Benilde Hall",
    "phone": "(816) 842-5836",
    "website": "http://www.benildehall.org/",
    "description": "Open 24/7, office staff on site 8-5pm M-F.Benilde Hall provides transitional housing and substance abuse treatment to indigent homeless men, and also runs Matt Talbot, a 12 unit permanent housing apartment building for men who successfully completed the Benilde Hall program.\n\nServices include mental health treatment, substance abuse treatment, jobs program, health education, food, clothing, case management, and an opportunity to reconnect to the community."
  },
  {
    "addressLine1": "705 Virginia Ave",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64106",
    "name": "Hope Faith - Homeless Assistance Campus",
    "organization": "Hope Faith - Homeless Assistance Campus",
    "phone": "(816) 471-4673",
    "website": "https://www.hopefaith.org/",
    "description": ""
  },
  {
    "addressLine1": "750 Paseo Blvd",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64106",
    "name": "Kansas City Community Kitchen",
    "organization": "Kansas City Community Kitchen",
    "phone": "(816) 561-8920",
    "website": "https://nourishkc.org/programs/community-kitchen/",
    "description": "We serve balanced, nutritious meals for lunch every weekday from 11 a.m. - 2 p.m. and ALL are welcome to eat.\n\nWe call ourselves a \"Community Kitchen\" rather than a soup kitchen because we believe food is the basic human right and great equalizer - everyone needs to eat, and we all do better when we eat better. We encourage anyone to come eat with us, get a quality meal for free and see who you meet in the process. Volunteers serve as hosts and wait staff to make this a restaurant style experience, offering all of our guests a bit of dignity and the power of choice.\n\n\nKansas City Community Kitchen has been serving the hungry of downtown Kansas City since 1989. We began as a ministry of Grace & Holy Trinity Cathedral (Episcopal Church) but grew and came under the leadership of Episcopal Community Services while still housed at the cathedral. In 2010 the kitchen moved to its current home in the lower level of the Downtown Community Services Center at 8th/Paseo."
  },
  {
    "addressLine1": "2611 E. 11th Street",
    "city": "Kansas City",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64127",
    "name": "Kansas City Rescue Mission Women’s Ministries",
    "organization": "Kansas City Rescue Mission Women’s Ministries",
    "phone": "(816) 348-3287",
    "website": "https://kcrm.org/",
    "description": "The 20-bed KCRM Womens Center provides a safe, homelike environment where traumatized women can find hope, peace and security as they work to overcome life-challenging barriers to stability and success.\n\nMost of the Womens Centers residents were sexually abused as children and have coped with their pain through drugs, alcohol, gambling, hoarding and other addictions. Many have spent time behind bars, prostituted for money, food or shelter, and have suffered continued physical and sexual abuse as adults.\n\n\nThe KCRM Womens Center provides each resident with a long-term recovery and case management program designed just for her. After an intake assessment, she is paired with a case manager and certified counselor to determine a course of objectives that guide her toward freedom from the past and hope for the future.\n\nClinical case managers and counselors at the KCRM Womens Center work with each client to achieve these outcomes:\n    Ongoing addiction recovery with support\n    A sustainable mental health treatment plan\n    A reliable stream of income\n    A productive lifestyle through volunteerism or a paying job\n    A support network that includes a doctor or clinic\n    Appropriate housing"
  },
  {
    "addressLine1": "3721 Delridge",
    "city": "Independence",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64055",
    "name": "Mother's Refuge",
    "organization": "Mother's Refuge",
    "phone": "(816) 353-8070",
    "website": "https://www.mothersrefuge.org/",
    "description": "Office Hours:\nMonday-Friday 9am-5pm\n\nOur mission is to shelter and educate homeless, pregnant, and parenting young women by providing comprehensive services that empower them to make successful life decisions for themselves and their babies.\n\nWe are located at:\n3721 Delridge, Independence, MO 64052\n(One block north of Highway 40 and Hardy St.)\nOur home is filled with love, warmth and acceptance to all the young ladies that call Mothers Refuge home.\n\nMore than 1,550 pregnant young women have found refuge at our home since 1987. With a sun deck, shade trees and swings, our residents have plenty of reasons to enjoy the warm summer sun. During the cold winter months, they may enjoy hot cocoa and popcorn while playing board games, cards or watching movies in the great room.\nThe home has seven bedrooms, a beautiful kitchen, a dining room and television room for residents and their babies. Girls also have access to a computer-learning center to learn computer skills, complete homework assignments or research community services. Washers and dryers make laundry convenient. Residents can walk to nearby restaurants, Gates BBQ, QT, Subway, Cool Crest Miniature Golf and a nearby bus stop.\n\nWe are located on a spacious corner lot in Independence, Missouri, not far from the Truman Sports Complex and down the road from Blue Ridge Corners and Wal-Mart.\nPregnant residents share a bedroom while waiting to give birth. After their baby is born, they share a private bedroom with their baby."
  },
  {
    "addressLine1": "411 E. 12th",
    "city": "Pittsburg",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "66762",
    "name": "Wesley House",
    "organization": "Wesley House",
    "phone": "(620) 232-3760",
    "website": "http://www.wesleyhouseumc.org/",
    "description": "Day shelter\nHours are 9:00-4:00 week days.\n\nWesley House now has a homeless case manager and we are offering day sheltering.\n\nWhen a homeless person comes in, they can enroll in our homeless day sheltering program which will give them priority use of our shower and laundry facilities.\n\n\nWe will feed them breakfast and lunch as well as provide homeless case management which includes identifying and solving the barriers to permanent housing.\n\n\n The City of Pittsburgs Rapid Rehousing and Homeless Prevention Program is housed at Wesley House.\n\nProgram helps individuals and families find permanent housing through the Rapid Rehousing Program. The Homelessness Prevention Program will prevent individuals/families from becoming homeless by providing rental and utility assistance.\n\nFood pantry weekdays at 1:30pm"
  },
  {
    "addressLine1": "531 Kentucky Ave",
    "city": "Joplin",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64801",
    "name": "Watered Gardens Gospel Rescue Mission",
    "organization": "Watered Gardens Gospel Rescue Mission",
    "phone": "(417) 623-6030",
    "website": "https://wateredgardens.org/",
    "description": "Day Outreach\n\nHours: 9 AM to 2 PM, Mondays, Tuesdays, Thursdays, and Fridays\n\nThrift store with clothing, furniture, and household items\nFood pantry\n"
  },
  {
    "addressLine1": "817 South Main Street",
    "city": "Joplin",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64802",
    "name": "Souls Harbor",
    "organization": "Souls Harbor",
    "phone": "417-623-7927",
    "website": "https://soulsharborjoplinblog.wordpress.com/",
    "description": "Souls Harbor is a Christ centered multifaceted human services agency and homeless shelter"
  },
  {
    "addressLine1": "1809 South Connor Ave",
    "city": "Joplin",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64804",
    "name": "Lafayette House",
    "organization": "Lafayette House",
    "phone": "(417) 782-1772",
    "website": "http://lafayettehouse.org/",
    "description": "Lafayette House emergency shelter is available 24 hours a day for women and children who need a safe place to stay to escapeLafayette House Logo Joplin MO domestic violence. If you are being abused or beaten by your husband or partner, call Lafayette House any time day or night. If you are in immediate danger, call 911.\nLafayette House provides services to domestic violence victims on a residential or outpatient basis.  In addition to safe shelter, we offer individual, group and family counseling, community support, child care, childrens therapy, and a full menu of support services.  The caring staff at Lafayette House can help you access clothing and basic needs, as well as jobs, transportation and a safe place to live.\n\nLafayette House serves families in a 7-county area in southwest Missouri (Jasper, Newton, Barry, Lawrence, McDonald, Dade and Barton). We offer residential shelter and services at our Joplin location, and an outreach office in Neosho.\nThere is no charge for shelter and support please call if you need help.\n\nPlease contact us via email here, or call for immediate help at (800) 416-1772."
  },
  {
    "addressLine1": "100 S Main St",
    "city": "Carthage",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "64836",
    "name": "Carthage Crisis Center",
    "organization": "Carthage Crisis Center",
    "phone": "(417) 358-3533",
    "website": "https://carthagecrisiscenter.org/",
    "description": "Faith Based Homeless Center\n\nFor immediate needs and assistance, please call (417) 358-3533.\n\nIntake hours are usually 9 AM - 5 PM.\n\nThe Carthage Crisis Center is not your ordinary homeless mission. Although we provide temporary emergency housing, we have a more long-term approach to the problem of homelessness. Our mission is to restore homeless and needy people to self-sufficiency with Gods help.\nTo that end, all of our residents are involved in opportunities for Spiritual growth. We all share in a weekly Saturday evening Bible Study at the center. On Sundays, all of our residents attend local congregations where they find friendly Biblical communities that help to build them up spiritually, and on Monday evenings, all of our residents attend a local Celebrate Recovery meeting at the First Nazarene Church.\n\nThroughout each week our residents have opportunities to counsel with the staff to learn life skills and how to apply Biblical principles to their daily lives."
  },
  {
    "addressLine1": "807 W 1st N St",
    "city": "Morristown",
    "state": "Kansas",
    "stateAbbreviation": "KS",
    "postal": "37815",
    "name": "CEASE, Inc - Domestic Violence Shelter",
    "organization": "CEASE, Inc - Domestic Violence Shelter",
    "phone": "(800) 303-2220",
    "website": "https://ceaseabuse.sitey.me/",
    "description": "CEASE, Inc. has two full service shelters in Hamblen and Claiborne Counties with a combined total of 26 beds. We serve survivors of domestic violence and sexual assault as well as their pets, giving them a safe place to call home."
  }
]