[
  {
    "addressLine1": "205 E Highland St",
    "city": "Albion",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46701",
    "name": "Noble House Ministries - Pilot House",
    "organization": "Noble House Ministries - Pilot House",
    "phone": "(260) 636-7160",
    "website": "https://twitter.com/NHMI1993",
    "description": "A shelter for men: we provide a beacon of hope for men in our community who are homeless and in crisis. For many men who feel they are at the end of their rope, the Pilot House has been a \"knot\" they could hold on to. We are determined to provide compassionate help, individual attention, and a plan for success to anyone who seeks our assistance.\n\nSERVICES\n    Mentoring Support\n    Low Cost Housing\n    Case Management\n    Referral to Other Agencies\n    Educational Programming\n    Legal Advocacy\n    Community Education\n    Access to Healthcare Providers\n    Essential Transportation\n"
  },
  {
    "addressLine1": "500 W Business 30",
    "city": "Columbia City",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46725",
    "name": "IFM Lighthouse",
    "organization": "IFM Lighthouse",
    "phone": "(260) 244-5266",
    "website": "https://www.mission25cc.org/",
    "description": "WHO WE SERVE\n\nResidents who choose to participate in our programming will commit to a minimum of 30 days and can stay up to 2 years depending on income eligibility and compliance. We are a program based facility and not an emergency shelter. All incoming residents must have a negative drug screen upon entrance.  \nWomens Program\n\n    We serve single women (18 and above) and single moms with children.\n    We have 9 rooms designated for women and children. Two single women may be expected to share a room and a single mom and her children will occupy one room.\n\n    All women will participate in daily/weekly gatherings, meet with the case manager and establish weekly goals.\n\nMens Program\n\n    We serve single men (18 and above)\n    We have 2 rooms designated for single men. 2 to 3 men may be expected to share one room.\n    All men will participate in daily/weekly gatherings, meet with the case manager and establish weekly goals."
  },
  {
    "addressLine1": "P.o. Box 285",
    "city": "Alexandria",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46001",
    "name": "Bountiful Harvest Ministries - Beauty For Ashes Transitional Home",
    "organization": "Bountiful Harvest Ministries - Beauty For Ashes Transitional Home",
    "phone": "(765) 724-3454",
    "website": "mailto:%20srbountifulharvest@yahoo.com",
    "description": "Provides transitional housing, accountability, and life management education in a nurturing environment to homeless women and children working toward self-sufficiency.\n\nGoal\nTo help homeless women develop stability--emotionally, spiritually, & financially--during their 6 to 18 month stay at Beauty for Ashes.\n\nPhilosophy\nWe believe that women must recognize their ability and responsibility to control the disorganizing and destructive forces in their lives and to accept God's love and guidance as a spiritual resource.\n\nWe believe a combination of factors instill success:\nspiritual and emotional support\nliving in a stable and orderly environment\nestablishing and working toward a personal and family goals\ninner healing life skills and emotional management tools\nprofessional counseling, as needed\n\nThe Lord hath sent me to bind up the brokenhearted, proclaim liberty to the captives, and the opening of the prison to them that are bound; . . . to give unto them beauty for ashes, the oil of joy for mourning, the garment of praise for the spirit of heaviness that they might be called trees of righteousness, a planting of the Lord, that He might be glorified Isaiah 61:1-3"
  },
  {
    "addressLine1": "208 SOUTH ANDERSON STREET",
    "city": "ELWOOD",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46036",
    "name": "Elwood Community Food Pantry",
    "organization": "Elwood Community Food Pantry",
    "phone": "(765) 552-5570",
    "website": "https://www.facebook.com/pages/Elwood-Community-Food-Pantry/930934340324607",
    "description": ""
  },
  {
    "addressLine1": "625 Main Street",
    "city": "Anderson",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46015",
    "name": "The Christian Center",
    "organization": "The Christian Center",
    "phone": "(765) 649-4264",
    "website": "https://thechristiancenter.org/",
    "description": "The Christian Center's Rescue Shelter program maintains a 24/7 \"no turn away\" policy. Immediate physical needs are met, as guests sign up for beds, eat three meals a day, take showers and get haircuts and pick out fresh clothes. Men can stay up to 30 days, during which time Christian Center staff help them to evaluate their next best step, which may include enrollment in our Men's Program or different recovery programs with other service providers in the area.\nEveryone comes into the Christian Center through the emergency shelter program.\n\nMen's Program\nThe healing begins for hundreds of men when they finally have a safe, caring environment in which to spend crucial daylight hours, and a warm bed to sleep in at night when they've had no other place to call home. Without a permanent address, those trying to rebuild their lives may find it difficult to take practical steps towards self-sufficiency, such as scheduling job interviews, applying for aid, saving money, receiving mail and phone calls, and much more. Participation in the Men's Program establishes residency and once again puts these things within reach.\nA member of the Men's Program working in the retail storage area of The Christian Center in AndersonMore importantly, because The Christian Center believes that a stable life requires making peace with God, yourself, and others, the Men's Program is purposefully designed to promote spiritual and emotional wholeness. This means that our first priority is to help men establish a Biblical foundation for making healthy choices, which includes maintaining an addiction-free life.\n\nWhile learning basic life management skills, men have the opportunity to develop a personal relationship with Jesus Christ through Bible study and chapel services.\nOur comprehensive programming works through community partnership and volunteers who provide resources for substance abuse counseling and education, work therapy, group Bible studies, chapel services, spiritual guidance, anger management classes, financial education, basic interpersonal skills training, and more.\nBecause every life story is unique, Men's Program staff and volunteers work together with each person to set individualized goals over the course of an 18-24 month program. These goals are set to assist each man in his healing journey to wholeness."
  },
  {
    "addressLine1": "625 Main Street",
    "city": "Anderson",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46016",
    "name": "The Christian Center, Inc.",
    "organization": "The Christian Center, Inc.",
    "phone": "(765) 649-4264",
    "website": "http://www.thechristiancenter.org/",
    "description": "The Christian Center is a non-denominational organization \"Offering a Transformed Life to the Hungry, Hurting and Homeless\" by providing emergency and long-term shelter for men, a community dining room, and community assistance."
  },
  {
    "addressLine1": "332 W. 11th Street",
    "city": "Anderson",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46016",
    "name": "Stepping Stones for Veterans",
    "organization": "Stepping Stones for Veterans",
    "phone": "(765) 648-1101",
    "website": "",
    "description": "Transitional housing to homeless and/or chemically dependent veterans.\n\nWe supply the clients with a Case Manager(s) and L.M.H.C. You can not warehouse people and hope they become self-sufficient. You must have a program and staff it. With the cut-back in money for programs to teach life skills to the homeless population we must rely more and more on outside grants and donations. Please consider helping.\n\nStepping Stones for Veterans is:\n-       A safe place to share and learn from others\n-       A refuge for those who feel trapped in their world of addictions.\n-       A place of belonging\n-       A place to care for others and be cared for\n-       A place where respect is given to each person\n\n-       A place where confidentiality is highly regarded\n-       A place to learn\n-       A place to grow and become strong again\n-       A place where you can take off your mask\n-       A place for healthy challenges and healthy risks\n-       A possible turning point in your life"
  },
  {
    "addressLine1": "P.O. Box 1302",
    "city": "Anderson",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46015",
    "name": "Alternatives Incorporated",
    "organization": "Alternatives Incorporated",
    "phone": "(866) 593-9999",
    "website": "https://www.alternativesdv.org/",
    "description": "We assist with homelessness in Madison County only.  Our first priority is domestic and sexual violence victims;\n\nAlternatives Incorporated serves all victims of domestic violence-women, children, and men. Our services are non-sectarian and include emergency shelter; transitional housing; crisis advocacy; information and referral; and support and advocacy.\n\n\n    We offer specialized services for children, with the hope of breaking the cycle of violence.\n    We provide training and education for community groups, law enforcement, businesses, faith organizations, teachers, health care workers, and first responders such as firefighters. \n    Our prevention services include classroom based dating violence and sexual assault sessions for teens.\n    We offer crisis response services for sexual assault victims as well as treatment and intervention in collaboration with the Madison County Sexual Assault Treatment Center.\n "
  },
  {
    "addressLine1": "600 Williams Street",
    "city": "Angola",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46703",
    "name": "Turning Point of Steuben County",
    "organization": "Turning Point of Steuben County",
    "phone": "(260) 665-9191",
    "website": "https://www.turningpointsteuben.org/",
    "description": "Men and Women's shelter. Serves the transient population, domestic violence clients. Two kitchens, outdoor area, laundry facilities, stocked pantry.\n\nMust live in Steuben County and not have a sexual or violent crime offense conviction.\n\nCall to check availability.\n\nCan stay up to 60 days.\n\nTurning Point is currently in use every day with occupancy ranging from 1 to 40 people per night. Individuals or families may be referred to Turning Point by local Clergy, Social Service Agencies, or Area Law Enforcement Departments. Before any individual can enter Turning Point, he or she must pass a Police Security Check. Each individual's stay at Turning Point is evaluated on a daily basis. The expectation is that residents are to be employed or actively seeking employment. The operation of Turning Point is conducted under specific rules for occupants. Failure to follow the rules will result in dismissal from the facility.\n"
  },
  {
    "addressLine1": "63 W. Washington St.",
    "city": "Coldwater",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "49036",
    "name": "Family Promise of Branch County",
    "organization": "Family Promise of Branch County",
    "phone": "(517) 278-0928",
    "website": "https://www.facebook.com/pages/Family-Promise-of-Branch-County/490897424259290",
    "description": "Family Promise of Branch County works with 11 host churches and more than 12 partner churches to provide a meal and overnight housing to the homeless."
  },
  {
    "addressLine1": "6815 US 50",
    "city": "Aurora",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47001",
    "name": "Heart House Inc.",
    "organization": "Heart House Inc.",
    "phone": "(812) 926-4890",
    "website": "https://hearthouseinc.org/",
    "description": "Heart House currently operates a 72 bed shelter and a 12-unit transitional apartment building.\nWithin the bricks and mortar of our home-like environment, we provide a variety of social\n\nservices to equip our clients with the life and coping skills they will need to re-enter mainstream\nsociety. Single men and women and families welcomed."
  },
  {
    "addressLine1": "1841 Fairmount Avenue",
    "city": "Cincinnati",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "45214",
    "name": "Bethany House Services",
    "organization": "Bethany House Services",
    "phone": "(513) 381-7233",
    "website": "https://bethanyhouseservices.org/",
    "description": "We provide emergency shelter, mental health assessments, transitional housing, and permanent housing.\n\nEmergency Shelter\n\nBHS provides a sanctuary for desperate homeless families in need of help to achieve stable housing and income. Our shelters meet each familys immediate needs for safety, housing, food and other necessities. While in shelter, parents receive the resources and information needed to help them obtain a living income, organize a comfortable home, and provide a nurturing environment for their children. Perhaps most important, parents themselves feel cared for and realize that they will develop a realistic plan for a better future for themselves and their children while they are guests of BHS.\n\n\n\nHousing\n\n\n\n\n\n\n\n\n\nRapid Re-Housing programs, considered by the Department of Housing\n& Urban Development (HUD) to be the best housing practice for\n\nalleviating homelessness, provides financial assistance and supportive\nservices to families experiencing homelessness. The goal of the program\nis to expedite housing and stabilization of the family as quickly as\npossible. It is easier and more efficient for families to sign up for\nbenefits or apply for jobs when they have the stability that a home\nprovides. They are also less stressed and better organized at home than\nwhen in shelter.\n\nThe program provides several forms of assistance, including:\nidentification of affordable housing suitable for the familys needs;\nshort-term or medium-term rental assistance and housing relocation and\n\nstabilization services, including such activities as mediation, credit\ncounseling, security or utility deposits, utility payments, moving cost\nassistance, and case management. Housing case managers and a housing\nspecialist assist each family to develop a housing plan, serve as\nliaison between family and landlord, and manage complex issues such as\nlease options, contracts and apartment inspections.\n\n\nShelter DiversionShelter diversion programs are identified by the National Alliance to\nEnd Homelessness as best practice for prevention of homelessness for\nfamilies seeking to enter a shelter. This strategy avoids the trauma of\nhomelessness for families by helping them to identify immediate\nalternative housing arrangements while connecting them with the services\nand financial resources needed to achieve permanent housing. The case\nmanager guides the family through the process of developing a\n\ncomprehensive, reality-based plan for ensuring a secure future in stable\nhousing.\nThis program conserves shelter beds and assistance for those who\ntruly have no resources of their own and no options other than a\nhomeless shelter or the streets.\n"
  },
  {
    "addressLine1": "1805 Dalton Avenue",
    "city": "Cincinnati",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "45214",
    "name": "City Gospel Mission",
    "organization": "City Gospel Mission",
    "phone": "(513) 241-5525",
    "website": "https://www.citygospelmission.org/",
    "description": "City Gospel Mission is a food pantry. .\n\n* Make sure you check by\ncalling the food pantry to confirm that they still are in operation and\nthe hours have not changed.\n\nSince 1924, City Gospel Mission Has Served Hurting, Needy, And Homeless People, Providing Help And Hope In Ever-Increasing Numbers Through The Years. The Mission Provides A Caring, Supportive Environment Where Homeless And Hurting People Are Treated With Respect And Encouraged To Accept Responsibility For Rebuilding Their Lives In An Atmosphere Of Love And Acceptance. Our Services Help Meet The Physical, Spiritual, And Emotional Needs Of People Who Have Lost Hope And Are Least Able To Meet Their Own Needs. The Daily Meals, Clothing Days, Safe Overnight Shelter, Recovery Programs, And Other Need-Based Services All Have This In Common: God'S Love And His Message Of Hope Are Shared In Practical, Christ-Like Ways. This Has Been Changing The Lives Of Those In Need At City Gospel Mission For More Than Eighty Years."
  },
  {
    "addressLine1": "411 Gest Street",
    "city": "Cincinnati",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "45202",
    "name": "David and Rebecca Barron Center for Men",
    "organization": "David and Rebecca Barron Center for Men",
    "phone": "(513) 721-0643",
    "website": "https://www.shelterhousecincy.org/mens-center/",
    "description": "Shelterhouse offers the essentials: housing, help, hope to people experiencing homelessness. We provide a refuge of unconditional care and compassionate assistance for both men and women,  reaching out our hand to encourage and empower those without resources to move from homelessness and destitution to shelter and stability.\n\nMen's Center:\n\nThe David and Rebecca Barron Center for Men ensures homeless men in Cincinnati have access to basic human needs such as shelter, food, emergency clothing items, basic toiletries, and safety.\n    150 beds for homeless men 18+\n    Non-dormitory sleeping quarters\n    Serving three daily meals\n    State of the art kitchen facilities\n    Individualized Case Management Support Services\n    Full day treatment services tailored to each mans specific needs\n    Fully operational on site medical and dental clinics\n    Daytime Programming\n    Full Laundry Services\n    3,600 Sq. Foot Private Outdoor Courtyard\n    10,000 Sq. Foot Winter Shelter operating December to February.\n\nGOAL\nTransition into permanent housing in 30 days or less with an increase in income."
  },
  {
    "addressLine1": "4230 Hamilton Ave",
    "city": "Cincinnati",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "45223",
    "name": "Grace Place Cincinnati",
    "organization": "Grace Place Cincinnati",
    "phone": "(513) 591-2246",
    "website": "http://www.cainministry.org/graceplace.html",
    "description": ""
  },
  {
    "addressLine1": "260 West Pike Street",
    "city": "Covington",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "41012",
    "name": "Fairhaven Rescue Mission",
    "organization": "Fairhaven Rescue Mission",
    "phone": "(859) 491-1027",
    "website": "https://www.fairhavenmission.org/",
    "description": ""
  },
  {
    "addressLine1": "205 West Pike St.",
    "city": "Covington",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "41011",
    "name": "Welcome House Shelter",
    "organization": "Welcome House Shelter",
    "phone": "(859) 431-8717",
    "website": "https://www.welcomehouseky.org/",
    "description": "The Welcome House Emergency Shelter provides a safe place for approximately 30 homeless women and children. Guests of the shelter work with Service Coordinators and other Welcome House staff to increase income and access affordable housing while removing any challenges or barriers to success.\n\nWhile working toward greater stability, clients are offered a safe place to live, warm meals, any needed hygiene supplies, and extra assistance (such as help with transportation and referrals to area resources). Shelter residents benefit from the caring support of a 24 hour staff member, various volunteers, and donors who help meet their needs.\n\n\nIn 2015, 135 children were part of the many individuals who stayed in Shelter. Fifty-two percent of the children served were under six years of age. Children who stay in the shelter (as well as those of other families working with Welcome House) have the support of a staff member dedicated to meeting their needs and protecting their rights. Mothers are offered assistance in enrolling children into school and daycare, and in meeting the material needs of their school-aged children.\n\nThe average length of stay at the shelter was 35 days. During their shelter stays in 2015:\n\n    100% of shelter clients accessed support services while at the shelter, such as the care of visiting nurses, mental health and substance abuse referrals, and parenting and life skills coaching.\n     73% of our clients exited shelter to positive housing outcomes\n\n     68% of 185 households had income at exit (and more residents accessed non-cash benefits such as WIC, SNAPS benefits, and health insurance enrollment while in shelter).\n"
  },
  {
    "addressLine1": "27 West 12th Street",
    "city": "Cincinnati",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "45210",
    "name": "Tender Mercies",
    "organization": "Tender Mercies",
    "phone": "(513) 721-8666",
    "website": "https://www.tendermerciesinc.org/",
    "description": "Permanent Housing and Caring Support\n\nTender Mercies provides more than housing. Each resident has his/her own room with a key. All buildings have round the clock staffing and residents are provided with ongoing support from compassionate and experienced staff. Living in a welcoming community with security & dignity is essential for recovery.\n\nHousing Services Outreach Services.\nWe accept referrals from anyone. The first step is to meet with one of our helpful Outreach Workers and complete an application for services. Applicants must be homeless with a history of mental illness.\n\nResidency Details\n149 single-occupancy rooms with 24-hour staff coverage at these locations:\nHaven Hall\n27 West 12th Street\n13 Female\n26 Male\n30% of income\nDana Hotel\n15 West 12th Street\n41 rooms - Coed\n30% of income\nHarkavy Hall\n24 West 12th Street\n29 targeted toward Males\n30% of income\nTransitional Housing\n29 West 12th Street\n16 rooms - Coed\n30% of income\nThese locations have staff support available (not 24-hour support):\nRace Street Residence\n1214 Race Street\n12 targeted toward Females\n$215-225 a month\n\nNew Morning House\n1209 Elm Street\n11 targeted toward Males\n$205-245 a month\n\nAll of our rooms include a twin bed, a dresser or wardrobe and a small refrigerator. Shared bathroom facilities are available on each floor. Shared kitchen and laundry facilities are also available.\n\nAlthough Tender Mercies does not serve 3 meals a day, on most days at least one meal is provided by community volunteers. There are often donated food items available and residents are provided with information about local pantries and soup kitchens.\n\n\nUpon moving in, residents can be provided with some basic assistance (sheets, towels, clothing, hygiene items) if needed. There is a $50 security deposit for all buildings.\n"
  },
  {
    "addressLine1": "898 Walnut Street",
    "city": "Cincinnati",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "45202",
    "name": "YWCA of Greater Cincinnati (Women) Shelter and Transitional Housing",
    "organization": "YWCA of Greater Cincinnati (Women) Shelter and Transitional Housing",
    "phone": "513-241-7090",
    "website": "https://www.ywcacincinnati.org/",
    "description": "Domestic Violence Shelter and Crisis Hotline\nThe YWCA provides safe protective shelter, crisis line assistance and necessary supportive services for adults and their children to move them toward self-sufficiency, independence and freedom from abuse.\n\nYWCA hotline advocates can provide: peer counseling and moral support, assistance with creating a safety plan and determining if shelter is appropriate for you, and information about restraining orders.\n\nHamilton County - YWCA Domestic Violence Shelter\nYWCA Domestic Violence Hotline:\nLocal: 513-872-9259\nToll-Free: 888-872-9259\n24-hour Hotline Assistance\n\nTTY Accessible\n    Only domestic violence shelter in Hamilton County\n    Shelters up to 72 adults and children\n    Case management, advocacy and referral\n    24-hour crisis hotline including TTY services and an International Language Line\n    Services for immigrant women\n    Employment Resource Program\n    Children's Program\n    Pet protection services"
  },
  {
    "addressLine1": "113 E 12th St",
    "city": "Cincinnati",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "45202",
    "name": "Cincinnati Homeless Coalition",
    "organization": "Cincinnati Homeless Coalition",
    "phone": "(513) 421-7803",
    "website": "https://cincihomeless.org/",
    "description": "Office Hours: Mondays through Fridays 9am to 5pm.\n\nNeed Help?\nAre you currently homeless or are you on the edge of homelessness? If so, there are a number of agencies in the Greater Cincinnati area that may be able to help you get out of homelessness or prevent you from becoming homeless.\n\nCAP Line/Intake Process\nIf you need shelter, call the Cincinnati shelter hotline (513) 381-SAFE (7233). This is the Central Access Point (CAP) a centralized intake system for families and individuals who are currently experiencing homelessness or who are at risk of becoming homeless.\nIntake Specialists screen callers based on their immediacy of need and make appropriate referrals into a partner agencys program. Be prepared for a wait time. Unfortunately, due to the high need, Greater Cincinnati shelters are frequently full.\n\n\nCAP accepts call from 9:00 AM to 8:00 PM Monday through Friday and 10:00 AM to 2:00 PM Saturday and Sunday.\nThe only way to get in to the following shelters is through this hotline: Bethany House Services, Interfaith Hospitality Network, Mercy Franciscan at St. John, the Salvation Army, Mt. Airy Center (to see if you qualify for these shelters)"
  },
  {
    "addressLine1": "634 Scott St.",
    "city": "COVINGTON",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "41011",
    "name": "Emergency Shelter of Northern Kentucky",
    "organization": "Emergency Shelter of Northern Kentucky",
    "phone": "(859) 291-4555",
    "website": "http://emergencyshelternky.org/",
    "description": ""
  },
  {
    "addressLine1": "13-15 East 20th St",
    "city": "Covington",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "41014",
    "name": "Homeward Bound Shelter",
    "organization": "Homeward Bound Shelter",
    "phone": "(859) 581-1111",
    "website": "https://www.brightoncenter.com/",
    "description": "Emergency shelter for runaways ages 11 - 17 years old.\nHomeward Bound Shelter is a 24-hour emergency shelter location in Covington, KY, that provides a safe environment and short-term services for runaway, homeless, abused, neglected, and dependent youth ages 11-17.\n\n\nIntakes are conducted to gather information for eligibility, appropriateness and development of initial service plan\n\nProvide basic support that includes shelter, food and clothing\nA bio-psycho-social assessment is completed to identify issues\nTreatment Team meets weekly to discuss new admissions, bio-psycho-social, and goals to be addressed in the service plan\nIndividual counseling is conducted weekly for each youth\nCrisis Intervention and Referral Services are offered for local non-residential youth and families\nRecreation activities are offered weekly for community recreational activities\n\nLife skills are taught daily and groups held weekly\nWe use Positive Youth Development and Trauma-Informed best practices in our approach with youth.\n\n"
  },
  {
    "addressLine1": "336 West",
    "city": "Newport",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "41071",
    "name": "Family Promise of Northern Kentucky, Inc.",
    "organization": "Family Promise of Northern Kentucky, Inc.",
    "phone": "(859) 360-0905",
    "website": "https://www.nkyfamilypromise.org/",
    "description": ""
  },
  {
    "addressLine1": "2499 Reading Road",
    "city": "Cincinnati",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "45202",
    "name": "Esther Marie Hatton Center for Women",
    "organization": "Esther Marie Hatton Center for Women",
    "phone": "(513) 562-1980",
    "website": "http://www.shelterhousecincy.org/",
    "description": "Shelterhouse offers the essentials: housing, help, hope to people\nexperiencing homelessness. We provide a refuge of unconditional care and\n\ncompassionate assistance for both men and women reaching out our hand\nto encourage and empower those without resources to move from\nhomelessness and destitution to shelter and stability.\n\nWomen's Center\n\nThe Esther Marie Hatton Center for Women ensures homeless women in Cincinnati have access to basic human needs such as shelter, food, emergency clothing items, basic toiletries, and safety.\n60 beds for homeless women 18+\nNon-dormitory sleeping quarters\nServing three daily meals\nState of the art kitchen facilities\nIndividualized Case Management Support Services\nFull day treatment services tailored to each womans specific needs\nFully operational on site medical clinic\nDaytime Programming\nFull Laundry Services\n9,000 Sq. Foot Private Outdoor Courtyard\nGOAL\nTransition into permanent housing in 30 days or less with an increase in income.\n"
  },
  {
    "addressLine1": "2314 Iowa Ave",
    "city": "Cincinnati",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "45206",
    "name": "Lighthouse Sheakley Center for Youth",
    "organization": "Lighthouse Sheakley Center for Youth",
    "phone": "(513) 569-9500",
    "website": "https://www.lys.org/services/shelter-and-resources-for-homeless-young-adults-18-24/sheakley-center-f",
    "description": "Lighthouse offers shelter to young adults ages 18-24 who are motivated to move from homelessness to safe and stable housing.\n- Shelter where homeless young adults learn self-reliance and life skills\n\n- Each young adult works with a case manager who helps the young adult develop a case plan and implement it.\n- The goal: move young adults from the center into safe and stable housing within 30 days\n\nWhen homeless young adults enter the Lighthouse Sheakley Center for Youth, they often experience their first sense of hope for a better future. Young people who live on the streets lack the guidance and support so many of us take for granted. Thats why Lighthouse has a dedicated and trained team of case managers who provide consistent, personalized, and comprehensive case management services. They assess each young persons needs, provide crisis intervention if needed, coordinate the necessary care, and develop an individualized plan to provide support. Our end goal is to guide young people off the streets and into secure housing."
  },
  {
    "addressLine1": "360 IN-267",
    "city": "Avon",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46123",
    "name": "Family Promise of Hendricks County",
    "organization": "Family Promise of Hendricks County",
    "phone": "(317) 296-3742",
    "website": "http://familypromisehendrickscounty.org/",
    "description": "Our mission is to fight homelessness in Hendricks County by coordinating immediate shelter and needs assistance programs alongside longer term compassionate support services for families in all areas of life.\n\n\nIntake for the shelter is at 9am to 12 noon, Mondays through Fridays.\nBring ID's.\n\nThis shelter is for homeless people with children."
  },
  {
    "addressLine1": "907 N. Holmes Avenue",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46222",
    "name": "Holy Family Emergency Shelter",
    "organization": "Holy Family Emergency Shelter",
    "phone": "(317) 635-7830",
    "website": "https://www.archindy.org/cc/holyfamily/",
    "description": "Emergency residential shelter, three meals per day, hygiene supplies, access to telephones, laundry facilities, and transportation. All services are free of charge. Families residing at Holy Family Shelter meet with case managers who provide advocacy and referral for community services, jobs, training, education and housing.\n\nHoly Family Shelter, an emergency shelter for homeless families, addresses the increasing demand for emergency shelter in Indianapolis and central Indiana by providing residential services designed to move homeless families to self-sufficiency.\n\n\nThe shelter has the capacity to house up to 30 families on any given night. Depending on family size, there are 55-85 individuals living at the shelter at any given time. This is their \"home\" while they are with us and we take this responsibility to heart. We work diligently to provide food, shelter, basic material needs and a safe place for families in crisis to begin to heal.\n\nHoly Family Shelter: Who We Serve\nHoly Family Shelter serves families defined as the following:\n    Married couples without children\n    Married couples with children\n    Single parents with children\n    Single pregnant females"
  },
  {
    "addressLine1": "1108 5th Street",
    "city": "Bedford",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47421",
    "name": "Becky's Place For Women and Children",
    "organization": "Becky's Place For Women and Children",
    "phone": "(812) 275-5773",
    "website": "http://www.archindy.org/cc/bloomington/beckysplace.html",
    "description": "Becky's Place is designed to provide shelter and create hope for women and children who are experiencing homelessness and moving toward a life of self-sufficiency.\n\nBasic Overview of Services:\n    Shelter\n    Meals\n    Case Management\n    Support Services\n    Counseling\n    Educational Resources\n    Vocational Training\n    Life Skills\n    Compassionate, dedicate staff and volunteers\n\nClient Commitment\n    Our goal is for each resident to obtain permanent housing as quickly as possible. Maximum length of stay is 90 days\n    Evaluation of program commitment will take place every 30 days\n\n    Each resident will work with a Case manager to develop a life plan\n    Residents must commit to seeking employment and/or further education\n    Residents must commit to remaining drug and alcohol free\n    Residents who are employed must commit to saving at least 75% of their income\nIf you want to help Becky's Place, you can get involved with financial support, material donations, serving on the advisory board, volunteering for projects or as a staff member, and through prayer. Contact us at (812) 275-5773."
  },
  {
    "addressLine1": "620 S Walnut St",
    "city": "Bloomington",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47401",
    "name": "Shalom Community Center",
    "organization": "Shalom Community Center",
    "phone": "(812) 334-5728",
    "website": "http://shalomcommunitycenter.org/",
    "description": "As a resource center for people experiencing hunger and homelessness, Shalom supports people in their greatest times of need.\n\nShalom provides breakfast from 8-9am and lunch from 12-1:30 everday (except holidays when we are open from 8am-12 pm and serve one meal usually at 8am). Shalom also provided emergency groceries once per household per month.\n\n\nIn addition, Shalom provides other life essentials to help people stabilize in times of need. These include:\n\nDay Shelter & Daytime Sleep Room\nRestrooms\nShowers\nLaundry\nBus tickets\nPrescription Assistance\nHealth Insurance Payment Assistance\nRent and Utility Assistance\nBirth Certificates and ID Assistance\nTelephones\nMailing address\nDay and long-term storage\nCopying, Faxing, and Postage\nClothing, shoes, sleeping bags, backpacks, socks, coats, gloves, hats, and other supplies\nToiletries, including, soap, shampoo, toothbrushes and toothpaste, feminine hygiene products, deodorant, razors, and more\nDiapers, wipes, and other baby supplies\nAnd more\n\n\nOvernight Shelter at A Friends Place\nShalom provides overnight shelter to people experiencing homelessness at A Friends Place, located at 919 S Rogers St. in Bloomington. Friends Place is the only nonreligious, emergency shelter for adults (18 and over) in our region. A Friends Place provideds 40 safe and sober beds, 28 for men and 12 for women.\n\nThe shelter opens at 5:15 pm. To access an available bed, please arrive at the shelter at that time.\n\n\nGuests must not be under the influence of alcohol or illegal drugs. Monroe County residents are given priority.\n"
  },
  {
    "addressLine1": "400 S. Opportunity Ln",
    "city": "Bloomington",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47404",
    "name": "Wheeler Mission Ministries Center for Women And Children",
    "organization": "Wheeler Mission Ministries Center for Women And Children",
    "phone": "(812) 334-4047",
    "website": "https://wheelermission.org/",
    "description": "No appointment necessary for emergency shelter.\nMust have an appointment for addiction recovery program.\n\nServices\n    Meals\n    Shelter\n    Chapel Services\n    Emergency Shelter Services\n    Residential Programs"
  },
  {
    "addressLine1": "215 N Rogers St",
    "city": "Bloomington",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47403",
    "name": "Amethyst House",
    "organization": "Amethyst House",
    "phone": "(812) 336-3570",
    "website": "http://www.amethysthouse.org/",
    "description": ""
  },
  {
    "addressLine1": "308 S Oak st",
    "city": "Paoli",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47454",
    "name": "Gateway Ministries Grace Haven",
    "organization": "Gateway Ministries Grace Haven",
    "phone": "(812) 723-2777",
    "website": "https://www.gatewayministriespaoli.org/",
    "description": "Grace Haven is a volunteer driven, Christian-based halfway house for those looking to make a new start after being released from incarceration/ for those looking to be set free from addictions. We believe God never gives up on anyone no matter ow deep they are into sin's pit! We are striving to help them experience true freedom by allowing God's love and grace to transform their lives to become productive members of our community and in God's kingdom\n\nOur Facility\n\nOur facility is currently located in the basement of Gateway Ministries' building. We have three sleeping rooms for our clients, a sleeping room for the volunteers, a sitting area with TV,a fully functional kitchen with a laundry area, and a bathroom."
  },
  {
    "addressLine1": "PO Box 95",
    "city": "Bloomington",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47402",
    "name": "Middle Way House",
    "organization": "Middle Way House",
    "phone": "(812) 336-0846",
    "website": "https://middlewayhouse.org/",
    "description": "Domestic Abuse Center, Hotline/Crisis: 812-336-0846\n\nEmergency Shelter\nMiddle Way House provides shelter for women and children fleeing violence at home. Call (812) 336-0846 to learn more."
  },
  {
    "addressLine1": "301 West Harrison Street",
    "city": "Martinsville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46151",
    "name": "Wellspring Center",
    "organization": "Wellspring Center",
    "phone": "(765) 342-6661",
    "website": "https://wellspringcenter.org/",
    "description": "WellSpring offers emergency shelter and supportive services to families.\n\nWellSpring operates a nine-unit emergency shelter with efficiency or one-bedroom apartments (where residents live without cost for up to 30 days).\n\n\nAll apartments include stove, refrigerator, and cooking utensils. The utilities and laundry facilities are also provided at no cost. Our families also have access to a common entertainment area with toys and TV provided. Our residents are provided weekly success coaching for employment, and housing assistance. Those residing in emergency shelter are able to access classes for nutrition, parenting and stress management. Families are able to access our computer lab and on-site food pantry.\n\nWe provide a temporary residential setting with support and encouragement. Families have an opportunity to move to a permanent supportive housing apartment where they pay below market rent for an extended stay period of up to 2 years.\n\nIntake is conducted Mon.-Thurs. 9 AM- 5 PM. Preliminary applications may be done via phone during those times at 765-342-6661 ext. 300 or by walk-in.\n\n\nProvides emergency shelter for homeless Morgan County families; singles accepted only if children or pregnancy are involved. Assists shelter residents with food, clothing, transitional housing, counseling and referral.\nEligibility: Homeless or in need of emergency shelter; families w/children or pregnant singles.Must meet a 6-month residency requirement in Morgan County. Will consider accepting clients from adjoining counties ONLY IF THAT COUNTY DOES NOT HAVE A SHELTER. Drug testing is administered.\n\nSubstance Aubuse Treatment is also provided at this location. Offers addictions treatment to homeless residents of Morgan County"
  },
  {
    "addressLine1": "603 Parker St",
    "city": "Warsaw",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46581",
    "name": "The Beaman Home",
    "organization": "The Beaman Home",
    "phone": "(877) 725-9363",
    "website": "https://www.thebeamanhome.com/",
    "description": "Women's shelter.\nBeaman Home's Emergency Shelter\n\nProvides temporary shelter, food, clothing, and other basic necessities to domestic violence victims, and their children, who are fleeing their abuser. The Shelter is staffed 24-hours a day, 7-days a week by trained staff and volunteers. While in-shelter, Case Managers and Advocates work with each victim to assist in making necessary steps to gain independence from abuse and violence. Working from a strengths-based approach, daily case management includes assistance with: weekly goal setting, securing housing, navigating the legal system and social service network, job skills, parenting skills, life skills, and much more.\n\nIn addition, the Shelter is also the base for our area's local Domestic Violence Crisis Hotline. Each year, trained staff and volunteers provide crisis intervention assistance through hundreds of crisis-related phone calls from victimized families reaching out for help. Without our programs, these calls may have gone unanswered."
  },
  {
    "addressLine1": "431 Fairmont Place",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46808",
    "name": "Charis House - Rescue Mission",
    "organization": "Charis House - Rescue Mission",
    "phone": "(260) 426-8123",
    "website": "https://fwrm.org/about-the-mission/our-houses/charis-house",
    "description": "Charis House is for women and children experiencing a homeless crisis.\nShort-term residential program, typically 3-6 months. Long-term residential program, typically 12-18 months.\n\nIntensive services enable women to move past root causes of homelessness.\n\n78 Beds\n\nQualifications:\n    Be experiencing a homeless crisis (without a permanent address or name on a lease agreement).\n    Be age 18 or older (or the dependent child of a Charis House applicant over age 18).\n    Be a resident of Allen County or one of the 9 surrounding counties for at least six months to be considered for our Long-Term Transformational Program.\n    Complete an interview with our Intake Coordinator to see if you meet our criteria and have a bed available. We do not have a waiting list. We take people on a first come-first served basis.\n    We are not able to accept Community Corrections clients at this time - they do not qualify for our program.\n\n    We are not able to accept those who have been convicted of harming a child sexually or physically.\n    If you have finances available to use (SSI, SSD, etc.), be willing to be accountable for the expenditure of any funds.\n    Willing to complete a phone interview with an Intake Coordinator to see if you meet our criteria and have a bed available. We do not have a waiting list. We take people on a first come-first served basis.\n    Willing to follow all of our house guidelines and be able to complete daily household chores.\n    Be physically and mentally able to live in a community environment without significant staff assistance.\n    Give up employment temporarily, if applying for our Long-Term Program.\n    Remain alcohol and drug free.\n    Willing to complete a drug screen/breathalyzer when you arrive and, if accepted, random drug screens/breathalyzers throughout your stay.\n    Willing to comply with a two - four week \"house restriction or house support\" status upon entering. This means that you may be restricted to staying at The Mission or only leave the house for approved reasons (Church, Dr. appointments, court/probation appointments, etc.) with an approved support person.\n\n\n\n"
  },
  {
    "addressLine1": "404 E. Washington Blvd.",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46802",
    "name": "Fort Wayne Rescue Mission",
    "organization": "Fort Wayne Rescue Mission",
    "phone": "(260) 426-7357",
    "website": "https://fwrm.org/",
    "description": "Fort Wayne Rescue Mission offers homeless services such as shelter and free meals, all located in the same center where you can find support, referrals and services.\nApplicants should call ahead to complete a telephone interview and application to determine eligibility.\n\nEvening check-in for males over 18 years of age who are in need of immediate housing begins at 5:30 PM daily. Check-out is at 8:00 AM.\n\nFree meals hours served to the public:\n7:00 AM, 12:00 PM, and 5:00 PM daily.\n\nNotes:\nNormal business hours are 8:00 AM to 5:00 PM daily, but staff is on-site 24/7 in case of emergency.\n\n"
  },
  {
    "addressLine1": "2018 N Clinton St",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46805",
    "name": "Road to Recovery - Halfway House",
    "organization": "Road to Recovery - Halfway House",
    "phone": "(260) 422-0223",
    "website": "https://www.facebook.com/road2recoveryinc/",
    "description": ""
  },
  {
    "addressLine1": "806 Walnut St.",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46802",
    "name": "Freedom House Inc. - Halfway House Fort Wayne",
    "organization": "Freedom House Inc. - Halfway House Fort Wayne",
    "phone": "(260) 456-8097",
    "website": "http://www.freedomhouseinc.com/",
    "description": ""
  },
  {
    "addressLine1": "427 W. Washington Blvd.",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46808",
    "name": "Salvation Army Rehab Center",
    "organization": "Salvation Army Rehab Center",
    "phone": "(260) 424-1655",
    "website": "https://twitter.com/salvationarmyus",
    "description": "Rehabilitation Program Provided at this location.\n\nThe Salvation Armys Adult Rehabilitation Centers provide spiritual, social and emotional assistance for men and women who have lost the ability to cope with their problems and provide for themselves.\n\nEach center offers residential housing, work, and group and individual therapy, all in a clean, wholesome environment. The physical and spiritual care that program participants receive prepares them to re-enter society and return to gainful employment. Many of those who have been rehabilitated are reunited with their families and resume a normal life."
  },
  {
    "addressLine1": "1520 E. Winona Ave.",
    "city": "Warsaw",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46580",
    "name": "Warsaw Homeless Shelter",
    "organization": "Warsaw Homeless Shelter",
    "phone": "(574) 268-9555",
    "website": "https://fellowshipmissions.net/",
    "description": "Fellowship Missions is open to men, women, and children. We aim to provide a safe and caring environment for individuals without the threat of violence, or inappropriate behavior and language.\n\n\nThe shelters check-in hours are Monday through Friday from 1pm to 4pm. In order to check-in, you must have a valid photo ID, pass a background check without any active warrants, and you must not have any crimes against a minor. All guests must pass a BAC (Blood Alcohol Content) test when checking in. Open beds are given on a first come, first served basis. We recommend calling to check on the availability of beds before arriving. While we make every reasonable effort to accommodate the needs of our guests, we cannot guarantee availability of an accessible bunk."
  },
  {
    "addressLine1": "519 Tennessee Ave",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46805",
    "name": "Shepherds House",
    "organization": "Shepherds House",
    "phone": "(260) 424-2500",
    "website": "https://www.shepherdshouse.org/",
    "description": "Offering long term safe housing to homeless veterans struggling with alcoholism and or chemical dependencies.\n\n41 Beds\n\nShepherd's House is like a giant home with a lot of structure for a multitude of people who find themselves feeling hopeless because theyre addicted to drugs or have alcohol problems; 99 percent of them are veterans.\nWe have an intake process and a lot of rules and a lot of surveillance cameras, and we have a beautiful facility for them to live in with one major hitch: They must stay sober. We have social workers and a lot of recovery meetings and classes and we work in collaboration with the Veterans Affairs, WorkOne and veterans centers. The minimum stay here is six months and the maximum is two years, or longer if they need it. Clients start out in an eight-man bedroom and if they do well they go into a four-man room, then a two-man room and then theyre on their own in the rooms on the second floor. Its all incentive-based.\n\nWhen they first move in, they have a mentor assigned to them to explain the programs and tell them what the rules of the facility are, and eventually they end up becoming mentors to others. If you come across any homeless vets with drug addition or alcohol problems, just let them know they can come here and they dont have to bring anything. We give them toiletries, a welcome kit, bedding, clothing and food.They dont have to do anything but come in and make a commitment to stay clean and sober and work a recovery program."
  },
  {
    "addressLine1": "576 William St.",
    "city": "Huntington",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46750",
    "name": "Huntington House Homeless Shelter",
    "organization": "Huntington House Homeless Shelter",
    "phone": "(260) 358-0748",
    "website": "http://www.communityandfamilyservices.org/huntington-county",
    "description": "Hours:\nOffice hours 9am to 4pm\n\n\nHuntington House provides short-term, intermediate housing for homeless women as well as women and children who are in need.\n\nIn addition to housing and meals, case management services are provided with assistance to set goals, link to community resources, and employment opportunities which lead toward success needed to become self-sufficient."
  },
  {
    "addressLine1": "432 Madison St.",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46802",
    "name": "Ave Marie House - Day Shelter",
    "organization": "Ave Marie House - Day Shelter",
    "phone": "(260) 424-3355",
    "website": "https://stmarysfw.org/ave-maria-house/",
    "description": "Hours\nMonday -Thursday: 10:00 a.m. -2:00 p.m.\nFriday Saturday: 10:00 a.m. 1:00 p.m.\nDay Shelter, Laundry, Shower, Phone, Social Interaction\n"
  },
  {
    "addressLine1": "512E Jefferson Blvd. suite 201",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46802",
    "name": "Victory House",
    "organization": "Victory House",
    "phone": "(260) 557-6183",
    "website": "https://www.inarr.org/listings/victory-house-for-women/",
    "description": "Transitional home for women without children.\nTotal capacity 8 people.\nA spiritual awakening. Challenging stigmas in mental health, addictions, trauma and violence. History is not your Destiny\n\nA spiritual awakening! Victory House for Women is faith based recovery residence founded January 2010. Serving Fort Wayne-Allen and surrounding counties with mental health/addiction recovery support services.\n\n"
  },
  {
    "addressLine1": "2812 Gay St",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46806",
    "name": "Genesis Outreach",
    "organization": "Genesis Outreach",
    "phone": "(260) 744-2800",
    "website": "https://genesisoutreach.org/",
    "description": "Genesis Outreach, Inc. provides permanent supportive housing for chronically homeless families and individuals whom, except for housing, would not receive supportive services, and except for support services, would not remain housed. Program participants become self-sufficient while gaining stability, economic empowerment, and enhanced community development and neighborhood impact. Success is measured by increasing income and maintaining housing for 12 months without experiencing future episodes of homelessness."
  },
  {
    "addressLine1": "2827 Holton Avenue",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46806",
    "name": "Vincent Village",
    "organization": "Vincent Village",
    "phone": "(260) 456-4172",
    "website": "http://vincentvillage.org/",
    "description": ""
  },
  {
    "addressLine1": "2925 E. State Blvd",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46805",
    "name": "Just Neighbors IHN",
    "organization": "Just Neighbors IHN",
    "phone": "(260) 458-9772",
    "website": "https://www.ihnfamily.org/",
    "description": ""
  },
  {
    "addressLine1": "2208 Wayne Trace",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46803",
    "name": "The Rose Home, Inc",
    "organization": "The Rose Home, Inc",
    "phone": "(260) 424-1600",
    "website": "http://www.therosehome.org/index.html",
    "description": "Christian not-for-profit transitional living home for women who choose to recover from drug and alcohol addictions.\nThe mission of the Rose Home is to provide a structured Christian atmosphere in which a drug/ alcohol addicted woman can be guided through a holistic approach to recovery.\n\nWhat we do:\nAt the Rose Home an equal emphasis is placed on developing spirituality while working a 12-step recovery program with a sponsor. The Rose Home is a Christian based and relies on a balanced and wholesome approach to recovery. Members of our staff utilize a team approach to help residents heal, grow, and develop in all areas-emotionally, physically, mentally, intellectually and spiritually.\n\nOur Residents:\nOur residents come from a wide variety of referral sources. Some of our residents are self-referrals, others are referred by counselors, clergy, employee assistance programs, probation officers, case mangers from various agencies, and drug court. All referrals are given equal consideration.\n\nOur Fort Wayne Rose Home is a beautiful Victorian Style house located in south Fort Wayne.\n\n?The Fort Wayne Rose Home offers:\nTen bed home\nPublic transportation across the street\nScreened atrium for smoking\n24 hour per day/7 days per week staffing\nISNAP approval\nAccess to many agencies for counseling, employment assistance, and spiritual growth."
  },
  {
    "addressLine1": "P.O. Box 103",
    "city": "Columbus",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47402",
    "name": "Turning Point Domestic Violence Services",
    "organization": "Turning Point Domestic Violence Services",
    "phone": "(812) 379-5575",
    "website": "https://www.turningpoint6.org/",
    "description": "SERVICES\nAt Turning Point, we offer a wide variety of services including\n1. A 24-hr Crisis/Help Line\n2. Emergency Shelter Services\n3. Outreach\n4. Prevention Education and Professional Training\n5. Children's Program\n6. Legal Services\n\nEMERGENCY SHELTER\nTurning Point offers a 25-Bed Emergency Shelter for adult women, men, and their dependent children who are victims of Domestic Violence and/or Sexual Assault. Shelter services include; crisis intervention, danger assessment, individualized safety planning, legal advocacy, and skill building activities in the form of life skills groups, educational support groups focused on recovering from the trauma of abuse, and substance abuse screening and education. In addition the victim is provided with assistance in accessing community resources. All services are completely free of charge. Personal care items such as, shampoo, soap, and other toiletries are provided.\n\nTRANSITIONAL HOUSING\nTransitional Housing is available for victimized individuals and/or families who are dedicated to breaking free from violence and continuing to participate in Turning Point Programming. Transitional Housing is available for up to 24 months. Questions regarding the shelter can be answered through the Crisis/Helpline: 1-800-221-6311 Shelter Director 812-379-5575 ext. 110"
  },
  {
    "addressLine1": "505 Community Drive",
    "city": "Seymour",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47274",
    "name": "Alley Kitchen - Free Meals",
    "organization": "Alley Kitchen - Free Meals",
    "phone": "(812) 525-5858",
    "website": "https://www.facebook.com/TheAlleySeymour/",
    "description": ""
  },
  {
    "addressLine1": "201 E 3rd St",
    "city": "Seymoure",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47274",
    "name": "Community Diner of Seymour",
    "organization": "Community Diner of Seymour",
    "phone": "(812) 230-3002",
    "website": "https://www.facebook.com/pages/category/Diner/Community-Diner-of-Seymour-189084587842593/",
    "description": "A free meal site for whoever would like a free meal. Serving every Monday 4:30 to 5:30pm"
  },
  {
    "addressLine1": "250 S. Vine Street",
    "city": "Seymour",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47274",
    "name": "Anchor House Family Emergency Shelter",
    "organization": "Anchor House Family Emergency Shelter",
    "phone": "(812) 522-9308",
    "website": "http://anchorhouseshelter.org/",
    "description": "Staffed Shelter Hours:\nMon through Sat 9-5PM\n"
  },
  {
    "addressLine1": "P.O. Box 254",
    "city": "Crawfordsville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47933",
    "name": "Family Crisis Shelter",
    "organization": "Family Crisis Shelter",
    "phone": "(800) 370-4103",
    "website": "https://sites.google.com/site/familycrisisshelter/home",
    "description": "Survivors of domestic violence and sexual assault can feel the joy of waking up to a new day at Familiy Crisis Shelter in Crawfordsville, Indiana.\n\nWe provide emergency housing and supportive services in a welcoming and judgment-free environment. Our guests achieve safety and independence by working toward their unique goals that lead them to violence-free lives, so they can grow to reach their full potential.\n\n\nFamily Crisis Shelter offers the following services to victims of domestic violence and sexual assault:\n    24 Hour Crisis Hotline - We operate a crisis hotline 365 days a year for victims of domestic violence and sexual assault where people can get the information they need or speak to caring individuals trained in crisis intervention.\n    Case Management - Our professional case management team works to empower survivors so they can work to achieve their unique goals that will lead to a safe self-sufficiency.\n    Referral Services - Callers to the hotline, nonresidential clients, and FCS guests are referred to appropriate community resources.\n    Youth Services - Children and teenagers work with our Youth Advocate to learn about what they are going through and about appropriate ways to deal with anger and sadness.\n\n    Legal Advocacy - We work with survivors to assist them with protective orders, victim compensation, and general assistance to navigate the legal system.\n    Rape and Sexual Assault Advocacy - Victims of rape and sexual assault can access our advocacy services 24 hours a day, 365 days a year by calling the Crisis Hotline and requesting assistance.\n    Residential services - We offer safe housing for our  guests for up to 60 days.\n    Clothing Pantry - Guests are provided with clothing on an as-needed basis.\n    Transitional Living - Guests that are working toward their goals, but need an extra layer of support as they work toward self-sufficiency are encouraged to apply for our Transitional Living Program designed to provide them with housing and case management for up to two years.\n    Weekly Support Group - We offer a support group for survivors that is open to all community members who are victims of domestic violence or sexual assault.\n    Community Outreach and Education - The Community Liaison works throughout the community to educate individuals about issues relating to domestic and dating violence, sexual assault, and FCS.\n"
  },
  {
    "addressLine1": "525 N 4th Street",
    "city": "Lafayette",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47901",
    "name": "LUM Emergency Shelter",
    "organization": "LUM Emergency Shelter",
    "phone": "(765) 423-2691",
    "website": "http://www.lumserve.org/",
    "description": "The LUM Emergency Shelter provides short-term, overnight shelter, meals, and showers in a safe and caring environment to homeless individuals. The LUM Emergency Shelter may accommodate up to 44 adults each night of the year.\n\n\nThe LUM Winter Warming Station complements the services of the LUM Emergency Shelter from November to April. Other contingencies plans are in place during stormy weather or if temperatures get dangerously low.\n\nOther Services:\nGet an ID: Help in getting a valid ID card (Indiana identification) and/or birth certificate.\n\nHow to Use the ID Clinic:\n    Meet with LUM staff during Drop-in hours:\nDays/Hours:\nMonday through Wednesday;\n10 11:30 a.m.;\nMust sign in by 11:15 a.m.\nPlace: LUM Office, 420 N 4th Street, Lafayette\n    The service is free, but the entire process may take a few weeks to complete\nWho may Use the ID Clinic:\n    Tippecanoe County residents\nWhat you should bring with you:\n    Information: names of birth parents, city & state of where you were born, name of schools you attended and years of enrollment\n    Birth certificate, if available\n    Social Security card, if available\n\nGood Samaritan Program\nEmergency Financial Assistance\n    Funds:\n    For family emergencies such as\n        Utilities (gas, electric, water) help with fees, re-connection or deposit\n        Rent/Mortgage payment\n        Medical Prescription medication, HIP premium payment, physical exam or TB test required for new job\n\n        Work-related clothing shoes & clothes required for a new job\n        Clothing (general use) clothing vouchers are available from time to time\n        GED test fee\nAmounts:\nGenerally less than $50; decisions are made on a case-by-case basis\nThere is also a total amount allowed per household per year\nHow often:\nNot more than every 30 days or until your household annual limit is reached\nGenerally do not help with the same bill more than once\n    Referrals to other assistance programs\n    NO funds for doctor bills, car repairs, gasoline for cars, bus tokens, court or legal fees, bills not yet past due, bills too large\nHow to get funds from the Good Samaritan Program:\n    Check-in hours\nDays/Time: Monday through Friday at 8:15 a.m.\nPlace: LUM Office, 420 N 4th Street, Lafayette\n    Prescriptions must be ready for pick-up at your pharmacy\n    Frequently Asked Questions (FAQs) & the Answers may be found HERE\nWho may get funds from the Good Samaritan Program:\n    Tippecanoe County residents only\n    Income: up to 150% of federal poverty guideline\nWhat you should bring with you:\n    Picture ID\n    Names & birth-dates of all adults & children in your household\n    Required paperwork:\n        Utilities Gas, Electric, Water\n            Current Disconnect notice\n            Your Current Bill from the Utility company\n        Rent/Mortgage\n            Copy of your Current Lease or Bank Payment Book\n            Rent Receipt or a Letter from your Landlord\n        Medical\n            Prescription Name & phone number of your Pharmacy\n            HIP current bill\n            Physical/TB Test Note from your new employer or the employment agency listing Physical Exam or TB Test is required\n\n        GED Test Fee proof of current enrollment and testing date\n        Work-related clothing\n            Note from your new employer or the employment agency listing required clothes like work boots or uniform\n"
  },
  {
    "addressLine1": "605 N 6th St",
    "city": "Lafayette",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47901",
    "name": "YWCA Women's Shelter",
    "organization": "YWCA Women's Shelter",
    "phone": "(317) 742-0075",
    "website": "http://www.ywcalafayette.org/",
    "description": "Domestic Violence Hotline\n765-423-1118 or 1-888-345-1118. Available 24 hours a day, year round.\nThe Domestic Violence Program office has moved. It is located at the YWCA, 605 N. 6th Street (directly across the street from old office).\n\nProgram Services\nIf you are a victim of dating/domestic violence, you are not alone! We are here to help you and provide support in a variety of ways. Click on the links to the left for more information about the services we offer for women, men, and their children living in Benton, Carroll, Clinton, White, Warren, and Tippecanoe counties. All services are also provided in Spanish. Todos los servicios estn disponibles en espaol."
  },
  {
    "addressLine1": "815 North 12th Street",
    "city": "Lafayette",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47904",
    "name": "Lafayette Transitional Housing Center / LTHC Homeless Services",
    "organization": "Lafayette Transitional Housing Center / LTHC Homeless Services",
    "phone": "(765) 423-4880",
    "website": "https://lthc.net/",
    "description": "LTHC's Homeless Services Program, which is in the Howarth Center, offers three meals a day, laundry facilities, showers and computers. But the staff's primary focus is placing people who are homeless into housing. Caseworkers help clients find jobs, sign up for disability benefits and address any problems preventing them from finding housing.The center has long offered those services, but until this week, it kept regular business hours. When MHA announced it would close due to funding cuts, LTHC agreed to fill the gap. The center now is open from 7:30 a.m. to 8:30 p.m. every day.\n\n\nOffice hours: Mondays through Fridays 8am - 6pm.\nThe Homeless Services Program, which is located at the Howarth Center, offers a variety of services to anyone in our community who is homeless or in a housing crisis. This program is often the first step for anyone in need who is trying to find a solution to their situation.\n\nLTHC provides the central point of entry for all homeless services, including transitional housing shelter for the homeless.\n\nSingles Transitional Housing Program\n\nThe Singles Program offers housing and case management to 15 men and 8 women. The housing is in a former nursing home facility, which allows each client their own furnished bedroom, and shared bathrooms and kitchen facilities. The Singles can stay at LTHC for approximately 12 months. Each resident pays rent, which is based on their income and circumstances.\n\nThe goal of the Singles Programs is to help the homeless break down the barriers that have led to their homelessness. LTHC has Case Managers who work with each client and are available 24/7. The case managers are to help gain access to appropriate services, developing and implementing short and long-term goals, and to give the clients overall support.\n\nFamily Transitional Housing Program\n\nThe LTHC Family Program properties and playground. The Family Program offers both housing and case management to approximately 13-15 families at any one time. The housing consists of group home living for the first 3-6 months in the program, followed by a two-bedroom apartment. Families can stay at LTHC for approximately 18 months, while they work to become self-sufficient. Each family pays rent, which is based on their income and circumstances.\n\nThe LTHC Family Program properties and playground The goal of the Family Program is to help the clients break down the barriers that have led to their homelessness. LTHC has Case Managers who work with each client and are available 24/7. The case managers are there to help gain access to appropriate services, developing and implementing short and long-term goals, and to give the clients overall support.\n\n\nLincoln Center Permanent Supportive Housing Project\n\nThe Lincoln Center is located at 814 North 14th Street, Lafayette\n\nThe Lincoln Center is located at 814 North 14th Street, Lafayette\nThe renovations of the Lincoln Center Project were completed in March 2011, and 24 tenants moved into their units on April 1st.\n\nPermanent Housing is a combination of affordable housing with Lincoln Center on-site case management services, that helps people live more stable, productive lives. The Lincoln Center provides a long-term solution for people in our community who are continuously challenged by difficulties. The main goal for the tenants is to remain housed. When a person has their most basic needs of food, clothing and shelter, they can then focus on their long term success.\n\n\nThe Lincoln Center has 24 Project Based Housing Vouchers through the Lafayette Housing Authority. These vouchers, which are provided by HUD, enable tenants with zero income the opportunity to have permanent housing. As the tenants gain income, the Lafayette Housing Authority will adjust their rent accordingly.\n\nThis project has taken years to become a reality, but with the help of so many, it is now a permanent solution to ending homelessness for men and women in Tippecanoe County."
  },
  {
    "addressLine1": "P. O. Box #253",
    "city": "Decatur",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46733",
    "name": "Adams Wells Crisis Center Inc",
    "organization": "Adams Wells Crisis Center Inc",
    "phone": "(260) 728-9800",
    "website": "http://www.adamswellscrisiscenter.com/",
    "description": "Domestic violence shelter, short term."
  },
  {
    "addressLine1": "201 S Van Buren St",
    "city": "Monroe",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46733",
    "name": "Monroe United Methodist Church Bread of Life Food Pantry",
    "organization": "Monroe United Methodist Church Bread of Life Food Pantry",
    "phone": "(260) 692-6101",
    "website": "",
    "description": "Provides a food pantry the 2nd & 4th Tues 6:30 pm - 7:30 pm"
  },
  {
    "addressLine1": "801 Benham Avenue",
    "city": "Elkhart",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46516",
    "name": "Faith Mission of Elkhart",
    "organization": "Faith Mission of Elkhart",
    "phone": "(574) 293-3406",
    "website": "https://thefaithmission.org/",
    "description": ""
  },
  {
    "addressLine1": "132 State Street",
    "city": "Elkhart",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46515",
    "name": "Safe Haven",
    "organization": "Safe Haven",
    "phone": "(574) 830-5073",
    "website": "http://www.ywcancin.org/",
    "description": ""
  },
  {
    "addressLine1": "105 S Third Street",
    "city": "Goshen",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46526",
    "name": "Goshen Interfaith Hospitality Network",
    "organization": "Goshen Interfaith Hospitality Network",
    "phone": "(574) 534-2300",
    "website": "http://goshenihn.org/ihn-home/homeless-shelter",
    "description": ""
  },
  {
    "addressLine1": "500 East Walnut Street",
    "city": "Evansville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47713",
    "name": "Evansville Rescue Mission",
    "organization": "Evansville Rescue Mission",
    "phone": "(812) 421-3800",
    "website": "https://www.evansvillerescuemission.org/",
    "description": "24 hour help desk.\nCapacity of 222 beds\nThe Evansville Rescue Mission's Residence Center is the Tri-State's oldest and largest service provider for homeless men but offers emergency services for the general public as well.\n\n\nDespite this capacity, we do not turn any male (over the age of eighteen) away during times of inclement weather; specifically, between November 1st & March 31st and during the summer months when there are periods of excessive heat.\n\n\nIf you are employed while staying at the Evansville Rescue Mission, receive money for services;\nor receive pension, SSI, SSDI you will be required to pay program fees. Workers will have 30 days to provide two paystubs or an award letter. Failure to do so will result in possible no passes being issued or dismissal from the facility.\n\n\nWe will collect $5.00 per day from individuals who are working. This will help establish a payment history for residents when the leave the PACES or work program(s) of the ERM. Residents who receive Social Security, SSDI or SSI income will be required to pay 25% of their income.\nMeal served by faithful community volunteers. Each and every day (including holidays), not only our homeless guests, but the general public have the opportunity to visit the Residence Center for a meal. Meal times are offered as follows:\nBreakfast 6:30 to 7:00 a.m. Monday through Friday\nBreakfast 7:30 to 8:00 a.m. Saturday and Sunday\nLunch 12:00 to 12:30 p.m. Monday through Saturday\nLunch 12:30 to 1 p.m. Sunday\nDinner 5:30-6:00 p.m.\n"
  },
  {
    "addressLine1": "not disclosed",
    "city": "Evansville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47708",
    "name": "YWCA Battered Women's Shelter",
    "organization": "YWCA Battered Women's Shelter",
    "phone": "(812) 422-1191",
    "website": "https://www.ywcaevansville.org/what-were-doing/housing-programs/",
    "description": "battered women's shelter only.\n\nDomestic Violence Shelter\nThe YWCA opened Evansvilles first Domestic Violence Shelter in 1979. We never turn away a victim of domestic violence and her children. We believe that given a supportive environment free from abuse, victims of domestic violence are capable of developing their own strengths and abilities to manage their lives and the lives of their children. We maintain a crisis line and provide safe housing, transportation, clothing, and personal care items. Our 24-hour staff provides crisis counseling, information and referrals, goal planning, and self-sufficiency counseling. A Legal Advocate provides assistance with legal issues and counseling to both on- and off-site victims. Each child is assessed by the Childrens Advocate who provides counseling, and referrals. Other services include support groups, tutoring, parenting programs, and summer day camp."
  },
  {
    "addressLine1": "324 NW 6th Street",
    "city": "Evansville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47708",
    "name": "United Caring Shelter",
    "organization": "United Caring Shelter",
    "phone": "(812) 422-0297",
    "website": "https://www.unitedcaringservices.org/",
    "description": "Day shelter: serves 3 meals a day, 7 days a week. Night Shelter: 62 beds (men only) first come, first served. Transitional Housing (men only): 2 year program, Section 8 approved, Studio Apartment, Case Worker.\nWomen's Shelter 24 beds\nHomeless Medical Respite Program 6 beds (currently) hopeful for relocation/expansion in the works this year.\n\nDay Shelter\nWe offer the only Day Shelter services in Evansville. We serve over 300 hot meals a day, all prepared by our volunteers. We provide services for elderly, disabled, near homeless and homeless men, women and children.\nUnited Caring Services offers a place for people to get out of the elements and provides shower and laundry facilities (for which UCS supplies toiletries and laundry detergent), an address for receiving mail, clothing and a Bike to Work program (providing reconditioned bicycles to anyone who is employed or searching for employment and in need of transportation).\n\nThe Day Shelter is open from 8:00 am until 6:00 pm, seven days per week.\nOur Day Shelter works in conjunction with agencies such as Aurora, Inc., ECHO Community Health Center, the Veterans Administration, and Southwestern Indiana Behavioral Services, all of which provide outreach support for case management, physical health, and behavioral health.\n\nNight Shelter\nUnited Caring Services' Men's Emergency Night Shelter provides a safe and secure overnight haven for homeless men from 7:00 p.m. until 7:00 a.m. There are bunk beds in a dorm-type atmosphere. Every guest is required to shower at night. We have a curfew of 10pm and a wake up service for those who need to get to work on time in the morning. Personal belongings are limited to one bag on the bunk and a 40 gallon plastic tote for each man. These belongings are secure during the day when the Night Shelter is closed. Each guest is breathalyzed nightly upon entry; we have zero tolerance for alcohol use and/or illegal drug use.\nThe Night Shelter is full nearly every night of the year. All of the men in the Night Shelter have work details that they are responsible for completing; cleaning the Night Shelter and the bathrooms every morning, washing sheets and towels in the evening, cleaning the Kitchen and washing dishes after each meal and cleaning the Day Shelter after closing each day.\n\nWe strongly encourage our guests to stay for 180 days or less. We hope to acquire funding soon that will allow us to provide direct Case Management for the men in the Night Shelter. This service will provide the one on one support and encouragement they need to get employed, housed, and back on their feet.\n\nRuth's House Women's Shelter\nThe UCS Ruth's House Women's Emergency Night Shelter at 321 E. Walnut, offers a safe, clean, home like overnight shelter to 26 homeless women. Guests can begin checking into the Women's Shelter at 7:00 pm and must be in by 10:00 pm unless they have verified employment that keeps them out later. The Women's Shelter is always filled to capacity. Each guest has her own bed, closet space and dresser drawers in which to store personal belongings. UCS provides pillows, sheets, blankets and towels and personal hygiene items for each guest. All guests are breathalized , each night upon entry.\n\nTransitional Housing\nThe Transitional Housing Apartment Program has 21 studio apartments located on the third and fourth floors of our facility. We provide a residential setting with intensive Case Management, support and encouragement. Each apartment has a kitchen, bathroom, bedroom and living area.\nApplicants for this Program must meet strict guidelines prior to residency, including a criminal background check. The Evansville Housing Authority supplements the low income residents' rent through Section 8 funding.\nThe Program participants work closely with the Transitional Housing Case Manager to set goals and develop an Action Plan that will allow them to achieve those goals. While each individual has a unique Action Plan, we also offer general classes such as Personal Finance and Budgeting, Basic Computer Skills, Healthy Cooking on a Budget, and others that all Program participants are required to attend. We also provide access to counseling and classes that address relational issues, coping skills, assertiveness, anger management, substance abuse, stress management and spirituality/meditation.\nOur Transitional Housing Case Manager ensures that our Program participants have the tools, techniques and disciplines that they need to renew life sustaining personal relationships, be successful in obtaining and keeping gainful, full-time employment and securing permanent housing, in a maximum time frame of two years."
  },
  {
    "addressLine1": "1100 Read St",
    "city": "Evansville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47710",
    "name": "Ozanam Family Shelter",
    "organization": "Ozanam Family Shelter",
    "phone": "(812) 422-2214",
    "website": "https://www.ozanamfamilyshelter.org/",
    "description": "The Ozanam Family Shelter Corporation is a 501(c)3 non-for-profit organization providing families and single women with emergency temporary shelter.  Our programs are designed to provide residents with the necessary tools to aid in their struggle to identify and overcome the barriers that attribute to homelessness.  We also strive to assist residents in building and maintaining stronger support systems for themselves and their families as they regain their independence.\n\n\nSERVICES PROVIDED:\n    A Safe Bed to Sleep in\n    Case Management\n    Three Meals and Two Snacks Daily\n    Laundry Facilities\n    Computer Access\n    On-Site Agency Presentations\n        WorkOne\n        Purdue Extension\n        ECHO Healthcare\n        ARG"
  },
  {
    "addressLine1": "804 Clay Street",
    "city": "Henderson",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "42420",
    "name": "Harbor House Christian Center",
    "organization": "Harbor House Christian Center",
    "phone": "(270) 827-5010",
    "website": "https://www.facebook.com/pages/Harbor-House-Christian-Center/142619852450904",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 11242",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46856",
    "name": "YWCA Shelter for Women Victims of Violence",
    "organization": "YWCA Shelter for Women Victims of Violence",
    "phone": "(219) 447-7233",
    "website": "http://www.ywca.org/",
    "description": "Provides a Crisis Shelter For Women\nDomestic Violence Crisis Line at (260) 447-7233 or (800) 441-4073.\nWe are here to help 24 hours a day, 7 days a week.\n\nThe Crisis Shelter provides immediate crisis intervention 24 hours a day, 365 days a year, for women and men, with or without children, to escape a domestic violence situation. (Men are housed at a safe, off-site location.) Upon entering the shelter, clients are offered the following:\n    Safety\n    Food\n    Clothing\n    Personal care items\n    Transportation to and from appointments and work\n    Domestic violence education\n    Support groups\n    Help identifying options and resources\n    Assistance with referrals\n    Assistance navigating the legal system\n    Case management\n    Access to a computer lab\n    GED and job skills classes\n    Programs for children, including access to tutoring and a music therapist\n    Support groups\n    Physical and mental health evaluations and support\n\nYWCA Northeast Indiana's Domestic Violence Crisis Shelter provides a safe, nurturing environment for women and children to heal physically, emotionally and spiritually, thus empowering them to make decisions about the future.\n\nYWCA\nBusiness Office Hours:\nMonday- Friday\n8:00 a.m. 5:00 p.m."
  },
  {
    "addressLine1": "2021 Hobson Rd",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46805",
    "name": "The Lighthouse Biblical Recovery Center",
    "organization": "The Lighthouse Biblical Recovery Center",
    "phone": "2607605726",
    "website": "https://biblicalliferecoverycenter.com/",
    "description": "The Lighthouse is a 501 (c)(3) nonprofit located in Northeast Indiana. Our vision includes faith based residential addiction services, mentorship, consultation services, drug testing, and community training/education. We couldnt do what we do without our volunteers and supporters! You make our work possible. Thank you for your continued support of our mission."
  },
  {
    "addressLine1": "2021 Hobson Rd",
    "city": "Fort Wayne",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46805",
    "name": "Biblical Life Recovery Center Inc. / The Lighthouse",
    "organization": "Biblical Life Recovery Center Inc. / The Lighthouse",
    "phone": "2602556413",
    "website": "https://www.biblicalliferecoverycenter.com/",
    "description": "The Lighthouse is a faith based recovery program offering a 30 day, 6 month, and 2 year program. We also offer direction, support, and food to those in our community seeking help."
  },
  {
    "addressLine1": "455 Massachusetts St",
    "city": "Gary",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46402",
    "name": "The Rainbow Ark Shelter - Gary Commission for Women",
    "organization": "The Rainbow Ark Shelter - Gary Commission for Women",
    "phone": "(219) 886-1600",
    "website": "https://gary.gov/commission-on-women/",
    "description": ""
  },
  {
    "addressLine1": "2120 Broadway",
    "city": "Gary",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46407",
    "name": "Brother's Keeper Homeless Shelter",
    "organization": "Brother's Keeper Homeless Shelter",
    "phone": "(219) 882-4459",
    "website": "https://mybrotherskeeperinc.net/",
    "description": ""
  },
  {
    "addressLine1": "509 West Ridge Road",
    "city": "Gary",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46408",
    "name": "Missionaries of Charity Shelter Gary",
    "organization": "Missionaries of Charity Shelter Gary",
    "phone": "(219) 884-2140",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "792 McCool Rd.",
    "city": "Valparaiso",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46385",
    "name": "Gabriel's Horn Homeless Shelter",
    "organization": "Gabriel's Horn Homeless Shelter",
    "phone": "(219) 364-8018",
    "website": "http://www.gabrielshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "309 East Franklin Street",
    "city": "Greencastle",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "00000",
    "name": "Beyond Homeless Inc",
    "organization": "Beyond Homeless Inc",
    "phone": "(765) 301-9263",
    "website": "https://www.beyondhomeless.com/",
    "description": ""
  },
  {
    "addressLine1": "16 South Jackson Street",
    "city": "Greencastle",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46135",
    "name": "Family Support Services of West Central Indiana",
    "organization": "Family Support Services of West Central Indiana",
    "phone": "(317) 653-4820",
    "website": "https://fsswci.net/",
    "description": ""
  },
  {
    "addressLine1": "35 East Pierson Street",
    "city": "Greenfield",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46140",
    "name": "Hancock Hope House Inc",
    "organization": "Hancock Hope House Inc",
    "phone": "(317) 467-4991",
    "website": "https://www.hancockhopehouse.org/",
    "description": "Hope House operates 24-hours-a-day, seven-days-a-week. Our vision to self-sufficiency is finding long term solutions, allowing each individual and family an opportunity to create a plan of action that will lead them to a stable housing situation. Our program recommends a commitment of 30, 60, 90 or 120 days.\n\nWe do not charge any fees to any of our clients. Our clients do chores and other duties around the shelter. In addition, there are other guidelines that are required to be met during their stay with us. All of these guidelines are reviewed thoroughly at admission with each client.\n\nThe Hancock Hope House Homeless Shelter is a private 501c3 non-profit organization that serves the homeless population in Hancock, Shelby and Rush Counties.It is the only shelter for these three counties. In addition to shelter for individuals and families the Hancock Hope House provides food, clothing and life skills classes to the residents.\nAdmission Criteria\n    Be and remain Alcohol and Drug Free\n    Have a solid connection with Hancock, Henry, Rush and Shelby Counties\n    Have a current photo ID for a criminal warrant check\n    Have the ability to care for yourself\n    Have the ability to do general housekeeping duties for the shelter\n    Have the ability to seek and hold employment\n    Have no prior or current charges of violent offenses\n    Have no prior or current charges of sexual offenses\n    Must observe shelter curfews\n    Must adhere to staff recommendations  on achieving self-sufficiency\n    Must adhere to daily and weekly chore schedule\n    Must adhere to safety guidelines\n    Domestic abuse situations are referred to other providers\n    Must have letter of verification of homeless status"
  },
  {
    "addressLine1": "2716 E. Washington Street",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46142",
    "name": "Good News Mission",
    "organization": "Good News Mission",
    "phone": "(317) 638-2862",
    "website": "https://goodnewsministries.com/",
    "description": "Good News Mission\n317-638-2862\n2716 E. Washington St.\nIndianapolis, IN 46201\n\nGood News Family Shelter\n317-638-7094\n2801 E. Washington St.\nIndianapolis, IN 46201\n\nFive Stones Camp\n765-795-3722\n11707 S. County Road 300 W.\nReelsville, IN 46171\n\n\nChristian rescue mission providing food, shelter, clothing, medical care, educational opportunities and counseling for homeless men.\n\nGood News Men's Shelter\nWe provide shelter, serviceable clothing, medical care, educational or vocational training assistance and counseling as needed; however, our ULTIMATE purpose is to proclaim the Gospel and establish them in independent Christian living.\n\nGood News Family Shelter\nThe GOOD NEWS FAMILY SHELTER offers homeless families their own, fully furnished apartment with all the financial, educational, emotional, medical and spiritual support needed to make a complete recovery. These families may stay as long as they need.\nFamilies entering the program come with some combination of financial, legal, employment, addiction, relationship and educational problems that have brought them to this low point in their lives.\n\nOur goal is to reach these families with the Gospel and help them overcome their destructive behavior that makes successful independent living difficult or impossible.\n\nFive Stones Camp\nSituated on 145+ acres of wooded land in Reelsville, Indiana, Five Stones Camp provides an absolutely FREE residential camping experience to disadvantaged inner-city youth from all over the state of Indiana. The Five Stones program is a rigorous 40-day residential summer program that rescues troubled, low-income teenage boys, ages 13-18, from the negative influences of gangs, drugs, neglect and domestic violence and helps them become responsible, mature and independent young men through spiritual, educational and vocational training."
  },
  {
    "addressLine1": "1850 N Arsenal Ave",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46218",
    "name": "Family Promise of Greater Indianapolis",
    "organization": "Family Promise of Greater Indianapolis",
    "phone": "(317) 261-1562",
    "website": "https://www.fpgi.org/",
    "description": "Family Promise provides shelter and resources for homeless families through the following programs.\nInterfaith Hospitality Network\nThe Interfaith Hospitality Network (IHN) - Family Promise's core program - is a way for volunteers and congregations to address the challenge of family homelessness by using existing resources. The volunteers bring hospitality. Their service and in-kind congregational facilities makes it cost efficient. And with intensive case management from trained staff at the Day Center, lives are significantly impacted for the long term.\n\nApartment Shelter Program\nPioneering a new model for shelter that maximizes the dignity of the family.\n\n\n\n"
  },
  {
    "addressLine1": "1033 E. Washington St.",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46202",
    "name": "Horizon House",
    "organization": "Horizon House",
    "phone": "(317) 396-6342",
    "website": "https://www.horizonhouse.cc/",
    "description": "Day Shelter and Services Provided.\n\nHorizon House welcomes anyone who is homeless & strives to treat all neighbors with respect, dignity & hospitality.\n\nDay Room Hours:\nWe are open Monday, Tuesday, Thursday, Friday 7am to 3pm; Wednesday 7am to 12pm.\n\nDonations can be dropped off at our Front Desk; please enter door on Southeastern Ave.\n\n\nOn site we have basic needs such as showers, restrooms, automated laundry facility, mail delivery, food and more. Comprehensive services include medical & mental health care, job readiness training, legal services, housing and more.\n\nWe are Indianapolis' only day shelter and only secular homeless agency. We leave spirituality up to the individual."
  },
  {
    "addressLine1": "1537 N. Central Ave.",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46202",
    "name": "Dayspring Center Family Emergency Shelter",
    "organization": "Dayspring Center Family Emergency Shelter",
    "phone": "(317) 635-6780",
    "website": "https://dayspringindy.org/",
    "description": "Dayspring Center Emergency Shelter\nDayspring Center operates 24-hours-a-day, 7-days-a-week. Families seeking assistance at our emergency shelter are typically at a crisis stage, and require the compassionate care and support of our case management team. While the bare necessities of food, clothing and shelter are of critical importance to Dayspring residents, we realize we have to do more to break the cycle of homelessness. At Dayspring, we provide families devastated by homelessness the tools and resources they need to become an independent family again. With this goal in mind, Daysprings experienced case managers work with each family to develop a plan to help them address the underlying issues of their homelessness. When families are stabilized and ready to leave the emergency shelter facility, our services continue through the Follow-up Case Management program.\n\n\n\n\nAfter 27 years, Dayspring Center still remains one of the few emergency shelters that can address\n\nthe emergency and supportive needs of an entire family, including children of all ages, regardless of race, creed or circumstance. During a family's 45-60 day stay at Dayspring Center, providing the basics (nutritious meals, clothing and safe shelter) is important, but it is not enough to help families overcome their homelessness, permanently. It is our goal at Dayspring to empower homeless families an their children with the skills, resources and resolve to effect permanent change and achieve their goals for healthy family, independent living."
  },
  {
    "addressLine1": "540 N. Alabama Street",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46204",
    "name": "Salvation Army Women's Shelter",
    "organization": "Salvation Army Women's Shelter",
    "phone": "(317) 637-5551",
    "website": "https://centralusa.salvationarmy.org/indiana/women-and-childrens-center/",
    "description": "Operating Agency: Salvation Army Social Service Center\nHours: Office hours: Mon.-Fri. 8am-4pm; clients admitted and telephone service 24/7\n"
  },
  {
    "addressLine1": "540 Alabama St",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46204",
    "name": "The Salvation Army Family Service Center",
    "organization": "The Salvation Army Family Service Center",
    "phone": "(317) 637-5551",
    "website": "https://centralusa.salvationarmy.org/indiana/women-and-childrens-center/",
    "description": " The Salvation Army Shelter for Women and Children provides a safe place for homeless and abused women and children in perhaps their greatest time of need. Established as the first facility in Indianapolis to help homeless and abused women and children, we have offered care, assistance, and guidance to women for more than 50 years. The Center is open 24 hours a day, seven days a week. Our 111 bed facility features rooms for both single women and women with children.\n\nUpon admission to the Center, the needs of a woman and her children are assessed by a case manager. Immediate medical, nutritional, and shelter needs are met. Safety and security measures allow women to focus on rebuilding their lives free of danger, continued abuse and the uncertainty of the streets. Children learn and play in a warm and nurturing environment. See our wish list for items needed below.\n\nServices\n        Childrens services\n        Assistance with finding housing\n        Family budget counseling\n        Life skills training\n        Parenting and community resources classes\n        Employment information\n        Literacy\n        Legal assistance\n        Health care\n        Substance abuse classes\n        Domestic abuse support groups\n        Voluntary spiritual counseling and Bible study\n\nEmergency Bedspace Program , coordinated by the Salvation Army, ensures that a safe place and range of supportive services are always available for women and children escaping domestic abuse. Staff members monitor available Indianapolis area shelter space and provide daily updates to service providers. If shelters are full, families are sheltered at the Salvation Army until traditional bedspace becomes available.\n \nThe Continuing Support Program is offered to women and their children after they leave the program for independent or transitional housing. Case managers offer support, information, resources, financial assistance, referrals, and guidance towards self-sufficiency, so women may continue to develop positive relationships and healthy lifestyles."
  },
  {
    "addressLine1": "205 East New York Street",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46204",
    "name": "Wheeler Mission Ministries",
    "organization": "Wheeler Mission Ministries",
    "phone": "(317) 635-3575",
    "website": "http://wheelermission.org/",
    "description": "Wheeler Mission has nine different locations in Indianapolis and Bloomington. We offer homeless services, residential programs, and addiction recovery programs for men and women. We also have enterprises - Wheeler Mission Thrift Store, Wheeler Mission Pallets & Industry, and Restored Creations - that help fund our programs.\n\nWheeler Mission Ministries is a non-denominational, Christian, social services organization, which provides critically needed goods and services to the homeless, poor, and needy of central Indiana without regard to race, color, creed, national origin, or religion.\n\n\n\n\nWheeler is not a church, but does cooperate with many different churches that are concerned about poverty and homelessness in the inner city.\n\n\n\nFounded in 1893, Wheeler is the oldest continuously operating ministry of its kind in the state of Indiana."
  },
  {
    "addressLine1": "120 East Market Street",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46204",
    "name": "Redemption Outreach Service",
    "organization": "Redemption Outreach Service",
    "phone": "(317) 986-7714",
    "website": "http://www.ind-rosi.org/",
    "description": "Office hours:\nMondays through Fridays 8am to 5pm.\n\nWe provide Emergency housing to Indiana residents, who have been displaced or suffered a hardship. We are offer transition housing, for youths, out of foster care transitioning into adulthood.\nOur Program process begins with a full assessment of each individuals needs to develop and implementation of their, \"Individual Success Plan.\" This includes include, housing, training, work force development, life coaching with coping skills, family counseling and support to promote, a stable living condition and normalcy.\n\n \nOur facility with offer the occupants the following services:\n    Temporary housing for up to 90 days\n    Family Canceling: Life coaching and Coping Skills\n    Success Fundamental training\n    Career and Workforce Development\n    Finance Training\n    Food Pantry\n    Clothing and personal items give away"
  },
  {
    "addressLine1": "15755 Allisonville Road",
    "city": "Noblesville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46060",
    "name": "Third Phase",
    "organization": "Third Phase",
    "phone": "(317) 773-5100",
    "website": "http://www.thirdphase.org/",
    "description": "Hamilton County's Largest Shelter, Food, and Clothing Pantry\n\nProvides emergency shelter for Hamilton County residents referred by American Red Cross, Hamilton County; local fire department; Hamilton County Senior Services; Trustee; Churches; or HELPLINE. No drug testing is administered.\n\n\nEligibility: Individuals or families in need of emergency shelter. Youth 17 and younger must be accompanied by parent or guardian. Males four and younger may stay with their mothers on the women side. Males from 5-17 could not go to the shelter and could not be on the male side unless an older male relative was with him.\n\nIntake procedure: Requires a referral through Churches, Red Cross or Hamilton County Fire Dept., or HELPLINE. No drug testing is administered.Fees:None"
  },
  {
    "addressLine1": "2011 N Meridian St",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46202",
    "name": "Julian Center, Inc./ Sojourner",
    "organization": "Julian Center, Inc./ Sojourner",
    "phone": "(317) 941-2200",
    "website": "https://www.juliancenter.org/",
    "description": "Women's shelter only, Hotline/Crisis: 317-251-7575.\n\nFor individuals suffering from domestic violence, calling for help may be one of the most difficult calls they ever make. Yet, that phone call is only the beginning of the journey toward a violence free life. The Julian Center Shelter can be your bridge between the life you want to leave behind and your hope for a new beginning.\n\n\nOur transitional housing program, called New Life Transitional Housing, is a continuum of services available to survivors of domestic violence and sexual assault who need a bridge to self-sufficiency and permanent housing. If you need help making the transition, our transitional housing might be right for you.\n\nShelter\nFor individuals suffering from domestic violence, calling for help may be one of the most difficult calls they ever make.  Yet, that phone call is only the beginning of the journey toward a violence free life.  The Julian Center Shelter can be your bridge between the life you want to leave behind and your hope for a new beginning.\n \nDo you need help?\nSomeone is waiting to answer your call 24 hours a day.  Simply pick up the phone and dial (317) 920-9320.\n \nWhat can you expect?\nLeaving your home and moving into a shelter can be frightening.  We understand that.  Not knowing what to expect might be keeping you from making the call.  Please, dont let it.  Let us help. "
  },
  {
    "addressLine1": "976 West 29th Street",
    "city": "Indianapolis",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46208",
    "name": "WOW - Women of Worth Transition Home",
    "organization": "WOW - Women of Worth Transition Home",
    "phone": "(317) 223-1752",
    "website": "mailto:wwwwomenofworth976@yahoo.com",
    "description": "Providing a safe environment for women in crisis and the necessary resources to build strong and healthy lives for six women to live in the house"
  },
  {
    "addressLine1": "418 South 18th Street",
    "city": "New Castle",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47362",
    "name": "Christian Love Help Center Women's Shelter",
    "organization": "Christian Love Help Center Women's Shelter",
    "phone": "(765) 624-8659",
    "website": "https://www.facebook.com/pages/Christian-Love-Center/326306500714259",
    "description": "Office Hours Mon - Sun:    7:00 AM - 4:30 PM\nShelter intake: Daily 24 hours"
  },
  {
    "addressLine1": "1500 S Meridian Rd",
    "city": "Jasper",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47546",
    "name": "Crisis Connection",
    "organization": "Crisis Connection",
    "phone": "(812) 482-1555",
    "website": "https://crisisconnectioninc.org/",
    "description": "Women's shelter only, Hotline/Crisis: 812-357-2200, Toll Free #: (800)245-4580\n\nDirect Client Services\n24-Hour Hotline; Crisis Intervention/Counseling; Follow-up Contact; Safety Planning.\nAssistance with Filing Protective Orders; Victim impact Statements; Victim Notification Rights; Address Confidentiality; Information and Assistance with Violent Crime Compensation Forms; and Safe Housing Options.\n\nAccess to Regional Shelters; Limited Emergency Transportation; Support Groups; and access to a Sexual Assault Response Team that includes an exam performed by a Sexual Assault Nurse Examiner (SANE).\nPersonal Advocacy; Law Enforcement Advocacy; Medical Advocacy; Legal/court Advocacy including support at hearings, interviews. Trials, information about the criminal justice process, and information regarding case and/or arrest status via the prosecutor.\nProvide information/referral for Food; Rent Assistance; Back-to-School Supplies; Services to the Deaf; Emergency Translation Services; Pet Care Programs as appropriate.\nProvide Client-Specific Handbook; 911 Phones; Personal Care Items; Household Supplies; and other Victim Assistance Services as needed.\nAll direct services provided to clients are confidential."
  },
  {
    "addressLine1": "1727 DL Motley Way",
    "city": "Jeffersonville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47130",
    "name": "Catalyst Rescue Mission",
    "organization": "Catalyst Rescue Mission",
    "phone": "(812) 285-1197",
    "website": "https://catalystrescuemission.org/",
    "description": "We provide fresh coffee, hot showers, a place for our clients to receive personal mail and phone calls, and hygiene products.\n\nThose who seek emergency shelter at Catalyst are encouraged to take the next step on the road to permanent housing. Job and housing counselors connect our clients to new opportunities, help them identify barriers to self-sufficiency, and connect them to our case management team as they move forward.\n\n\nOur mission at Catalyst is to identify barriers to housing and to eliminate them. This means that our case manager will be working with our clients on getting identification cards, birth certificates, and social security cards. Our goal is to work through past evictions and help our clients pay the debts they owe. This means obtaining disability, SSI, a part-time job, or a full-time job is a must.\n\nCatalyst will work with potential landlords to match our clients with the housing options that are best for them. Through our partnerships with the New Albany Housing Authority and Jeffersonville Housing Authority, we seek housing permanency for all our clients."
  },
  {
    "addressLine1": "733 E Jefferson St",
    "city": "Louisville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "40202",
    "name": "Re-Center Ministries Louisville Campus",
    "organization": "Re-Center Ministries Louisville Campus",
    "phone": "(502) 583-6543",
    "website": "https://recenterministries.org/",
    "description": "Drop-In Program\n"
  },
  {
    "addressLine1": "432 E. Jefferson Street",
    "city": "Louisville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "40202",
    "name": "Wayside Christian Mission Shelter",
    "organization": "Wayside Christian Mission Shelter",
    "phone": "(502) 584-3711",
    "website": "http://www.waysidechristianmission.org/",
    "description": "Men's Adult Day Shelter\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711\nHours: 7:00 am - 6:30 pm\nAccommodations: 75 person capacity\n\nMen's Emergency Shelter\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711\nAccommodations: 331 spaces for single males\n \nMen's Permanent Supportive Housing\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711     Accommodations: 30 private apartments for homeless, men with mental or physical disabilities.\n\nSingle Women's Emergency, Transitional and Day Shelter\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711     (8:00 am - 5:00 pm, Day Shelter Only)\nAccommodations: 106 emergency beds, 11 transitional beds\n\nFamily Emergency Shelter\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711     Accommodations: 50 beds\n\nSafe Haven for Women\n432 E. Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711\nAccommodations: 10 emergency beds for homeless, mentally ill women.\n\nWomen's Permanent Supportive Housing\n432 East Jefferson Street\nLouisville, KY 40202\nTelephone: (502) 584-3711\n"
  },
  {
    "addressLine1": "1020 W Market St",
    "city": "Louisville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "40202",
    "name": "The Healing Place",
    "organization": "The Healing Place",
    "phone": "(502) 585-4848",
    "website": "http://www.thehealingplace.org/",
    "description": "Now a nationally-recognized recovery program for men and women, The Healing Place was founded in 1989 as a homeless shelter and medical clinic for men. Every day we provide food, clothing, and shelter at no cost to more than 600 clients seeking help for their addictions.\n\nDetox\nThe primary purpose of Detox is to detoxify and stabilize the individual from drugs and/or alcohol.\nThe secondary function of Detox is to prepare him or her to participate in the Recovery Program and to a life in recovery. Here they begin to identify a common problem and a common solution.\n\nDuring their stay, we supply clients with food, shelter and clothing; familiarize them with the Twelve Steps of Alcoholics Anonymous and Narcotics Anonymous; talk to them about withdrawal; and orient them to The Healing Places unique program.\n\nOff the Streets\nClients accepted into The Healing Place's Recovery Program begin their Off the Streets (OTS) expeirence in the OTS - Safe Haven portion of the program. During this 14 day period, clients feel more protected by remaining on The Healing Place property, except for court dates and medical appointments. During this time, clients attend approximately 80 classes and 12 Step meetings while they become acclimated to The Healing Place environment. OTS Safe Haven clients are housed with OTS clients and begin bonding with those who have already begun the motivational phase of The Healing Place Recovery Program.\n\nOTS is the motivational phase of the recovery program of The Healing Place. Once in the long-term residential program, clients work with peers in similar circumstances to motivate one another to adopt social skills and to learn core principles central to Alcoholics Anonymous and Narcotics Anonymous programs.\n\n\nOur OTS program is where clients come to understand the concept of the physical allergy. Day classes are held off campus at the Healing Centers at 4th and St. Catherine (men) as well as 15th and Kentucky (women). These classes are where clients begin accepting their self-centered-disease problem and its spiritual solution. Our clients also learn the basics of responsibility and move away from a \"street\" mentality. Along the way, they make a commitment to the solution.\n\nThe Recovery Stage\nThe Recovery Stage (Phase I) is where clients learn how to apply the 12 Steps of Alcoholics Anonymous and Narcotics Anonymous in their lives with the program curriculum. This curriculum consists of classes and written assignments. All clients are assisted through the process by Peer Mentors, which are men and women who have completed the program.\nThe first part of this stage stresses personal accountability being on time for classes and meetings, completing job assignments, etc. and encourages clients to look at their own behavior. This is facilitated at the Community meeting.\nThe second part focuses on interpersonal skills, stressing concern and accountability for others in the program. This is achieved through role modeling, holding peers accountable for their actions, and by giving support to others.\n\nPeer Mentors\nPeer Mentors are men and women who have completed the program.\nThey volunteer to serve as leaders and role models for those who are newer in the program. Peer mentors teach classes, monitor assignments, coordinate job assignments and work one-on-one with people who are moving through the recovery process. Peer mentors demonstrate The Healing Place philosophy that the best solution is one alcoholic/addict reaching back to help another along the journey to recovery.\n\nOvernight Shelter\nThe Overnight Shelter provides meals and a safe place for homeless men and women. It is designed with few barriers and rules in order to allow as many overnight guests as possible. Both men's and women's overnight shelters are \"wet,\" i.e. a man or woman may spend the night while under the influence of alcohol and/or drugs.\nEmphasis is placed on role modeling positive change for the overnight guests to demonstrate that people can change their lives and get off the streets."
  },
  {
    "addressLine1": "911 South Brook Street",
    "city": "Louisville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "40203",
    "name": "The Salvation Army Center of Hope Shelter",
    "organization": "The Salvation Army Center of Hope Shelter",
    "phone": "(502) 671-4904",
    "website": "https://www.salvationarmylouisville.org/",
    "description": "We offer a Day Shelter and an Overnight Shelter. Shelter Reservations in the Louisville Community for overnight are done with one point of entry via the Coalition for the Homeless (502) 637-2337 (https://louhomeless.org/contacts/) The Single Point of Entry staff takes calls seven days a week from 10 a.m. to 4 p.m.\nCheck in is at 5:15 p.m. for women and 6:00 p.m. for men each night.\n"
  },
  {
    "addressLine1": "927 South 2nd Street",
    "city": "Louisville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "40201",
    "name": "The Center For Women and Families MD Campus",
    "organization": "The Center For Women and Families MD Campus",
    "phone": "(502) 581-7200",
    "website": "https://www.thecenteronline.org/",
    "description": "The Center for Women and Families provides services for victims of domestic abuse, sexual assault, spousal abuse, dating violence, and offers family therapy in Louisville, Kentucky and Southern Indiana. The Center for Women and Families helps survivors through supportive services, community education and cooperative partnerships that foster hope, promote self-sufficiency and rebuild lives.\n\nOriginally part of the YWCA, The Center for Women and Families has been serving our community since 1912. Today The Center is a private nonprofit organization with 6 regional locations serving 10 Kentuckiana counties: Bullitt, Henry, Jefferson, Oldham, Shelby, Spencer and Trimble counties in Kentucky and Clark, Floyd and Harrison counties in Indiana."
  },
  {
    "addressLine1": "927 S 2nd St",
    "city": "Louisville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "40203",
    "name": "The Center for Women and Families",
    "organization": "The Center for Women and Families",
    "phone": "(502) 581-7200",
    "website": "https://www.thecenteronline.org/",
    "description": "Emergency shelter is for people who ultimately lack a safe place away from an intimate partner abusing them or their families.\n\n    People (women/men/non-binary) and their dependent children who are fleeing an abusive situation are eligible for shelter as it is available.\n\n    We do not deny services or emergency shelter on the basis of gender identity, sexual orientation, disabilities, citizen status, or religious affiliation. We will do our absolute best to accommodate each persons specific needs.\n    You DO NOT need to file an emergency protective order in order to be eligible for emergency shelter."
  },
  {
    "addressLine1": "702 E Market Street",
    "city": "New Albany",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47150",
    "name": "St. Elizabeth Catholic Charities",
    "organization": "St. Elizabeth Catholic Charities",
    "phone": "(812) 949-7305",
    "website": "https://www.stecharities.org/",
    "description": ""
  },
  {
    "addressLine1": "1436 South Shelby Street",
    "city": "Louisville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "40217",
    "name": "Halfway Back Men's Addiction Recovery Program - Louisville",
    "organization": "Halfway Back Men's Addiction Recovery Program - Louisville",
    "phone": "(502) 635-4530",
    "website": "https://www.voamid.org/halfwayback",
    "description": ""
  },
  {
    "addressLine1": "710 S. 31st Street",
    "city": "Louisville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "40211",
    "name": "Rhonda's Another Chance, Inc. - Transitional Housing",
    "organization": "Rhonda's Another Chance, Inc. - Transitional Housing",
    "phone": "(502) 776-8830",
    "website": "mailto:rhondahouse710@att.net",
    "description": "Transitional home; accommodates four single, homeless women who may reside at Rhonda's for six months to a year.\n\nWomen are accepted from any life-change situation: recovery from drugs/alcohol, job lost or a painful experience of divorce. Mission is to guide women toward permanent lifestyle change and self-dependency and to lend a hand to any woman who requests our assistance."
  },
  {
    "addressLine1": "1624 South Preston Street",
    "city": "Louisville",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "40217",
    "name": "Women In Circle",
    "organization": "Women In Circle",
    "phone": "(502) 690-2010",
    "website": "http://mindfuldirection.net/womenincircle/",
    "description": ""
  },
  {
    "addressLine1": "321 W Mulberry St",
    "city": "Kokomo",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46901",
    "name": "Kokomo Rescue Mission",
    "organization": "Kokomo Rescue Mission",
    "phone": "(765) 456-3838",
    "website": "http://www.kokomorescuemission.org/",
    "description": ""
  },
  {
    "addressLine1": "618 S Main St",
    "city": "Kokomo",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46901",
    "name": "Family Service Association of Howard County",
    "organization": "Family Service Association of Howard County",
    "phone": "(765) 457-9313",
    "website": "http://www.fsahc.org/",
    "description": "Services\n24 hour crisis hotline 1-800-725-8177 or 765-868-3154\nAdvocates trained in crisis intervention are available 24 hours a day, 7 days a week to answer questions and assist in crisis intervention.\n\n45 day Crisis Shelter\nShelter Care is offered for 45 days to those who are seeking safety from violence. The Shelter is only a crisis intervention program, not a long term program. After the end of 45 days, clients must either enter another program or enter permanent housing.\n\nTransitional Housing Program\nThe Domestic Violence Program has several scatter-site apartments that provide housing for victims for up to twelve months while they are transitioning out of shelter care. There is limited availability for the Transitional Housing Program and all"
  },
  {
    "addressLine1": "625 North Union St",
    "city": "Kokomo",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46901",
    "name": "Coordinated Assistance Ministries Inc",
    "organization": "Coordinated Assistance Ministries Inc",
    "phone": "(765) 452-8963",
    "website": "https://camhope.org/",
    "description": "Coordinated Assistance Ministries, Inc. in Kokomo, Indiana, which works with homeless, and keeping people and families from becoming homeless.\n\nThe Drop In Center\nThe Drop In Center is a day shelter for the homeless and near homeless. We see over one thousand people a year. There is a home like atmosphere as one walks into the Center. The Lobby has comfortable chairs and a TV. A volunteer greets people and answers the phone.\n\nThere is a home like atmosphere as one walks into the Center. The Lobby has comfortable chairs and a TV. A volunteer greets people and answers the phone. The kitchen always has a pot of coffee, drinks and snacks donated by the community.\n\n\nAt night, the Drop-In Center shelters up to 5 men who sleep on mats on the floor when we close, who have no where else to go.\n\nBill Hudson Project\nThe Project consist of 6 Beds available to single men for $5 a night. There is a live-in night supervisor. The BHP opened March 2007 and 52 men were housed in the first year.\nBesides Beds there is a common living room, dining room, kitchen and storage room.\n\nThe Family Hope Center\nThis is one of a few Family Emergency Shelters in Indiana. The goal is to keep Families together during a time of desperate vulnerability.\n\n\n\nThe Mission of Coordinated Assistance Ministries is to unify the assistance ministries of the religious community, show God's love, and meet needs not being met by Community Agencies. CAM, Inc. is about helping people to meet their own goals in life - with others, their work, education, and housing.\n\n\nWe are a place where caring people have the opportunity to reach out and help others. CAM Inc. operates The Drop In Day Shelter, Bill Hudson Project for men, Familly Hope Center. emergency shelter for families; Serena House, for young women ages 18-25."
  },
  {
    "addressLine1": "805 Spencer Street",
    "city": "Logansport",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46947",
    "name": "Emmaus Mission Center",
    "organization": "Emmaus Mission Center",
    "phone": "(574) 739-0107",
    "website": "http://www.logan-emmaus.org/",
    "description": "The Emmaus Mission Center is a 501(c)3, non-profit, multi-denominational social service agency that was established to provide support for marginalized families and individuals within a fifty-mile radius of Cass County, Indiana.\n\n"
  },
  {
    "addressLine1": "423 S. Gallatin Street",
    "city": "Marion",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46952",
    "name": "Grant County Rescue Mission",
    "organization": "Grant County Rescue Mission",
    "phone": "(765) 662-0988",
    "website": "http://grantcountyrescuemission.com/",
    "description": ""
  },
  {
    "addressLine1": "P.O.Box 1045",
    "city": "Michigan City",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46360",
    "name": "Stepping Stone Shelter for Women",
    "organization": "Stepping Stone Shelter for Women",
    "phone": "(219) 879-4615",
    "website": "http://www.steppingstoneshelter.org/",
    "description": "he Stepping Stone Shelter for Women\n \nProviding those who are victims of domestic violence, services including 24/7 crisis lines & intervention, temporary shelter, clothing & food, transitional housing, counseling, support groups, and advocacy.\n \nMission\nWe, the members of The Stepping Stone Shelter for Women, alert to the problems of domestic violence existing at all socioeconomic levels in American society and, perpetuating itself from generation to generation, associate ourselves to work toward its elimination and, in particular, to offer refuge and services to its victims in our area.\n \nCompany Overview\nThe Stepping Stone Shelter for Women, Inc. attempts to respond constructively to the victims of domestic violence and to assist them in living within the community without violence.\n \nDescription\nIt is the philosophy of The Stepping Stone Shelter for Women, Inc. that family violence is a complex and serious problem, not only to the individual family involved, but also for the community. We view the problem as cyclical in nature; the solution requiring that the intervention process be one of education and understanding by each mate as to why the family, as a unit, is in trouble.\n\nStepping Stone is an emergency shelter for women and their underage children who are victims of domestic violence and/or sexual assault. Services are confidential and include:\n       Temporary Shelter\n       Clothing and Food\n       Crisis Intervention\n       Legal Advocacy\n       Support Groups\n       One to One Support\n       Rape Recovery Support\n       Essential Transportation\n       24 hour staffing and hotline.\n       \"The Bridge\" Transition Housing (details below)"
  },
  {
    "addressLine1": "1005 West 8th St",
    "city": "Michigan City",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46360",
    "name": "Sand Castle Shelter for Homeless Families",
    "organization": "Sand Castle Shelter for Homeless Families",
    "phone": "(219) 879-2552",
    "website": "http://www.sandcastleshelter.org/",
    "description": "30 day emergency shelter for LaPorte County families with children. Drug & alcohol free. Families must be pro-active in finding & maintaining stable housing. Life skills classes required.\n\nSand Castle offers temporary shelter to LaPorte County families: primarily single moms with children; sometimes families headed by couples or dads, too. When space is available, we accept single women. All family members must test free of drugs and alcohol.\n\n    Single men are referred to the Faith Community Mens Overnight Shelter.\n    Domestic violence victims are referred to Stepping Stone Shelter for Women.\nThose that are from other counties and those with alcohol, substance abuse or debilitating mental illness are referred to other agencies equipped to help with those issues.\n\nHow We Serve Them\n    We can accommodate seven families, each in a private room\n    The average stay is six weeks\n    Children attend the schools they were in before housing loss\n    Clients must leave the building Monday thru Friday, 9 AM to 2:30 PM to work, seek work, apply for assistance or look for an affordable apartment\n    Each adult completes daily chores to keep the property neat and clean\n    A case manager meets with each family daily, to set goals, measure progress, affirm efforts, provide information about other helpful programs and talk through obstacles.\n\nStaff persons offer a listening ear and provide empathy and encouragement\nFamilies must observe a 9 PM curfew, unless working later\n75% of income earned during their stay must be saved toward future housing\nSkill building classes (at Grace Learning Center) are required:\n    Landlord Tenant law\n    Nutrition & Cooking\n    Get the Job, Keep the Job\n    Health Notebook\n    Green Cleaning on a Dime\n    Healthy Relationships\nWe respect the privacy of our residents and never reveal any information unless specifically authorized to do so by the resident."
  },
  {
    "addressLine1": "516 Decatur St",
    "city": "Michigan City",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46360",
    "name": "Interfaith Community PADS - Winter Seasonal Shelter",
    "organization": "Interfaith Community PADS - Winter Seasonal Shelter",
    "phone": "(219) 276-7582",
    "website": "http://www.interfaithcommunitypads.com/",
    "description": "Emergency shelter program is currently geared for the winter season beginning on October 15th to April 15th.\n\n"
  },
  {
    "addressLine1": "2102 Calumet Avenue",
    "city": "Valparaiso",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46383",
    "name": "New Creation Men's Center",
    "organization": "New Creation Men's Center",
    "phone": "(219) 548-3548",
    "website": "https://newcreationempowers.org/",
    "description": "Office Hours\nMonday - Friday: 8am - 4pm\nSaturday - Sunday: 7am - 10am\n \nWe are open to single men experiencing homelessness who are from, work, or have family in Porter County.  Each guest will need to pass a drug and alcohol screen.  Also, a criminal background check will be done.  We can not take registered sex offenders."
  },
  {
    "addressLine1": "2001 Calumet Ave.",
    "city": "Valparaiso",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46383",
    "name": "Spring Valley Homeless Shelter",
    "organization": "Spring Valley Homeless Shelter",
    "phone": "(219) 548-2800",
    "website": "http://housing-opportunities.com/",
    "description": "Spring Valley provides transitional housing for homeless families in Porter County.\n\nHOUSING FOR THE HOMELESS\nHousing Opportunities has several housing programs designed to help individuals and families who are ready to move from inhabitable conditions to safe housing.  Our housing for the homeless programs provide affordable, safe apartments where individuals and families gain the personal and economic empowerment needed to break the cycle of homelessness.\n\n Temporary Housing Program - This program has 16 units located in Valparaiso.  Individuals/families are able to reside here for 30-120 days. This program gives the individual/family a chance to get off the streets and receive customized support services that address their needs.  This program is open to current Porter County residents who qualify.  The first step in applying for this program is to call or stop by the office to start the application process. \n\n \n      Permanent Housing Program - This program has units in Portage and Michigan City.  This program provides individuals/families an affordable permanent option while seeking assistance to improve their lives along with the training and skills necessary to succeed in the community.  Residents are offered classes that focus on budgeting and credit repair, case management, and employment services.  This program is open to current Porter and LaPorte County residents who are currently homeless and where the head of household has a diagnosed disability. \nWith both of these programs, a case manager will work with residents to enable their return to the community as self-reliant citizens.  These programs also offer job preparation skills and training, money management training, self-help programs, support groups, individualized support services and treatment programs as needed. \n"
  },
  {
    "addressLine1": "2001 Calumet Avenue",
    "city": "Valparaiso",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46383",
    "name": "Housing Opportunities Housing For Homeless",
    "organization": "Housing Opportunities Housing For Homeless",
    "phone": "(219) 548-2800",
    "website": "https://hoi.help/",
    "description": "Housing Opportunities has several housing programs designed to help individuals and families who are ready to move from inhabitable conditions to safe housing. Our housing for the homeless programs provide affordable, safe apartments where individuals and families gain the personal and economic empowerment needed to break the cycle of homelessness.\n\nDayspring Women's Program\nThis program is our day program for women and their children who are experiencing homelessness or who are at risk of homelessness.  Guests can come as often as they like for services, support, and resources to help break the cycle of homelessness.  Services offered include case management, daily groups, shower and laundry facilities, kitchen and meals, as well as employment services.  For more information on this program please contact Program Manager, Aly Gibbons, at 219-510-5432. \n\nWomen's Overnight Shelter\nThis program is open year round and serves up to 8 homeless single women 7 nights a week.  The shelter is available to those women who qualify and utilize our Dayspring Women's Program.\n \nTemporary Housing Program\nThis program has 16 units located in Valparaiso.  Individuals/families are able to reside here for 30-120 days. This program gives the individual/family a chance to get off the streets and receive customized support services that address their needs.  This program is open to current Porter County residents who qualify.  The first step in applying for this program is to call or stop by the office to start the application process. \n \nPermanent Housing Program\nThis program has units in Portage and Michigan City.  This program provides individuals/families an affordable permanent option while seeking assistance to improve their lives along with the training and skills necessary to succeed in the community.  Residents are offered classes that focus on budgeting and credit repair, case management, and employment services.  This program is open to current Porter and LaPorte County residents who are currently homeless and where the head of household has a diagnosed disability. \nWith both temporary and permanent housing programs, a case manager will work with residents to enable their return to the community as self-reliant citizens.  These programs also offer job preparation skills and training, money management training, self-help programs, support groups, individualized support services and treatment programs as needed. "
  },
  {
    "addressLine1": "Address Witheld",
    "city": "Valparaiso",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46383",
    "name": "The Caring Place Domestic Violence Shelter",
    "organization": "The Caring Place Domestic Violence Shelter",
    "phone": "(800) 933-0466",
    "website": "http://thecaringplacenwi.org/",
    "description": "For help - Call The Caring Place 24 HOUR CRISIS LINE:\nLocal: 219.464.2128\nToll-free Long Distance: 1.800.933.0466\n\nThe Caring Place, Inc. provides service and shelter for victims of violence and their children. Through education and awareness, we empower all members of our community to live in peace.\n\nProvides:\nSafe shelter for both men and women and their dependent children who are victims of domestic violence and sexual assault.\n\nA Womens Recovery Program in collaboration with Porter-Starke Services, providing housing and case management for women suffering from addiction.\n\n\nAn Emergency Response Volunteer (ERV) program, where staff and volunteers assist victims of rape and violence through the initial stages of trauma at a hospital or clinic.\n\nCommunity educational programming on domestic violence and sexual assault, teen dating violence, and workplace violence.\n\nAll services are confidential and free of charge."
  },
  {
    "addressLine1": "1005 North Campbell Street",
    "city": "Valparaiso",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46385",
    "name": "Dayspring Women's Center",
    "organization": "Dayspring Women's Center",
    "phone": "(219) 510-5432",
    "website": "http://www.dayspringvalpo.org/",
    "description": "Women's Services\nDayspring Offers:\n    Case Management, Information, and Referral Services\n    Group Classes\n    Counseling\n    Optional Spiritual Counseling\n    Lunch for Women Who Participate in the Day Program\n    Mailing Address\n    Computers for Job Search and Resume Creation\n    Phones\n    Lockers\n    Laundry Facilities\n    Showers\n\nNight Shelter For Women\nEvery night for the colder half of the year (Oct. 15 to Apr. 15) churches provide overnight shelter for women, including dinner and breakfast. The location rotates from church to church each night.  They call this the Open Arms Women's Shelter. Intake is handled by Dayspring Women's Center, a day center for women who are homeless or at risk of homelessness.  They can be reached at 219-510-5432.\n"
  },
  {
    "addressLine1": "P.O. Box 734",
    "city": "Muncie",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47308",
    "name": "A Better Way",
    "organization": "A Better Way",
    "phone": "(317) 747-9107",
    "website": "https://abetterwaymuncie.org/",
    "description": "24 hour Crisis Line for anybody in Crisis\n\n\n\n765-288-HELP (4357)\n\n\n\n\nA Better Way provides shelter and services for victims of domestic violence, transitional housing, advocacy for victims of sexual assault, a 24 hour crisis line for persons in any type of crisis, AOK afterschool programs, a suicide hotline, bullying, teen dating violence and domestic violence prevention programs, and a check-in call service for elderly or disabled homebound persons.\nTRANSITIONAL HOUSING\n\nPassage Way is a transitional housing project that will allow victims of domestic violence and their children, after staying at a Better Way, to have safe, adequate housing for a period of time long enough to find security, stability and peace in their lives.\n\nAt Passage Way, we intend to provide support to residents, but not to carry the whole load. There will be expectations of participation in programs that will lead them to success and self-sufficiency. Their children will participate in programs as well.\n\n\nWhile there, residents will gain home-making, decision-making, budgeting and other skills that will ready them to succeed on their own following their exit from the program. Their children will have received guidance on how to better manage their emotions and to peacefully resolve conflict. They will gain social skills and in turn improve academically, due to a reduction of the turmoil in their lives.\n\nThose dedicated to making positive change in their lives and willing to work for it will have a great opportunity for success.\n"
  },
  {
    "addressLine1": "1725 S Liberty St",
    "city": "Muncie",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47302",
    "name": "Muncie Mission",
    "organization": "Muncie Mission",
    "phone": "(317) 288-9122",
    "website": "https://www.munciemission.org/",
    "description": "Muncie Mission Ministries is a faith-based, not-for-profit agency that has brought hope to the poor, needy and homeless in East Central Indiana for 80 years. Our primary services are provided in a Christ-centered environment designed to provide basic needs and teach life skills, while guiding our residents through various problems that have brought them to our doorstep. Our recovery program is centered on spiritual healing and enrichment.\nMens Services\nThe heart of the Mission is our faith-based Mens program, a refuge for men experiencing the chaos of addictions and/or homelessness. They find temporary shelter as well as the opportunity to experience a year-long, 12-step program that provides counseling, education, and skill development as they rebuild their lives.We provide:\n    EMERGENCY SHELTER\n    RECOVERY\n    TRANSITIONAL LIVING\n\nIn addition, short-term emergency care is available and guests can stay up to four weeks without committing to long-term recovery.\nALL MEN ARE WELCOME.\nMen's Program\n\nResidents going through the recovery program meet with their specific recovery groups weekly.\n\n\nWomens Services\nMuncie Mission expanded its services to women with the Womens Transitional Housing, giving women struggling with homelessness a chance to rebuild and refocus their lives through this 6-18 month program.\n\nFamily Services\nThe services we provide to the community include aiding families with food, clothing and household items to those in need.\n\nCommunity Lunches\nWe serve a free lunch Monday through Friday at 12:30.\n\n"
  },
  {
    "addressLine1": "310 E. Charles St.",
    "city": "Muncie",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47305",
    "name": "YWCA of Muncie",
    "organization": "YWCA of Muncie",
    "phone": "(765) 284-3345",
    "website": "https://ywcacentralindiana.org/",
    "description": ""
  },
  {
    "addressLine1": "401 E. Main Street",
    "city": "Muncie",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47308",
    "name": "Christian Ministries of Deleware County Family Shelters",
    "organization": "Christian Ministries of Deleware County Family Shelters",
    "phone": "(765) 288-0601",
    "website": "http://www.christianministriesmuncie.org/",
    "description": "Office hours: Mondays through Fridays 8:30am to 1pm.\n\nShelters\nOur Family Shelters are located at 401 E. Main Street in downtown Muncie. Family Shelters provide a safe environment for families to stay in as they find and retain permanent housing. Our Family Shelters consist of one efficiency apartment and four rooms that share a kitchen and bathroom, in which families may stay up to 45 days. Our Outreach Specialist and Executive Director work with the families to help them find housing, and to get them connected to other services in the community.\n\nThe Mens Sleeping Room is located at 403-1/2 E. Main Street in downtown Muncie. This shelter for single men is open each evening from 6 p.m. to 8 a.m. between October and April. Single men are provided a warm, safe area where they can take showers, receive a warm dinner and breakfast, and receive clean clothes.\n\nFood Pantry\nChristian Ministries has the largest Food Pantry in Delaware County. Open four days a week, the pantry provides staples, meat, and when available, fresh fruits and vegetables. Christian Ministries also provides vouchers for High Street United Methodist Church and Grace Lutheran Food Pantries.\n \n    CMDC's food pantry serves an estimated 212 families each month, impacting over 420 individuals.\n\n    U.S.D.A. Commodities are available to eligible households.\n    Eligibility is based upon the number in the household.\n \nFood Pantry Hours:  Tuesday 10 a.m. to 12:30 and Wednesday - Friday\n9 a.m. to 12:30 p.m.\n \nThe Food Pantry is located at 401 E. Main St. Muncie.\n \n"
  },
  {
    "addressLine1": "15 S 11th St",
    "city": "Richmond",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47374",
    "name": "YWCA - Genesis Shelter",
    "organization": "YWCA - Genesis Shelter",
    "phone": "(765) 935-3920",
    "website": "mailto:schoolagh2020@gmail.com",
    "description": "Women's shelter only, Hotline/Crisis: 317-935-5824, Toll Free #: (800)886-4508.\n\nThe YWCA Genesis assists in ending the cycle of abuse. Provide shelter, advocacy and counseling for victims of domestic violence, sexual assault and homelessness. Services include temporary housing, Support Groups, Victim Advocacy, Community Counseling. Crisis Line/Domestic violence and sexual assault hotline. Available 24 hours a day, seven days a week, if you have a crisis or need to talk about a past or present concern. Volunteer Opportunities: assistance with planning and preparation for special public awareness events(copying flyers, distributing flyers and making phone calls. Donations accepted.\n\n\nRegular office hours: 8:00 am - 4:30 pm Monday through Friday Crisis hotline and shelter 24 Hours a day Counseling by appointment.\nOur Shelter is a 26 bed, secure facility that serves as 24/7 emergency shelter for victims of Domestic Violence and/or Sexual Assault. There are six individual bedrooms; each with a closet, dresser, and bedside tables. A handicap-accessible bedroom is also available. Common Areas in the shelter include: Laundry facilities for residential clients, ample bathroom facilities, kitchen and dining areas, large living room with television, reading area, play area for children, computer area for preparing job application material and completing school work, and a secure outdoor patio to provide our residents the opportunity to enjoy sunshine, fresh air, and playtime with their children.  \n"
  },
  {
    "addressLine1": "275 Grove Rd",
    "city": "Richmond",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47374",
    "name": "Hope House Halfway House",
    "organization": "Hope House Halfway House",
    "phone": "(765) 935-3000",
    "website": "http://www.richmondhopehouse.com/",
    "description": ""
  },
  {
    "addressLine1": "N., 35 Public Square",
    "city": "Salem",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47167",
    "name": "Hossier Hills Domestic Violence Center - Hoosier Hills PACT",
    "organization": "Hossier Hills Domestic Violence Center - Hoosier Hills PACT",
    "phone": "(812) 883-1959",
    "website": "http://www.pactchangeslives.com/programs-a-services/hoosier-hills",
    "description": "Women's shelter only, Toll Free 1-888-883-1959.\n\nVICTIM SERVICES\nDomestic Violence Shelter:\nA safe temporary residence for victims of domestic violence and their children. The program provides a 24 hour crisis line as well as court and hospital advocates for victims of domestic violence and sexual assault. Food, clothing, case management and support groups are free to clients. Trained staff provide educational presentations. Volunteers are an essential part of the program's success.  The shelter is also supported by a generous donation from The Mary Kay Foundation.\n\nTransitional Housing:\nTransitional housing apartments are accessible up to 24 months for clients who have left an abusive relationship and need to become self sufficient. Residents are provided case management services and assistance to locate employment and childcare. Access to resources including educational opportunities, budget counseling and permanent housing are also available.  "
  },
  {
    "addressLine1": "304 Hoosier Street",
    "city": "North Vernon",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47265",
    "name": "Wayside Inn Shelter",
    "organization": "Wayside Inn Shelter",
    "phone": "(812) 352-7598",
    "website": "http://www.waysideinnshelter.com/",
    "description": "Temporary housing for those who are homeless.\n\nWayside Inn Shelter helping people help themselves, one step at a timeWayside Inn has been on our hearts and the Community has been without an emergency shelter for many years. Groups like the hospital, township trustees, social service agencies, churches, and civic offices like the Mayor and law enforcement just cobbled together nights of stay at local hotels or in tents at the County Park.\n\nWe have some communities in the county where people would take shelter in abandoned trailers or mobile homes, or literally pitch tents in the woods. Im sure this mirrors the plight of the homeless throughout the nation, but looking people in the eye and telling them there was really no place to send them finally became untenable for a group of us in the community.A group of people who became charter members of the fellowship and ultimately took Board positions shared our hopes and vision for a place to provide emergency shelter.\n\n\nWe envisioned a short-term facility (14 days to perhaps a month) where people could stay and begin to connect with the services/opportunities they needed to become self-sufficient and sustainable. Our volunteer staff helps them with job applications and making connections with local business and industry that might be hiring. If they need mental health services or health care, we work with our community partners to facilitate that."
  },
  {
    "addressLine1": "1717 Jefferson St",
    "city": "Mt. Vernon",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "62864",
    "name": "Lifeboat Alliance - Family Shelter",
    "organization": "Lifeboat Alliance - Family Shelter",
    "phone": "(618) 244-4088",
    "website": "https://www.lifeboatalliance.org/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 212",
    "city": "Rensselaer",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47978",
    "name": "North Central Indiana Rural Crisis Center, Inc.",
    "organization": "North Central Indiana Rural Crisis Center, Inc.",
    "phone": "(800) 933-0374",
    "website": "https://www.facebook.com/rensselaercrisiscenter/",
    "description": "Women's shelter only, Toll Free #: (800)933-0374\n\nIn House Services\nVictims may stay for up to 30 days at the shelter.  During this time, victims will receive advocacy and victim assistance that includes, but is not limited to: support groups, agency/housing/employment referalls, emergency transportation, and any additional support needed.  While staying at the shelter, residents and their children will have their own room.  In addition to this, food is provided for every meal.  Residents will take turns sharing the responsibility of preparing these meals as well as clean up and other household chores.  We have an Client Advocate who will work individually with each resident as well as a Child Advocate who will assess and meet the needs of each child residing here.\n\nOutreach Services\nThe Crisis Center also provides services for victims of domestic violence and sexual assault even when they may not be in need of emergency shelter.  The Client Advocate will meet with the victim in Jasper, Newton, or Pulaski County at a safe location predetermined by the advocate.  During this time, the advocate can provide advocacy, referrals, and education/support on the issue of domestic violence.  The advocate is also able to accompany the victim to court appointments for the purpose of assisting the client in obtaining a protective order or simply for emotional support."
  },
  {
    "addressLine1": "649 W Moonglo Rd",
    "city": "Scottsburg",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47170",
    "name": "Sovereign Grace Baptist Church",
    "organization": "Sovereign Grace Baptist Church",
    "phone": "(501) 681-4000",
    "website": "http://sgbcscottsburg.org/locations/sovereign-grace-baptist-church-scottsburg/",
    "description": ""
  },
  {
    "addressLine1": "813 S. Michigan Street",
    "city": "South Bend",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "46601",
    "name": "Center for the Homeless",
    "organization": "Center for the Homeless",
    "phone": "(219) 282-8700",
    "website": "https://www.cfh.net/",
    "description": "Our Programs\n1. Emergency Shelter:\nWhen a guest first comes to the Center Crisis Intervention, Orientation and Assessment are provided.\nGuests who will go on to programming at the Center have a Coach who assists in developing and implementing a self-sufficiency plan. The following services are available as needed throughout the stay: Adult Basic Education, Relationship Counseling, Mental Health and Substance Abuse Treatment, Peer Mentoring, Abuse Counseling, Debt Reconciliation and Budgeting.\n\n\n2. Personal Development and Education: Starting Over/Stepping Higher Program (SOSH)\nCurriculum includes: stress management, living an integrated life, team leadership, goal setting and daily programming addressing the whole person (mental, emotional, physical and spiritual).\n\n3. Job Training and Placement: STAR (Skilled, Trained, Able and Ready)\nCurriculum includes: job readiness, externships, job retention and job search.\n\n4. Transitional Housing: On-site\nOpportunities Include: After Five and Breakfast Club (peer support groups), job search and retention, saving 75% of income, debt reduction.\n\n5. Housing in the Community\nGuests secure affordable housing, participate in outreach case management, volunteer in the community and mentor guests at the Center.\n\n6. Homeownership\nGuests move into stable neighborhoods with low mortgage payments and serve as community volunteers and mentors."
  },
  {
    "addressLine1": "4470 South Houseman Street",
    "city": "Terre Haute",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47808",
    "name": "C.O.D.A. Family Crisis Center",
    "organization": "C.O.D.A. Family Crisis Center",
    "phone": "(812) 232-1736",
    "website": "http://www.codaterrehaute.org/",
    "description": "The mission of the Council on Domestic Abuse, Inc. is the elimination of domestic violence and sexual assault through societal change and the empowerment of abused individuals and their minor children.\n\nEmergency Shelter\nThe emergency shelter provides safe housing for victims of domestic violence or sexual assault and their minor children for up to 60 days. The shelter is in a confidential location within the city limits of Terre Haute, Indiana. Security is maintained at all times by a staff that is on duty 24 hours a day, 365 days a year. Each staff member is trained in First Aid and CPR.\nThe shelter has room for 14 people to reside in it comfortably. Overflow guests are housed at a separate location. Personal hygiene items, clothing, and food are provided at no charge.\n\nPets are not allowed at the shelter, but arrangements can be made for at-risk pets to be boarded in a safe location.\nNo illegal drugs or alcohol are allowed in shelter. A person who is currently under the influence of drugs or alcohol will not be allowed to enter the shelter until medical clearance is given by a hospital or physician.\nNormally, residents are housed in individual rooms, along with their children, unless doubling up becomes a necessity. Bathrooms and laundry facilities are shared. All adult residents are expected to share in cooking and cleaning duties.\nThere is a large kitchen and dining area, TV/living area, and playroom, as well as outside play equipment. The shelter does not have child care facilities, so residents are responsible for watching their own children at all times, or making arrangements for outside child care.\nThe shelter is located close to a bus line for those with no transportation.\n\nWhile residing in the shelter, guests may continue their regular employment or education.\nA telephone is available for resident use. It is a corded phone and is much safer to use than individual cell phones."
  },
  {
    "addressLine1": "1402 Locust St",
    "city": "Terre Haute",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47808",
    "name": "Bethany House Homeless Shelter",
    "organization": "Bethany House Homeless Shelter",
    "phone": "(812) 232-4978",
    "website": "https://www.archindy.org/cc/terrehaute/programs-bethany.html",
    "description": "Bethany House Homeless Shelter\nBethany House has sheltered single women, women with children, and married couples since it opened in April 1980.\n    Residents come from various backgrounds with many different reasons for needing shelter.\n        Job loss\n        Eviction\n        Release from prison\n        Addiction issues\n        Marital problems\n        Mental and physical hardships\n    All residents receive an intake assessment of needs and life situations. Together we develop a program plan that includes goal setting and personal responsibility while living at Bethany House.\n    A resident's targeted stay is up to 120 days. Active participation in their service program and progress towards goals are monitored. Reviews are conducted every 30 days.\n\n    We work with each individual to provide them with the services they need:\n        Collaboration with other social service agencies\n        Attendance at local Alcoholics Anonymous or Narcotics Anonymous meetings\n        Meetings to improve resident's responsibilities and self discipline\n        Employment search and maintaining employment\n        GED classes\n        Menu and budget planning\n\n\n Weekend Sack Lunches\nSack lunches are available for pick up on Saturday and Sunday from 11:30 am to 1:30 pm.\nBethany House Free Clothes Closet\nOpen to the public Monday through Friday from 8:00 a.m. to 12:00 p.m.\n\n    Please call in advance to arrange donations of clothing, small household items, toys, books, bedding, etc.\n\n    In addition to serving more than 2,000 individuals monthly at the Closet, we also provide items to group agencies such as group homes, nursing homes, prisons, and other shelters for the needs of their clients."
  },
  {
    "addressLine1": "1201 S. 13th St.",
    "city": "Terre Haute",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47802",
    "name": "Light House Mission",
    "organization": "Light House Mission",
    "phone": "(812) 232-7001",
    "website": "http://www.thlhm.org/",
    "description": "Men only shelter. Must bring picture id and be sober.\n\nWe are open 365 days a year, and help is needed every day, including the weekends.\n\n\nLodging: Whether homeless, emotionally troubled, or simply stranded, we take people into our facilities and provide the necessities of life. In addition to donated goods and services.\n\nTransitional Apartments. On the 3rd floor of the Wabash Avenue building, there are 19 one-bedroom apartments available for to single, low-income men who have completed the program and are employed. There is no other facility like this available to men in the Wabash Valley. We recently built 6 one-bedroom apartments for single women at 18th and Chestnut Streets for ladies finishing the program at our Conners Center."
  },
  {
    "addressLine1": "9 N 5th Street",
    "city": "Vincennes",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "47591",
    "name": "Another Chance Christ Ministries",
    "organization": "Another Chance Christ Ministries",
    "phone": "(812) 886-5304",
    "website": "https://anotherchancechristministries.wordpress.com/",
    "description": "Christ centered facility for men only, We can not accept registered violent or sexual offenders.\n\nThis is not a FREE program.\nProgram Information:\n    The program last for 1 to 3 years.\n    You must be 18 or older.\n    We do not accept registered sex or violent offenders to protect our neighboring community\n    The program cost is $120/week or 30% of your income. Exceptions can be made.\n\n    Application for residency and Policy and Procedures Packet must be completed.\n\nThis program is a 1 to 3 year transitional housing program.\nThere will be an application process for every potential resident in this program.  "
  },
  {
    "addressLine1": "217 W. 3rd Street",
    "city": "Mount Carmel",
    "state": "Indiana",
    "stateAbbreviation": "IN",
    "postal": "62863",
    "name": "Safe Haven of Mount Carmel",
    "organization": "Safe Haven of Mount Carmel",
    "phone": "(618) 262-2677",
    "website": "mailto:office.safehaven.mtcarmel@gmail.com",
    "description": "Safe Haven of Mt. Carmel Illinois, Inc. is a private (non-state funded) temporary Emergency Shelter for homeless women and their children in the greater Wabash County Area of Southeastern Illinois.\n\nThe following are requirements for individuals seeking temporary emergency shelter at Save Haven of Mount Carmel.\n\n\nAn applicant must be in one of the following categories:\n\nA female over the age of 18.\nA female over the 18 and her minor children under the age of 17.\nAn emancipated female minor with or .without children.\n"
  }
]