[
  {
    "addressLine1": "222 E 12 Street",
    "city": "Ada",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74820",
    "name": "Mama T’s Bread and Blessing",
    "organization": "Mama T’s Bread and Blessing",
    "phone": "(580) 495-1559",
    "website": "http://mamatsada.com/",
    "description": ""
  },
  {
    "addressLine1": "1212 Harris St.",
    "city": "Ardmore",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73401",
    "name": "Naomi House Inc",
    "organization": "Naomi House Inc",
    "phone": "(580) 798-0761",
    "website": "mailto:naomihouse212@yahoo.com",
    "description": "Naomi House is entirely Faith based for Women 18 and older who are suffering from life controlling issues such as drug and alcohol addiction, homelessness, domestic violence, ect. We provide a safe place to live along with A wide range of community resources for specific needs. We encourage Long term goal planning and assist residents in reaching those goals. Some community agencies work together with Naomi House to accomplish permanent solutions for housing and freedom from reoccuring issues of bondage."
  },
  {
    "addressLine1": "11 A. St. NW",
    "city": "Ardmore",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73401",
    "name": "The Grace Center of Southern Oklahoma",
    "organization": "The Grace Center of Southern Oklahoma",
    "phone": "(580) 223-2027",
    "website": "https://www.ardmoregracecenter.com/",
    "description": ""
  },
  {
    "addressLine1": "331 W. Morton",
    "city": "Denison",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "75020",
    "name": "Texoma Family Shelter",
    "organization": "Texoma Family Shelter",
    "phone": "(903) 465-6041",
    "website": "https://texomafamilyshelter.com/contact/",
    "description": ""
  },
  {
    "addressLine1": "5700 Texoma Pkwy",
    "city": "Sherman",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "75090",
    "name": "Salvation Army of Grayson County Texas",
    "organization": "Salvation Army of Grayson County Texas",
    "phone": "(903) 868-9602",
    "website": "http://www.salvationarmytexas.org/sherman/",
    "description": "Provides emergency assistance for food, clothing, emergency shelter, pastoral counseling and prescriptions, when funding warrents. Emergency shelter for men, women, and families. Persons must call before coming to shelter if possible. Seasonal programs include Summer Camps for children and adults and Christmas assistance for food and gifts. To recieve school supplies applicants must come in to fill out applications and bring birth certificates or other identification showing the childs age.\n\nDuring extremely hot weather the facility operates as a Cooling Center.\n\n\nEligibility: Emergency shelter for three day intervals; all populations 18 and over; must leave facility during the daytime hours.\n\nHours: Mon - Fri 9:00am - Noon; 1:00pm - 4:00.\n\nIntake procedure: Call for appointment for utility requests, Call or walk-ins accepted.\n\n"
  },
  {
    "addressLine1": "1411 West Hensley Boulevard",
    "city": "Bartlesville",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74003",
    "name": "Lighthouse Outreach Center",
    "organization": "Lighthouse Outreach Center",
    "phone": "(918) 336-9029",
    "website": "http://www.lighthousemissionok.org/",
    "description": "We're glad to have you come visit and the coffeepot is always on! We have an existing capacity of a 32-bed men's dormitory, a 7-bed woman's dormitory and 5 family apartments. The Lighthouse Outreach Center is a Christian based homeless shelter providing each resident's basic needs:\n\nPhysical Needs\na) Three meals per day\nb) Clothing and personal Items as needed\nc) Hygiene (showers, toiletries, bedding)\nd) Laundry facilities\ne) Separate living quarters for single males and females\nf) Family efficiency apartments\n\nSpiritual Needs:\na) The Gospel of Jesus Christ, our Lord and Savior\nb) Prayer and Bible Study\nc) Evening Church Services\nd) Morning Chapel Service\n\nOther Needs\na) Employment referrals*\nb) Substance abuse treatment referrals\nc) SSI, SSDI assistance\nd) Housing referrals*\ne) Mental Health referrals"
  },
  {
    "addressLine1": "822 Johnstone Ave",
    "city": "Bartlesville",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74003",
    "name": "Family Promise of Washington County",
    "organization": "Family Promise of Washington County",
    "phone": "(918) 815-3457",
    "website": "https://familypromisewc-ok.org/",
    "description": "Family Promise of Washington County is an affiliate of Family Promise National. The program provides temporary housing for homeless families with children under the age of 18. Families stay at host congregations in the evening and spend their time at the Family Promise Day Center during the day, where they receive intensive case management."
  },
  {
    "addressLine1": "307 W. Pecan Street",
    "city": "Independence",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "67301",
    "name": "Home Sweet Home Homeless Ministry",
    "organization": "Home Sweet Home Homeless Ministry",
    "phone": "(620) 331-5115",
    "website": "https://hshhomelessministry.org/",
    "description": "Admissions and Counseling Office              \n319 West Laurel Room 212\nIndependence, KS  67301\n\nThe Home, Sweet, Home Alan Runyan Men's Shelter opened its doors on January 4, 2011. We have space for eight guests, each day. A guest may stay up to seven days; on an emergency basis a guest may stay up to 90 days if they show motivation and action for change in their lifestyle. Guests are guided in finding resources for health, counseling, employment and permanent housing."
  },
  {
    "addressLine1": "215 East 4th Street",
    "city": "Chandler",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74834",
    "name": "The Chosen House, Inc.",
    "organization": "The Chosen House, Inc.",
    "phone": "(405) 240-5768",
    "website": "mailto:Kimberly_Battle2002@yahoo.com",
    "description": "The Chosen House is a faith base home that is FREE for 9 months and we help we provide Mental Health Counseling, Behavior Modification, AA meetings, Nutrition classes and many more."
  },
  {
    "addressLine1": "416 N 7th Avenue",
    "city": "Stroud",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74079",
    "name": "Maranatha Outreach Center Maternity Center",
    "organization": "Maranatha Outreach Center Maternity Center",
    "phone": "(918) 987-0777",
    "website": "mailto:maranthaoutreach@yahoo.com",
    "description": "Faith based home for women 18 and older whom are either pregnant or have children. We are not a Domestic Violence Center."
  },
  {
    "addressLine1": "1004 N 5th",
    "city": "Duncan",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73533",
    "name": "Sought out Ministries Homeless Shelter",
    "organization": "Sought out Ministries Homeless Shelter",
    "phone": "(580) 467-8328",
    "website": "mailto:support@script-it.net",
    "description": "We are a homeless shelter for men and families right now. We are ran by donations only. Any and all donations are accepted and appreciated. If you would like more information on how to donate or where to donate please feel free to call us at any time. We are open from 8am to midnight. For after hours please call or go to the white door on the north side of the building that is the shelter directors apartment.\n\nCurfewWe emergency intake 24/7"
  },
  {
    "addressLine1": "214 W Main Street",
    "city": "Marlow",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73055",
    "name": "Marlow Samaritans Emergency Shelter",
    "organization": "Marlow Samaritans Emergency Shelter",
    "phone": "(580) 658-5771",
    "website": "",
    "description": "Office hours: Mondays, Wednesdays, Fridays 10am - 2pm.\n\nEMERGENCY SHELTER provided by giving one night at a local motel-No homeless shelter available. Provides temporary shelter for those in need in emergencies for the night in a motel, when funding is available.\n\n\nYou must live in Marlow, OK, mailing area and must explain the cause of the emergency to the case worker. Situations are reviewed and assessed individually before help is granted, deferred or denied altogether.\nDocumentation: Photo ID and Proof of Residency if different than what is listed on Photo ID"
  },
  {
    "addressLine1": "7 N. Broadway",
    "city": "Edmond",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73034",
    "name": "Hope Center Emergency Assistance",
    "organization": "Hope Center Emergency Assistance",
    "phone": "(405) 348-1340",
    "website": "https://hopecenterofedmond.com/",
    "description": "Hope Center is not a homeless shelter. Hope Center provides assistance to members of the Edmond Community with Emergencies.\n\nProvides help with issues such as: divorce, unemployment, illness, homelessness, and child abuse. HOPE Center has been providing assistance to members of the Edmond community. Our name is our mission - it stands for Help Our People in Emergencies. Our mission is to meet the basic needs of the people in our community who are having personal emergencies or crises. It is difficult enough to ask for help but imagine how hard it would be to have to go to every church in town to get enough assistance to pay a utility bill. The combined support of many of the churches, businesses and individuals in the community means that we have the resources to provide food, clothing and utility assistance from a single community agency."
  },
  {
    "addressLine1": "3131 N Pennsylvania",
    "city": "Oklahoma City",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73112",
    "name": "Sisu Youth Services",
    "organization": "Sisu Youth Services",
    "phone": "(405) 459-7478",
    "website": "http://www.sisuyouth.org/",
    "description": "Sisu Youth Services is a low-barrier, identity-affirming safe space in Oklahoma City where unhoused transition-age youth find the shelter and support they need to pursue the life they want.\n\nServices:\nEmergency shelter\nClothing\nHot meals\nCase management services,\nTransitional living programs for unhoused or at-risk youth between the ages of 15-24\n"
  },
  {
    "addressLine1": "1001 N Pennsylvania Ave",
    "city": "Oklahoma City",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73107",
    "name": "The Salvation Army's Chesapeake Energy Center of Hope",
    "organization": "The Salvation Army's Chesapeake Energy Center of Hope",
    "phone": "(405) 246-1100",
    "website": "https://salvationarmyokcac.org/",
    "description": "The Salvation Army Men's Lodge is open to any man who needs a clean, warm, safe place to stay. The comforts of home are not always available to many people because of a crisis in their lives.\nShelter is one of the first things that is addressed when we assist the less fortunate members of our society.\n\nThe Army shelters are open 365 days per year. Each person is required to go through case management in Social Services to aid in making a plan of action to get back on their feet.\nGiving a hand-up to these individuals helps to reintegrate them back into society as responsible citizens.\n\nFamily and Women's LodgeThe Family and Women's Lodge gives displaced families and battered women a place to call home during a crisis.\nThe Salvation Army Emergency Family and Women's Shelter is a safe haven, allowing every woman and family an opportunity for safety. For thousands each year, The Salvation Army becomes a home away from home where they can feel secure, a place where they can be nurtured physically, mentally and spiritually.\nLatest News\n\n"
  },
  {
    "addressLine1": "not disclosed",
    "city": "Oklahoma City",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "00000",
    "name": "YWCA Inez Kinney Gaylord Passageway Emergency Shelter",
    "organization": "YWCA Inez Kinney Gaylord Passageway Emergency Shelter",
    "phone": "(405) 917-9922",
    "website": "https://www.instagram.com/ywca_okc/",
    "description": "Inez Kinney Gaylord Emergency Shelter\nThe YWCA provides the only shelter for battered women and children in Oklahoma County. Ours is an emergency shelter, providing help in obtaining legal services, transportation, housing information, medical care, child care and advocacy services for up to two months. Clients attend domestic violence education and support groups during their stay. Our Child Advocates offer education and support to help children avoid further victimization, verbalize feelings, learn appropriate ways to express emotions and understand what is occurring in their families.\n\nOur shelter is a safe place for women and children to escape domestic violence. Open 24-hours/7days a week, the shelter provides immediate, emergency shelter and supplemental services to more than 1,000 women and children every year."
  },
  {
    "addressLine1": "1335 West Sheridan Avenue",
    "city": "Oklahoma City",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73106",
    "name": "Jesus House",
    "organization": "Jesus House",
    "phone": "(405) 232-7164",
    "website": "http://www.jesushouseokc.org/",
    "description": "The Jesus House recovery program is specifically tailored to meet the needs of men and women who are experiencing homelessness, mental illness and addiction. We also offer cold weather shelter on a night-to-night basis for up to 15 additional male guests during the winter and at times of inclement weather. All resident-guests must be at least 18 years of age.\nJesus House is an inner city, non-denominational, non-profit Christian outreach providing shelter, food, clothing, and love to the community's homeless and poverty stricken.\n\n\n\n\nJesus House is more than an emergency shelter providing refuge to the homeless who are mentally ill and addicted. The Jesus House soup kitchen serves approximately 100,000 hot and nutritious meals each year to the homeless of Oklahoma City. The Jesus House food basket outreach distributes hundreds of shopping carts loaded with essential grocery items to poverty stricken households each week. The Jesus House clothing and used furniture ministry provides hundreds of articles of clothing and household items to the people in need every week. And the Jesus House street ministry outreach delivers a hot, fresh breakfast each week to the unsheltered homeless where they are on the street with fellowship and encouragement to forsake the street for programs that work. At Jesus House, our mission is love. Love lives here.\nThe Jesus House Life Transformation ProgramOur recovery program is a goals based program which focuses on connecting our resident-guests with the medical and social services they need in a spiritually encouraging environment which promotes sobriety, mental stability, accountability and eventually transition to a life of new opportunities. We work with numerous partner ministries and community service organizations to connect our resident-guests to services and benefits such as medical care, prescription assistance, counseling, life-skills classes, legal assistance, social security benefits, identification assistance, financial responsibility classes, job skills, GED assistance, employment and eventually housing. We are also a host site for numerous, daily drug and alcohol recovery and support group meetings.\n\nThe duration of the recovery program varies from one resident-guest to the next. Although 12 months is what we would consider the typical duration of a successful shelter program stay, the circumstances and goals of each resident-guest always vary from one to the next. Additionally, difficulties in maintaining sobriety can provide setbacks and multiple shelter program stays may be necessary.\nOnce our resident-guests graduate, they move to housing which they secure while completing the Life Transformation Program at Jesus House. Housing options after graduation can range from apartments or houses or accommodations with one of our strategic partners providing transitional housing, such as Hope House OKC or The Pershing Center\nRecovery Hope Transformation\nOur motto at Jesus House is \"Recovery, Hope, Transformation.\" Our welcoming atmosphere and philosophy of meeting people where they are with the unconditional love of Christ keeps our program beds full most of the time and our resident-guests positive. We offer numerous spiritual based programs and classes and an on-site chapel service on Sundays. Attendance at any spiritual program or class is voluntary and is always at the choice of the resident-guest."
  },
  {
    "addressLine1": "800 W. California Ave",
    "city": "Oklahoma City",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73106",
    "name": "City Rescue Mission",
    "organization": "City Rescue Mission",
    "phone": "(405) 232-2709",
    "website": "https://www.cityrescue.org/",
    "description": "Emergency shelter for men, women and children. The shelter provides clean clothing, showers, food and personal care items.\n\nNeed Shelter\nIf you are 18+ years of age, Emergency help in the form of food and shelter are available everyday. Men can go to our 914 W. California entrance and women (and women with children) can go to our 800 W. California entrance.\n\n\nNeed Food\nAre you in need of food? Here are some quick facts to get started:\n- Shop by appointment only, shoppers can come by the Impact Hunger Food Resource Center to make an appointment between 9:00 am and 6:00 pm Monday through Friday\n\n- The FRC (Store) is open for shopping from 1:00 pm till 6:00 pm Monday through Friday\n- Shoppers can shop once every fourteen days\n- Shoppers can choose up to twelve items per trip.\nMust be valid ID or utility bills with your name and address on it.\n\nCommitment to recovery\nIn addition to offering three meals a day and a place to sleep each night, City Rescue Mission, with the help of our partner organizations, is able to care for and provide specialized services in the fight to end homelessness.\n\nOther Services\nCity Rescue Mission's trained Case Management staff collaborates with 70 local agencies to provide access to coordinated services including free access to medical, dental, vision, veteran's benefits, counseling, educational (on-site GED courses) and job placement services, among others.\n\n\n\n\nCity Rescue Mission is a faith-based, private, nonprofit organization providing solution-based ministry to an average of 430 homeless men, women and children in the Oklahoma City metro area each day. For more than 50 years, the Mission has saved many lives and has had a profound impact on thousands of others. Not only does the Mission provide safe shelter and warm meals, but also a holistic approach to recovery and a variety of social services for the homeless and near homeless including medical, dental, vision care and much more."
  },
  {
    "addressLine1": "8712 EAST MAIN STREET",
    "city": "MIDWEST CITY",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73110",
    "name": "EMERGING ANGLES",
    "organization": "EMERGING ANGLES",
    "phone": "(405) 313-2656",
    "website": "http://emergingangels.weebly.com/",
    "description": "Emerging Angels, a non-profit, faith based organization which operates a group home supporting women, women with children, abandoned seniors, disabled and/or abused women finding themselves homeless as a consequence of trauma, abuse or tragedy of many types. We house program participants in the Oklahoma City area on 4 acres in a big beautiful ranch style house. The program assists women with their health, food, medical, transportation and career search, spiritual and life skills development and many other things within our capacity, aiding and teaching them to return to a functional, healthy and balanced life. Our facility in your community assists up to 12 women plus children in a year-long program"
  },
  {
    "addressLine1": "2205 Exchange Ave",
    "city": "Oklahoma City",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73108",
    "name": "Grace Rescue Mission Inc",
    "organization": "Grace Rescue Mission Inc",
    "phone": "(405) 232-5756",
    "website": "http://cbaokc.net/page/grace_rescue_mission",
    "description": "Grace Rescue Mission is an emergency shelter for up to 110 men a night. We serve 400-600 meals daily.\n\nSAFE Addictions Recovery Program (1 yr. in residence program).\n\n\n6 month Back To Work Program (mandatory 50% income savings to enable the participant to pay required deposits when they step out on their own again.\n\nEducation program (participants enrolled in college or technical training have an indefinite stay at the mission as long as they can prove enrollment and satisfactory progression.\n\nSecurity (we provide 'as needed' security for Sanctuary Women's Shelter, Stockyards Main Street functions and Exchange Avenue Baptist Church."
  },
  {
    "addressLine1": "815 W. Maine",
    "city": "Enid",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73701",
    "name": "Hope Outreach Homeless Shelter",
    "organization": "Hope Outreach Homeless Shelter",
    "phone": "(580) 237-4673",
    "website": "https://www.hopeoutreach.org/",
    "description": ""
  },
  {
    "addressLine1": "1804 S.Perkins Rd.",
    "city": "Stillwater",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74074",
    "name": "Mission Of Hope",
    "organization": "Mission Of Hope",
    "phone": "(405) 332-5521",
    "website": "http://www.stillwatermoh.org/",
    "description": "Mission of Hope gives assistance by providing supportive housing, food, comprehensive case management, transportation, and life skills training.\nOur goal is to help homeless people become self-sufficient.\n\nMission of Hope provides:\n    Emergency Shelter\n    Transitional Housing\n    Stillwater Transitional Apartments\n    Permanent Supportive Housing\n    Permanent Supportive Housing for Veterans\n\nRequirements\n    Photo I.D.\n    Social Security Card\n    Be considered homeless"
  },
  {
    "addressLine1": "409 North Ellison Street",
    "city": "Guymon",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73942",
    "name": "Oaks Of Mamre",
    "organization": "Oaks Of Mamre",
    "phone": "(580) 338-5067",
    "website": "https://www.okdrs.gov/guide/oaks-mamre-homeless-shelter",
    "description": "This is a shelter for single,married couples and families with children,the length of stay max is 90 days,you must look for work while staying here,there is a kitchen where you can cook your own food and sometimes meals are provided donated by local businesses and of course there are rules you must follow to be able to stay here for example no drinking or drugs and etc. and you must go to Police station for a background check."
  },
  {
    "addressLine1": "1015 N Washington",
    "city": "Liberal",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "67901",
    "name": "Stepping Stone Shelter",
    "organization": "Stepping Stone Shelter",
    "phone": "(620) 626-6024",
    "website": "https://www.facebook.com/SafeHavenOutreachMission/",
    "description": "Thirty night residential shelter for the homeless.\n\nStepping Stone Shelter is the only residential shelter in southwest Kansas. Other shelters in the region offer only a few days stay with a bed and a meal but no other services. We receive referrals from area hospitals, area agencies, as well as the local Police/Sheriff and community corrections. The most common referrals come from friends and family members.\n\nWe offer a 30 day minimum stay though that can be, and is, extended based upon the individual needs of the client. Our average stay has increased to over 16 days and after omitting those here less than 5 days the average stay went up to 21 days. We believe this coupled with a reduced return rate indicates we are fulfilling our mission statement to prevent future homelessness. We also furnish clothing, meals and hygiene items. Our case management has become the backbone of our endeavor to help those we serve. We network with agencies to find other services available to our clients. Because of the amount of cooking and client supervision required, we are staffed with three eight hour shifts every day.\n\n\nDonations from the community have increased tremendously. We provide as many items as possible to our clients for their new home when they leave. Overflow items are used for \"Sharing Saturday\" a free program we started several years ago. We now see families on Saturday at 6:00 AM waiting for the boxes of goods and continued traffic until the boxes are removed on Sunday afternoon."
  },
  {
    "addressLine1": "1203 South West Texas Ave",
    "city": "Lawton",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73501",
    "name": "C. Carter Crane Shelter for the Homeles",
    "organization": "C. Carter Crane Shelter for the Homeles",
    "phone": "(580) 248-0936",
    "website": "https://www.gpif-caa.org/",
    "description": "Office Hours 8am-5pm Monday-Friday Intake Hours 8am-5pm Monday 8am-10pm Tuesday-Friday 9am-3pm Saturday All calls to 580-248-0936 are answered 24 hours a day.\n\nEmergency shelter for all. Men, women, children. Can stay at shelter up to 6 weeks depending on needs.\n\n\nThe C. Carter Shelter fot the Homeless is the only homeless program which allows its clients to stay for a period of up to six weeks. The shelter is a homelike environment and provides all clients with strong supportive case-management services to help in gaining employment and housing. Clients are also provided transportation to employment, medical appointments, employment search, and other appointments in the form of Lawton Area Transit System (LATS) bus passes. Necessary hygiene items are provided to all clients during their stay at the shelter."
  },
  {
    "addressLine1": "901 SW E Avenue",
    "city": "Lawton ",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73501",
    "name": "Family Promise of Lawton Inc",
    "organization": "Family Promise of Lawton Inc",
    "phone": "(580) 699-2821",
    "website": "http://www.familypromiseoflawton.org/",
    "description": "Family Promise of Lawton Inc serves homeless children and their families. This program provides shelter for up to 90 days. Single or married pregnant mom's are welcomed.\n\n\nA nonprofit organization empowering homeless children and their families to achieve stable housing, employment, and financial independence."
  },
  {
    "addressLine1": "1210 E. Cherokee",
    "city": "McAlester",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74501",
    "name": "Hope House of McAlester Inc.",
    "organization": "Hope House of McAlester Inc.",
    "phone": "(918) 423-4673",
    "website": "http://hopehousemcalester.com/",
    "description": "Homeless shelter for women & children. Faith based. No state or government funds provided. Completely volunteer funds.\nOpen 24 hours a day.\n\nThe Hope House of McAlester is a supportive shelter that welcomes women and children. Some of the many services that are provided are emergency shelter, transportation, food, clothing, job search, nutrition education, budgeting, healthcare referrals, housing assistance, skills training, specialized classes, case management, counseling, and any other service that the family might need."
  },
  {
    "addressLine1": "20 E Cherokee Ave",
    "city": "McAlester",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74501",
    "name": "Good Samaritan Outreach Homeless Shelter for Men",
    "organization": "Good Samaritan Outreach Homeless Shelter for Men",
    "phone": "(918) 429-7773",
    "website": "https://www.goodsamoutreach.com/",
    "description": ""
  },
  {
    "addressLine1": "904 North 9th Street",
    "city": "McAlester",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74501",
    "name": "Youth Emergency Shelter",
    "organization": "Youth Emergency Shelter",
    "phone": "(918) 423-8845",
    "website": "https://www.facebook.com/Youth-Emergency-Shelter-1663151607262923/?rf=170141096333384",
    "description": "Y.E.S. provides community based services include; emergency shelter care, counseling, first time offenders program, school based services & foster care.\n\n\nThe Youth Emergency Shelter was established in 1971, when a group of concerned citizens formed a steering committee to resolve the problem of abused children being detained in the county jails. Our facility was donated by the Regional Health Authority and funding from various grants were procured to provide emergency shelter care services to Pittsburg, McIntosh, and Latimer Counties. Our agency is Community-Based and governed by a Board of Directors comprised of members from the communities we serve. This ensures that our services meet the specific needs of the communities and guarantees the quality children deserve. Y.E.S. provides community based services include; emergency shelter care, counseling, first time offenders program, school based services & foster care. The Youth Emergency Shelter operates two community children's shelters. Emergency Shelters are located in McAlester & Eufaula. The Youth Emergency Shelter provides Community Based Services in Pittsburg, McIntosh and Latimer Counties. The Youth Emergency Shelter now has F.A.I.T.H Foster Care Program. (Finding And Improving Treasured Homes) Our Mission: Prevention and diversion of children and their families from entering, or further penetrating the juvenile justice system, and Provision of a safe, stable environment for those children whose lives have been endangered or threatened."
  },
  {
    "addressLine1": "214 N Morton Ave",
    "city": "Okmulgee",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74447",
    "name": "Okmulgee County Homeless Shelter",
    "organization": "Okmulgee County Homeless Shelter",
    "phone": "(918) 756-9098",
    "website": "http://ochs-online.com/",
    "description": "\"To Serve the Homeless and Strive to Prevent Homelessness\""
  },
  {
    "addressLine1": "323 Callahan",
    "city": "Muskogee",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74403",
    "name": "Miller Family Center for Life Change",
    "organization": "Miller Family Center for Life Change",
    "phone": "(918) 682-3489",
    "website": "https://www.grmmuskogee.org/",
    "description": "New Shelter Intakes are welcomed every day at 1 pm in the Bankston Chapel (323 Callahan).\n\nDo you need a safe place to sleep tonight?  Are you ready for life change?  We believe in you and want to help you make the changes that will help you achieve your God given dreams.\n\nWe will make room for you. NOTE: We are a clean and sober facility.\n\nOVERFLOW SHELTER\nFor those that are not fully ready for life change or can not make the 1 pm daily new intake check in time.  You are welcome to stay safe on a mattress in our dining room every night from 10 pm until 6 am.\n \nRescue Operation\nThe Rescue function of the Mission is at the heart of what we do and is based on Jesus instruction to us in Matthew 25:35-36. Our shelter services are located at the Miller Family Center for Life Change at 323 Callahan facility in Muskogee. By providing shelter and three meals a day, its our prayer that this temporary assistance might open doors to get our guests back on their feet."
  },
  {
    "addressLine1": "700 Asp, Ste. 2",
    "city": "Norman",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73069",
    "name": "Transition House",
    "organization": "Transition House",
    "phone": "(405) 360-7926",
    "website": "https://twitter.com/thouse82",
    "description": "Transitional living program for homeless with mental illness"
  },
  {
    "addressLine1": "P.O. Box 5089",
    "city": "Norman",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73070",
    "name": "Women's Resource Center",
    "organization": "Women's Resource Center",
    "phone": "(405) 701-5497",
    "website": "http://www.wrcnorman.com/",
    "description": "WRC Business line: 405-364-9424\n\nWRC Fax line: 405-364-4888\n\n\nFamily Violence Shelter: 405-701-5497\n\nDomestic Violence Crisis Line: 405-701-5540\n\n\nRape Crisis Center: 405-701-5550\n\nSexual Violence Crisis Line: 405-701-5660\n\n\n\nServices: The WRC Shelter is for Battered Women, The Rape Crisis Center, and the crisis lines assist with domestic violence issues.\n\n\n\nThe WRC Domestic Violence Shelter has provided safe, temporary housing for women and their children who have been victimized by domestic violence, sexual violence, and stalking. Residents receive individual and group support, DV education, advocacy, information and referral on housing, job training, legal aid and financial assistance. They also benefit from the understanding and support of the staff and other residents."
  },
  {
    "addressLine1": "201 Reed Ave",
    "city": "Norman",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73071",
    "name": "Food and Shelter Inc",
    "organization": "Food and Shelter Inc",
    "phone": "(405) 360-4954",
    "website": "http://www.foodandshelterinc.org/",
    "description": "Food and Shelter operates a 32 unit shelter program for long-term supportive living. These units are specifically for families with minor children. Families who qualify can stay up to 2 years with the assistance and support of a case manager who will develop an individualized plan for services.\n\nThere is no cost to residents. We consider the work each family is doing to better themselves as their rent payment.\n\n\nIf you are interested in applying for Food and Shelter's housing program, please come by and complete our housing application.\n\nDay Shelter\n\nOur day shelter is open 8:00 a.m. until 4:00 p.m. We often expand these hours during extreme weather months.\n\nCleveland County is home to many women, children and men who live on the streets, in their cars or in camp-sites around town. For those individuals and families we offer a day shelter complete with bathrooms, showers, laundry facilities, television, books, music and games. We provide extensive case management services to this group so living on the street is no longer their only option."
  },
  {
    "addressLine1": "325 E. Comanche",
    "city": "Norman",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73071",
    "name": "City of Norman Winter Shelter",
    "organization": "City of Norman Winter Shelter",
    "phone": "(405) 360-4954",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "4336 S 91st E Ave",
    "city": "Tulsa",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74145",
    "name": "GUTS Church - Food Pantry (aka Distribution Center)",
    "organization": "GUTS Church - Food Pantry (aka Distribution Center)",
    "phone": "(918) 622-4422",
    "website": "https://gutschurch.com/",
    "description": "Friday Groceries began in the fall of 2010, as a response to meeting the need for free meals for struggling families in the Tulsa community.\n\nWhat started as a distribution of free groceries, quickly expanded to providing a full church service every\n\nFriday Groceries Tulsa:\nFridays 9:30am 10:30am\n\n\nFarmers Market\nMonday: 10am 12pm | 9am doors open\nFamilies leave with a full weeks supply of food, but most importantly, they leave with hope.\n\n"
  },
  {
    "addressLine1": "2401 Charles Page Blvd",
    "city": "Tulsa",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74127",
    "name": "Tulsa County Emergency Shelter",
    "organization": "Tulsa County Emergency Shelter",
    "phone": "(918) 596-5591",
    "website": "https://tulsadaycenter.org/",
    "description": "Emergency shelter for all, including families with children."
  },
  {
    "addressLine1": "415 W. Archer Street",
    "city": "Tulsa",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74103",
    "name": "Day Center for the Homeless",
    "organization": "Day Center for the Homeless",
    "phone": "(918) 583-5588",
    "website": "https://www.tulsadaycenter.org/",
    "description": "The Day Center is the only organization in Tulsa providing shelter during the day. They also provide a night shelter for approximately 116 of the most vulnerable and at-risk segment of the homeless population - women and children, those men who suffer from mental or physical illness and men over 55.\nAlso provides a day center clinic.\nThe homeless population nationwide struggles with access to healthcare, and eviction is often a result of poor health. In 2012, 40 percent of the homeless population suffered from a mental illness or chronic substance abuse according to the National Alliance to End Homelessness.\nThe registered nurses and APRN at the Tulsa Day Center are always hard at work between treating diabetes, providing immunizations before flu season and treating frost bite. The Day Center is one of the few homeless charities in the nation that provides free healthcare to all of its clients, including prescribing and filling medication.\n"
  },
  {
    "addressLine1": "311 South Madison",
    "city": "Tulsa",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74120",
    "name": "Youth Services",
    "organization": "Youth Services",
    "phone": "(918) 582-0061",
    "website": "http://www.yst.org/",
    "description": "Youth only shelter."
  },
  {
    "addressLine1": "102 N. Denver Avenue",
    "city": "Tulsa",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74103",
    "name": "The Salvation Army - Emergency Shelter",
    "organization": "The Salvation Army - Emergency Shelter",
    "phone": "(918) 582-7201",
    "website": "http://www.salarmytulsa.org/emergency-assistance/",
    "description": "Emergency 24 hour shelter for all. Meals provided.\nProgram Hours: 7 days a week, 24 hours a day. Check in time is 4:30 p.m. daily for Emergency Shelter\nPublic meal is served daily at 1 p.m.Evening meal is served from 4:30 - 5:30 p.m. for those staying in the shelter.\nEligibility: For Shelter: Anyone who is homeless\nFor Feeding: Anyone who needs a hot mealFees: None for those without income\nFees: None for those without income\n\nThe Salvation Army has the largest capacity Emergency Shelter in this community. Built to provide refuge to 150 people a night, an average of 325 homeless individuals and families seek this service every day of the year. Daily meals are prepared in the Emergency Shelter Dining Room averaging 900 meals per day."
  },
  {
    "addressLine1": "506 N. Cheyenne Ave",
    "city": "Tulsa",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74103",
    "name": "John 3:16 Mission",
    "organization": "John 3:16 Mission",
    "phone": "(918) 587-1186",
    "website": "https://john316mission.org/shelter/",
    "description": ""
  },
  {
    "addressLine1": "1048 Louisville ave.",
    "city": "Tulsa",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74115",
    "name": "Mamas Transitional housing",
    "organization": "Mamas Transitional housing",
    "phone": "(918) 688-7850",
    "website": "mailto:dunn58@msn.com",
    "description": "Transitional housing for 90 days male or female singles ages 21 & up all bills paid,counseling & therapy provided if needed. Life skill classes provided must qualify...."
  },
  {
    "addressLine1": "709 E. Brewer",
    "city": "Salina",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74365",
    "name": "The Sanctuary House for Women",
    "organization": "The Sanctuary House for Women",
    "phone": "(918) 434-2288",
    "website": "mailto:jeanla.overstreet@gmail.com",
    "description": "This a homeless shelter for Women - was known and Community Outreach Center."
  },
  {
    "addressLine1": "1402 N Inglewood St",
    "city": "Siloam Springs",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "72761",
    "name": "Genesis House of Siloam Springs - Day Shelter",
    "organization": "Genesis House of Siloam Springs - Day Shelter",
    "phone": "(479) 549-3438",
    "website": "https://www.genesishousesiloam.com/",
    "description": "To provide a safe place of shelter and support to needy individuals striving to overcome obstacles to self sufficiency.\n\nDay Shelter\n"
  },
  {
    "addressLine1": "39604 W. Independence, P.O. Box 3044",
    "city": "Shawnee",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74802",
    "name": "Family Promise of Shawnee",
    "organization": "Family Promise of Shawnee",
    "phone": "(405) 273-0161",
    "website": "http://familypromiseshawnee.org/",
    "description": "Overnight accommodations, three meals per day, day center (for address, phone number, shower and laundry facilities, etc.), case management, transportation.Must clear TB testing (takes up to 3 days) before entrance."
  },
  {
    "addressLine1": "P.O. Box 3044",
    "city": "Shawnee",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74802",
    "name": "Family Promise of Shawnee, Inc.",
    "organization": "Family Promise of Shawnee, Inc.",
    "phone": "(405) 273-0161",
    "website": "http://familypromiseshawnee.org/",
    "description": "Family Promise of Shawnee provides shelter, food, transportation and case management to homeless families with children and pregnant women. Criminal backgound check and drug testing required."
  },
  {
    "addressLine1": "506 South Beard St",
    "city": "Shawnee",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74801",
    "name": "Homeless Resource Center (HRC)",
    "organization": "Homeless Resource Center (HRC)",
    "phone": "4058781543",
    "website": "https://tinyurl.com/aj9umu8d",
    "description": "Open Mondays 10a-6p, Wednesdays 1p-6p, Saturdays 10a-6p."
  },
  {
    "addressLine1": "9205 E 37TH PL",
    "city": "Tulsa",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "74145",
    "name": "Thrive Transitional Housing",
    "organization": "Thrive Transitional Housing",
    "phone": "918-727-2201",
    "website": "https://thrivetransitionalhousing.com/",
    "description": "Transitional housing for both accompanied men and women 18+ who are ready to regain their independence outside of a shelter environment Our homes are designed to provide a \"home\" feel, ensuring that our clients feel comfortable and secure during their stay. We serve a variety of individuals and groups within our community who are unhoused."
  },
  {
    "addressLine1": "1220 7th Street",
    "city": "Woodward",
    "state": "Oklahoma",
    "stateAbbreviation": "OK",
    "postal": "73801",
    "name": "High Plains Outreach Center, Inc.",
    "organization": "High Plains Outreach Center, Inc.",
    "phone": "(580) 254-5162",
    "website": "https://www.facebook.com/HPOCWoodward/",
    "description": "High Plains Outreach Center, Inc. is a non-profit organization that provides temporary, safe housing to the homeless. It offers 9 beds for a maximum of 30 days stay.\n\nPlease contact the office for additional information.\n\n\n"
  }
]