[
  {
    "addressLine1": "1060 US Highway 17 South",
    "city": "Bartow",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33830",
    "name": "George W. Harris, Jr. Runaway & Youth Crisis Shelter",
    "organization": "George W. Harris, Jr. Runaway & Youth Crisis Shelter",
    "phone": "(863) 595-0220",
    "website": "https://www.facebook.com/George-Harris-Jr-Runaway-Youth-Crisis-Center-199654036777300/",
    "description": ""
  },
  {
    "addressLine1": "604 Lemon St",
    "city": "Sebring",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33870",
    "name": "New Testament Mission",
    "organization": "New Testament Mission",
    "phone": "(863) 385-0035",
    "website": "https://www.facebook.com/New-Testament-Church-Mission-158593830839064/",
    "description": "Emergency Shelter/Food.\n\nMeals\nMonday- Friday\nLunch- 11:30AM Dinner- 4:00 PM\nSaturday\nLunch Only- 11:30 A.M.\nSunday\nDinner follows Church Services"
  },
  {
    "addressLine1": "117 E. Magnolia St",
    "city": "Lakeland",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33802",
    "name": "Lighthouse Ministries - Men's Gospel Rescue Mission",
    "organization": "Lighthouse Ministries - Men's Gospel Rescue Mission",
    "phone": "(863) 687-4076",
    "website": "https://www.lighthousemin.org/",
    "description": ""
  },
  {
    "addressLine1": "814 N Kentucky Ave",
    "city": "Lakeland",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33801",
    "name": "Talbot House Ministries of Lakeland",
    "organization": "Talbot House Ministries of Lakeland",
    "phone": "(863) 687-8475",
    "website": "https://talbothouse.org/",
    "description": "We are one of the oldest and most comprehensive homeless care centers in Polk County. We are committed to provide SHELTER, HEALTHCARE, and RENEWAL of the Homeless in our community.\n\nA safe comfortable place where homeless are welcomed, fed, clothed and sheltered.\n\nMore than 180,000 hot nutritious meals are served each year. We serve between 500 and 700 meals each day.\nApproximately 150 guests spend stay each night.\nThe Day Time Safe Haven offers a refuge for the homeless who would otherwise seek comfort and safety in the commercial areas of our community. Beverages, snacks, showers, and restroom are also provided.\nHomeless guest can use the Talbot House address as their mailing address and use a free phone to make necessary phone calls.\n\nTalbot House is our community's largest provider of basic needs services for poor and homeless men and women.\nOur Basic Needs services provide each person who comes to our door with the immediate needs of clothing, food, and shelter. We provide men and women who would otherwise be on the streets a place of safe refuge, and basic needs.\n\nComprehensive services include:\nMen's and women's emergency shelter\nHot, healthy meals\nFood pantry\nFree medical clinic\nJob assistance and vocational rehabilitation\nPermanent housing assistance\nSobriety, clean-living classes\nClasses for homeless prevention and more"
  },
  {
    "addressLine1": "not disclosed",
    "city": "Belle Glade",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33430",
    "name": "YWCA Harmony House West - For Women and Children",
    "organization": "YWCA Harmony House West - For Women and Children",
    "phone": "(561) 993-2204",
    "website": "http://www.ywcapbc.org/",
    "description": "Domestic Violence shelter for women and children and transitional housing shelter.\n\nThe Mary Rubloff Harmony House offers a secure, year round, 24 hour facility for women and their children who are victims of domestic violence. Harmony House West is located in the western communities of Palm Beach County, which offers individual apartments for up to 2 years for women and their families seeking transitional housing assistance. Housing is available for qualified women with children."
  },
  {
    "addressLine1": "1749 E. Main St",
    "city": "Pahokee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33476",
    "name": "Lake Village at the Glades Shelter",
    "organization": "Lake Village at the Glades Shelter",
    "phone": "",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "5930 S.E. Robinson Road",
    "city": "Belleview",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34420",
    "name": "Shepherd LightHouse and Thrift Shop",
    "organization": "Shepherd LightHouse and Thrift Shop",
    "phone": "(352) 347-6575",
    "website": "https://www.theshepherdslighthouse.org/",
    "description": "We are transitional housing in Belleview, Fl we assist homeless women 21 and over with children ages birth to 9 years. The program last about 4 to 6 months and the Mothers work and safe funding to move forward into independent living with their children.\n\nTRANSITIONAL HOUSING PROGRAM\n\nShepherd's LightHouse is a place where you and your children can call home while learning the skills to become a productive family unit in society. The staff and volunteers at Shepherd's LightHouse are committed to helping you navigate through life's storms and learn how to face challenges with confidence.  We want you to set life goals and complete the course to independence.\n\n \n\nTo be a part of our program you need to be a single mother over 21 years of age with children infant to nine years old.   You cannot be in a domestic violence crisis.  You can not be in a substance abuse crises.\n\n \nHOUSE RULES\nPROBATION FORM\nWHAT TO EXPECT\n\n    Private room for mother and child available for up to six months.\n\n    Large kitchen to prepare and store food.\n\n    Safe play areas for children.\n\n    A computer is accessible for employment search and connection to employment.\n\n    Individual life goal plan designed uniquely for your needs.\n\n\n    Life Coach Counselor to do an assessment that will help set goals, decision making, and overall growth moving forward.\n\n    Available classes for, parenting, budgeting, child development, and relationship.\n\n    Transportation to work, daycare, doctor appointments, etc....\n\n    In cases of DCF case plans, a Life Coach is provided to assist in court appointments and work directly with caseworkers.\n"
  },
  {
    "addressLine1": "320 NW 1st Ave",
    "city": "Ocala",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34478",
    "name": "Salvation Army - Center of Hope",
    "organization": "Salvation Army - Center of Hope",
    "phone": "(352) 732-8326",
    "website": "https://salvationarmyflorida.org/ocala/",
    "description": "Provides Emergency Shelter for women, men and families who would otherwise be at the mercy of the elements and those with evil intent. We offer a 42 bed men's dorm, 19 bed women's dorm, and 3 rooms for short-term occupancy by families with children."
  },
  {
    "addressLine1": "435 NW 2nd Street",
    "city": "Ocala",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34478",
    "name": "Interfaith Emergency Services",
    "organization": "Interfaith Emergency Services",
    "phone": "(352) 629-8868",
    "website": "https://iesmarion.org/",
    "description": "The Interfaith Emergency Shelter provides for single women, women with children and families that are homeless. In the women's shelter, the ladies share rooms and bathroom facilities. Living area, kitchen and laundry rooms also provide common areas. Residents are required to do daily chores and attend devotions Monday thru Friday each morning with the staff. At 8:30am each morning during the week, residents leave for the day to go to work or search for a job.\nIn the family shelter, married couples and children have a room and bathroom to themselves, and share a common kitchen area. Also on property is the Learning Center, where residents attend bible study, parenting, budgeting and other life-skill classes.\n\nA Case Manager meets with residents each week to determine their needs and barriers so that we can better equip them for a brighter future, as well as providing referrals for services offered in the community.  Our goal, is to provide a safe, comfortable haven for the residents so they have an opportunity to save money and get back on their feet as soon as possible. Interfaith provides food, hygiene and clothing as needed to each resident. Dinner is provided by local churches and organizations each night, that include a time of fellowship and sharing. Although strict rules and boundaries are enforced for the residents, they are primarily safety issues."
  },
  {
    "addressLine1": "1839 NE 8th Rd",
    "city": "Ocala",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34470",
    "name": "Open Arms Village of Ocala",
    "organization": "Open Arms Village of Ocala",
    "phone": "(352) 304-6229",
    "website": "https://openarmsvillageocala.org/",
    "description": "Your donation helps homeless individuals as they work to change their circumstances by providing food, shelter, laundering, transportation and case management.\n\n\nNo one should face the challenges of life alone. Together we can create a community that allows each individual to reach their full potential and have a second chance at life. \"It Takes a Village\" !\n\nDownload an application on the website listed above.\n"
  },
  {
    "addressLine1": "21 S. Melbourne St.",
    "city": "Beverly Hills",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34465",
    "name": "The Path of Citrus County",
    "organization": "The Path of Citrus County",
    "phone": "(352) 527-6500",
    "website": "http://www.pathofcitrus.org/",
    "description": "Our mission is to provide a Christian living environment that allows true rehabilitation. To allow long term stays for life changing biblical teachings to take effect. To encourage the work ethic, for those without a home in Citrus County."
  },
  {
    "addressLine1": "2488 North Pennsylvania Ave",
    "city": "Crystal River",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34428",
    "name": "Mission in Citrus Inc",
    "organization": "Mission in Citrus Inc",
    "phone": "(352) 794-3825",
    "website": "https://www.missionincitrus.com/",
    "description": "Our shelters help all in need.. The two in Crystal River Florida are open 24 hours.Child Molesters , or those currently wanted by the law are not welcome.\n\nOur Mission is to help all in need to the best of our ability. We follow the parable of the Good Samaritan, as there are no requirements for our services. We constantly reinvent the wheel, and adapt quickly to make it work in any situation.In 2014 , we provided over :\n\n    18,000 bed nights\n    55,000 meals\n    Tents,vehicles, supplies, building materials,food, clothing and much more to those in poverty in our community without charge.\n    Help to many of our Nation's Veterans.\n\n\n"
  },
  {
    "addressLine1": "300 SW 2nd Avenue",
    "city": "Boca Raton",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33432",
    "name": "Salvation Army Boca Raton Social Services",
    "organization": "Salvation Army Boca Raton Social Services",
    "phone": "(561) 391-1344",
    "website": "https://salvationarmyflorida.org/westpalmbeach/",
    "description": "The Salvation Army of Boca Raton is a social services location. Call for an appointment for a needs assessment. Office hours: T~F 9:30 1:30\n\nOur Social Services Office offers assistance with dry goods from our food panty, clothing from community donations, emergency furniture assistance for victims of natural disasters; and utility/rental assistance (when funding is available).\n\n\nWe may also be able to refer you to other organizations if we cannot directly assist you with your needs.\n\nAlso provided at this location are:\nClothing Vouchers to be used at our local Family Store are available on Fridays; Individuals and Families must qualify due financial strain or emergency.\nUtility and Rent/Mortgage Assistance is made by appointment ONLY; There are eligibility guidelines.\nThis is also a donation drop off location.\nThere is also a Salvation Army Family Store at this location.\n\nHomeless and Substance Abuse Services: The Boca, Delray Salvation Army attends to the basic needs of over 30 homeless people a month. We provide them with food, clothing, hygiene needs and more. We also encounter and counsel those who are battling alcohol and substance abuse. Palm Beach County is fortunate to have The Salvation Army Center of Hope, a long-term recovery program for chronically homeless or substance abuse clients who want to change their lifestyle.\n\n\nWe are also partnered with 6 different facilities in our Boca, Delray area giving us the opportunity to visit and uplift nearly 1,000 seniors on a regular basis."
  },
  {
    "addressLine1": "153 NW 12th Street",
    "city": "Pompano Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33060",
    "name": "Haitian Evangelical Baptist Church Food Pantry",
    "organization": "Haitian Evangelical Baptist Church Food Pantry",
    "phone": "(954) 479-7113",
    "website": "https://www.facebook.com/hebcpompano/",
    "description": "Provides a food pantry. Wednesdays and Fridays: 10am to 2pm."
  },
  {
    "addressLine1": "1700 Blount Road",
    "city": "Pompano Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33069",
    "name": "Broward Partnership for the Homeless North Campus",
    "organization": "Broward Partnership for the Homeless North Campus",
    "phone": "(954) 332-7499",
    "website": "https://bphi.org/",
    "description": ""
  },
  {
    "addressLine1": "1698 Blount Road",
    "city": "Pompano Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33069",
    "name": "St. Laurence Chapel Homeless Day Shelter",
    "organization": "St. Laurence Chapel Homeless Day Shelter",
    "phone": "(954) 972-2958",
    "website": "http://www.stlaurencechapel.org/",
    "description": "St. Laurence Chapel is the working name for the Episcopal Mental Health Ministries, Inc.\n\nLocated next to the Broward Outreach Center (BOC).\n\nHours: Direct Client Services are provided Mondays through Fridays 7:30 to 3:30pm. Every Sunday there is a voluntary chapel service and hot lunch from 12 to 2pm, each week provided by local Episcopal churches.\n\nTransportation Provided\nFree van transportation is provided to and from St. Laurence Chapel each morning from Pompano Beach mid-city so that the homeless are able to access services.\n\nBasic & Emergency Needs\nBreakfast, lunch,showers, clothing, mailing address, telephone to make and receive calls, hygiene kits, emergency food, bus passes, chapel services (attendance is voluntary).\n\nMedical Care\nMedical assessments, vital signs are checked, first aid, medication storage, health and nutrition, education, linkage with primary and emergency health care, appointment tracking, bus passes for medical appointments.\n\nCase Management\nComprehensive assessments, service planning, individual counseling, appointment tracking, budgeting assistance, referrals for housing, specialized supportive services, replacement of client identification cards and family reunification.\n\nOur Partnership with Holy Cross Hospital\nHoly Cross Hospital Outreach team provides confidential on site HIV testing and screening weekly.\n"
  },
  {
    "addressLine1": "840 George Bush Boulevard, Building D",
    "city": "Delray Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33483",
    "name": "Family Promise of South Palm Beach County",
    "organization": "Family Promise of South Palm Beach County",
    "phone": "(561) 265-3370",
    "website": "https://familypromisespbc.org/",
    "description": "Family Promise is the faith communities of South Palm Beach Counties response to homelessness for children and their families. The program is designed to bring temporary shelter, meals and support to these families, with the goal of empowering families to achieve long term self sufficiency.\n\n\nFP targets assistance to family units, this means parents or legal guardians with children. The family must have been making their best effort to find a permanent residence on their own. we are not equipped to handle active domestic violence, or substance abuse situations, or untreated mental illness. Potential guest families are thoroughly screened before acceptance into the program to determine if the family meats program criteria.\n\n"
  },
  {
    "addressLine1": "10540 Childers St",
    "city": "Bonita Springs",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34135",
    "name": "Cafe of Life",
    "organization": "Cafe of Life",
    "phone": "(239) 495-9325",
    "website": "https://cafeoflife.org/",
    "description": "We serve lunch to anyone who visits our location on Monday thru Friday at 10:00 A.M. No one is refused.\n\n\nOur clients are what society has termed \"less fortunate.\" They are in almost all cases \"in transition\" in their lives. They could be a wife and children of a migrant Hispanic laborer. Maybe the client is a professional who has suddenly lost his or her employment and or family or simply experiencing extreme financial difficulties. We are not interested in \"why\" they have come to us only that we demonstrate a \"caring, sharing and serving\" response to their needs. As their lives evolve into a better situation we welcome them back to visit and share their experiences.\n\nWe serve from 80 to 120 clients each day, although it is not uncommon that more than 120 clients partake of our hot lunches on any given day. In 2012 our total number of meals served was over 24,000.\n\nIn addition, the Caf of Life may provide supplemental groceries, clothing, blankets, miscellaneous personal goods, and at times furniture and appliances to clients. The Salvation Army, a partner agency, has a full-time case worker on site every day to assist clients with referrals for health care and other essential services."
  },
  {
    "addressLine1": "not provided",
    "city": "Naples",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "00000",
    "name": "The Shelter Naples",
    "organization": "The Shelter Naples",
    "phone": "(239) 775-1101",
    "website": "https://naplesshelter.org/",
    "description": "The Shelter for Abused Women & Children operates two 60 bed emergency shelters in Naples and Immokalee as well as nine transitional living cottages in Naples. We provide outreach services, school-based prevention programs and training/education classes for businesses and agencies throughout Collier County, FL. All services are provided free of charge. To find out more, call 239-775-3862"
  },
  {
    "addressLine1": "2647 Michigan Avenue",
    "city": "Kissimmee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34744",
    "name": "Salvation Army",
    "organization": "Salvation Army",
    "phone": "(407) 518-9111",
    "website": "https://www.twitter.com/salvationarmyus",
    "description": "Salvation Army is a food pantry. Serves Osceola County. Documentation Required: Photo ID, Social Security Card for all household members and Proof of Income\n\nFood pantry service hours: Mondays through Fridays 1pm and 3pm. .\n\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "2001 Airport Rd. S.",
    "city": "Naples",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34112",
    "name": "St. Matthew's House",
    "organization": "St. Matthew's House",
    "phone": "(239) 774-0500",
    "website": "http://stmatthewshouse.org/",
    "description": "St. Matthew's House has been in operation since 1988 as a feeding ministry and homeless shelter, and currently has 124 beds in Naples and 44 beds in Immokalee. Structured recovery program to assist people to become independent and self sufficient. Our mission is to provide housing to the homeless, food for the hungry in a spiritual environment that is both compassionate and disciplined.\n\n\n\nOffice Hours/Direct Assistance\n\nWed. 1:00 p.m. - 3:00 p.m.\n\nTue., Thur. 3:00 p.m. - 5:00 p.m."
  },
  {
    "addressLine1": "3174 Tamiami Trail E",
    "city": "Naples",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34112",
    "name": "Catholic Charities Family Resource Center",
    "organization": "Catholic Charities Family Resource Center",
    "phone": "(239) 793-0059",
    "website": "https://catholiccharitiesdov.org/charities/judy-sullivan-family-resource-center/",
    "description": "Financial assistance for shelter utilities and prescriptions. Food pantry. Employment placement and resettlement services to eligible refugees/entrants.\nThe Judy Sullivan Family Resource Center of Catholic Charities, Diocese of Venice, Inc. assists low- to moderate-income families and individuals in Naples. The mission of the center is to help the surrounding neighborhoods rise to a better standard of living and obtain greater self-sufficiency.\n\nPROGRAMS AND SERVICES\n\nChoice Food Pantry\n\nFood is available to individuals and families in need at a pantry where clients choose the items they prefer to eat.\n\nFamily Food Outreach Program\n\nStaff and volunteers deliver bags of food to families in need from neighborhoods who do not have access to assistance.\n\nEmpowerment Program\nGuiding clients on the path to self-sufficiency with financial assistance for transportation needs, rental and utilities, counseling, day care and education as well as referral to other service providers.\n\nEducational Programs for Adults and Seniors\n\nOffering a variety of educational opportunities and experiences for adults and seniors.\n\nFinancial Assistance\n\nFinancial aid is available to qualified individuals and families, who experience an economic emergency, for utilities, prescription medications, rent or mortgage, and other bills.\n\nWeekend Power Pack Food Program\n\nHomeless elementary students are provided food to sustain them through the weekend when school meals are not available.\n\nUndy Sunday\n\nUnderprivileged students receive assistance through an annual initiative that provides underclothing, socks, and school supplies.\n\nHoliday Food Distribution\n\nDuring the Thanksgiving and Christmas holidays, hundreds of low-income families are given special food items.\n"
  },
  {
    "addressLine1": "9538 Highway 441",
    "city": "Boynton Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33437",
    "name": "Faith Farm",
    "organization": "Faith Farm",
    "phone": "(561) 737-2222",
    "website": "https://www.faithfarm.org/boynton-beach-campus/",
    "description": "Faith Farm Ministries is a free, 10 month, faith-based, college\naccredited, addiction recovery program with residential services for\nmore than 440 men and women who have\nlost control of their lives due to alcohol and/or illegal and\npharmaceutical drug addictions. It all started in the year 1951 as\n\nFort Lauderdale Rescue Tabernacle, through Rev. Garland Eastham, who\nshowed mercy to the homeless and addicted in the streets of Fort\nLauderdale by offering food and shelter.\n\n\nContact us for more details."
  },
  {
    "addressLine1": "not disclosed",
    "city": "Boynton Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33435",
    "name": "The Lord's Place Men's Campus Boynton Beach - William H. Mann Place for Men",
    "organization": "The Lord's Place Men's Campus Boynton Beach - William H. Mann Place for Men",
    "phone": "(561) 537-4632",
    "website": "https://www.thelordsplace.org/",
    "description": "William H. Mann Place for Men\nThe Lord's Place Men's Campus is located in Boynton Beach. It provides supportive housing to 50 formerly homeless men in Palm Beach County. The Campus is comprised of two main housing programs: transitional and permanent supportive. The transitional program, which we call The Recovery Center, serves ex-offenders who have become homeless after being released from incarceration as well as those who have struggled with substance abuse and chronic homelessness. The permanent supportive housing program, Joshua House, serves residents who have demonstrated a commitment to personal growth and success and are considered leaders at the Men's Campus.\n \nEach resident is connected to a case manager that helps them develop and implement a plan to address their needs. They have the opportunity to focus on their future and work on themselves through classes, meetings and volunteer opportunities. They can also participate in The Lord's Place's comprehensive Job Training and Employment Services Program, which provides classroom-based job skills training, supervised apprenticeship opportunities and assistance searching for and obtaining employment.\n "
  },
  {
    "addressLine1": "291 N.E. 19th Avenue",
    "city": "Boynton Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33435",
    "name": "Vetsville Cease Fire House - Veterans Service",
    "organization": "Vetsville Cease Fire House - Veterans Service",
    "phone": "(561) 736-4325",
    "website": "https://vetsville.us/",
    "description": "In order to be assisted by this program you must be homeless, honorably discharged veteran, with income.\n\nProvides help to disabled homeless and hungry veterans by providing emergency residential lodging for $100 per week. No food nor transportation provided.\n\nHours of service: Everyday 9 am-5 pm"
  },
  {
    "addressLine1": "11103 Stonewood Forest Trail",
    "city": "Boynton Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33473",
    "name": "TEST",
    "organization": "TEST",
    "phone": "5617025873",
    "website": "https://www.freeclinics.com/",
    "description": "TEST"
  },
  {
    "addressLine1": "11103 Stonewood Forest Trail",
    "city": "Boynton Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33473",
    "name": "Test Clinic",
    "organization": "Test Clinic",
    "phone": "5617025873",
    "website": "https://www.freeclinics.com/",
    "description": "sdf asdf asdf"
  },
  {
    "addressLine1": "1204 14th Street West",
    "city": "Bradenton",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34205",
    "name": "Salvation Army Bradenton Emergency Shelter",
    "organization": "Salvation Army Bradenton Emergency Shelter",
    "phone": "(941) 748-5110",
    "website": "http://www.salvationarmyflorida.org/bradenton/",
    "description": "Emergency shelter for homeless men women and children. Food clothing social services provided.\nHours: 5:30 pm until 6:30 am.\nCall or come in. Evening meal served at 5:00 p.m.; shelter intake occurs after the meal. Intake procedures take place at the shelter. First 7 nights are free of charge for Manatee County residents, first 3 nights are free for out of county overnighters; each additional night is $10.00 for the first 30 stays; fee scale adjusts post 30 stays.\n\n"
  },
  {
    "addressLine1": "1400 10th Street",
    "city": "Sarasota",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34236",
    "name": "Salvation Army Shelter - Center of Hope",
    "organization": "Salvation Army Shelter - Center of Hope",
    "phone": "(941) 954-4673",
    "website": "http://www.salvationarmyflorida.org/sarasota/services/emergency-shelter/",
    "description": "Emergency Shelter /food/ vouchers/ and other assistance provided.\n\n Emergency shelter services are available to anyone in need, regardless of race, creed, age or gender.  We have more than 200 beds in the emergency shelter.   Families and individuals in need of temporary shelter are provided a safe, secure environment along with nutritional meals during their stay.We have several collaborative partners within the community to assist our clients.  Our goal is to assist them to move past the immediate crisis stage that brought them to The Salvation Army to the goal of self-sufficiency and ultimately to successful independent living.  Initially the clients needs are identified by the case managers. They first establish a plan of action to stabilize the situation, seek solutions for immediate needs and then establish long term goals. "
  },
  {
    "addressLine1": "3650 17th Street",
    "city": "Sarasota",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "00000",
    "name": "Harvest House Transitional Centers",
    "organization": "Harvest House Transitional Centers",
    "phone": "(941) 953-3154",
    "website": "http://harvesthousecenters.com/",
    "description": "Harvest House Transitional Centers is a not-for-profit social service provider located in Sarasota, FL. We provide affordable, faith-based, residential drug & alcohol treatment & supportive services, along with permanent supportive and transitional low-income housing for families and individuals whose lives have become unmanageable due to life limiting patterns resulting in homelessness.\n\nFamily Haven Emergency Shelter\nEmergency shelter is the safety-net that keeps families off the streets. Emergency housing of this type is a vital tool in the fight against homelessness. Harvest Houses Family Haven provides free housing and support services for families who have nowhere safe to sleep. Harvest House provides critical case management services to connect the family to child care, medical care, counseling, job training, and other services that will stabilize families and help them find permanent housing outside the shelter.\nFamilies who are in need of emergency shelter should call 211 for services at the Family Haven.\n\nWe are one of the only organizations in Sarasota who purchase run-down apartments and create vibrant, affordable housing specifically for homeless families, and include stability services on-site.\n\nVeteran Transitional Housing\nHarvest House offers VETS (Veterans Empowered through Transitional Services) program to adult male veterans who have struggled with emotional trauma and substance abuse after their service causing them to experience homelessness. Housing & treatment is provided to our veterans at no cost.\n\nFreedom Substance Abuse Treatment\nFounded in 1992, the FREEDOM program is your first choice for substance abuse treatment in Sarasota offering affordable substance abuse treatment to adults who have struggled with the destructive powers of alcohol and/or drug addiction tools needed to transition out of life limiting patterns and into freedom and stability. We serve citizens of Sarasota and Manatee counties among many other counties across Florida and the US. This program is appropriate for individuals serving probation or drug/alcohol charges. We are partnered with many Judicial Systems to accept individuals court ordered to enter and complete drug or alcohol treatment."
  },
  {
    "addressLine1": "507 Kumquat Court",
    "city": "Sarasota",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34237",
    "name": "Resurrection House",
    "organization": "Resurrection House",
    "phone": "(941) 365-3759",
    "website": "mailto:info@resurrectionhouse.org",
    "description": "Clothing, food, showers, laundry, day resource center for the homeless. A 501 (c)(3) non-profit, faith-based organization, Resurrection House serves as a day resource center to the homeless of Sarasota County, Florida.\n\nIf you were to walk inside Resurrection House needing help,\nwhat could you expect from us?\nFirst of all, you would be greeted at the front desk with respect and in a courteous manner by a group of dedicated volunteers.  Previous clients have their history in a folder that would be updated by their visit to Resurrection House.  A new client would go through an intake session to establish history and determine needs with a trained, caring counselor.\n\nHungry?\nThere is a meal waiting for you.\n\nDirty clothes?\nOur volunteers will wash your clothes for you.\nCleanliness?\nShower and bathroom facilities are available to you.\n\nLong hair?\nA barber volunteers and is always kept busy.\n\nStorage?\nLockers are provided both for short and long term purposes.\nNeed help?\nOur volunteer counselors are there to provide the types of assistance that best suit your particular needs.\n\nNeed transportation?\nBicycles are also available to those clients who qualify for one.\n\nMedical Help?\nA doctor is on duty three days a week.\n\nLegal Advice?\nAn attorney is here on Tuesday mornings.\n\nNeed a job?\nOur counselors will assist in any way possible.  A bus pass or bicycle will get you there.\n\nNeed clothes?\nAll types of clothing are available.  You will be dressed to succeed.\n\nNeed shoes?\nAll types of shoes including new work boots can be attained.\n\nNeed spiritual help?\nA chapel that recognizes all faiths is open daily and a retired volunteer minister is available on a regular basis.  Three wedding services were conducted in the chapel last year."
  },
  {
    "addressLine1": "820 Kennedy Blvd",
    "city": "Brooksville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34601",
    "name": "Mid Florida Community Services",
    "organization": "Mid Florida Community Services",
    "phone": "(352) 796-1425",
    "website": "http://www.mfcs.us.com/",
    "description": "Food/Financial Assistance/shelter/medication for homeless.\n\nEmergency/Support Services assistance is available to low-income households who are at 125% or less of the Federal Poverty Guidelines."
  },
  {
    "addressLine1": "1163 Howell Ave",
    "city": "Brooksville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34601",
    "name": "Jericho Road Ministries, Inc Women's Shelter",
    "organization": "Jericho Road Ministries, Inc Women's Shelter",
    "phone": "(352) 799-2912",
    "website": "http://www.jericho-road.net/",
    "description": "6 Bed facility, 9 mo. - 1 yr. Drug/Alcohol rehab. program\n\nIntake Procedures\nMen and women are received daily at the Rescue Missions for lodging at the hours listed above. Anyone under the influence of alcohol will not be permitted to enter the facility. Sunday assistance must be prearranged by 3:00PM Saturday. People interested in our Recovery Program must contact the Shelter Director by phone or in person for an admissions interview. Admission requirements are determined on an individual basis.\nClient Program Tracks\nVocational Track\nStandard 9 month Mission Recovery Program that enables a client to re-establish themselves within the community with a full-time job, dependable transportation and a furnished place to live.\nAcademic Track\nThis 6 month track is done in addition to our Standard Recovery Program. It is an educational program designed to meet the clients goals as they pursue the completion of a College and/or Trade School curriculum.  For addition information regarding this program track requirements see the Shelter Director."
  },
  {
    "addressLine1": "1090 Mondon Hill Rd.",
    "city": "Brooksville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34601",
    "name": "Jericho Road Ministries, Inc Men's shelter",
    "organization": "Jericho Road Ministries, Inc Men's shelter",
    "phone": "(352) 799-2912",
    "website": "http://www.jericho-road.net/",
    "description": "14 bed facility, 9 mo. - 1 yr. Drug/Alcohol, rehab. program\n\n\nCheck-in time is between the hours of 3 pm 5pm Sunday through Saturday at 1090 Mondon Hill Rd., Brooksville, FL 34601. (352) 799-2912 Ext. 103.\n\nIntake Procedures\nMen and women are received daily at the Rescue Missions for lodging at the hours listed above. Anyone under the influence of alcohol will not be permitted to enter the facility. Sunday assistance must be prearranged by 3:00PM Saturday. People interested in our Recovery Program must contact the Shelter Director by phone or in person for an admissions interview. Admission requirements are determined on an individual basis.\nClient Program Tracks\nVocational Track\nStandard 9 month Mission Recovery Program that enables a client to re-establish themselves within the community with a full-time job, dependable transportation and a furnished place to live.\nAcademic Track\nThis 6 month track is done in addition to our Standard Recovery Program. It is an educational program designed to meet the clients goals as they pursue the completion of a College and/or Trade School curriculum.  For addition information regarding this program track requirements see the Shelter Director."
  },
  {
    "addressLine1": "PO Box 10141",
    "city": "Brooksville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34603",
    "name": "The Life Center of Hernando",
    "organization": "The Life Center of Hernando",
    "phone": "(352) 597-0119",
    "website": "http://www.lifecenterofhernando.com/",
    "description": "Transitional housing for eight moms and their preschool children. Full program participation expected.\n\nThis is not emergency housing, but a long term program with time to give birth, complete school and become employed.\n\n\nLive in House Manger and daily support staff on hand. Life skill class attendance mandatory.\n\nNo smoking, drinking, drugs. No pets. Must have custody of child or be pregnant. Age restrictions apply (18-25).\n\nProgram fees are expected once a resident has an established income.\n\nCall for information or preinterview over phone. 352 597 0119 ask for Barbara"
  },
  {
    "addressLine1": "306 South Park Ave",
    "city": "Inverness",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34452",
    "name": "Mission in Citrus Inc - Veterans Shelter",
    "organization": "Mission in Citrus Inc - Veterans Shelter",
    "phone": "(844) 409-0970",
    "website": "http://www.adoptourveterans.org/",
    "description": "When beds are available, we provide emergency housing for veterans for up to three days. Laundry, mail, and personal items such as shampoo, soaps, and more are also provided. We set up many social events, including fishing, bowling, and other activities to help with the transition back into the community.\n\nThis transition can be harder for some than others. We offer spiritual help through the church and give a bible to all of our residents. We also offer counseling and family counseling within our veteran housing. This helps them to get back in touch with their relatives and loved ones. Programs such as counseling offers veterans assistance with their emotional problems. Many are angry and greatly benefit from our anger management courses which are available locally or online.\n\n\nEstablished in 2008, Mission in Citrus Inc. has been helping homeless veterans from all over the United States. The servicemen and women of Florida, need our help, and we are dedicated to serving them as they have served us. We are also committed to providing our donors and supporters with transparency. Our administrative costs are low because we believe that your donations should go directly towards helping these veterans.\n\nWe have a 20 bed shelter in Inverness Fl, and a 10 bed Veterans shelter in Crystal River, Fl.\n\nVeterans Receive Assistance Including: We get them computers which are used or new to help them with classes, training, and job searches. They can now get bus tickets for local needs and to go home to their family. Your adoption will help them to buy gifts for birthdays or during Christmas. Your adoption helps them with socializing and letting them know you care. We can get them rides to disability hearings or other appointments. Veterans receive help enrolling in school, WTC, or another college. You will assist the veteran in getting furnishings when they move. Your adoption will help us to take them out for a holiday meal. We deliver food to those who are disabled in their homes. This can help us to sponsor events such as a fishing trip. Those with families receive help with parenting classes. Your adoption helps us purchase toys for the children. We can provide food for those in need with your help. We can hold fundraisers for the major items needed. Our team provides veterans with hygiene supplies. Your assistance helps with bills for those in homes. Your money helps them to gain employment. You help them to get a vehicle or bicycle. Our team assists them with a job search. We can offer mentoring for veterans. We purchase new clothing."
  },
  {
    "addressLine1": "7463 W. Grover Cleveland Blvd.",
    "city": "Homosassa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34446",
    "name": "The Sanctuary Mission, Inc",
    "organization": "The Sanctuary Mission, Inc",
    "phone": "(352) 601-8025",
    "website": "http://www.sanctuarymission.org/",
    "description": "The Men's Shelter\nOur Men's Shelter provides a safe living environment with recovery focused programming that gives an opportunity to have a positive transformational culture for learning new life behaviors.  \n \nTransitional housing is the primary focus of our Mission, but along with that we provide case management, occupational training, spiritual enrichment, employment preparation and life skills training. The Mission functions as a work program, with the goal of having our residents actively participating in several avenues of training and education in order to attain their independence.\n\n \nWe are committed and focused on empowering our residents in making a successful transition. As we are working to see these goals met we also focus on recovery. Addiction comes in many shapes, sizes and forms, and this requires a process of case-by-case care. We offer Christian 12-Step Programs and personal counseling to assist our clients in their journey of recovery.\n\n\nThe Grace House\nThe Grace House provides a safe living environment for women and their children, as well as providing the specialized care of case managers and counselors to assist with their particular needs.\n \nTransitional housing is the primary focus of our Mission, but along with that we provide case management, occupational training, spiritual enrichment, employment preparation and life skills training. The Mission functions as a work program, with the goal of having our residents actively participating in several avenues of training and education in order to attain their independence.\n\n \nWe are committed and focused on empowering our residents in making a successful transition. As we are working to see these goals met we also focus on recovery. Addiction comes in many shapes, sizes and forms, and this requires a process of case-by-case care. We offer Christian 12-Step Programs and personal counseling to assist our clients in their journey of recovery."
  },
  {
    "addressLine1": "205 N. Pine Street",
    "city": "Bunnell",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32110",
    "name": "The Sheltering Tree",
    "organization": "The Sheltering Tree",
    "phone": "(386) 439-3933",
    "website": "https://flaglershelteringtree.com/",
    "description": "The Sheltering Tree is operated under the FCFAC. And opens anytime the temperature is lower than 40 degrees in Flagler County. Flagler County Family Assistance Center, Inc. (FCFAC) is a non-profit coalition of individuals, faith based communities and service organizations of Flagler County dedicated to feeding the hungry, providing shelter to the homeless while helping them transition to permanent affordable housing and preventing at-risk individuals from becoming homeless. FCFAC, Inc. believes all individuals deserve to be treated with dignity and respect and provides a doorway through which their clients can find the support they need to move forward in rebuilding their lives."
  },
  {
    "addressLine1": "810 Ridgewood Ave.",
    "city": "Holly Hill",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32117",
    "name": "Family Renew Community",
    "organization": "Family Renew Community",
    "phone": "(386) 239-0861",
    "website": "http://www.familyrenew.org/",
    "description": "Family Renew Community is a transitional housing program (6-24 months) for families with children. We are not an emergency shelter.\n\nAt Family Renew Community, we address the whole problem family homelessness in Volusia County.\n\n\nFamily Renew Community gives families with children a safe, stable place to live while parents work to attain permanent housing and regain their stability.\n\nIt is an application process that requests eight pages of current and\nbackground information that is verified.Applicants are interviewed and\nall family members 13 years and up are sent for pre-entry drug tests.If\na positive test is received they are referred to agencies that provide\ndrug counseling.Random drug testing is done during residency.If they\ntest positive, they are exited from the program.\n\nWhile living at FRC, (1) parents must be employed (2) must maintain a\nsavings housing fund with a minimum of 30% of income deposited every\n\npayday (3) must meet weekly with a case manager and submit weekly budget\nsheets with receipts attached, listing all income, expenses and amount\ndeposited into housing fund (4) help with yard cleanup (5) attend\nworkshops on parenting, money management, and nutrition (6) keep\nchildren enrolled in school. In addition, apartments are inspected\nweekly to ensure a clean living environment for the children; parents\nare encouraged to obtain GED's, enroll in college or vocational classes\nto increase their income potential, and all children are enrolled in\nsummer camp. New employment opportunities are posted weekly."
  },
  {
    "addressLine1": "501 Ridgewood Ave",
    "city": "Holly Hill",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32117",
    "name": "Daytona Rescue Mission",
    "organization": "Daytona Rescue Mission",
    "phone": "(386) 252-5570",
    "website": "http://daytonarescuemission.com/",
    "description": "homeless assistance. Call for details."
  },
  {
    "addressLine1": "605 N Segrave St",
    "city": "Daytona Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32114",
    "name": "Halifax Urban Ministries Barracks of Hope",
    "organization": "Halifax Urban Ministries Barracks of Hope",
    "phone": "(386) 252-9400",
    "website": "http://www.halifaxurbanministries.org/",
    "description": ""
  },
  {
    "addressLine1": "316 North St",
    "city": "Daytona Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32114",
    "name": "Homeless Coallition Daytona Beach",
    "organization": "Homeless Coallition Daytona Beach",
    "phone": "(386) 323-1784",
    "website": "http://www.vfcch.org/",
    "description": ""
  },
  {
    "addressLine1": "336 S Palmetto Ave",
    "city": "Daytona Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32114",
    "name": "Palmetto House",
    "organization": "Palmetto House",
    "phone": "(386) 253-4895",
    "website": "http://www.mfhp.org/",
    "description": "Emergency and Transitional housing.\n\nPalmetto House, with its forty-eight rooms, is the largest temporary housing facility in Volusia and Flagler Counties. Its purpose is to facilitate the movement of homeless families and individuals to permanent housing within a reasonable amount of time (usually 24 months). Temporary housing is primarily designed to serve homeless families with children and individuals in accordance with HUD's Office of Community Planning and Development (CPD) programs or functions. Supportive services provided to clients are case management, goal setting, counseling, life skills, alcohol/drug abuse services, mental health service referrals, other related health services referrals, Embassy of Hope assistance, Adult Basic Education, GED, HUD Certified Credit Counseling, Money Management workshop, Small Business Development classes, and permanent housing assistance. Drug screening is mandatory prior to entry and random thereafter. Participants must comply with strict house rules and make progress in meeting their established goals."
  },
  {
    "addressLine1": "5726 126th Avenue North",
    "city": "Clearwater",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33760",
    "name": "Pinellas Hope",
    "organization": "Pinellas Hope",
    "phone": "(727) 556-6397",
    "website": "https://pinellashope.org/",
    "description": "Catholic Charities established Pinellas Hope in partnership with the interfaith community, local government, businesses and other not-for-profits to assist the homeless with 250 units of emergency shelter and 156 subsidized efficiency apartment units. Pinellas Hope is located in Clearwater (Pinellas Park) on the over 20 acres of land provided by Bishop Robert N. Lynch and the Diocese of St. Petersburg in 2007. Pinellas Hope was established to serve street homeless adults by providing temporary emergency shelter. Intake is facilitated by three Community Outreach teams. Residents are assisted with food, transportation, employment assistance and social services.\n\nPinellas Hope II\n(727) 709-6713\n"
  },
  {
    "addressLine1": "P.O. Box 10594",
    "city": "Clearwater",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33757",
    "name": "Haven of RCS Domestic Violence Shelter",
    "organization": "Haven of RCS Domestic Violence Shelter",
    "phone": "(727) 442-4128",
    "website": "https://www.instagram.com/hopevillages/",
    "description": "Provides emergency shelter, transitional living and outreach services to victims of domestic violence and their children. Other services include: 24hr hotline, legal advocacy, support groups, individual counseling, cell phones, professional training, and information and referral. When a victim of domestic violence reaches out for help, The Haven of RCS provides everything from food and shelter to clothing, counseling and advocacy.\n\nOutreach services include follow-up for shelter graduates, support groups for adults and children, legal advocacy through the court process, a twenty-four-hour hot line and cellular phones for victims. Public awareness and professional training presentations can be arranged by calling 727-441-2029.\n\n\nTransitional Living provides housing for up to two years as clients save money in order to move out on their own. With eleven furnished apartments the facility can house up to sixty-six people and provides an activity center, laundry room, and playground.\n\nThe Haven is a not-for-profit agency providing safety, support and guidance for victims of domestic violence and their children. Founded on the philosophy that all people are worthy of respect and dignity, The Haven offers a continuum of services to intervene in the destructive cycle of force, fear, and violence that adult victims and children experience within the home.\n\nEligibility Victims of domestic violence"
  },
  {
    "addressLine1": "14840 49th St N",
    "city": "Clearwater",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33762",
    "name": "Pinellas Safe Harbor",
    "organization": "Pinellas Safe Harbor",
    "phone": "(727) 464-8058",
    "website": "https://www.pcsoweb.com/pinellas-safe-harbor",
    "description": "Mission\n\nPinellas Safe Harbor is a cost-effective shelter and service headquarters for homeless people involved in the criminal justice system in Pinellas County. It is also a portal for inmates re-entering our community from the Pinellas County Jail (PCJ).\n\nPinellas Safe Harbor opened January 2011, and the primary objective of the shelter is to keep Pinellas County's homeless population out of the criminal justice system. Pinellas Safe Harbor provides these men and women with a safe environment while they pursue services needed to get back on their feet. As a result, the population of ordinance violators and non-violent offenders in the Jail reduces, resulting in significant savings to taxpayers.\n\n\nPinellas Safe Harbor is operated by the Pinellas County Sheriffs Office in partnership with the Pinellas/Pasco Public Defender's Office, WestCare Foundation, Metropolitan Ministries, Pinellas County Health and Human Services, Directions for Living, and the Pinellas County Homeless Leadership Board.\nCapacity\n\nThe total capacity for Pinellas Safe Harbor is 470 with an average population of 400. Men and women share common facilities during the day but are housed in separate housing units at night. Intake staff completes an initial assessment of each homeless persons appropriateness for the facility.\nExpenses\n\nPinellas Safe Harbor's operational costs are offset by monetary donations from participating cities, civic groups, and citizens that have contributed significantly to the program.\nSecurity\n\nInternal security is provided by G4S Services (contractor). Facility perimeter security is maintained by existing Pinellas County Jail perimeter patrols. There are five community policing deputies assigned to roving shifts at Pinellas Safe Harbor. These deputies assist in law enforcement matters at Pinellas Safe Harbor and provide the surrounding community with dedicated service. Additionally, there is a Street Outreach Program community policing deputy based out of Pinellas Safe Harbor who works with a Directions for Living social worker.\nServices\n\nThree hot meals, prepared at Metropolitan Ministries or partnering churches, are served daily.\n\nDonations of new socks and underwear are provided to residents when they're available, and racks of donated clothes are also available for use. CLICK HERE for a list of acceptable donation items.\n\n\nThere are washers and dryers on the premises so residents can do their own laundry.\n\nHomeless clients who are employed or require transportation to employment or medical appointments will be accommodated as it is feasible.\n\nLoaner bikes are available for residents to check out.\n\nThe Pinellas Suncoast Transit Authority (PSTA) buses stop near the shelter, and PSTA route maps are available at the shelter.\n\nGroups: Alcoholics Anonymous, Narcotics Anonymous, HIV awareness, various worship and religious services, etc.\n\nClasses: Parenting, Life Skills, Walkwise-Pedestrian Safety, Jobs for Life, and Ready to Rent.\n\nMedical services are provided onsite at the Bayside Clinic through Pinellas County Human Services Monday through Friday. Residents receive basic health care and referrals for medical, dental, and mental health services.\nMaintenance\n\nResidents are asked to help maintain the facility with assistance from inmate workers from the jail.\n\nIn addition to the team of case managers who are onsite to guide the residents through their transition to permanency and self-sufficiency, Pinellas Safe Harbor works with:\n\nPinellas County Sheriffs Office Social Workers needs assessments, coordination of services and placements, mental health and substance abuse referrals\n\n\nPublic Defenders Office Homeless Outreach Diversion Assessments for homeless ordinance violators, Public Defenders Office connection\n\nWestcare Substance abuse evaluations, substance abuse counseling, recovery services\n"
  },
  {
    "addressLine1": "1120 N. Betty Lane",
    "city": "Clearwater ",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33755",
    "name": "Homeless Emergency Project, Inc. (HEP)",
    "organization": "Homeless Emergency Project, Inc. (HEP)",
    "phone": "(727) 442-9041",
    "website": "https://www.hepempowers.org/",
    "description": "HEP is a registered 501 (c)(3) charitable organization. Our mission is to provide homeless and very low-income individuals and families with housing, food, clothing, and support services necessary to obtain self-sufficiency and improved quality of life.\n\nAs one of the oldest and largest providers of housing and support services to the homeless in Pinellas County, HEP has been helping to build hope and transforming the lives of families and individuals who are homeless since 1986.\n\nWHAT WE DO\n\n\nAt HEP we offer an array of services to empower homeless individuals and families to end their cycle of homelessness, increase self-sufficiency, and improve health outcomes.\n\nWe provide 300 beds of supportive housing: emergency and transitional housing for the temporarily homeless and permanent supportive housing for disabled individuals and families.\n\n\nAccording to the U.S. Department of Housing and Urban Development, supportive housing is proven to have powerful impacts, ending chronic homelessness for individuals who may also be living with a disability, mental illness, or an addiction.\n\nSupportive housing benefits people who shuffle between shelters, the streets, and hospital emergency rooms and gives them the tools needed to become self-sustaining. Supportive housing saves public funds and helps to end the vicious cycle of homelessness."
  },
  {
    "addressLine1": "9627 Pasofino Lane",
    "city": "Clermont",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34711",
    "name": "Elyon House of Bread Food Pantry & Shelter",
    "organization": "Elyon House of Bread Food Pantry & Shelter",
    "phone": "(352) 242-1630",
    "website": "https://elyonhouseofbreadfoodpantryandshelterinc.business.site/",
    "description": ""
  },
  {
    "addressLine1": "29 W. Smith St",
    "city": "Lakeland",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33801",
    "name": "Safe Families for Children",
    "organization": "Safe Families for Children",
    "phone": "(863) 232-9815",
    "website": "http://safe-families.org/",
    "description": "Safe Families is a network of host families that provide a loving home where parents can safely place their children in times of crisis. Host Families, prompted solely by compassion, are screened, trained and serve without compensation. As a result, this program is a voluntary, non-coercive alternative to the foster care system. By temporarily freeing parents from the responsibility of caring for their children, we provide them the time to address personal issues without fear of losing custody."
  },
  {
    "addressLine1": "113 Aurora Street",
    "city": "Cocoa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32922",
    "name": "Central Brevard Sharing Center",
    "organization": "Central Brevard Sharing Center",
    "phone": "(321) 631-0306",
    "website": "https://sharingcenter.org/",
    "description": "When the temperature drops to 45 degrees or below we convert our community kitchen in to a Cold Night Shelter. Please call (321) 631-0306 to see if the shelter is planning to be open. Doors open at 6:00 PM and space is limited. All are welcome.\n\nCommunity Kitchen\nWe provide a nutritious and well balanced meal through our community kitchen program. Everyone is welcome. Serving times are: Monday through Saturday: 11:00 a.m. 1:00 p.m. Sundays: A bagged lunch is served from 2:00 p.m. to 3:00 p.m. Everyone is welcome!\n\nClothing and Household items\nWe have an on-site Thrift Store from which we give basic household essentials and clothing to individuals and families. CLIENT REQUIREMENTS:\nClients are eligible every 30 day for clothing and every 6 months for household goods.\n\nClients must reside in the central section of Brevard County.\nClients must provide an original social security card\n\nFood Pantry\nWe provide an emergency supply of food to individuals and families. Services are provided Monday through Friday from 9:00 a.m. to 3:00 p.m.\n\nCLIENT REQUIREMENTS:\nReside in the central section of Brevard County Pt. St John south to the Pineda Causeway, Orange/Brevard County line east to the ocean.\nComplete and sign Client Assistance Form\n"
  },
  {
    "addressLine1": "4087 S US 1, Suite 3",
    "city": "Rockledge",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32955",
    "name": "Housing For Homeless",
    "organization": "Housing For Homeless",
    "phone": "(321) 639-0166",
    "website": "https://housingforhomeless.org/",
    "description": "ProgramHousing for Homeless provides a safe harbor for the homeless with properties scattered throughout Brevard County. For those who are able, our Housing for Homeless provides homes and supportive services for homeless individuals, families with children and the elderly. Our Housing Programs has a maximum stay of one year, as that is considered to be a sufficient period for those who want to turn their life around and re-establish themselves in as independent living situation.\nOnce in the Program, our Case Managers are ready and able to assist our clients in achieving their Personal Improvement Plan, which enables them to accomplish their short and long-term goals. Our staff provides motivation through supervision, empathy, and recognition of client's success. In addition, clients are exposed to the wide range of social services that are available throughout Brevard County. We offer classes on budget management, offer substance abuse and mental health counseling and have an employment specialist who works with clients who are willing to take advantage of this opportunity to turn their lives around.\n\nThe program also provides intervention services in crisis situations at critical stages with appropriate, professional resources and effective case management. Our range of services provided includes, but are not limited to:\nHousing Placement\n    Intake and Assessment\n    Case management and Support Services\n    Rapid Rehousing Assistance\n    Access to a network of Social Service Agencies and Community Collaboration\nCriteria for Admission\nApplicants to the Housing for Homeless Program must be homeless or referred to us by one of our partner agencies. Applicants must complete a \"Intake Application\" in person and provide all supporting documentation. If approved, an appointment will then be made by the Case Manager for an in-depth interview and assessment of needs. Placement times vary and can take up to several months.\nHousing Facilities\nHousing for Homeless properties are primarily located in the north and central areas of Brevard County.\n\n"
  },
  {
    "addressLine1": "120 Duggan Avenue",
    "city": "Crestview",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32536",
    "name": "Crestview Area Shelter for the Homeless",
    "organization": "Crestview Area Shelter for the Homeless",
    "phone": "(850) 398-5670",
    "website": "https://crestviewshelter.org/",
    "description": "Hours of Operation\nMon 11 am-4 pm, Wed 9 am-4 pm, Fri 1 pm-4 pm\n\nProvides services for the homeless, including food, clothing, showers and laundry services. They can assist with taking someone to a Doctor when sick and make sure they get medicine. They can also assist with getting an ID, applying for Social Security and food stamps, applying for housing assistance, and applying for VA benefits."
  },
  {
    "addressLine1": "305 Lovejoy Road",
    "city": "Fort Walton Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32548",
    "name": "Opportunity Place, Inc. - For Women And Families",
    "organization": "Opportunity Place, Inc. - For Women And Families",
    "phone": "(850) 659-3190",
    "website": "http://www.opifwb.org/",
    "description": "Opportunity Place, Inc (OPI) is a temporary emergency shelter for single women and families with children under the age of 18 who are at imminent risk of homelessness. We help clients obtain sustainable employment and stable/affordable housing and connect them with community resources. The mission of OPI is to help women and families achieve self-sufficiency. Based on availability there may be a waiting list), we can accommodate up to 35 people (includes infants and children). Please call ahead."
  },
  {
    "addressLine1": "8 Bobolink St NE",
    "city": "Fort Walton Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32548",
    "name": "Fresh Start",
    "organization": "Fresh Start",
    "phone": "(850) 243-5648",
    "website": "http://freshstartfl.com/",
    "description": ""
  },
  {
    "addressLine1": "16 Ferry Road SE",
    "city": "Fort Walton Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32548",
    "name": "Shelter House Domestic and Sexual Violence Center",
    "organization": "Shelter House Domestic and Sexual Violence Center",
    "phone": "(850) 243-1201",
    "website": "http://www.shelterhousenwfl.org/",
    "description": "Shelter House is a non-profit center serving domestic and sexual violence victims and survivors in Okaloosa and Walton counties. The supportive, non-judgmental environment at Shelter House works to make every survivor feel safe, empowered and confident. Domestic and sexual violence cross all age, racial, ethnic, nation-orientation, sexual, gender preference, spiritual and socioeconomic boundaries.\n\nAll services provided by Shelter House are free and confidential for victims and include a 24-hour hotline, crisis counseling, advocacy, outreach, primary prevention, transitional housing, confidential shelter and supportive services for family members of sexual violence victims.\n"
  },
  {
    "addressLine1": "307 Harbor Blvd",
    "city": "Destin",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32541",
    "name": "Blue Door Homeless Outreach Ministry",
    "organization": "Blue Door Homeless Outreach Ministry",
    "phone": "(850) 650-2737",
    "website": "https://standrewsbtsepiscopal.org/",
    "description": ""
  },
  {
    "addressLine1": "Polo Park",
    "city": "Davenport",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33897",
    "name": "The Foundation",
    "organization": "The Foundation",
    "phone": "(863) 250-4357",
    "website": "https://www.zephyrusfoundation.org/",
    "description": ""
  },
  {
    "addressLine1": "330 N Beaumont Ave",
    "city": "Kissimmee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34741",
    "name": "H.O.M.E. of Osceola",
    "organization": "H.O.M.E. of Osceola",
    "phone": "(407) 742-8402",
    "website": "http://www.osceola.org/agencies-departments/human-services/home-program/",
    "description": "Women and children program for transitional housing. Call for details."
  },
  {
    "addressLine1": "241 Thornberry Branch Ln, Daytona Beach, FL 32124, USA",
    "city": "Daytona Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32124",
    "name": "Homeless 2 Home",
    "organization": "Homeless 2 Home",
    "phone": "3862328842",
    "website": "https://www.homeless2home.org/",
    "description": "We are a faith led 501c3 charity on a mission to provide safe, comfortable, permanent housing for very low income veterans & senior citizens to end their housing insecurity. Building for the future with the development of a Tiny Acres, a Tiny Home Village to prevent homelessness. Helping people now with guidance to current community housing opportunities in Central Florida."
  },
  {
    "addressLine1": "434 South Woodland Blvd",
    "city": "DeLand",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32720",
    "name": "The Neighborhood Center of West Volusia",
    "organization": "The Neighborhood Center of West Volusia",
    "phone": "(386) 734-8120",
    "website": "http://www.nhcwv.org/",
    "description": ""
  },
  {
    "addressLine1": "1701 W 13th St",
    "city": "Sanford",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32771",
    "name": "Rescue Outreach Mission",
    "organization": "Rescue Outreach Mission",
    "phone": "(407) 321-8224",
    "website": "http://www.rescueoutreachcfl.org/",
    "description": "Emergency Shelter For Homeless.\n\nMen\nOur Men's shelter is a 48 bed facility that houses men needing emergency shelter or a transitional place to stay. Residents stay in the Men's shelter for as little as one night or for several months depending on their situation.\nWomen and Children\nOur Woman and Children's facility is currently being expanded from 36 to 46 beds. Mom's with kids stay in a private room with their children and we can accommodate for up to 4 children in a room. There is a dormitory style room for individual woman, some needing shelter from domestic violence.\n\nThe Rescue Outreach Mission exists to serve disadvantaged people throughout Central Fla communities by providing resources that help prevent homelessness and by helping those who are already homeless return to self sufficiency.\n\nWOMEN AND CHILDREN\nStay in private rooms that can accommodate between 1 to 5 children at a time.\nThe rooms have beds for you and the children and usually include a closet.\nINDIVIDUAL WOMEN\nStay in a newly constructed dormitory style room.\nMEN\nStay in the men's building in dormitory style rooms.\nThere are three wings and each individual has their own locker."
  },
  {
    "addressLine1": "PO Box 5094",
    "city": "Destin",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "00000",
    "name": "Hosanna House",
    "organization": "Hosanna House",
    "phone": "(850) 837-7430",
    "website": "http://hosannahousedestin.org/",
    "description": "We are a Christ-centered transitional living facility located in Destin, Florida. We offer hope to women who have been through crisis situations by providing a holistic residential program that focuses on physical, emotional, and spiritual healing; all of which are necessary for a new beginning in life. The goal of Hosanna House is for a woman to become a whole and healthy member of the community, able to give as she has been given to.\n\nOffice Hours:\nMonday - Friday\n9:00 am - 3:00 pm\n\nHosanna House is a place of new beginnings for women. It is a Christ-centered haven that provides hope through teaching and a loving environment to meet the challenges of a renewed life.\nMission\nThe mission for Hosanna House is to provide a place where women can come to be renewed. The ministry is based on Isaiah 61:1-4.\nGoals\nHosanna House has four specific goals for the women who are served:\n    to share the Gospel of the Good News of Jesus Christ,\n    to achieve emotional and spiritual healing,\n    to transform the inner person, and\n    to give hope for the future.\n\nWhat are the requirements to enter the Hosanna House program?\n    Being addiction free for at least six months, independent of incarceration or an inpatient facility. (This includes all illegal drugs, prescription drugs, & alcohol.)\n\n    Being willing and able to work full time and/or attend the local job training center full time.\n    Having a strong desire to change your life for the better and to become whole, healthy, and self-supporting.\n    A willingness to make a sincere commitment to the 6-9 month program.\nWhat type of woman do we assist?\nHosanna House is geared towards women who truly want to change their life and come out of abusive and dysfunctional lifestyles into a healthy and self-supporting life. Hosanna House wants to offer hope to women without resources who are struggling to better themselves.\nWhat is unique about Hosanna House?\nThe goal of Hosanna House is not short-term housing but rather it is to provide women without resources a wholesome atmosphere where they can become independent and healthy members of the community. The focus of Hosanna House is on physical, emotional and spiritual healing which is the foundation of new beginnings.\nHosanna House takes a holistic, Christ-centered approach by offering programs that will enable a woman to receive healing in all three areas. Programs include life skill classes, practical classes, and spiritual programs. Although the life skill and practical classes are necessary for women to become stable and independent, the spiritual programs are most important to the healing process. In order for healing to occur, a woman must truly begin to experience God's presence in her life and realize the hope that she can receive from opening her life to Jesus. Through these Christ-centered programs, a woman can find strength and renewed purpose in her life.\nHow long can a woman stay at Hosanna House?\nHosanna House provides a residential program that lasts from 6 to 9 months depending on the individual's need."
  },
  {
    "addressLine1": "1991 Testcourt",
    "city": "Dunnellon",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34430",
    "name": "Annie Johnson Senior Center Free Meals",
    "organization": "Annie Johnson Senior Center Free Meals",
    "phone": "(352) 489-8021",
    "website": "https://www.dunnellonbusiness.com/senior.htm",
    "description": "Office hours:\n8:30 A.M. to 2:00 P.M.\n\nAssistance Hours are\n8:30 AM to 1:00 PM\n(352) 489-8021\n\nAssistance with Rent/Mortgages\nAssistance with Utility Payments\nReferrals to other Agencies\nYear-Round Food Baskets\nChristmas Baskets\n\nCongregate Meal Site For Seniors:\nThe only requirement for the congregate meals is 60 years of age. There is no cost for this service, but donations are gladly accepted.\n"
  },
  {
    "addressLine1": "2600 Peters ST",
    "city": "Palatka",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32177",
    "name": "R L Simmons House",
    "organization": "R L Simmons House",
    "phone": "(386) 328-0984",
    "website": "mailto:sheila@heartofputnam.com",
    "description": "Intake hours at the Palatka Christian Service Center-call for appointment 386 328 0984. Hours 9am until 2pm."
  },
  {
    "addressLine1": "1797 Old Moultrie Road, Suite 107",
    "city": "Saint Augustine",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32084",
    "name": "Alpha Omega",
    "organization": "Alpha Omega",
    "phone": "(904) 823-8588",
    "website": "https://www.aomh.org/",
    "description": "Office Hours:\nMonday thru Friday 9:00 am to 4:00 pm\n\nProvides housing to expecting single moms, children and the elderly.If you are experiencing the following in your life, you may qualify to enter our Program:\nAre you a single mother or pregnant and 18 years old or older?\n\nAre you homeless or soon to be homeless with no other alternative housing arrangements such as with a family member or close friend?\nAre you currently drug free and committed to remain so? We are not set up as a drug rehab. We are willing to place your child in our extended family program while you complete a rehab program of your choosing. Upon completion, you and your child can come into our resident program together.\nIf pregnant, are you considering parenting or adoption?\nAre you looking to work and further your education? All residents are required to work and, if applicable, attend school while in our program.\nAre you looking to build a foundation on God's Word? We are a faith based ministry and require our residents to attend church and daily bible studies. Are you willing to let us teach you how God can help you get your life on track?\n\nAre you willing to do whatever it takes to transition your life from instability to stability?\n\nIf you meet the above criteria, please contact Alpha-Omega Miracle Home and a specialist will get back to you shortly!"
  },
  {
    "addressLine1": "2450 Old Moultrie Rd #202",
    "city": "Saint Augustine",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32086",
    "name": "Betty Griffin House Domestic Violence Shelter",
    "organization": "Betty Griffin House Domestic Violence Shelter",
    "phone": "(904) 808-8544",
    "website": "https://bettygriffincenter.org/",
    "description": "24 Hour Help Line: (904) 824-1555\nBetty Griffin House is a safety shelter for victims of domestic violence and their children as well as rape victims who are in danger after the crime. Crisis counselors are available 24 hours a day, 7 days a week to talk with domestic violence and/or sexual assault survivors; and their families and friends who need help. Counseling and support groups are available for for the victim/survivor and/or their families. Legal assistance and advocacy are provided as well as Batterer's Intervention program.\nServices:\nSafe Shelter\n24-Hour Help Line\nSexual Assault Recovery\nConfidential Counseling\nSupport Groups\nPeace Club\nLegal Assistance\nCommunity Education\n"
  },
  {
    "addressLine1": "62 Chapin St",
    "city": "St. Augustine",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32084",
    "name": "Emergency Services and Homeless Coalition St Johns County",
    "organization": "Emergency Services and Homeless Coalition St Johns County",
    "phone": "(904) 819-0059",
    "website": "http://www.homelesscoalitionstjohns.com/",
    "description": ""
  },
  {
    "addressLine1": "70 Washington St",
    "city": "Saint Augustine",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32084",
    "name": "St Francis House",
    "organization": "St Francis House",
    "phone": "(904) 829-8937",
    "website": "https://www.stfrancisshelter.org/",
    "description": "Operates emergency shelter and emergency food programs\n\nProvides housing for currently homeless men and women. This is an alcohol and drug free agency. Also offers counseling, referral services, and eyeglasses.\n\n\nRestrictions: Cannot have outstanding warrants, be a registered sex offender, or have a history of violence.\n\nEmergency Services:\nSt. Francis House is the only full time emergency shelter between Jacksonville and Daytona Beach; serving St. Johns, Flagler, Clay, Putnam and Duval Counties. Check in is at 5:30 PM.\n\nWe currently have dormitory facilities to accommodate 16 men, and 8 women. Using the HUD formula, St. Johns County currently needs over 100 emergency beds, with that number slated to grow as the county grows. St. Francis House currently has the capacity to house 5 families seeking emergency shelter. Our total bed capacity is now 38.\n\nSoup Kitchen:\nSt. Francis House serves thousands of hot meals each year. These free and nutritious meals are often the only meal of the day for the poor and homeless of the area. Daily meals are served seven days a week.\n\nFood Pantry:St. Francis House provides food baskets to families and individuals On Mondays, Wednesdays, and Fridays from 12:00 pm to 2:00 pm.\n\n\nYou must bring ID and social security numbers for yourself and family members that you need services for.\n\nClient Support Services:In 2013, St. Francis House provided 163,981 essential services to clients in need. St. Francis House provides a variety of client support services including referrals for housing, food, health care, education, career development, bill payment, birth certificate and I.D. procurement, transportation, and counseling."
  },
  {
    "addressLine1": "16 W. St. Louis Ave.",
    "city": "Eustis",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32727",
    "name": "Helping Hands Ministries - Day Shelter",
    "organization": "Helping Hands Ministries - Day Shelter",
    "phone": "(352) 460-5498",
    "website": "https://twitter.com/helpinghandsoca",
    "description": "Hours: Mondays through Fridays 9:30am - 2pm.\nProvides a day shelter for the homeless.\n\nIn addition they reach out to the need s of the indigent, disabled, elderly, and low income people, providing educational support while attending to their immediate needs. The program incorporates skill-building for low-skilled workers, job placement once marketable skills are acquired & providing permanent housing to homeless families. Services offered: Referral, housing, resume writing, skill building & computer literacy and lunch."
  },
  {
    "addressLine1": "6215 Holly St",
    "city": "Zellwood",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32798",
    "name": "Anthony House - Transitional Housing",
    "organization": "Anthony House - Transitional Housing",
    "phone": "(352) 383-9242",
    "website": "http://anthonyhouse.net/",
    "description": "Anthony House is a transitional housing facility offering homeless families and individuals interim housing as well as life skills training that allows them to become self-sufficient and independent.\n\n\nThis is NOT a homeless shelter, it is a transitional housing facility.\n\nLifeStream is a fully licensed and accredited behavioral health and social services organization located in Central Florida, primarily serving residents of Lake and Sumter Counties for over 40 years. LifeStream provides quality treatment, education, case management and rehabilitation services to children, adolescents, adults and seniors in 20 locations.\nServices:\nRecovery and resiliency from substance abuse and mental health as a foundation for homelessness prevention\n\nImproving parenting and family relationships\nSustaining gainful employment or eligibility for disability services\nStabilization of housings\nBuilding a healing and supportive community, and reintegration with mainstream society.\n\n\nThe target population for Anthony House is intact families, and veterans The length of stay will depend on the severity of the family situation and progression through the stages of the program.\n\nAnthony House will help consumers build a future in which they can become a responsible member of the community. This will be accomplished by providing interim housing, wrap around services and rapid re-housing principles that will help to address the myriad issues, determinants and institutions that contribute to homelessness. Wraparound services refer to a comprehensive service provision model that guarantees that any of the services needed by an individual or family are integrated through a cohesive individualized services plan that guides all services. Anthony House will provide offices on-site for other community agencies to deliver services to the residents. Agencies will work together to develop a plan of action for each family focusing on health care, employment services, education, mental health and substance abuse, child care and transportation services."
  },
  {
    "addressLine1": "4361 SW 25th Street",
    "city": "Fort Lauderdale",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33317",
    "name": "The Homeless Voice Shelter",
    "organization": "The Homeless Voice Shelter",
    "phone": "(954) 924-3571",
    "website": "https://www.homelessvoice.org/",
    "description": "Housing Locations\n\nSouth Florida\n\nCentral Florida\n\nNorth Florida\nWhat to expect when you call\n\nEmpathetic and non-judgmental listening and emotional support\nAssessment of needs and homeless situation\nInformation and referral to support programs, such as meal locations and showering facilities\n\nScreening and preliminary client intake for shelter placement\nConnect homeless individuals with Homeless Outreach Teams\nPrioritize critical needs and provide ongoing support and referrals to families on shelter waiting list\nConnect homeless families with shelter beds as they become available\nProvide specialized information and referrals to other services such as legal, intervention, financial assistance, basic needs and medical care\n\n"
  },
  {
    "addressLine1": "5631 Van Dyke Road. Lutz",
    "city": "Fort Lauderdale",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33312",
    "name": "Salvation Army Fort Lauderdale",
    "organization": "Salvation Army Fort Lauderdale",
    "phone": "(813) 962-6611",
    "website": "https://salvationarmyflorida.org/fortlauderdale/",
    "description": "The emergency night shelter is an open door shelter that provides beds to homeless individuals without children. Homeless individuals can place their name on the list for drawing by calling or by walking in.\n\nIntake: Contact 954-524-6991 on Mondays between 12:00 and 2:00 PM, or walk in to the shelter on Mondays between 4:00 and 5:15pm\n\n\nThe Open Door project provides safe shelter to 45 chronically homeless people each night.  For some homeless people, especially those who have been on the street for a length of time, lack of trust inthe system keeps them from seeking shelter.  The only commitment at this facility will be a one night stay, which includes breakfast.\n\nEach night, homeless people seek safety and a comfortable bed; they also have the opportunity to engage with our staff and some begin to believe that a different way of life is possible.\n\n    Homelessness is a challenge shared by all members of the community, and The Salvation Army is taking a proactive approach to meeting a critical unmet need through the Open Door low demand shelter.\n    The goal of the Open Door project is to build trust with chronically homeless people who then may be more willing to receive services to help them attain permanent housing.\n\n    The Salvation Army collaborates with 211 Broward and other homeless providers in the Broward County Continuum of Care including Broward Partnership for the Homeless and Broward Outreach Centers.\nEmergency Assistance\n\nHomelessness has a very high cost, both in terms of money and the emotional trauma and upheaval suffered by those who are affected. By helping people in crisis to remain in their own homes and feed their families on a temporary basis until they can stabilize their situation, The Salvation Army works to minimize the problems by providing emergency funds for rent or mortgage assistance on a one time basis.\n\nWhen funding is available, Rent and/or Mortgage assistance is provided to any resident of Broward County.  Applicants must call the main line at 954-524-6991 and put their name on a list.  A case manager calls the applicant within 72 hrs. to do a preliminary screening on the phone.  If the applicant appears to qualify, they will be given an appointment and a list of documentation they must bring to the appointment.  All documentation must be verified prior to approval of their application.\n"
  },
  {
    "addressLine1": "733 Breakers Avenue",
    "city": "Fort Lauderdale",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33304",
    "name": "Covenant House Florida",
    "organization": "Covenant House Florida",
    "phone": "(954) 561-5559",
    "website": "https://www.covenanthousefl.org/",
    "description": "Our Residential Center welcomes you 24 hours, 7 days a week, 365 days a year with no questions asked. If you need a safe place to stay, please contact us.\n\nWe accept all youth ages 11-21 in Fort Lauderdale\n\nEach year, we reach hundreds of kids in Fort Lauderdale and Orlando via street outreach, crisis shelters, transitional housing projects, and aftercare, making Covenant House Florida one of the largest private agencies serving runaway and homeless youth in the state of Florida.\n\nThe demand for emergency shelter currently exceeds our financial capacity, and we have waiting lists in both Fort Lauderdale and Orlando. We ask all referral sources, e.g. law enforcement personnel, social service representatives, pastors, teachers, and guidance counselors, as well as youth and parents seeking help to call ahead to determine if a bed is available."
  },
  {
    "addressLine1": "920 NW 7 Avenue",
    "city": "Fort Lauderdale",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "00000",
    "name": "BC Central Homeless Assistance Center",
    "organization": "BC Central Homeless Assistance Center",
    "phone": "(954) 779-3990",
    "website": "https://bphi.org/",
    "description": "If you are experiencing homelessness, you must call the HOMELESS HELPLINE 954.563.HELP (4357) (Broward County only)\nOperated by The Broward Partnership for the Homeless, 200 bed facility with comprehensive services for men, women andfamilies. Admission by referral only. Call the number provided for full details."
  },
  {
    "addressLine1": "1100 N Andrews Ave",
    "city": "Fort Lauderdale",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33311",
    "name": "Hope South Florida",
    "organization": "Hope South Florida",
    "phone": "(954) 566-2311",
    "website": "https://www.hopesouthflorida.org/",
    "description": ""
  },
  {
    "addressLine1": "3217 NW 10th Terrace, Suite 307",
    "city": "Fort Lauderdale",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33309",
    "name": "Broward County Homeless HelpLine",
    "organization": "Broward County Homeless HelpLine",
    "phone": "(954) 563-4357",
    "website": "https://twitter.com/browardhip",
    "description": "Broward County Homeless Helpline.\nAnyone seeking Broward County Homeless information / referral or a homeless individual / family in Broward County.\nThe Homeless Helpline provides a single point of entry into the homeless continuum of care. Homeless individuals and families call in to complete in-take assessment and are referred to an available shelter space.\n(954) 563-4357 - Homeless Helpline\n(954) 537-0211 - Helpline\n(888) 537-0211 - Toll Free"
  },
  {
    "addressLine1": "920 NW 7th Avenue",
    "city": "Ft Lauderdale",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33311",
    "name": "Broward Partnership for the Homeless Central Campus",
    "organization": "Broward Partnership for the Homeless Central Campus",
    "phone": "(954) 779-3990",
    "website": "https://bphi.org/",
    "description": "All homeless housing interventions in Broward County are accessed through Broward County's Homeless Coordinated Entry and Assessment Screening, Information and Referral (CEASIR). Please contact the Homeless Helpline at 954.563.HELP [4357] to obtain your CEASIR.\n\nWe provide 498 beds of emergency shelter at the Central and North Homeless Assistance Centers in Fort Lauderdale and Pompano Beach, 100 units of scattered-site permanent housing interventions, and a complete array of health and social services. Broward Partnership directly provides every client with food, case management, primary and oral health care, mental health diagnosis and treatment, substance abuse prevention, intervention and treatment, parenting education, family therapy, vocational training and job placement, practical life skills classes, and housing search and placement assistance that leads to rapid and permanent supportive housing.\n"
  },
  {
    "addressLine1": "310 14th Ave South",
    "city": "St Petersburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33701",
    "name": "Salvation Army (Red Shield Lodge)",
    "organization": "Salvation Army (Red Shield Lodge)",
    "phone": "(727) 821-9123",
    "website": "http://www.salvationarmyflorida.org/stpetersburg/emergency-social-services/",
    "description": "Emergency Shelter for Homeless. 3 hot meals a day, 112 bed shelter, 30 night free stay, several programs. Access to One-Stop and Christian Cafe.\n\nDesigned for individual men and women who choose not to participate in our programs but just need a good night's rest, a hot shower and a hot meal.\n\nLimited to 7 consecutive nights."
  },
  {
    "addressLine1": "4231 Desoto Ave.",
    "city": "Fort Myers",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33905",
    "name": "Serenity Center and Shelter",
    "organization": "Serenity Center and Shelter",
    "phone": "(239) 693-7911",
    "website": "https://www.facebook.com/SerenityHouseWomensShelterInc/",
    "description": "Transitional housing / shelter for men. Faith based."
  },
  {
    "addressLine1": "599 Carolina Ave",
    "city": "Fort Myers",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33905",
    "name": "Ann's Restoration House",
    "organization": "Ann's Restoration House",
    "phone": "(239) 694-0877",
    "website": "mailto:restorhouse@yahoo.com",
    "description": "Ann's Restoration House is a Christian transitional residence that was established for persons who battle mental illness and substance abuse. It is committed to providing a structured, supportive program for those seriously seeking to obtain and maintain long term sobriety.\n\nFaith based, 12 step program based.\n\nOffice hours: Monday - Friday, 9:00 am - 5:00 pm"
  },
  {
    "addressLine1": "6900 Mission Lane",
    "city": "Ft Myers",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33916",
    "name": "Ft Myers Rescue Mission",
    "organization": "Ft Myers Rescue Mission",
    "phone": "(239) 334-7365",
    "website": "https://www.facebook.com/Fort-Myers-Rescue-Mission-647480678663644/",
    "description": "Emergency Shelter/Clothing/Meals on site and street. Provides shelter, counseling, job search for 65 male clients.\n"
  },
  {
    "addressLine1": "129 Gibson St",
    "city": "Lexington",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "29072",
    "name": "Samaritan's Well - Shelter for women",
    "organization": "Samaritan's Well - Shelter for women",
    "phone": "(803) 785-4357",
    "website": "https://samaritanswellsc.wordpress.com/",
    "description": ""
  },
  {
    "addressLine1": "1203 Orange Avenue",
    "city": "Fort Pierce",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34950",
    "name": "Image of Christ - The Village Shelter",
    "organization": "Image of Christ - The Village Shelter",
    "phone": "(772) 461-7788",
    "website": "https://intheimageofchrist.org/",
    "description": "THE VILLAGE SHELTER - Cold Weather Shelter.\nDuring inclement weather and emergencies, we keep our doors open to offer a warm, safe place for those in need to congregate and sleep. We provide hot meals, access to personal hygiene products, and hot showers. The shelter is currently open. For those who are homeless, there are additional services available through many of our community partners. \n\nJACK'S FOOD PANTRY\nOpen: Mondays, Wednesdays, and Fridays from 1:00pm to 4:00pm.\nITIOC's food pantry currently serves more than 1000 families per month in our community. In addition to food, families in need can receive clothes, furniture and appliances. Our efforts have been featured in several local publications including the Fort Pierce Tribune, Port St. Lucie News, the Palm Beach Post and the Stuart News.\n\n\nFor more information on the food pantry, please contact our offices at (772) 461-7788.\n\nClothing/Shoes free to take.\nPersonal Items\nCommunity Events\nHIV Testing & Counseling\nSTI Testing\nParents Matter (Education Group Session)\nFaith Talk (also in Spanish)\nSISTA\nSIHLE"
  },
  {
    "addressLine1": "720 4th Street",
    "city": "Vero Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "00000",
    "name": "Hope For Families Center",
    "organization": "Hope For Families Center",
    "phone": "(772) 567-5537",
    "website": "https://hopeforfamiliescenter.org/",
    "description": "Emergency shelter for homeless families\n\nStaffed 365 years a day, 24 hours a day.\n\nEach of our residents is offered three prepared meals a day, including packable lunches for work or school.\n\nHope for Families Center is stocked to meet the living needs of our residents. Upon admittance, each family is given bedding, personal hygiene products, laundry supplies, and any extra necessities such as diapers. We also work with other community agencies to meet any additional needs our residents may have such as clothing or infant formula.\n\n\nWith 21 rooms and four beds per room, our families are given a place to temporarily call their own. Our rooms are equipped with either Jack-and-Jill-style restrooms which are shared with another family or given access to our mens and womens restrooms with complete shower facilities.\n\nDesigned with families in mind, our shelter offers a dining area, a library for homework or studying, a meeting room, common living areas, a playground and an outdoor recreation area for residents use.\n\nThe following shelter options are available based on each families needs:\nEmergency Housing - Available to homeless families from Indian River, Martin, St. Lucie, and Ockeechobee Counties, Case Management interviews each client and develops an action plan based on that famiy's goals and objectives. This program is limited to a 90 day stay. Food, clothing, shelter, employment services, and case management are provided to each family. Clients who are able are required to work full time and children are enrolled in daycare / school.\n\n\nTransitional Housing - Available to homeless families who require a longer period of time to get back on their feet. This program can be extended as long as two years, provided the client continues to follow house rules and work with case management. In this program, more intensive case management is provided with emphasis on job skills (employment and training), affordable housing, and realistic budgeting.\n\nEmployment Training - Any client who resides at the Center is able to work with the Employment Counselor who will provide training and job placement services. Residents are required to be employed 40 hours / week and save 75% of their income.\n\nChildren's Program - Our children's program staff oversees this program which promotes the betterment of self-esteem issues for the children through the use of art therapy and group classes. In addition to mentoring and tutoring services, weekly, age-specific activities are planned.\n\nThe Hope for Families Center provides Emergency and Transitional Shelter for homeless families from Indian River, St. Lucie, Martin, and Okeechobee Counties. Our 4th Street facility can accommodate seven families in the Emergency Shelter and twelve families in the Transitional Shelter which translates into a total of 72 individuals that we may house on any given day.\n\nWe are more than just a roof overhead as we partner with a dedicated group of agencies to provide services for our clients such as children's programs, employment training, and mental health counseling.\n\nThe Hope for Families Center staff comprises professionally trained individuals who specialize in areas of support for homeless families.\n"
  },
  {
    "addressLine1": "1015 Commerce Avenue",
    "city": "Vero Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32960",
    "name": "The Source",
    "organization": "The Source",
    "phone": "(772) 564-0202",
    "website": "http://www.iamthesource.org/",
    "description": "The Source is the only drop-in outreach ministry in Indian River County that serves as a cold weather shelter, opens six days a week, provides hot meals, emergency food boxes, clothing, basic hygiene items, showers and laundering facilities, mail and phone services, job readiness programs, cooperative community agency referrals, and a saving faith in Jesus Christ.\n\nOperating Hours\nThe Source is open six days a week, providing critical care to the homeless and desperately needy.\nMonday, Tuesday, Thursday, Friday\n9:00am 4:30pm\n* Continental breakfast available 9:00 10:00am\n* Bible study is in the midst of transition but will start again soon.\n* Lunch served at 12:30pm\n* Showers open 9:00 11:00am & 1:00 3:30pm\n* Counselors schedules are in the midst of transition and will resume soon.\n\nEvening Programs:\nMonday Dinner served at 5:00pm\nTuesday Dinner served at 5:00pm\nThursday Dinner served at 5:00pm\nFried Chicken Friday sponsored by St. Mark's Anglican Church. Dinner served at 5:00pm.\n\nClosed Wednesdays for staff development and prayer.\n\nSaturday\n9:30am 12:00n\nContinental breakfast available at 9:30am\nLight lunch served at 11:30am\n\nSunday Celebration\n11:30am family style service with lunch included to those who attend\nCoffee and pastries available at 11:30am\nWorship Service begins at 11:45am\nLunch is served at 12:45pm\nDonations are accepted Mon, Tues, Thurs, Fri\n9:00 11:45am & 1:00 4:30pm"
  },
  {
    "addressLine1": "17 S Scenic Hwy",
    "city": "Frostproof",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "00000",
    "name": "Frostproof Care Center",
    "organization": "Frostproof Care Center",
    "phone": "(863) 635-5555",
    "website": "http://frostproofcarecenter.com/",
    "description": "Food/Emergency Shelter/Financial Assistance\nThe Ways the Frostproof Care Center Helps\n\nOCCUPANCY\nMortgage, rent, utilities,\nHome furnishings, household items\n\nMEDICAL\nPrescriptions, medical equipment\nminor medical payments\n\nFOOD\nFood box, hot meals,\ncommodities\n\nPERSONAL ITEMS\nClothes, school supplies, hygiene items\n\nTRANSPORTATION\nAuto gas, minor repairs, bus tickets\n\nHOLIDAY ASSISTANCE\nHoliday food boxes, Christmas gifts\n\nCAREER\nResume writing\nInterviewing skills\nJob search\nScholarships for professional certifications and licensure\n\nIf you live outside the Frostproof Babson Park area dial 211 on your phone for assistance in your area.\n"
  },
  {
    "addressLine1": "140 East Park Avenue",
    "city": "Lake Wales",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33853",
    "name": "Lake Wales Care Center",
    "organization": "Lake Wales Care Center",
    "phone": "(863) 676-6678",
    "website": "https://www.facebook.com/lakewalescarecenter/",
    "description": "Lake Wales Care Center is a food pantry. Serves Lake Wales\n\nFood pantry service hours: Mondays through Fridays 8:30am - 4:30pm. .\n\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "not disclosed.",
    "city": "Gainesville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32601",
    "name": "Interfaith Hospitality Network",
    "organization": "Interfaith Hospitality Network",
    "phone": "(352) 378-2030",
    "website": "http://www.familypromisegvl.org/",
    "description": "Shelter for homeless families with children. There is currently a waiting list.\n\n"
  },
  {
    "addressLine1": "413 S. Main St.",
    "city": "Gainesville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32601",
    "name": "St Francis House Emergency Shelter",
    "organization": "St Francis House Emergency Shelter",
    "phone": "(352) 378-9079",
    "website": "https://stfrancishousegnv.com/",
    "description": "We require a police clearance to utilize our facilities, which are open to the community, from 7am-4pm, after that time, only those staying in the shelter are permitted.\n\nWe serve a community meal to anyone who needs one daily from 10:00 am - 1:00 pm.\n\n\nShelter residents receive three meals a day. Women and women with children are given preferential treatment to reside in the shelter. Case management is supplied to shelter residents\n\nWe currently have 35 beds, and open the shelter to everyone during inclement weather.\n\nServices\nWe feed, shelter, provide public phone access, Regional Transit System bus passes, laundry services, and clothing vouchers. Along with tutoring, our case management and referral services provide education and partner agencies who can offer victim advocacy, job opportunities, GED certificates, life skills classes, in safe compassionate environments."
  },
  {
    "addressLine1": "P.O. Box 5189",
    "city": "Gainesville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32627",
    "name": "Family Promise of Gainesville",
    "organization": "Family Promise of Gainesville",
    "phone": "(352) 378-2030",
    "website": "https://www.familypromisegvl.org/",
    "description": "Family Promise of Gainesville provides shelter, meals and social services for families with children. Adults must be enrolled in school or have work within ten days of entering the program. Housing is supplied by various congregations of Christians, Jews and Muslims in the Gainesville Community.\n\nDay Center\nServes as a home base while adults look for jobs and apply for services. Also provides laundry facilities, showers, telephones, a mailing address, computer facilities, and a children's playroom. The IHN Case Manager is located at the Day Center."
  },
  {
    "addressLine1": "3055 NE 28th Drive",
    "city": "Gainesville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32609",
    "name": "GRACE Marketplace",
    "organization": "GRACE Marketplace",
    "phone": "(352) 792-0800",
    "website": "http://www.gracemarketplace.org/",
    "description": "GRACE is a 113 bed emergency shelter that offers a wide variety of supportive services including:\n\nIntake & referral\nSubstance abuse & mental health counseling\nCase management\nAssistance with public benefit signups (food stamps, Medicaid, SSI/SSDI, & SafeLink phones)\nShowers & restrooms\nBreakfast, Lunch, & Dinner\nOutdoor shelter pavilion\nStorage of personal belongings\nClothes closet\n\nGRACE offers a wide variety of supportive services, including:\nIntake and referral\nSubstance abuse and mental health counseling\nCase management\nAssistance with public benefit signups (food stamps, Medicaid, SSI/SSDI, and SafeLink phones)\nShowers and restrooms\nBreakfast and Dinner\nOutdoor shelter pavilion\nStorage of personal belongings\nClothes close"
  },
  {
    "addressLine1": "750 NW 8th Avenue",
    "city": "Hallandale Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33009",
    "name": "Austin Hepburn Senior Mini Center",
    "organization": "Austin Hepburn Senior Mini Center",
    "phone": "(954) 457-1460",
    "website": "",
    "description": "Food pantry (Hallandale Beach, Hollywood, Pembroke Park, West Park, Dania Beach and Miramar) 8:00 am to 5:00 pm, or emergency as needed"
  },
  {
    "addressLine1": "2056 Scott Street",
    "city": "Hollywood",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33022",
    "name": "The Caring Place Broward Outreach Center",
    "organization": "The Caring Place Broward Outreach Center",
    "phone": "(954) 926-7417",
    "website": "https://www.browardoutreachcenter.org/",
    "description": "This full-service, 90-bed facility is located on the corner of Scott Street and Dixie Highway in Hollywood, serving homeless men and women in South Broward County.\n\nLocated adjacent to the Broward Outreach Center is the BROWARD OUTREACH CENTER FOR WOMEN & CHILDREN - HOLLYWOOD. Designed to meet the needs of homeless women and families.\n\nThe 50-bed facility is located next to Broward Outreach Center in Hollywood and is now open."
  },
  {
    "addressLine1": "2020 Scott St",
    "city": "Hollywood",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33020",
    "name": "Jubilee Center of South Broward Inc",
    "organization": "Jubilee Center of South Broward Inc",
    "phone": "(954) 920-0106",
    "website": "http://jubileecenterbroward.org/",
    "description": "Not a Homeless Shelter. This is a Homeless Services organization.\n\nSoup Kitchen/ Food Pantry/clothing and outreach provided\n\nSocial Services \"Monday-Friday 10:30am-12:30pm\n\nPantry bags of food--(Once every 4 weeks) for singles with proof of address e.g., a rent receipt or utility bill\n\nPantry bags of food--(Once every 2 weeks) for families with proof of address e.g., a rent receipt or utility bill and identification for all members of the family.\n\nWalk-Around Bag--homeless (Once per week)\n\nPersonal Hygiene Items--(Once every 2 weeks)\n\nClothing--(Once every 2 weeks)\n\nJubilee ID \"(Weekly on Wednesday)\n\nLegal Aid--(Weekly on Tuesday AM)\n\nDCF ACCESS Partner--Food Stamps and Medicaid: (Tuesday and Friday 10:30am-12:30pm)\n\nInformation and Referrals--To shelters and other organizations (Monday--Friday 10:30am-12:30pm)\n\nSoup Kitchen\nOpen 5 days a week - Monday through Friday - The Jubilee Center Soup Kitchen, located at 2020 Scott Street in Hollywood, serves a nutritious lunch to approximately 150 people each day. Lunch is served at 11:00AM. The Kitchen is staffed by volunteers from several area churches and many other groups. Volunteers begin their day at 9:00AM, preparing the food, setting the tables, and arranging the serving line. When the doors open, they serve a nourishing meal of protein, vegetables, and beverage to all who come. Much of the food is donated by many area churches, synagogues, civic groups and dedicated individuals, but a good deal must be purchased from food banks and wholesalers."
  },
  {
    "addressLine1": "7450 W. Fourth Ave",
    "city": "Hialeah",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33014",
    "name": "Salvation Army Hialeah Support Services",
    "organization": "Salvation Army Hialeah Support Services",
    "phone": "(305) 557-0981",
    "website": "https://www.facebook.com/TheSalvationArmyHialeahCorps/",
    "description": ""
  },
  {
    "addressLine1": "1907 NW 38th Street",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33142",
    "name": "The Salvation Army of Miami-Dade",
    "organization": "The Salvation Army of Miami-Dade",
    "phone": "(305) 637-6700",
    "website": "https://salvationarmyflorida.org/miami/",
    "description": "Our Administration office is open Mon-Fri 8:30am - 4:30pm\n\nThe Salvation Army Miami Area Command offers 236 beds distributed among three lodges that provide temporary housing to women and families, single men, veterans, and persons dealing with HIV/AIDS. \n\nThese temporary programs are designed to empower residents to regain their independence and return to being self-sufficient members of our community.\nThe Social Services Department is shaped as a support network that assists shelter residents with day-to-day care and services. This support system consists of Case Management, 24-hour and 7-days a week staff supervision, janitorial and kitchen staff. Additionally the department offers life skills, short-term crisis counseling and groups.In order to enhance our residents opportunities to succeed, we partner with reliable community agencies that make additional services available as needed.For information on admission to The Salvation Armys Red Shield Lodge Program, call 305.637.6700\n\n\nFamily & Women's Lodge: The Salvation Army has 83 beds available to configure rooms to accommodate single females, single mothers with children and intact families. Additional services such as tutoring and storytelling are provided through our community partners.For information on admission to The Salvation Army's Family & Women's Lodge Program, call 305.637.6700\n\n\nMen's Lodge: The Men's Lodge serves 115 beds to homeless, single men. Clients may include transients, homeless, undocumented and our Nation's veterans.For information on admission to The Salvation Army's Men's Lodge Program, call 305.637.6700\n\nAdult Rehabilitation Center: The Salvation Army's Adult Rehabilitation Center runs a six-month residential program with a capacity of 135 residents. The program reaches the outstanding success rate of 26% and consists of spiritual, social and emotional assistance for men and women who have lost the ability to cope with their problems and provide for themselves. Participants are exposed to a comprehensive approach to recovery. The work therapy program of the center includes the collection and repair of donations-in-kind and the operation of Salvation Army Family Stores, in which donated materials are sold. For more information visit www.satruck.org\n"
  },
  {
    "addressLine1": "12001 SE Federal Hwy",
    "city": "Hobe Sound",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33455",
    "name": "St Vincent DePaul Society",
    "organization": "St Vincent DePaul Society",
    "phone": "(772) 546-2492",
    "website": "https://www.svdpusa.org/",
    "description": "Suite D/ Food/Financial Assistance/Utilities/Rent"
  },
  {
    "addressLine1": "2484 SE Bonita Street",
    "city": "Stuart",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34997",
    "name": "House of Hope Martin County",
    "organization": "House of Hope Martin County",
    "phone": "(772) 286-4673",
    "website": "http://www.hohmartin.org/",
    "description": "Food/Clothing/Emergency Financial assistance\n\nMon - Fri:   \n9:00 am - 4:00 pm\nSat:   \n9:00 am - 3:00 pm\n\nHouse of Hope is a nonprofit agency, founded in 1984, that provides food, clothing, furniture, financial assistance and life-changing case management services to Martin County residents. The agency has four locations countywide offering these services and operating a thrift store."
  },
  {
    "addressLine1": "3400 North 29th Avenue",
    "city": "Hollywood",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33020",
    "name": "Rebel's Drop in Center",
    "organization": "Rebel's Drop in Center",
    "phone": "(954) 276-3422",
    "website": "https://www.mhs.net/services/mental-health/treatments/peer-support",
    "description": "Free drop in center that helps those with mental health or substance abuse.\n\nHours\nMonday through Friday: 3 to 8 pm\nWeekends and holidays: Noon to 5 pm\n\nThe center has earned a reputation as a safe and supportive, prejudice-free environment with impressive outcomes. For clients receiving mentoring to reduce hospitalization rates, 92 percent are not hospitalized during the first 90 days in the program, and 90 percent of participants surveyed show Improvement in Life Skills and Emotional Stability. For Drop-In participants, 89 percent of individuals surveyed indicate reduced feelings of stress and isolation."
  },
  {
    "addressLine1": "28205 SW 125 Avenue",
    "city": "Homestead",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33033",
    "name": "South Miami Dade Center",
    "organization": "South Miami Dade Center",
    "phone": "(877) 994-4357",
    "website": "http://www.homelesstrust.org/",
    "description": "Community Partnership for Homeless South Miami-Dade Center. This is a 300 bed facility for single and family homeless. This includes a multi room, vocational training facility, child care facility and full medical facility.\n\nAny person  or family who is homeless, about to be homeless,  or assisting someone facing homelessness, and  requiring emergency assistance  must first contact the Homeless Helpline administered by the Miami-Dade County Homeless Trust.\n\nContact at the phone number provided."
  },
  {
    "addressLine1": "111 NW 1st St",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33128",
    "name": "Miami Dade Homeless Trust",
    "organization": "Miami Dade Homeless Trust",
    "phone": "(305) 375-1490",
    "website": "http://www.homelesstrust.org/",
    "description": "If you are homeless or about to be, or know someone who is, a trusted resource is just a phone call away. 1-877-994-4357\n\nWhile a phone call doesnt mean an automatic place to stay, the Helpline is the front door to available resources. Homeless individuals and families will be assessed according to their need and vulnerabilities, and then directed to necessary services and assistance."
  },
  {
    "addressLine1": "223 E Flagler St # 218",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33131",
    "name": "Eyes On God Homeless Shelter",
    "organization": "Eyes On God Homeless Shelter",
    "phone": "(305) 373-4798",
    "website": "",
    "description": "Homeless shelter."
  },
  {
    "addressLine1": "1603 NW 7th Avenue",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33136",
    "name": "Camillus House",
    "organization": "Camillus House",
    "phone": "(305) 374-1065",
    "website": "https://www.camillus.org/",
    "description": "Emergency Shelter Provided. Homeless Services provided.\n\n\nServing the South Florida community since 1960, Camillus House is a non-profit organization that provides humanitarian services to men, women and children who are poor and homeless.\n\n\n\nCamillus Housing Services addresses the most obvious aspect of homelessness. We provide individuals and families with a place to live. A range of housing options include Emergency, Transitional and Permanent housing, depending upon the stage in which each client is during their recovery from homelessness.\n\n\n\nAll housing programs are linked to Camillus' other programs so that clients receive the comprehensive health care and social services they require during their participation in the program. On an average night, some 1,000 men, women and children of South Florida will spend the night at Camillus House.\n\n\n\nMedical Clinic\n\n\nCamillus Health Concern (CHC) has been a leader in providing primary health care services to persons in Miami-Dade County who are homeless or have low income. CHC's health care providers are specially trained in meeting the unique health care and social service needs of persons who are homeless.\n\n\nSubstance Abuse Treatment\n\nThe Institute of Social and Personal Adjustment (ISPA) is a comprehensive program designed to treat mental illness and substance abuse as co-occurring disorders.\n\n\nHospitality Services\n\nHospitality Services is the oldest and probably most well known of the services offered at Camillus House. Its primary purpose is to ensure that each clients basic human needs for food, clothing, and overnight shelter are met. Since a person who is hungry, or cold, or sleeping on the street cannot begin to address the larger issues that prevent them from leading a fulfilling life, Hospitality Services focuses on providing the immediate care they need.\n\n"
  },
  {
    "addressLine1": "724 NW 17th St",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33127",
    "name": "M. Teresa Mission of Charity",
    "organization": "M. Teresa Mission of Charity",
    "phone": "(305) 545-5699",
    "website": "https://twitter.com/mothert_project",
    "description": "Emergency Shelter for women and children.\n\nThe Missionaries of Charity of Mother Teresa arrived in the archdiocese in 1980 to care for the poorest of the poor in Miami's inner city. They currently operate a shelter for homeless women and children near Jackson Memorial Hospital. Emergency night shelter for women and children, (boys under age 4 only). Dinner and breakfast is provided, as well as emergency clothing and toiletries.\n\nEmergency Shelter: 4:00pm-6:30am, Fridays through Wednesdays\n\nSoup Kitchen: 9:30am - 11:00am, Fridays through Wednesdays.\nClosed Thursdays\n\nIntake Process:\nMust show up at 4:00pm for intake"
  },
  {
    "addressLine1": "217 NW 15th St",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33136",
    "name": "Lotus House",
    "organization": "Lotus House",
    "phone": "(305) 438-0556",
    "website": "https://lotushouse.org/",
    "description": "Lotus House is a shelter for women, youths and children,24/7, 365 days a year.\n\nProvides shelter and wrap around support services for homeless women with special needs, and those with medical or mental health conditions or the elderly.\nAdditional Services:\nFamilies ProgramYouth Program\nSafe Haven For Women Only\nHealth and Wellness ProgrammingHolistic ProgrammingEmployment & Education Program\nCulinary Center\n\n"
  },
  {
    "addressLine1": "1550 N Miami Avenue",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33136",
    "name": "Homeless Assistance Center - Chapman Center",
    "organization": "Homeless Assistance Center - Chapman Center",
    "phone": "(877) 994-4357",
    "website": "https://chapmanpartnership.org/",
    "description": "Any person or family who is homeless, about to be homeless, or assisting someone facing homelessness, and requiring emergency assistance must first contact the Homeless Helpline administered by the Miami-Dade County Homeless Trust.\nIf you are homeless, or about to become homeless,Contact the Homeless Helpline at 1-877-994-HELP (4357)\n\n\nChapman Partnership operates two Homeless Assistance Centers with 800 beds located in Miami and Homestead. We help the homeless by providing a comprehensive support program that includes emergency housing, meals, health, dental and psychiatric care, day care, job training, job placement and assistance with securing stable housing.\n\n\n\nTemporary shelter for all. The Chapman center has 402 beds for single and family residents. There is also a vocational training facility at this location along with child care facilities. There is also a full medical facility."
  },
  {
    "addressLine1": "1550 North Miami Avenue",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33136",
    "name": "Chapman Partnership",
    "organization": "Chapman Partnership",
    "phone": "(305) 329-3000",
    "website": "https://www.chapmanpartnership.org/",
    "description": "Any person or family who is homeless, about to be homeless, or assisting someone facing homelessness, and requiring emergency assistance must first contact the Homeless Helpline administered by the Miami-Dade County Homeless Trust.\nHomeless Helpline\nToll Free: 1-877-994-HELP (4357)\n\nSince 1995, Community Partnership for Homeless has been assisting homeless men, women and children in transitioning off the streets of Miami-Dade County and on their way to attaining greater stability and self-sufficiency in their lives. As the private sector partner of the Miami Dade County Homeless Trust, we have continually been recognized as a national model for our comprehensive approach to helping the homeless. Our program's main catalyst for success the Homeless Assistance Centers operate as one-stop temporary care entry points that provide not just food and shelter, but comprehensive case management, healthcare, daycare, job training and other assistance from a variety of social service agencies all under one roof.\n\nAbove all, however, is our deeply held conviction that those temporarily homeless persons in our care shall always be treated with the greatest compassion, dignity and respect.\n"
  },
  {
    "addressLine1": "3033 NW 7th Ave",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33238",
    "name": "Miami City Mission Youth Center",
    "organization": "Miami City Mission Youth Center",
    "phone": "(305) 633-5105",
    "website": "https://twitter.com/miamipdtraining",
    "description": "The center Impact youths to be positive agents of change to our society; by becoming self-conscious, spiritual conscious and community conscious. Providing; after school, enrichment program to support students in the Wynwood / Allapatta neighborhood and surrounding areas."
  },
  {
    "addressLine1": "2250 NW 1st Ave",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33127",
    "name": "Miami Rescue Women",
    "organization": "Miami Rescue Women",
    "phone": "(305) 571-2250",
    "website": "http://www.miamirescuemission.com/women.htm",
    "description": "Emergency Shelter for women and children.\n\nThe Center is a haven for homeless women and children, and provides emergency overnight shelter as well as a long-term recovery program. The 40-bed facility located at 2250 NW 1st Avenue in Miami.\n\nA.W.A.R.E.N.E.S.S. (A Woman's Answer Regarding Education, Nurture, Encouragement, Self-esteem and Salvation) is a 10 month program based on Jeremiah 29:11. The program is designed to help women become aware of God's plan for them.\n\n\nThe program includes classes on parenting skills, adult living skills, budgeting, nutrition and health concerns. Other areas addressed are, education, conflict resolution, decision making and all the women are involved in group and/or individual counseling. Spirituality is addressed on a daily basis. In addition, there is a strong focus on building a positive attitude, communication skills, dependability , honesty and courtesy. Employment skills and computer literacy are also an important focus in the program."
  },
  {
    "addressLine1": "2236 NW Miami Court",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33127",
    "name": "Salvation Army Miami Adult Rehab Center",
    "organization": "Salvation Army Miami Adult Rehab Center",
    "phone": "(305) 573-4200",
    "website": "https://salvationarmyflorida.org/adult-rehabilitation-center/",
    "description": "Men's Substance Drug and/or Alcohol Abuse Rehab Center.\nThe Salvation Army Miami Adult Rehab Center provides individual and group counseling, training in job skills, and other tools for rebuilding positive lifestyles.\n\n\nEach in-residence program puts the men into clean, comfortable living facilities. Regular meals, medical check-ups and Alcoholics Anonymous programs combine to make each center a place for new beginnings. Each center also offers a very comprehensive spiritual regeneration program in which all clients are expected to participate.\n\nUnlike many programs, these centers are self-supporting. Clothing and household items are collected from communities. These items are brought to the center's workshops where they are repaired and refurbished, then resold in Salvation Army family stores.\n\nThe center is open to all men who have an identifiable and treatable handicap regardless of race, color or religious belief. The success rate of this Salvation Army program is high. There are over 100 centers across the United States. Many include similar programs for women."
  },
  {
    "addressLine1": "3620 NW 1st Ave",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33127",
    "name": "New Life Family of Catholic Charities",
    "organization": "New Life Family of Catholic Charities",
    "phone": "(305) 573-3333",
    "website": "http://www.ccadm.org/sh_projects/the-new-life-family-center/",
    "description": "Emergency Shelter for families with children.\n\nCatholic Charities' New Life Family Center in Miami-Dade is a transitional housing shelter with 15 private units. Under the guidance of our experienced staff, dispossessed families with children have the opportunity to return to self-sufficiency within 6 months.\nNew Life residents participate in:\n\nComprehensive Case Management and referral services\nVocational training\nLife Skills training (parenting, financial literacy, anger management)\nJob counseling& employability skills (resumes, interview techniques)\nTransportation\nMental health and substance abuse services\nNutritionally balanced meals daily\nMentoring\nClothing and hygiene supplies\n\nHours: M-F 8:30am 5:00pm"
  },
  {
    "addressLine1": "14121 Water Tower Drive",
    "city": "Hudson",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34667",
    "name": "The Rope Center",
    "organization": "The Rope Center",
    "phone": "(727) 869-6426",
    "website": "http://www.theropecor.org/",
    "description": "Office hours:  Monday, Wednesday and Friday, hours are 10:00 to 3:00pm.\nTransitional housing up to 13 months- food -clothing- job assistance and more\n\n\nThe R.O.P.E. Center was established in 2009 to provide shelter and assistance to those who seek it and is located in Hudson, FL. Started by Pastor Jim Campbell along with his wife Pastor Sue Campbell, the R.O.P.E. Center takes in single men and women. There are two sections to the house, with one side for the men and one for the women. To see if the R.O.P.E. Center can help you, please contact or visit the C.O.R. Center."
  },
  {
    "addressLine1": "602 W Main St",
    "city": "Immokalee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34142",
    "name": "Immokalee Friendship House",
    "organization": "Immokalee Friendship House",
    "phone": "(239) 657-4090",
    "website": "http://stmatthewshouse.org/programs/immokalee-friendship-house/",
    "description": "Immokalee Friendship House provides shelter to over 1,000 people and feeds over 25,000 meals each year.\nUpon arrival, each Immokalee Friendship House resident's needs are assessed and in-house assistance and referrals are coordinated. Warm showers and hot meals are made immediately available. The shelter provides three meals a day, including a bag lunch to take to work or while job prospecting. In the evening, clothes are washed, chores are done, and social services such as AA meetings, support groups and case management are made available. To help guide residents toward independence, staff assists with job interview preparedness, referrals, and finding affordable housing.\n\nLocation:\n602 West Main St.\nImmokalee, FL 34142\n(239) 657-4090\n\n\n\n\nHousing & Feeding Ministry\nEmergency / Transitional Housing\nHousing more than 150 people & feeding more than 450 every day.\n\nSt. Matthews House is a part of the recovery process, not a permanent place to live.\n\n\nOur goal is to equip each person that leaves St. Matthews House to make the transition from a homeless lifestyle to self-sufficiency.\nWhen St. Mathews House residents enter our Emergency/Transitional Housing Program, they subsequently submit themselves to our rules and regulations, which in turn lead to the self-respect that comes from accountability. We have a no-tolerance policy for drugs and alcohol. Our program offers compassionate, disciplined counseling and guidance to each residents physical, emotional, and spiritual challenges.\nResidents have access to referrals for their medical, mental health, and substance abuse needs. We partner with many key organizations including NCH, David Lawrence Center and the Neighborhood Health Clinic to make sure the residents have the resources to be successful.\nClientele meet weekly with a case manager to set goals and a plan of action. They also attend meetings seven days a week to assist them on their road to self-sufficiency.\n\nLocation:\n2001 Airport Road, S.\nNaples, FL\n\nJustins Place Feeding Ministry\nJustins Place Feeding Ministry operates out of our original 1988 facility, the former East Naples Fire Station. On average, we prepare 60 meals per day to feed anyone who is homeless and/or hungry, totaling more than 20,000 meals served each year.\nThe facility has never missed a day of serving meals in over 25 years. Justins Place Feeding Ministry continues to feed the homeless, hungry and needy of our community underneath a protective awning that shields diners from the intense southwest Florida elements.\nMeal Schedule\nLunch: Mon Sat 12:15 12:45 p.m.\nLunch: Sunday 1:00 1:30 p.m.\nDinner: Every day 5:00 5:30 p.m.\nLocation:\n2691 Airport Rd South\nNaples, FL 34112"
  },
  {
    "addressLine1": "P.O. Box 205",
    "city": "Inverness",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34451",
    "name": "CASA - Domestic Violence, Domestic Violence Services",
    "organization": "CASA - Domestic Violence, Domestic Violence Services",
    "phone": "(352) 344-8111",
    "website": "https://casafl.org/",
    "description": "24hr Hotline - 352-344-8111CASA provides shelter to victims of domestic violence and their children. Our shelter services provide a safe haven for survivors as they are recovering and working on a plan for a successful life free from abuse and violence.  The shelter will provide all food, toiletries, and clothing as needed.  All CASA Outreach services are also provided.\n\nShelter care services for women and children, Community referrals, Court accompaniment, Sexual assault counseling, Domestic Violence counseling for victims, Assistance in seeking medical care, Assistance in seeking protective injunctions. Community education; Criminal justice support/advocacy; Crisis counseling; Crisis hot line; Domestic violence relocation assistance; Emergency cell telephone; Emergency legal advocacy; Follow up contact; Group treatment; Information and referral; Outreach services; Personal advocacy; Professional training; Shelter/safe house; Support groups; Telephone contacts; Translation services; Transportation; Victims compensation claims; Crisis Hot-Line"
  },
  {
    "addressLine1": "234 W. State Street",
    "city": "Jacksonville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32201",
    "name": "City Rescue Mission Shelter for Men and Women",
    "organization": "City Rescue Mission Shelter for Men and Women",
    "phone": "(904) 421-5161",
    "website": "http://www.crmjax.org/",
    "description": ""
  },
  {
    "addressLine1": "611 E Adams St",
    "city": "Jacksonville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32202",
    "name": "IM Sulzbacher Center for the Homeless",
    "organization": "IM Sulzbacher Center for the Homeless",
    "phone": "(904) 359-0457",
    "website": "http://www.sulzbachercenter.org/",
    "description": "Full service shelter for all includes medical dental vision and behavioral health care.\n\n\n\nSulzbacher Center offers a stable environment for homeless men, women and children. For families, individual dorm rooms allow parents and children to live together as they find their way home. Between sixty and ninety children call the center home on any given day.\n\n\n\nAlong with a bed, a case manager is assigned to every resident of the Sulzbacher Center. Residents work with case managers one-on-one to develop a plan that meets their particular needs. While the average stay at the center is three months, residents may stay longer if their circumstances require it. Regular case management meetings ensure that residents stay on track. Our program restores stability to the lives of the men, women and children who come to us for help.\n\nAll new individuals and families applying for shelter must be residents of Duval, Clay, Nassau, St. Johns or Baker county for at least six months before entering shelter at the Sulzbacher Center. Proof of residency is required.\n\n\n\n\nHere are the steps you need to take when applying for shelter.\n\n\n\n\nCome to the Center's downtown office located at 611 E. Adams St. Jacksonville, FL 32202.\n\n\n\nWhen you arrive ask for one of our intake coordinators and they will provide you with our intake screening form and background check.\n\n\nMake sure you bring some form if I.D., preferably a drivers license.\n\nIf you are planning to enter shelter with your children please remember to bring copies of each child's birth certificate.\n\nOnce you fill out these forms you will be placed on our waiting list for shelter. Wait time varies but can be expected to last around two weeks or longer for single men and women. For families with children the wait time is typically longer and can take up to four months.\n\nAll spaces are given on a first come first served basis. The only exceptions are given to families without shelter.\n\nMen and women applying for shelter should come to the Center at 1:00 pm every day to determine if there is vacancy. Families will be called if there is space available.\n\n\n\n\n"
  },
  {
    "addressLine1": "3015 Parental Home Road",
    "city": "Jacksonville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32216",
    "name": "Youth Crisis Center",
    "organization": "Youth Crisis Center",
    "phone": "(904) 725-6662",
    "website": "https://youthcrisiscenter.org/",
    "description": "Hopeline: 1-877-720-0007\n\nEmergency Shelter for Youths 10 - 17 years of age\n\nOur residential counselors work with these youth and their families to address the immediate crisis and help provide long-term solutions to handle future problems once the child returns home. We work hard to re-unite families, with the goal of providing help and hope to families who have nowhere else to turn.\n\nDuring their stay at YCC, our residents receive:\nFood, clothing and a safe, comfortable place to sleep\nA positive, productive and healthy living environment\nIndividual, group and family counseling\nOn-campus school provided by Duval County Public Schools\nYouth development programs\nSupervised recreation\nLife management and social skills counseling\nAftercare support through our FAMILY LINK nonresidential program\nReferrals to other community agencies (when necessary)\n\n"
  },
  {
    "addressLine1": "613 West Ashley Street",
    "city": "Jacksonville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32202",
    "name": "Clara White Mission",
    "organization": "Clara White Mission",
    "phone": "(904) 354-4162",
    "website": "https://www.clarawhitemission.org/",
    "description": "The goal of the Clara White Missions transitional housing program is to move homeless participants to permanent housing and independent living within 24 months. Priority is given to veterans; maintaining a residency rate of 75% veterans.  Residents are required to:\n- Be employed and/or currently enrolled in school.\n- Participate in case-management and life-skills classes.\n- Complete a mental-health assessment and engage in mental-health counseling as indicated.\n- Complete a health assessment with the nurse.\n- Maintain sobriety and participate in substance-abuse education classes and support groups, as required.\n\nFeeding Program\nThe Clara White Missions \"soup kitchen\" service provides hot meals to the general homeless population seven days a week. Breakfast is served five (5) days a week (Monday, Tuesday, Wednesday, Saturday and Sunday) from 8:30 a.m. until 10:00 p.m. The program serves 400-500 persons daily. Volunteers assist with serving our daily meals.\n\nThe Clara White Mission, Inc. (CWM) is a private, non-profit organization with a 501 (c) (3) tax exempt status, founded in 1904, and incorporated in December 1936. The purpose of the agency, as expressed in its mission statement, is to prevent and reduce homeless through advocacy, housing, job training and employment, and through working in partnership with the community. The Mission has a 104-year history of providing services to the homeless, and since 2003, has operated as a one-stop service center designed to support workforce development as it assists homeless members of the community in the transition to independence and contributory citizenship. We target unemployed homeless and low-income prioritizing veterans and ex-offenders, and provides up to twenty-four months of housing with supportive services, while building marketable job skills tailored to identified needs of community employers through on-site vocational training (culinary arts and janitorial training) and job placement services.Correlated homeless assistance program provided by Clara White include a drop-in day center for street homeless individuals, also established in 2003, and the Mission's century-old daily feeding service for the homeless and economically low-income. The drop-in center and feeding components currently provide outreach services to more than 10,000 unduplicated homeless each year, and act as recruitment mechanisms for the Mission's housing and employment training programs. More than 80% of persons enrolled in housing and/or training services at the Clara White Mission initially learned of the services through their participation in feeding or drop-in activities.The drop-in day center provides daytime relief and limited case management services to street-homeless individuals at an average rate of 50 unduplicated persons per day. The 100-year old feeding component (soup kitchen) serves from 400 - 500 homeless and low-income individuals daily."
  },
  {
    "addressLine1": "622 W Union St",
    "city": "Jacksonville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32202",
    "name": "Trinity Rescue Mission",
    "organization": "Trinity Rescue Mission",
    "phone": "(904) 355-1205",
    "website": "http://www.trinityrescue.org/",
    "description": "Emergency Services include:\nShelter\nHot meals\nShowers\nClean clothing\nToiletry/hygiene items\nCounseling\n\nOur Emergency Services Team at Trinity Rescue Mission provides more than hospitality for our emergency services guests. They also offer emergency services case management to steer persons to Trinity Rescue Mission programs or other life changing programs in the community which can help them permanently end homelessness.\nSometimes, all a person wants is food or a place to stay. Others may want pray or spiritual encouragement. Still others may be ready to try something new and life changing. In the love and grace of Jesus Christ, we welcome them and offer help.\n\n\nIn our experience, it is at this entry point where many decide to turn their lives around using a Christ-centered approach. Men have the option of joining our Christ-centered Lifeline Program for Men. Women, whether single or with children, have the option of joining our Christ-centered Lifeline Program for Women. Our Lifeline programs strive to awaken hope in the hearts of people overcome with poverty and homelessness."
  },
  {
    "addressLine1": "622 West Union Street",
    "city": "Jacksonville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32202",
    "name": "Trinity Rescue Mission Women and Children’s Center",
    "organization": "Trinity Rescue Mission Women and Children’s Center",
    "phone": "(904) 355-1205",
    "website": "http://www.trinityrescue.org/",
    "description": "Women and Children's Center - The only faith based residential recovery program in Jacksonville offering long-term, comprehensive services to women and children."
  },
  {
    "addressLine1": "1033 E 14th St",
    "city": "Stuart",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34995",
    "name": "Mary’s Home of the Treasure Coast",
    "organization": "Mary’s Home of the Treasure Coast",
    "phone": "(772) 223-5000",
    "website": "https://maryshome.org/",
    "description": "Mary's Shelter of the Treasure Coast is a transitional home that provides shelter, care, and counseling for pregnant women and their newborns.\n\nMarys Home of the Treasure Coast is a transitional home centrally located in Stuart, Florida.  We provide residential and non-residential services for pregnant women 18 years or older who are in need of a supportive environment because of a lack of suitable housing or favorable family relationships. Marys Home prepares mothers for independent living and a vision of hope for the future through empowerment, education and training. There are no limitations on race, or religion. We help women who need a safe and loving place to stay and who want a chance to make good choices for them and their unborn child.\n\n\nUnfortunately, Mary's Home cannot accommodate a woman with children in her custody.\n\nMarys Home is free of charge, however, if while living at Marys Home, a resident gains employment we will assist them with developing a budgeting and savings plan.\n\n\nDuring your time at Marys Home, we work with you on developing a plan for after the birth of your baby.  Our goal is for new mothers to complete the program shortly after the birth of the baby.  The length of stay after your baby is born will vary based on your individual life circumstances."
  },
  {
    "addressLine1": "431 University Blvd N",
    "city": "Jacksonville",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32211",
    "name": "Family Promise of Jacksonville",
    "organization": "Family Promise of Jacksonville",
    "phone": "(904) 354-1818",
    "website": "https://familypromisejax.org/",
    "description": "TEMPORARY SHELTER\nFamily Promise shelters up to three families at a time. The families stay at the shelter provided by the congregational partner of the week. The congregations host the families in the evening providing dinner and overnight shelter while we provide transportation. There is no faith requirement.\n\nEach day, families return to the Family Resource Center where they have access to daily living essentials. The Family Resource Center includes Family Promise offices, computers, storage for family belongings, laundry facilities and showers. Families have the flexibility to plan their days without time restrictions or lining up for check-ins. The congregations donate breakfast and lunch food that the families prepare for themselves.\n\nWe do not provide emergency shelter.\n\n\nWe shelter:\nsingle mothers with children\nsingle fathers with children\ntwo-parent families with children\ngrandparents raising grandchildren\n\n"
  },
  {
    "addressLine1": "800 Shetter Ave",
    "city": "Jacksonville Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32250",
    "name": "Mission House - Day Shelter",
    "organization": "Mission House - Day Shelter",
    "phone": "(904) 241-6767",
    "website": "http://www.missionhousejax.org/",
    "description": "Day Shelter only.\n\nHomeless Day Facility Service Hours:\nMon-Sat: 10 a.m. to 1 p.m.\nMon-Fri: 5 p.m. to 8 p.m.\nSun: 1 p.m. to 4 p.m.\n\nMission House is open seven days a week, excluding Easter Sunday, 4th of July, Thanksgiving Day, and Christmas Day.\n\nTwo hot meals are served Mon-Fri at noon and 7 p.m.  A Saturday meal is served at noon and at 3 p.m. on Sunday. Two hours before each meal, clients are able to shower (including all toiletry items), get a change of clothing (including undergarments), make a phone call, and use our computer and job board to search for employment.\nCase Management:\nMission House clients work one-on-one with the case managers to develop a program planned to restore their independence.  Services for active clients include: obtaining identification, sources of income, housing, substance abuse referrals, medical assistance through our clinic, bus passes for jobs or doctor appointments, and clothing vouchers for interview/job clothing.\nClinic Services:\nThe Mission House clinic provides immediate medical care to those exhibiting pain or chronic medical issues that need attention.  The clinic operates on Tuesday evenings and Saturday mornings by appointment only.  Appointments are taken on Mondays from 1 p.m. to 3 p.m. and Thursdays from 1 p.m. to 3 p.m.  Patients must be homeless and/or uninsured Duval County residents with monthly income below $1,915 and be at least 18 years of age.  We do not provide routine physical or gynecological exams or HIV testing.  Students from the UNF nursing program research free medications from drug companies with the Patient Assistance Program for medications that are not available on order to Mission House.\nAlcoholics Anonymous:\nMeetings are held weekly at Mission House at 8 p.m. every Wednesday and 8:30 a.m. on Saturday.\nSpiritual Services:\n    Tuesday 6 p.m. music spiritual service with Pastor Keith from Calvary Chapel.\n    Listening sessions with Fr. Frank from Our Lady Star of the Sea Thursday evenings\n\n    Every second Tuesday Cross-eyed Ministry comes to give comfort and prayer to our clients."
  },
  {
    "addressLine1": "1614 Truesdell Court",
    "city": "Key West",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33040",
    "name": "Samuel's House",
    "organization": "Samuel's House",
    "phone": "(305) 296-0240",
    "website": "https://samuelshouse.org/",
    "description": ""
  },
  {
    "addressLine1": "2409 N. Roosevelt Blvd",
    "city": "Key West",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33040",
    "name": "St. Bede’s Village",
    "organization": "St. Bede’s Village",
    "phone": "(305) 292-9790",
    "website": "http://www.ccadm.org/sh_projects/homeless-prevention-and-rapid-re-housing-monroe-county/",
    "description": "Homeless Prevention and Rapid Re-Housing Monroe County\n\nProvides assistance and appropriate referrals to individuals and families in the Monroe County area to prevent homelessness, or rapidly re-house homeless families and individuals.\n\n Services offered include:\n\n    Rent/mortgage assistance\n    Utility assistance\n    Dockage Fee\n    Case management including assessment and referrals\n\nEligibility Requirements:\n\n    Resident of Monroe County\n    Homeless or at risk of homelessness\n    Must have a notice of eviction or late payment for rent/mortgage, and/or dockage.\n    Income restrictions may apply, please contact us for more details."
  },
  {
    "addressLine1": "5537 College Road",
    "city": "Key West",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33040",
    "name": "Kots Keys Overnight Tempory Shelter",
    "organization": "Kots Keys Overnight Tempory Shelter",
    "phone": "(305) 292-2744",
    "website": "http://www.shalkw.org/",
    "description": "Temporary Overnight shelter offering bed and showers for up to 155 Adults over the age of 18. Opens 6.30pm 7 days a week.\n\nThe Keys Overnight Temporary Shelter (KOTS) was created in 2004 by the City of Key West, to provide shelter and showers for about 150 people each night. SHAL began operating KOTS for the City in October 2011. The facility is comprised of seven temporary structures on Stock Island behind the Monroe County Sheriffs office at 5537 College Road.\n"
  },
  {
    "addressLine1": "127 NW Escambia St",
    "city": "Lake City",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32055",
    "name": "Suwannee Valley Rescue Mission/LAD Soup Kitchen",
    "organization": "Suwannee Valley Rescue Mission/LAD Soup Kitchen",
    "phone": "(386) 758-8438",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "PO Box 1028",
    "city": "Lake City",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32056",
    "name": "Another Way Inc - Domestic Violence Shelter",
    "organization": "Another Way Inc - Domestic Violence Shelter",
    "phone": "(352) 493-6743",
    "website": "http://www.anotherwayinc.net/",
    "description": "Provides counseling, support, and safe shelter to survivors of domestic and sexual violence; while providing a positive alternative to violence through community education.\n\nAnother Way provides domestic violence services in Columbia, Dixie, Levy, Gilchrist, Hamilton and Lafayette Counties. Sexual assault services are provided in these counties and additionally in Suwannee County. If you or anyone you know is in need of our services, please contact us at 1-866-875-7983 immediately! We can help!"
  },
  {
    "addressLine1": "Not Disclosed",
    "city": "Lake Worth",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "00000",
    "name": "The Lords Place - Burckle Place Supportive Housing for Women",
    "organization": "The Lords Place - Burckle Place Supportive Housing for Women",
    "phone": "(561) 603-9301",
    "website": "https://thelordsplace.org/what-we-do/supportive-housing/burckle-place/",
    "description": ""
  },
  {
    "addressLine1": "4051 Kirk Road",
    "city": "Lake Worth",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33460",
    "name": "Salvation Army Lake Worth Social Services",
    "organization": "Salvation Army Lake Worth Social Services",
    "phone": "(561) 968-8189",
    "website": "https://salvationarmyflorida.org/westpalmbeach/",
    "description": "The Salvation Army in Lake Worth, FL is a Social Services location.\n\nServices Provided:\nDry goods from their food pantry\nClothing from community donations\nEmergency furniture assistance if you are a victim of a natural disaster.\nUtility Assistance (if funding is available)\nRent Assistance (if funding is available)\nEmergency Food Assistance - Available on Tuesdays, Thursdays.\nClothing Vouchers to be used at our local Family Store are available on Fridays; Individuals and Families must qualify due financial strain or emergency.\n\n\nUtility and Rent and Mortgage Assistance is made by appointment ONLY; There are eligibility guidelines.\n\nYou must call for an appointment for any type of assistance."
  },
  {
    "addressLine1": "1712 2nd Ave North",
    "city": "Lake Worth",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33460",
    "name": "Adopt a Family of Palm Beaches",
    "organization": "Adopt a Family of Palm Beaches",
    "phone": "(561) 253-1361",
    "website": "https://www.aafpbc.org/",
    "description": "REACH is the only emergency shelter for families with minor children experiencing homelessness in Palm Beach County. The program focuses on the immediate stabilization of families while working to fulfill a goal of obtaining permanent or transitional housing for the families it shelters. REACH also provides food, clothing, and case management services for 19 families at any given time. In the most recent year, the program provided emergency shelter solution to 64 families in crisis while guiding 84% of families toward achieving self-sufficiency.\nProject SAFEProject SAFE, Adopt-A-Family's longest running housing program, provides a safe, consistent, and nurturing environment for 32 families experiencing homelessness. The program targets the community's most vulnerable families and prioritizes those with a head of household living with a disability.\n\nEach resident of Project SAFE receives support from an on-site case manager. This includes providing families with access to financial literacy training, educational opportunities, mental health referrals, life-skills training, and affordable childcare. The program works collaboratively with service providers from the community to enhance opportunities for the families we serve.\nSome of these agencies include Dress for Success, Palm Beach State College, Genesis Community Health, The Lord's Place, Community Partners, and other members of Palm Beach County's Housing and Homeless Alliance.\nProgram facts:\nProject SAFE was a recipient of a unique grant award through the Community Foundation for Palm Beach and Martin Counties. The grant provided funding for the installation of state-of-the-art, impact windows for all five buildings in the program. The upgrade allows for a safer and more energy efficient environment in Project SAFE.\n    Due to the barriers faced by the population the program serves, the program expanded its on-site staffing by bringing on an on-site therapist through a generous private foundation grant. With this addition in staff, the goal is not only to help families achieve independent living situations, but to improve their well-being in all areas of their lives thus creating a stronger foundation for long-term stability.\n"
  },
  {
    "addressLine1": "1003 Allendale Road",
    "city": "West Palm Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33405",
    "name": "Family Promise of North Central Palm Beach County",
    "organization": "Family Promise of North Central Palm Beach County",
    "phone": "(561) 318-8864",
    "website": "http://www.familypromisencpbc.org/",
    "description": "Host & Support Congregations: The hosting of families rotates weekly among the Host Congregations in the network. In turn, each host congregation provides lodging, three meals a day and caring hospitality 3-4 times each year. The Support Congregations provide much needed volunteers, supplies and finances when needed.\nDay Center: Guests use a local Day Center from 8:00 AM to 5:00 PM (Monday-Friday) where the Family Service Coordinator provides case management services. There, the guests pursue employment, tend to pre-school age children, use shower and laundry facilities. The Day Center provides guests with a mailing address and a base for housing and employment searches. Many guests are employed during the day, while older children attend school.\n\nTransportation: The Family Promise operates a 15 passenger van to transport guests to and from the Day Center.\nFunding: The organization is financed solely through private donations, private and corporate grants and fundraising events.\nSocial Service Agencies: Family Promise collaborates with other service providers to help our guests obtain jobs, mentoring, counseling, housing, social and health services.\nVolunteers: Volunteers are essential to our success and provide a wide range of services such as cooking and serving meals, playing with children or helping them with homework, interacting with guests with respect and compassion, and providing overnight security. The network depends on its success through its volunteers.\nList of Host Congregations\nFirst Presbyterian Church of Tequesta - Tequesta\nHoly Spirit Lutheran Church - Juno Beach\nMetropolitan Community Church - West Palm Beach\nOceanview United Methodist Church - Juno Beach\nOur Savior Lutheran Church - Lake Worth\nSt. Mark's Episcopal Church - Palm Beach Gardens\nSt. Paul of the Cross Catholic Church - Singer Island\nTemple Judea - Palm Beach Gardens\nTrinity United Methodist Church - Palm Beach Gardens\nUnion Congregational Church - West Palm Beach\nUnited Methodist Church of the Palm Beaches - West Palm Beach\nSupport Congregations\nHoly Spirit Episcopal Church - West Palm Beach\nOur Lady of Florida - North Palm Beach\nSt. Jude Catholic Church - Tequesta\n"
  },
  {
    "addressLine1": "7155 W Oakland Park Blvd",
    "city": "Lauderhill",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33319",
    "name": "Silver Impact Day Shelter",
    "organization": "Silver Impact Day Shelter",
    "phone": "(954) 572-0444",
    "website": "",
    "description": "Day shelter for those 55 years and older."
  },
  {
    "addressLine1": "221 Northwest 43rd Court",
    "city": "Oakland Park",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33309",
    "name": "Lippman Youth Shelter",
    "organization": "Lippman Youth Shelter",
    "phone": "(954) 568-2801",
    "website": "https://www.lsfnet.org/children-families/youth-shelters/",
    "description": "The Lippman Youth Shelter is a short term crisis runaway shelter for troubled and abused children from 12 years old to 17 years old."
  },
  {
    "addressLine1": "115 N 13th St",
    "city": "Leesburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34748",
    "name": "Christian Care Center Rescue Mission",
    "organization": "Christian Care Center Rescue Mission",
    "phone": "(352) 314-8686",
    "website": "https://www.christiancarecenter.org/",
    "description": "Men's Residence: The program serves up to 36 men who need help with drug and alcohol addiction, emotional issues and other life skills. The program is five months long and combines intensive Bible study and life skills classes with one-on-one counseling and mentorship from dozens of volunteers.\nThe Men's Residence has two barracks-style rooms with 12 beds each and three bedrooms that sleep two to four men each, for a total of 34 beds. The facility also features a commercial kitchen and a large common room that serves both as a dining room and a classroom, private rooms for counseling as well as staff offices. Outdoors there is a recreation area with basketball, free weights and a running circuit.\n\nThe Samaritan Inn\nThe Samaritan Inn is a transitional housing facility for homeless children and their parents or caregivers. The program is designed to help families become self-sufficient in a safe environment while teaching them life skills, supporting them as they pursue their personal goals and providing them with spiritual guidance during their journey. The Samaritan Inn is the only shelter in Lake County that accepts families with both men and women and is one of only three such shelters in Central Florida.\n\nQualified applicants are accepted into the shelters Temporary Housing Program which allows them to reside at the facility for up to 30 days. During that time they begin formulating an initial case plan. They are provided with various support services including parenting classes, childrens programming, employment services, dinner each night and access to food for breakfasts and lunches.\n\n\n\nAfter 30 days, a resident can choose to exit our program within a month, or apply to become part of the Transitional Housing Program. This program extends their length of stay to 12 months, during which time the family contributes only $175 or $250 per month (depending on the family) for program fees. Each family works with our staff to expand their case plan with more requirements to help them move forward toward sustainable independence at completion of the program. The expanded case plan includes creating a savings and debt reduction plan, regular church attendance, parenting classes and financial, marriage and vocational counseling. Our desire is to see each family leave with stable housing, consistent income and a closer relationship with Christ.\nThe Women's Residence\nThe Women's Care Center is a housing facility for women who are struggling with drug and alcohol addiction or other life issues. The program is designed to provide a safe place for women to recover through counseling, Bible study, life skills instruction and one-on-one mentoring to prepare them for wholesome, productive lives."
  },
  {
    "addressLine1": "1010 N Boulevard East",
    "city": "Leesburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34748",
    "name": "Leesburg Neighborhood Center",
    "organization": "Leesburg Neighborhood Center",
    "phone": "(352) 787-1156",
    "website": "http://www.lakecaa.org/commsvcctrs.asp",
    "description": "Food/Clothing/Financial Assistance provided"
  },
  {
    "addressLine1": "115 N. 13th St.",
    "city": "Leesburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34748",
    "name": "Christian Care Center Women's Care Center",
    "organization": "Christian Care Center Women's Care Center",
    "phone": "(352) 787-8929",
    "website": "https://www.christiancarecenter.org/",
    "description": ""
  },
  {
    "addressLine1": "1309 High Street, #102",
    "city": "Leesburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34748",
    "name": "Christian Care Center",
    "organization": "Christian Care Center",
    "phone": "(352) 787-8929",
    "website": "http://www.christiancarecenter.org/",
    "description": "Provides shelter for women and their children who have been displaced by poverty, abuse, or addiction. Ministers to their needs through personal counseling, spiritual mentoring, financial planning, and parenting classes. Job placement and help locating permanent housing are also provided to ensure their continued stability and future hope.\n\nMust be an adult and go through a prescreening process. Call for details.\n\nCall during office hours: 8am - 5pm."
  },
  {
    "addressLine1": "115 N. 13th St.",
    "city": "Leesburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34748",
    "name": "Christian Care Center Men's Residence",
    "organization": "Christian Care Center Men's Residence",
    "phone": "(352) 314-8733",
    "website": "http://www.christiancarecenter.org/ministries/mens-residence/",
    "description": ""
  },
  {
    "addressLine1": "115 N. 13th Street",
    "city": "Leesburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34748",
    "name": "Christian Care Center Samaritan Inn",
    "organization": "Christian Care Center Samaritan Inn",
    "phone": "(352) 314-8733",
    "website": "http://www.christiancarecenter.org/",
    "description": "The Samaritan Inn is a Transitional HOME in Leesburg, Florida for needy homeless families.\n\nProvides shelter for women and their children who have been displaced by poverty, abuse, or addiction. Ministers to their needs through personal counseling, spiritual mentoring, financial planning, and parenting classes. Job placement and help locating permanent housing are also provided to ensure their continued stability and future hope.\n\n\nMust be an adult and go through a pre-screening process. Call for details. Call during office hours: 8am - 5pm.\n\nOffice Hours\nMonday through Friday\n8:00 a.m. - 5:00 p.m."
  },
  {
    "addressLine1": "P.O. Box 522696",
    "city": "Marathon Shores",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33052",
    "name": "Domestic Abuse Shelter of The Florida Keys",
    "organization": "Domestic Abuse Shelter of The Florida Keys",
    "phone": "(305) 743-4440",
    "website": "https://domesticabuseshelter.org/",
    "description": "The Domestic Abuse Shelter, Inc. is the only certified emergency shelter in Monroe County that provides refuge for victims of domestic and sexual violence and their children. Residents may stay at the shelter for up to six weeks. 24-Hour Hotline, Information and Referral, Sexual Assault Response Assistance, Counseling services, Case Management, Advocacy: Survivors receive referrals and supportive assistance, Community Education, and Transportation Services."
  },
  {
    "addressLine1": "361 NW 67 St",
    "city": "Miami",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33138",
    "name": "Salvation Army Miami Edison Corps Social Services",
    "organization": "Salvation Army Miami Edison Corps Social Services",
    "phone": "(305) 757-1509",
    "website": "https://salvationarmyflorida.org/miami/",
    "description": "The Edison Corp's Salvation Army in Miami provides social services. The services include:\nDisaster Services\nEmergency Financial Assistance\nEmergency Shelter\nPlease contact this office to make an appointment for a needs assessment."
  },
  {
    "addressLine1": "701 Lincoln Rd",
    "city": "Miami Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33139",
    "name": "Douglas Gardens CMHC - Homeless Assistance Program",
    "organization": "Douglas Gardens CMHC - Homeless Assistance Program",
    "phone": "(305) 531-5341",
    "website": "http://www.dgcmhc.org/",
    "description": "Emergency Shelter and Outreach Services\n\nThe Douglas Gardens Community Mental Health Center provides comprehensive mental health services to people living in the Greater Miami Beach area. The Center was established in 1979 as a federally funded CMHC private non-profit State of Florida Corporation. The Center is accredited by the Commission on Accreditation of Rehabilitation Facilities (CARF) and the National Council for Behavioral Health Care Organization. It is governed by a Board of Directors comprised of 21 volunteers living in the Centers service area who are vested in the Centers clients success. The Board provides overall policy direction for the Center operations.\nAdults of all ages and backgrounds come to the Center for help managing their symptoms and living comfortably within the community. Our broad array of behavioral health care programs and services help these individuals achieve a more functional life and support resiliency and recovery for individuals who are living with mental illness.  The Center treats chronic mental illness, acute emotional disorders, substance abuse, and special population needs. The centers bilingual professionals (English and Spanish) also provide help for individuals with substance abuse problem, experiencing domestic violence, living homeless, and needing help with a loved one that has Alzheimers disease.\n\nThe Center is a recovery-based model of care for co-occurring treatment. We use assessment tools that reflect strength-based recovery approaches and self-directed care. Our treatment plans incorporate Wellness Recovery Action Plans (WRAP). We have a self-assessment tool and procedure as part of the intake process (ROSI).  Implemented evidence based practice modules into group interventions (Social Rehabilitation). Recovery and Wellness materials are used in outpatient, case management, and residential mental health services. We have an established peer counseling program including peer-facilitated support groups and clubs. Staff and Peers have been trained utilizing the \"Train the Trainer\" format and are active in coordinating Recovery -Oriented Mental Health Services. We do didactic training addressing co-occurring disorders through the CCISC Partnership and the administration of the baseline surveys (COMPASS and CODECAT).\nAt the center, you can also expect superlative care for a senior family member or loved one. And, many services are covered by Medicare, Medicaid, and private insurance."
  },
  {
    "addressLine1": "PO Box 9194",
    "city": "Naples",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34101",
    "name": "Sunlight Home",
    "organization": "Sunlight Home",
    "phone": "(239) 352-0251",
    "website": "https://sunlighthome.org/",
    "description": "Residential maternity home serving women of all ages.\n\nWe specialize in caring for women who are facing an unexpected or unwanted pregnancy. With a difficult pregnancy come difficult choices, and women need the facts to make an informed decision.\nServices Offered\nAll of our services are free and confidential. At the end of the day, we care about nothing more than your well being. Some of the services we offer include:\n    Medical Services. We have nurses who work as trained peer counselors. They have extensive experience in meeting the needs of women just like you women facing the unique challenges of pregnancy.\n\n    Counseling Services. Having a trusted person to talk to can be a big help. We invite you to schedule a visit with one of our trained counselors. Were here to listen free of judgement and in complete confidence.\n    Continued Education and Parenting Classes. Our program offers free and informal classes for expectant and new moms. Classes also features fun guest speakers, informational videos, and lively group discussions.\n    Adoption Information and Services. Adoption is a selfless act of love and can bring a positive end to an unplanned pregnancy. If youre not ready or able to parent, someone else is and that \"someone\" could be a family selected by you that will love and nurture your child."
  },
  {
    "addressLine1": "6919 OUTREACH WAY",
    "city": "North Port",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34287",
    "name": "North Port Social Services",
    "organization": "North Port Social Services",
    "phone": "(941) 429-3700",
    "website": "https://www.cityofnorthport.com/",
    "description": "Hours of Operation: Monday through Friday 8am to 5pm,\n\nFood bus fare gas vouchers provided.\n\nServices:\nSocial Services is a division within the Department of General Services and was established in 1980 to assist families and individuals in need of short term financial assistance. Our mission is to offer solutions to alleviate Renderingdespair, retain or restore dignity, and direct families toward economic independence and productivity."
  },
  {
    "addressLine1": "1476 Kenesaw Street",
    "city": "Port Charlotte",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33948",
    "name": "Charlotte County Homeless Coalition - Safe House Emergency Homeless Shelter",
    "organization": "Charlotte County Homeless Coalition - Safe House Emergency Homeless Shelter",
    "phone": "(941) 627-4313",
    "website": "http://www.cchomelesscoalition.org/",
    "description": "Charlotte County Homeless Coalition\nProvides emergency shelter for men, women, and families. New client intakes only on Mondays through Fridays 9am - 5pm.\n\nWe are the only homeless shelter in Charlotte County FL Charlotte County Homeless Coalition.\n\n\nAt the Safe House Emergency Shelter, we provide up to 60 days of shelter for people and families in crisis.\n\nThe Safe House Emergency Shelter is a 52 bed general population shelter with a focus on families. This is the only shelter available in Charlotte County. Safe, supervised and dry, the shelter allows clients to stay up to 60 days. In addition to serving the single male and female population, it is the goal of the Safe House Shelter to keep families intact.\n\nThis includes couples, couples with children, or single parents with minor children. There are six family units. The Safe House Shelter has served nearly 1,000 of Charlotte Countys homeless individuals and families, and more than 74% of those residents have gone on to permanent independent housing.The Shelter provides intensive Case Management by professionals.\n\nCase Managers assist clients in obtaining drivers licenses, identification cards, birth certificates, social security cards, military forms, etc.\n\n\nIntensive case management including employment opportunities, resume, and interview skills\n\nClient Referral Form for Community Agencies: click here for printable form? Case advocacy for clients with disability claims (SSDI/SSI)\n\nAssistance in eligibility and application for Veterans benefits & services\n\nAssistance in obtaining Vocational Rehabilitation, Goodwill Employment Training, and Senior Employment\n\nCash Assistance, Medicaid, and Medicare Services\n\nThe Charlotte County Homeless Coalition provides centralized intake for homeless clients with referrals as necessary to: Crisis Intervention Team; Crisis Stabilization Unit (CSU); Detox-Recovery Center (CBHC); Outpatient Evaluation & Counseling; AA/NA On-site 6-days per week; Crisis and Rape Emergencies (CARE); Department of Children & Families (DCF); and Homeless Youth Education\n\nResidents are expected to go to work, if employed, or prepare for and seek employment. Children will go to school or participate in child-care programs. Through collaborating agencies, training, transportation and other social services are made available to our clients.\n\nSafe, supervised, dry shelter includes breakfast, dinner, and intensive case management.\n400+ Residents Since December 18, 2008\nAssist clients in obtaining drivers licenses, identification cards, birth certificates, social security cards, military forms, etc.\nIntensive case management including employment opportunities, resume, and interview skills\n\nCase advocacy for clients disability claims (SSDI/SSI)\nAssistance in eligibility and application for Veterans benefits & services\nAssistance in obtaining Vocational Rehabilitation, Goodwill Employment Training, Senior Employment,\nCash Assistance, Medicaid, and Medicare Services\nCCHC provides centralized intake for homeless clients - referrals as necessary to:\nCCHC facility Crisis Intervention Team\nCrisis Stabilization Unit (CSU)\nDetox-Recovery Center (CBHC)\nOutpatient Evaluation & Counseling\nAA/NA On-site 6-days per week\nDepartment of Children & Families (DCF)\nHomeless Youth Education\n"
  },
  {
    "addressLine1": "18 N Terry Ave",
    "city": "Orlando",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32801",
    "name": "Coalition for the Homeless of Central Florida",
    "organization": "Coalition for the Homeless of Central Florida",
    "phone": "(407) 652-5300",
    "website": "http://centralfloridahomeless.org/",
    "description": ""
  },
  {
    "addressLine1": "410 W Central Blvd",
    "city": "Orlando",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32801",
    "name": "Orlando Union Rescue Mission Men's Division",
    "organization": "Orlando Union Rescue Mission Men's Division",
    "phone": "(407) 423-3596",
    "website": "http://www.ourm.org/",
    "description": "Men's shelter. The Orlando Union Rescue Mission is one of Central Florida's oldest and largest homeless service providers. The Mission provides for immediate physical needs, including food, clothing and shelter, however, our programs are designed to lead the homeless to permanent independence built upon a personal relationship with Christ.\n\nIntake: Starts at 2pm daily.\nFree first 7 nights. $6 night thereafter.\n\nPhoto ID required for entrance or must have an ID within the first week.\n\nBasic Men's Center Requirements\n    Application-based admission.\n    Residents must be 100 percent drug and alcohol free.\n    New Beginnings classes, and four other mandatory classes, must be completed.\n\n    Must work to earn their high school diploma and / or are gainfully employed.\n    Do daily chores around the Mission and keep living quarters clean at all times.\n    Attend chapel services in the Mission Church at Moody Chapel and be willing to have a personal relationship with Jesus Christ. After six months of participating in the program, residents may attend a local church of their choice.\n    Actively participate in a path toward self-sufficiency, working with a biblical counselor.\n    Limited temporary housing is available on a nightly basis but O.U.R.M. requirements must be met and those unwilling to comply are not admitted."
  },
  {
    "addressLine1": "400 W Colonial Dr",
    "city": "Orlando",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32804",
    "name": "Salvation Army Orlando Women's and Children's Shelter",
    "organization": "Salvation Army Orlando Women's and Children's Shelter",
    "phone": "(407) 423-8581",
    "website": "https://salvationarmyflorida.org/orlando/",
    "description": ""
  },
  {
    "addressLine1": "624 Lexington Ave",
    "city": "Orlando",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32804",
    "name": "The Salvation Army - Orlando Area Command",
    "organization": "The Salvation Army - Orlando Area Command",
    "phone": "(407) 423-8581",
    "website": "https://salvationarmyflorida.org/orlando/",
    "description": "Men seeking shelter find a safe place to lay their head at night at The Salvation Army. The Men's Shelter is not just a place to rest but also a place that offers programs designed to meet the needs of men who are hungry, unemployed and in need of guidance in their lives.\n\nResidents are provided the right to lead productive lives, free of alcohol and harmful drugs through a drug and alcohol-free environment. AA/NA Meetings are also offered on-site for those wanting continued support in maintaining wholesome living.\n\n\nThe men who stay at the shelter have the opportunity to participate in our program where they pay a nominal fee to stay at the facility. The first step after they decide to be a part of the program, is to obtain employment and maintain their jobs through the assistance of our program directors. Our ultimate goal is for each of the men to become self-sufficient and to re-enter the community with a better chance at being prepared for unfortunate circumstances. The men do have the option and are encouraged to attend GED Classes and pursue additional schooling or vocational training at a nearby educational institution.\n\nDaily Community Meal: 3:30pm to 4:30pm.\n"
  },
  {
    "addressLine1": "2313 North Orange Avenue",
    "city": "Orlando",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32804",
    "name": "Interfaith Hospitality Network Orlando",
    "organization": "Interfaith Hospitality Network Orlando",
    "phone": "(407) 893-4580",
    "website": "http://familypromiseorlando.org/",
    "description": "Services for the homeless. Contact for details of services.\n\nHours:\nMondays through Fridays 8AM to 5PM\n\nIHN Shelter Program\nThe IHN Shelter Program is a volunteer-driven, community-based program that provides shelter and comprehensive services for homeless families using facilities and volunteers of faith-based partners.\nEach week, one of our participating faith-based partners opens their doors and converts their classrooms or meeting rooms into bedrooms where four homeless families stay. Trained volunteers provide meals, compassionate support and activities for children. Our case management staff works with each family to establish a goal-orientated action plan for obtaining housing and sustainable income. We serve four families, up to a maximum of 14 people at a time."
  },
  {
    "addressLine1": "3955 West Colonial Drive",
    "city": "Orlando",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32808",
    "name": "Salvation Army Orlando Adult Rehab Center",
    "organization": "Salvation Army Orlando Adult Rehab Center",
    "phone": "(407) 295-9311",
    "website": "https://salvationarmyflorida.org/",
    "description": "Men suffering from homelessness, poverty, substance abuse, chemical dependency or misdirected lives can get the help they need at the Salvation Army Adult Rehabilitation Center.\n\n\n\nThe Adult Rehabilitation Center exists to help men grow closer to God in mind, body and spirit; overcome their addictions or afflictions; re-enter relationships with family, friends and society with a renewed and enriched sense of purpose; and live independently, self-sufficiently and morally.\n\n\n\n\nThrough the sale of donated items, including clothing, furniture and appliances, at Salvation Army thrift stores, the Adult Rehabilitation Center is able to sustain and enhance its programs and services offered to men throughout central Florida.\n\n\n\nThe Adult Rehabilitation Center (ARC), is a resident substance abuse rehabilitation program. Men come to the center for help when they are no longer able to cope with the pains of addiction. They have the benefits of group therapy, spiritual guidance and skilled counseling in a clean and stable environment. Residents receive nutritious meals, clean housing and engage in work therapy.\n"
  },
  {
    "addressLine1": "18 N Terry Ave",
    "city": "Orlando",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32801",
    "name": "Coalition For the Homeless",
    "organization": "Coalition For the Homeless",
    "phone": "(407) 426-1250",
    "website": "https://www.centralfloridahomeless.org/",
    "description": "Located on the main Central Boulevard campus, the Men's Service Center (MSC) is a two-story residential facility for 250 single homeless men at any given time, offering case management and supportive services. Accommodations are dormitory-style for residents in the comprehensive case managed programs. For those who are not yet ready to commit to this intensive level of support, there is an Introductory Phase with limited case management.\nEach night, the MSC opens its doors to anyone in need of a meal through our Community Feeding Program 7:00 PM Monday through Saturday and at 5:00 PM on Sundays.\n\nIt is important to note that you don't have to be a Coalition client to get a hot, nutritious dinner. We offer a community feeding program in the Men's Service Center (MSC) each night. Anyone who is hungry is welcome to join us at 7:00 PM Monday through Saturday and at 5:00 PM on Sundays.\nIf you or someone you know needs help, you've come to the right place. We provide shelter, food, and life-changing services to help individuals and families get back on their feet. Please contact us at 407.426.1250 to check for space availability and to schedule an appointment with our Intake Coordinator.\nWe accept:\nSingle men, with or without children\nSingle women, with or without children\nFamilies\nAdmission Criteria:\nClient must be 18 or older, unless accompanied by a parent or legal guardian.\nClient must be mentally and physically capable of self-care within a non-medical, non-psychiatric facility.\n\nIdentification, social security card, and birth certificate are preferred.\nTwo-bag maximum of personal belongings per person."
  },
  {
    "addressLine1": "3128 East 11th St",
    "city": "Panama City",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32401",
    "name": "Catholic Social Services St. Barnabas House Shelter",
    "organization": "Catholic Social Services St. Barnabas House Shelter",
    "phone": "(850) 763-0475",
    "website": "https://ccnwfl.org/",
    "description": ""
  },
  {
    "addressLine1": "609 Allen Ave",
    "city": "Panama City",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32401",
    "name": "Panama City Rescue Mission",
    "organization": "Panama City Rescue Mission",
    "phone": "(850) 769-0783",
    "website": "https://www.pcrmission.org/",
    "description": ""
  },
  {
    "addressLine1": "1824 W. 15th St.",
    "city": "Panama City",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32401",
    "name": "Salvation Army Transitional Housing Panama City",
    "organization": "Salvation Army Transitional Housing Panama City",
    "phone": "(850) 769-5259",
    "website": "http://www.salvationarmypanamacity.org/",
    "description": "Transitional Housing is available to clients in need of intensive, residential services\nThere are eight two-bedroom apartments available for families that are homeless or in transitional crisis. Programming assists clients in setting goals to overcome factors beyond their immediate control. The program provides a real life training ground for self-sufficiency, budget management and home economic skills. Program participants may stay at the facility for up to six months, although each clients case is evaluated for progress on a regular basis. This program began operation in the community in 1995.\n\nTransitional Housing clients are required to maintain gainful employment and open a savings account. They pay a small fee for housing, utilities and supervision based on their ability to pay and in keeping with their program budget. The program provides a clean, positive environment for the family to gain skills and resources to establish permanent residence in the community. As the client nears their goal of independent living, other material assistance is provided to ease their transition into affordable commercial housing. The capacity of each apartment in Transitional Housing is a total of six individuals. Apartments are available that are equipped for individuals with special needs.\nThe apartments are currently under renovations.\nPlease call our Office (850) 679-5259 for information about when the program will resume.\n"
  },
  {
    "addressLine1": "31 Murphy Lane",
    "city": "Pensacola",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32505",
    "name": "Alfred Washburn Center / Day Shelter",
    "organization": "Alfred Washburn Center / Day Shelter",
    "phone": "(850) 435-7427",
    "website": "https://www.alfredwashburn.org/",
    "description": ""
  },
  {
    "addressLine1": "206 East 8th Street",
    "city": "Apopka",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32703",
    "name": "Loaves And Fishes",
    "organization": "Loaves And Fishes",
    "phone": "(407) 886-6005",
    "website": "https://www.facebook.com/loavesandfishesapopka/",
    "description": "Loaves And Fishes is a food pantry. Serves 32703, 32712, 32714, 32745, 32757, 32768, 32776, 32777, 32798. Documentation Required: Proof of Residency (i.e., power bill, etc.) and Proof of Income (i.e., pay stub, tax return, etc.)\n\nFood pantry service hours: Mondays through Thursdays 9am - 10am (Call for Interview). Mondays through Thursdays 9am - 2:30pm (Services offered). .\n\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "1310 North S St",
    "city": "Pensacola",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32505",
    "name": "Salvation Army Lodge",
    "organization": "Salvation Army Lodge",
    "phone": "(850) 432-1579",
    "website": "https://salvationarmyflorida.org/pensacola/",
    "description": ""
  },
  {
    "addressLine1": "380 W. Herman Street",
    "city": "Pensacola",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32505",
    "name": "The Waterfront Rescue Mission",
    "organization": "The Waterfront Rescue Mission",
    "phone": "(850) 478-4027",
    "website": "https://waterfrontmission.org/",
    "description": "Men only overnight shelter.\nCheck in between 4 to 6pm\n\nDay services: Mondays through Fridays 6-8am limited.\n\n* Follow FACEBOOK page listed, for updates as things are changing rapidly.\n\n\nWaterfront Rescue Mission is a Christian organization that has provided food, shelter and clothing to the homeless in the greater Pensacola area since 1949. The Mission has two main campus locations, one in Pensacola, Florida, and one in Mobile, Alabama.. Rescue services include recovery and career development programs for homeless men with addictions.\n\n\n"
  },
  {
    "addressLine1": "1614 North T Street",
    "city": "Pensacola",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32505",
    "name": "Heavenly Blessings Mission",
    "organization": "Heavenly Blessings Mission",
    "phone": "(850) 469-0638",
    "website": "https://www.facebook.com/HeavenlyBlessingsMinistries/",
    "description": "Accepts men and women. Christian-based shelter for anyone needing a place to stay.\nHeavenly Blessings Ministries is a non-profit organization that mainly focuses on sheltering and feeding the homeless.\n"
  },
  {
    "addressLine1": "Private location",
    "city": "Pensacola ",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32503",
    "name": "M-Power House - Youth shelter ages: 16 to 21 years",
    "organization": "M-Power House - Youth shelter ages: 16 to 21 years",
    "phone": "(850) 266-2719",
    "website": "https://www.chsfl.org/",
    "description": "Call for application into transitional housing program for homeless youth ages16-21.\nM-Power serves teens and young adults who are homeless, at risk of homelessness and those who have exited foster care\nWho qualifies?\n\nYouth and young adults ages 16 to 21 who have exited foster care and those who are homeless.\nWhat to expect:\n\nWhen you join M-Power, youll find the path to realize your potential and skills to successfully transition to living independently.\n\nWith the support of M-Power, youll receive assistance with:\n\n\n    HousingLife skillsEducationJob trainingHealth needs\n\nWant to help? Become a host family!\n\nAs a host family, youll build bridges to success for youth in our community who are eager to realize their potential.\n\nYoull receive training, 24/7 support and a financial stipend to help cover the costs associated with caring for the teenager in your home.\n\nCall (850) 266-2700 to learn more.\n"
  },
  {
    "addressLine1": "50 W Johnson Ave",
    "city": "Pensacola",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32534",
    "name": "Women and Children Cold Weather Shelter",
    "organization": "Women and Children Cold Weather Shelter",
    "phone": "(850) 476-2221",
    "website": "https://www.ensleyfbc.org/",
    "description": ""
  },
  {
    "addressLine1": "620 N. McKenzie",
    "city": "Foley",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "36535",
    "name": "Salvation Army Foley Alabama",
    "organization": "Salvation Army Foley Alabama",
    "phone": "459-6125",
    "website": "",
    "description": "Our office hours are Mon-Fri 9 AM to 1PM\n\nWe provide Social Services, Food Pantry, Home Sweet Home Program, Homeless Day Services, School of music for elementary age children as well as disaster response services."
  },
  {
    "addressLine1": "20511 Co Rd 36",
    "city": "Summerdale",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "36580",
    "name": "Family Promise of Baldwin County Homeless Services",
    "organization": "Family Promise of Baldwin County Homeless Services",
    "phone": "(251) 947-5641",
    "website": "https://www.familypromisebaldwinal.org/emergency-shelter",
    "description": ""
  },
  {
    "addressLine1": "1901 Broadway",
    "city": "Riviera Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33404",
    "name": "The Valley Of Love Homeless shelter",
    "organization": "The Valley Of Love Homeless shelter",
    "phone": "(561) 502-8757",
    "website": "https://www.valleyofloveministries.org/",
    "description": "Valley of love ministries supports the homeless and needy families of Riviera Beach Florida with food, clothes and temporary sheltering.\n\nHomeless Ministries\nHave a heart for the homeless is operated by The Valley Of Love Ministries. Provides a range of services to homeless people in Palm Beach County. Services range from emergency accommodation, supported housing, social enterprise and more. VLM appeal raises awareness and funds to put an end to homeless in Palm Beach County. Our aim is to get rough sleepers off the street. VLM raises money to go towards services which support homeless people for the long term.\n\nServices:\n    Assistance with completing online applications for residents who qualify for the Food Stamp (SNAP) and Medicaid Programs,\n\n    Provision of school supplies, food, diapers, and clothes to families that have such need\n\n\n    Provision of Medical and legal support to families in need,\n\n    Helping to locate jobs for the unemployed and shelter for the homeless.\n\n    Providing spiritual support to families through prayer and a weekly radio Ministry.\n\n    1 day or 31 days Bus passes"
  },
  {
    "addressLine1": "200 W 20th St",
    "city": "Riviera Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34667",
    "name": "Holy Ground Shelter For The Homeless",
    "organization": "Holy Ground Shelter For The Homeless",
    "phone": "(561) 355-5040",
    "website": "https://holygroundpbc.org/",
    "description": "Holy Ground Shelter for Homeless, Inc. is a 501 (c) (3) established in 2009. Mission: To shelter and mentor homeless, pregnant teens and parenting teen mothers living in Palm Beach County.\n\n"
  },
  {
    "addressLine1": "1000 45th St",
    "city": "West Palm Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33407",
    "name": "Senator Philip D. Lewis Center",
    "organization": "Senator Philip D. Lewis Center",
    "phone": "(561) 904-7900",
    "website": "http://www.homelesscoalitionpbc.org/",
    "description": ""
  },
  {
    "addressLine1": "1715 Tiffany Drive East",
    "city": "West Palm Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33407",
    "name": "GulfStream Goodwill",
    "organization": "GulfStream Goodwill",
    "phone": "(561) 848-7200",
    "website": "https://goggi.org/",
    "description": "Homeless Residential Programs\nGulfstream Goodwill's Homeless Residential Programs provide safe, comfortable housing for homeless individuals with disabilities.\nPriority is given to those who are chronic substance users, veterans and persons diagnosed with severe mental illness.\n\n    All programs offer case management, life skills training, substance abuse and financial education, and job placement assistance.\n\nGoodwill Homeless and Residential ServicesGulfstream Goodwill currently manages five homeless residential programs and the Senator Philip D. Lewis Center:\nProject Succeed, New Avenues, Beacon Place, Beacon Place II and Home at J Street provide long-term supportive housing to single adults who are chronically homeless with a disability. These programs serve 133 chronically homeless individuals within the community. Referrals are accepted from the Palm Beach County Homeless Services Program and The Senator Philip D. Lewis Center.\nThe Senator Philip D. Lewis Center is a Palm Beach County homeless resource center provided through a unique partnership led by Gulfstream Goodwill Industries. Learn more about the Lewis Center.\n\nFor additional information, please call (561) 904-7900."
  },
  {
    "addressLine1": "2808 N Australian Avenue",
    "city": "West Palm Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33407",
    "name": "The Lords Place",
    "organization": "The Lords Place",
    "phone": "(561) 494-0125",
    "website": "https://thelordsplace.org/",
    "description": ""
  },
  {
    "addressLine1": "2107 North Dixie Hwy.",
    "city": "West Palm Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33407",
    "name": "St. Ann Place - OutReach Center",
    "organization": "St. Ann Place - OutReach Center",
    "phone": "(561) 805-7708",
    "website": "http://www.stannplace.org/",
    "description": "The Outreach center of Historical St. Ann Church, serving homeless women and men. Sister Katie Frank, SSND Health Care Program Director. Direct Line: 561- 932- 1005. They assist you with clothes, a shower, ID & Birth Certificate. If you need Food Stamps, they assist you with & Medical, with the Health Care District of Palm Beach County. There are other needs, if apply?\n\nSt. Ann Place is the Church's outreach center for services to homeless women and men. Its mission is to witness Gospel values by providing a comfortable, clean, safe place where clients receive services in a dignified and respectful manner regardless of race, religion, or gender. \n\nHygiene Center\nThere are six shower rooms (two are full bathrooms) that are available to clients who are homeless.  Regular clients are provided a container to store personal items for their use at the Center.  Clients who come for a shower may leave six pieces of clothing to be laundered.  Clean underwear and socks are given out as needed and shirts/pants/shorts are kept on hand for those who need them.\n\nFood Program\nThe food program is available Monday - Friday.  Breakfast is served daily from 8:00 - 9:00 AM.  Coffee, breakfast pastries, fresh fruit and cereal are served.  Lunch is served from 10:00 to 11:30 AM.  A take out bag will be provided that includes a meat and cheese sandwich, a peanut butter and jelly sandwich, crackers/chips and juice drink.  Pastries are also provided upon request."
  },
  {
    "addressLine1": "1320 Henrietta Ave",
    "city": "West Palm Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33401",
    "name": "Program REACH at Adopt a Family",
    "organization": "Program REACH at Adopt a Family",
    "phone": "(561) 514-0564",
    "website": "https://www.aafpbc.org/program-reach/",
    "description": "Eligible homeless families with children may receive emergency assistance including: travelers aid, shelter, food, transportation, clothing and case management services. An action plan will be developed through case management services in order to create linkage with other community resources to achieve self-sufficiency. To be eligible must be a homeless family with children under 18 years old, worked in the past (3) months or disability (mental/physical) receiving funds.\nHours: Monday through Friday 8am - midnight.\n\nProgram Reach is a member of a collaborative of service providers representing a continuum of care for the homeless and homeless at-risk in Palm Beach County. Program Reach is an emergency shelter for homeless families with dependent children and is staffed 24 hours a day, 7 days a week. Families in the shelter are part of a structured, supportive program that includes crisis counseling provided by The Center. Residents with other needs are linked with collaborative agencies, after-school tutoring by Palm Beach County School District teachers is provided to children at the shelter, and families receive budgeting and employment counseling. Pat Reeves Village provides temporary emergency shelter in area motels for homeless families. For people at imminent risk of homelessness, this program provides food vouchers, assistance with rent, mortgage and utilities. We also provide relocation assistance (Traveler' Aid) for individuals who are stranded to return to their out-of-town families. Referrals, food, clothing and personal hygiene items are provided to the homeless and at-risk served by both programs."
  },
  {
    "addressLine1": "PO Box 1251",
    "city": "Ruskin",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33575",
    "name": "Mary & Martha House Emergency Shelter and Transitional Housing for Women",
    "organization": "Mary & Martha House Emergency Shelter and Transitional Housing for Women",
    "phone": "(813) 645-7874",
    "website": "https://marymarthahouse.org/",
    "description": ""
  },
  {
    "addressLine1": "18240 US HWY 301 S",
    "city": "Wimauma",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33598",
    "name": "Beth-El Mission Farm Workers Assistance",
    "organization": "Beth-El Mission Farm Workers Assistance",
    "phone": "(813) 633-1548",
    "website": "https://beth-el.org/",
    "description": "DISTRIBUCION DE COMIDA\n\nMartes, comienza a las 8 a.m. a 2 p.m.\n\nLa distribucin Drive-Thru comienza a las 8 am hasta que se agoten las existencias.\n\n    Por favor, qudese en su automvil y siga las pautas de los voluntarios.\n\n    Venga preparado para abrir la puerta de su bal o automvil.\n    Tenga en cuenta la prctica de distanciamiento social: 6 pies de distancia.\n    Solo puede recoger UNA bolsa para un pariente confinado en su hogar.\n\nLA TIENDITA EST CERRADA\n\nSOLO SE PERMITE PERSONAL Y VOLUNTARIOS PROGRAMADOS EN EL EDIFICIO\n\nRESPUESTA DE EMERGENCIA\n\nLlmenos al 813-633-1548 antes de venir, si usted:\n\n    necesita recoger una bolsa de comida de emergencia\n    estn confinados en su hogar, aislados, en cuarentena\n    saber de alguien que no tiene acceso a alimentos\n\nVOLUNTARIOS SOLO DESPENSA DE ALIMENTOS\n\nBeth-El Mission helps farm workers achieve self-sufficiency through its open opportunities to worship, its extensive educational programs, and the many services it provides to meet basic needs. Provides Migrant housing referrals. Contact for further details."
  },
  {
    "addressLine1": "701 5th Ave North",
    "city": "St Petersburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33701",
    "name": "ALPHA House For Pregnant Women",
    "organization": "ALPHA House For Pregnant Women",
    "phone": "(727) 822-8190",
    "website": "http://www.alphahousepinellas.org/",
    "description": "The mission of ALPHA House is to provide housing and supportive services to homeless pregnant women and teens, new mothers with infants, and families experiencing crisis pregnancies. ALPHA House is Pinellas County's only residential maternity program.\n\nFrequently Asked Questions\nQ: Do you have any openings?\nA: It depends on your age, because of our different funding sources.\nQ: My children and I are homeless - do you have an opening?\n\nA: We assist women who are pregnant or are post-pardum with a child under the age of 9 months. We cannot assist with women who have more than one child. Please call and we can help point you in the right direction.\nQ: Do you provide services for men?\nA: Our services are for women who are pregnant and homeless.\nQ: Are you an emergency shelter?\nA: No, we are a long-term therapeutic based program that assists pregnant women with learning the life skills they need to be become successful members of society.\nQ: How long can someone stay at your shelter?\nA: A resident may reside with us up to 18 months after their child is born.\nQ: Do you provide independent living?\nA: Yes, however you must be a resident in our therapeutic program initially, and show successful completion before transitioning to our independent living apartment, DEEB. You must also be 18 years old and on level 4.\nQ: Will I receive items for my child? I can't afford baby supplies\nA: Yes, we provide ALPHA House residents with the essentials for each child and assist you with applying for public assistance.\nQ: What will I be required to do in your program?\nA: We require all residents to attends weekly group and individual counseling sessions with a Counselor, Monthly sessions with a life skills Counselor and regular meetings with a case manager.\n\nResidential Program\n    The goal of the Residential Program is to move women from homelessness to self-sufficiency while promoting healthy relationships, positive parenting, a good self-image and self-empowerment.\nThe fulfillment of ALPHA'S mission is a mother who has the education, job skills, parenting skills, self-esteem and spiritual foundation to be self-sufficient, raise her child and contribute to the community. Residents of ALPHA House receive free therapeutic counseling, case management and life skills education along with food, housing and medical care. The program promotes each woman's commitment to herself and to her child."
  },
  {
    "addressLine1": "863 3rd Ave N",
    "city": "St Petersburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33701",
    "name": "St Petersburg Free Clinic Women's Residence",
    "organization": "St Petersburg Free Clinic Women's Residence",
    "phone": "(727) 821-3894",
    "website": "http://www.stpetersburgfreeclinic.org/our-services/womens-residence",
    "description": "Shelter for single homeless women. The mission of Free Clinic Women's Residence is to provide safe and supportive transitional housing for single, homeless women who are capable of living independently.\n\nThe Women's Residence provides a safe place for single homeless women to stay while they are working, saving and planning for independent living. The residence can shelter a maximum of 20 women. The residents are supported through referral and information programs such as education about budgeting, goal setting, job seeking, and self-esteem. Women stay an average of 6 months; todays economic climate requires many residents to stay longer.\n\n\nIndividuals come to the Women's Residence for a variety of reasons: economic difficulties, recovery from drug or alcohol use, or family problems. To stay at the Womens Residence they must be drug and alcohol free, be able to work and save money for future independent living. All residents must help maintain the cleanliness of their rooms and the house in general."
  },
  {
    "addressLine1": "3835 28th St N",
    "city": "St Petersburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33714",
    "name": "St. Petersburg Free Clinic Men's Residence.",
    "organization": "St. Petersburg Free Clinic Men's Residence.",
    "phone": "(727) 823-5780",
    "website": "http://stpetersburgfreeclinic.org/beacon-house-2/",
    "description": "The St. Petersburg Free Clinic Men's Residence. is a transitional shelter for homeless men. The The St. Petersburg Free Clinic Men's Residence provides safe, supportive, transitional shelter to single, homeless men. The capacity of Beacon House is 25 residents. Residents work with staff to set goals, save money and work toward independent living.\n\nWith the aid of tSt. Petersburg Free Clinic Men's Residence, men are motivated and guided through the process of transitioning from homeless life to long term housing independence and financial stability. The structure provided by the staff and a community of men with similar desires stimulates hard work and success."
  },
  {
    "addressLine1": "PO BOX 41005",
    "city": "St Petersburg",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33743",
    "name": "The St Petersburg City Refuge",
    "organization": "The St Petersburg City Refuge",
    "phone": "(813) 406-1543",
    "website": "https://www.stpetecityrefuge.org/",
    "description": "THE ST PETERSBURG CITY REFUGE is a transitional housing program for ex-offenders, those in recovery from addiction, homeless, and open to anyone in need of a shelter. Our purpose is to assist individuals in the transition to becoming independent by providing them with the resources available to them. Our residents will receive the tools necessary to overcome and have a better quality of life. We help change one person at a time."
  },
  {
    "addressLine1": "P.O. Box 66676",
    "city": "St. Pete Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33736",
    "name": "Heaven on Earth for Veterans, Inc.",
    "organization": "Heaven on Earth for Veterans, Inc.",
    "phone": "(954) 822-2161",
    "website": "https://www.heavenonearth4veterans.org/",
    "description": ""
  },
  {
    "addressLine1": "821 SE Martin Luther King Jr. Blvd",
    "city": "Stuart",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34994",
    "name": "Salvation Army Compassion House Shelter",
    "organization": "Salvation Army Compassion House Shelter",
    "phone": "(772) 288-1471",
    "website": "http://www.salvationarmyflorida.org/martincounty",
    "description": "Compassion House is our transitional shelter for homeless women and women with children. We offer safe, secure shelter, food, clothing and counseling while residents work to once again become self-sufficient. Through case management, residents set goals and are guided in ways to use resources that meet their personal needs to meet those goals. A typical stay is three to four months.\n\nFAQ's\nHow do the women qualify to become residents?\nThey fill out an application and meet with the shelter coordinator who determines whether they would be a good fit for CH. They cant be using drugs or alcohol and must be willing to work to regain control of their lives. We currently have a waitlist of homeless women seeking help.\n\nDo the residents have to pay anything?\nNo. All their needs are met so they can save their money to eventually afford an apartment of their own. We provide meals, linens, toiletries, laundry supplies, and clothes, as well as classes and counseling - everything they need to get back on their feet.\n\nWhat do the children do while they stay at CH?\nThey are in school or at daycare during the day. In the evenings and on weekends, they play in the playroom or on the playground. Many participate in the youth and church programs available here at the Salvation Army.\n\nWhat can I do to help?\nWe are always in need of twin-size bedding and comforters, bath towels, and laundry supplies. If you have a background in budgeting, nutrition, parenting, or self-improvement, we might be able to use your services as a counselor or mentor to our residents."
  },
  {
    "addressLine1": "1380 Blountstown Highway",
    "city": "Tallahassee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32310",
    "name": "Catholic Charities of Northwest Florida Emergency Services",
    "organization": "Catholic Charities of Northwest Florida Emergency Services",
    "phone": "(850) 222-2180",
    "website": "https://www.facebook.com/CatholicCharitiesNWFlorida/",
    "description": "Emergency Family Assistance:\nThe Catholic Charities Emergency Assistance Program is a voluntary service designed to meet emergency needs of persons who are faced with a life-sustaining crisis. It is not intended to provide on-going financial assistance.\n\nThe target population is families in crisis who reside in the geographical area of the diocese of Pensacola/Tallahassee. Caseworkers will normally prioritize and assist potential clients according to need, immediacy of need and family situation; families with children, expectant mothers, homeless, and individuals lacking immediate necessities are all priorities.\n\n\nCatholic Charities attempts to assist all applicants, eligible or ineligible, with the emergency situation they face and by providing financial counseling, and information and referral to other resources as appropriate. Catholic Charities does not have income eligibility restrictions.\n\nChristmas Assistance:\nDuring the holidays, we become acutely aware of those in need. It is also a time of increased community awareness of vulnerable families and individuals. While all regional offices conduct a variety of holiday giving programs, Tallahassees Christmas Connection is the largest gift giving program in Northwest Florida. We ask for any and all gifts to accommodate those in need.\n\nCounseling Services:\nTo provide counseling services to empower and strengthen the quality of life for vulnerable families and individuals, while honoring the uniqueness of each by providing respectful, confidential, and professional services.\n\nWho is eligible?\nChildren, adolescents, adults, couples, or families residing in the eighteen counties of Northwest Florida. Due to the agencies limited resources and the special needs of some individuals, the agency cannot provide services to persons with:\nSevere obsessive rituals\nImpairments in reality testing or communications\nBehavior influenced by delusions or hallucinations\nPotential danger of hurting self or others\nActive physical abuse of others\nActive abuse of psychoactive substances\nGambling and other non-substance based addictive behaviors"
  },
  {
    "addressLine1": "2810 Sharer Rd, Suite 30",
    "city": "Tallahassee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32312",
    "name": "Good Samaritan Inn Residential Program For Males",
    "organization": "Good Samaritan Inn Residential Program For Males",
    "phone": "(850) 297-1113",
    "website": "https://www.gsncares.org/inn-for-men/",
    "description": "Program for men desiring to participate in a faith-based, residential program that includes work therapy, community service, life skills training, spiritual enrichment, accountability and structure."
  },
  {
    "addressLine1": "2729 West Pensacola St",
    "city": "Tallahassee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32304",
    "name": "Hope Community - Big Bend Homeless Coalition",
    "organization": "Hope Community - Big Bend Homeless Coalition",
    "phone": "(850) 576-5566",
    "website": "https://familypromisebigbend.org/",
    "description": "HOPE Community Temporary Housing Program\n\n    HOPE Community (location: 2729 W. Pensacola St)  is our residential facility with support services for homeless families with children and homeless single women.\n\n    We provide food and shelter for up to 140 people at a time, giving residents the option to stay for up to six months, while working on individual goals to work their way into stable housing.\n    In the last seven years, more than 1,200 HOPE Community residents have moved out into stable housing of their own (including 500 children)."
  },
  {
    "addressLine1": "2650 Municipal Way",
    "city": "Tallahassee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32304",
    "name": "The Shelter - Kearney Center",
    "organization": "The Shelter - Kearney Center",
    "phone": "(850) 792-9000",
    "website": "http://kearneycenter.org/",
    "description": "Emergency Temporary Shelter\nThis service is provided seven nights per week, and the check-in time is 8:00 p.m. Clients staying overnight must be at least 18 years old, able to physically care for themselves, and must not have to register as a sexual offender. Overnight clients have access to laundry, showers, storage, and the on-site medical clinic open nightly from 5:30 p.m. to 8:45 p.m.\n\nDaytime Services\nVarious support services are available Monday Friday via partnering social service providers. These agencies are on-site from 8:30 a.m. to 11:30 a.m., and 1:00 p.m. to 4:30 p.m.\n\nYou do not need to receive emergency temporary shelter from The Kearney Center to receive these services, however, you will need to register as a client in the arrival lobby.\n\n"
  },
  {
    "addressLine1": "P.O. Box 10547",
    "city": "Tallahassee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32302",
    "name": "The Chelsea House",
    "organization": "The Chelsea House",
    "phone": "(850) 297-1113",
    "website": "http://www.gsncares.org/",
    "description": "Homeless women and their children in our area face many problems and are in need of help. It is the mission of the Good Samaritan Network to be a part of the solution to this ever-growing problem. Through various support services, we are able to meet the needs of the homeless; thus, offering them encouragement and hope in God. The Good Samaritan Network is a faith-based outreach that networks with like-minded agencies and ministries for the purpose of restoration to individuals who find themselves facing homelessness. It is our goal to reach out to the physical, emotional, and spiritual needs of our ladies in need.\n\n    Phase I - Chelsea House: Transitional living for Single Women while going through a Christian program. (currently open)\n\n    Phase II - Emergency Overnight Shelter: For women and children only. (projected to open 2009)\n    Phase III - Good Samaritan Village: Transitional living for single moms with their children while going through a Christian program.\n    Each resident will pay program fees. Program fees will cover costs associated with being in the program except personal expenses such as toiletries, food, bus passes, medications, etc. If resident is unable to pay, she may apply for the scholarship program which will help pay her fees (based on fund availability) until she is able to take on the responsibility of paying her own program fees.\n\n    $10 nightly emergency overnight fee applies to overnight guest who sleeps on the couch\n    $200 monthly/$50 weekly - Level 1 bunk room 6-7 residents, limited storage space, shared bathroom, reserved bed\n\n    $250 monthly/$65 weekly - Level II semi-private room includes more privacy, shared bedroom/bathroom for 2-3 residents, extended lights out, more storage space, television in room\n    $300 monthly/$75 weekly - Level III semi-independent living residents live in attached fully-furnished studio apartment complete with private kitchen, walk-in closet, and private shared bathroom for 2-3 residents. Extra privacy allows residents to be exempt from mandatory lights out, meal plan and house chores are optional\n\nResources are available to all residents based on availability. Resource closet includes food pantry, clothing, personal care items, medicine cabinet, office supplies, items donated for yard sale."
  },
  {
    "addressLine1": "1224 Eppes Dr",
    "city": "Tallahassee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32304",
    "name": "CARE Tallahassee",
    "organization": "CARE Tallahassee",
    "phone": "(850) 597-8163",
    "website": "http://www.care-tallahassee.org/",
    "description": "CARE is a Christian home for men who are at risk of homelessness. We help assist men with their basic needs for food and shelter while also providing opportunities for our residents to grow and mature towards healthy social and spiritual living through the Lord Jesus Christ.\n\nOur program is structured to assist the men coming from prison to focus on their walk with Christ and successfully transition back into society. Each resident is given the opportunity to either pay our monthly program fees or participate in our volunteer program by working in our ministry. This is to help teach structure, responsibility, work ethic, and accountability. We have daily morning devotions, and nightly services to help the men stay focused and strengthen their relationship with our Lord and Savior Jesus Christ. We emphasize to the men at CARE, that whatever they do in the program, always do it to praise and glorify Him! After all, this is His ministry!\n\n"
  },
  {
    "addressLine1": "P.O. Box 12953",
    "city": "Tallahassee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32312",
    "name": "Making Miracles Group Home",
    "organization": "Making Miracles Group Home",
    "phone": "(850) 523-7886",
    "website": "https://www.makingmiraclesgrouphome.org/",
    "description": "A Christian transition program for homeless pregnant women. Although we are a transitional home a young lady can stay as her particular need requires,and goals are set."
  },
  {
    "addressLine1": "1105 North Monroe Street",
    "city": "Tallahassee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32303",
    "name": "City Walk Urban Mission",
    "organization": "City Walk Urban Mission",
    "phone": "(850) 528-3909",
    "website": "https://www.citywalkthrift.com/",
    "description": "The men's home is currently a 3 bedroom house, but our vision is to have a facility that houses 15 to 20 men.\nThe discipleship program exists to help men who have a desire to make the transition from incarceration back into the community as a transformed and productive citizen. Our home specializes in the needs of sex offenders. City Walk guides and helps men make such positive changes which are necessary.We provide monitored housing in a structured Christian family setting and assist in mentoring, a church home, employment opportunities, classes, and addiction recovery. Through a variety of classes and supportive Christian fellowship, we assist in strengthening ones practical as well as spiritual walk. Participants must bring total honesty and a commitment to change to the program and accept personal responsibility. City Walk believes that it is only through the power of God and faith in Christ Jesus that any person can receive the strength to overcome sin and the weaknesses of the flesh. Therefore, it is the hope of City Walk that all residents will be drawn by God into a relationship with Him and accept Jesus as Lord and Savior during their time here."
  },
  {
    "addressLine1": "3004 B Mahan Drive",
    "city": "Tallahassee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32333",
    "name": "Wisdom's Wellspring",
    "organization": "Wisdom's Wellspring",
    "phone": "(850) 294-6932",
    "website": "mailto:contact@wisdomswellspring.org",
    "description": "Wisdom's Wellspring is a faith-based 501(c)(3) transitional housing program for young women throughout the Big Bend area of Florida experiencing or facing homelessness and dependency.\n\nWe provide shelter, food and connection to education, training and employment, as well as life skills training through mentoring through a two-year residential program. We also offer limited emergency shelter for up to one week."
  },
  {
    "addressLine1": "606 West 4th Avenue, Suite 11",
    "city": "Tallahassee",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32303",
    "name": "InnBetween Transitional Housing",
    "organization": "InnBetween Transitional Housing",
    "phone": "(850) 575-4309",
    "website": "https://lssnf.org/",
    "description": ""
  },
  {
    "addressLine1": "317 Virginia Ave",
    "city": "Valdosta",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "31601",
    "name": "The Salvation Army - Emergency Men's Shelter",
    "organization": "The Salvation Army - Emergency Men's Shelter",
    "phone": "(912) 651-7420",
    "website": "https://salvationarmygeorgia.org/Valdosta/",
    "description": ""
  },
  {
    "addressLine1": "714 Charlton St.",
    "city": "Valdosta",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "31601",
    "name": "LAMP - New Horizons Dev. Center",
    "organization": "LAMP - New Horizons Dev. Center",
    "phone": "(229) 245-7157",
    "website": "http://lampinc.org/",
    "description": "Day Center and Emergency Shelter for single men, single women, & families with children.\n\nServices offered to the homeless: assistance with obtaining ID's, clothing, housing search assistance, community resource referrals, case management, life skills classes (budgeting, resume writing, job interview skills, parenting, stress management, time management & computer skills classes), day center with shower facility, laundry access, hygiene kits, & client computer lab. Intakes are accepted 24 hours a day, please call first for availability & criteria."
  },
  {
    "addressLine1": "2002 N. Florida Ave",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33602",
    "name": "Metropolitan Ministries",
    "organization": "Metropolitan Ministries",
    "phone": "(813) 209-1000",
    "website": "https://www.metromin.org/",
    "description": "Emergency Shelter\n\nWe are temporarily not able to accept walk-ins for emergency shelter. However, if you need emergency shelter or have questions related to the process, email Intakedocs@metromin.org or call (813) 209-1222. You can begin the process by completing the online form here. Email required documents (view list) to  Intakedocs@metromin.org. Please include your first and last name, date of birth, email address and phone number, and the best time to reach you. If you do not have internet access or need assistance with completing the application, leave your name, number and the best time to return your call and someone will reach out to you.\nWe are currently offering food boxes for families in need 9:30 a.m.-4:30 p.m. weekdays at our Family Support Centers. Please note that clothing services are currently unavailable.\n"
  },
  {
    "addressLine1": "11330 Countryway Blvd",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33626",
    "name": "Discovery Village At Westchase",
    "organization": "Discovery Village At Westchase",
    "phone": "(813) 798-0461",
    "website": "https://www.discoveryvillages.com/discovery-village-at-westchase",
    "description": ""
  },
  {
    "addressLine1": "4202 N Nebraska Ave",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33603",
    "name": "FSJ Rooming House",
    "organization": "FSJ Rooming House",
    "phone": "(813) 294-4993",
    "website": "http://www.fsjroominghouse.info/",
    "description": "* Note: This is not a homeless shelter. This is another resource that may be helpful.\nFSJ Rooming house has offered affordable housing since 1977 @ 4202 n nebraska (our 2nd location is 2818 n nebraska)\n\n\nThe cost for a client to live at the property is $100 a week with no deposit and the utilities are included."
  },
  {
    "addressLine1": "1514 N. Florida Avenue",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33602",
    "name": "The Salvation Army Red Shield Lodge Emergency Shelter",
    "organization": "The Salvation Army Red Shield Lodge Emergency Shelter",
    "phone": "(813) 549-0641",
    "website": "https://salvationarmyflorida.org/red-shield-center/",
    "description": "We operate 24/7/365, we operate on a first come firsts serve basis. We have a capacity of 132 shelter beds, although this is broken down by several programs.\n\nWe do not have a waitlist or call ahead list, we do not take reservations. We do not charge, ever. We are not a 1 night shelter, we offer a homeless program to assist with individuals getting from the streets to their feet.\n\n\nWe offer Case Management, meals, shelter, job assistance, insurance assistance, Social Security Assistance. All services are if applicable.\n\nThe old practice was set up by forming a line and accepting all persons we could hold. We no longer offer 5 nights for free as we no longer require any form of payment. Our phone number is 813-549-0641.\n\n\nEach homeless individual seeking shelter may come to our location, should a bed be available. Only an ID is required for occupancy. Should an individual not have an ID, we can work with them to obtain one.\n\nWe do run a Sex Offender Background Search prior to admission into our program."
  },
  {
    "addressLine1": "8535 North Nebraska Avenue",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33604",
    "name": "New Beginnings of Tampa Men Mission",
    "organization": "New Beginnings of Tampa Men Mission",
    "phone": "(813) 550-6921",
    "website": "https://www.newbeginningsoftampa.org/",
    "description": ""
  },
  {
    "addressLine1": "6718 N Armenia Ave",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33604",
    "name": "Dawning Family Services",
    "organization": "Dawning Family Services",
    "phone": "(813) 875-2024",
    "website": "http://dawningfamilyservices.org/",
    "description": "Dawning Family Services is an emergency homeless shelter for families with at least one minor child and women who are currently pregnant. Currently, we are at capacity. Our waiting list is full and has been closed; we do not anticipate it re-opening. Please call 211 for assistance.\n\nBridge Housing Emergency Shelter\n\nThe goal of Dawning Family Services is to help as many families as possible to avoid needing shelter altogether. Sometimes, however, households have nowhere else to go and shelter is unavoidable.\n\nOur bridge housing is short-term and offers a path for families to actively engage in ending their homelessness through the obtainment of permanent housing. We use a Housing First approach guided by the belief that housing is the foundation for life improvement and that this most basic necessity needs to be met before they can attend to other concerns. This approach does not have barriers to entry or mandatory participation requirements. Once the family is permanently housed, they are engaged in supportive services to assist them with problems affecting family well-being and to ensure that housing is retained."
  },
  {
    "addressLine1": "4428 E. Sligh Ave",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33610",
    "name": "Dee's House of Comfort For Veterans",
    "organization": "Dee's House of Comfort For Veterans",
    "phone": "(813) 629-1576",
    "website": "mailto:dsbskts@yahoo.com",
    "description": ""
  },
  {
    "addressLine1": "3000 N. Florida Ave",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33603",
    "name": "Homeless Helping Homeless",
    "organization": "Homeless Helping Homeless",
    "phone": "(813) 415-3586",
    "website": "http://www.homelesshhh.com/",
    "description": "Services:\n1. Women's Transitional Shelter\n(STILL OPEN)\n813/415-3586\n\n2. Woman & Children's Shelter\n\n3. Single Men's Shelter\n\n3. HHH NOW HAS A SHELTER FOR HOMELESS College Students\n813 415-3586\n\n4. HHH Birth Certificate/ID Program\nThis program provides funds, when available, for homeless individuals to obtain birth certificates on a first come, first serve basis. It is vital for homeless individuals to have a state ID in order to obtain benefits from the City of Tampa, (Food Stamps, Hillsborough County Health Insurance, etc.). Individuals will not get into an emergency shelter without an ID. Lastly, with an ID, homeless individuals will be able to apply for employment, which can lead to permanent housing."
  },
  {
    "addressLine1": "1812 E 143rd Ave #2",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33613",
    "name": "Recovery Services of Tampa Bay",
    "organization": "Recovery Services of Tampa Bay",
    "phone": "(813) 969-2068",
    "website": "http://www.recoveryoftampabay.org/",
    "description": ""
  },
  {
    "addressLine1": "3630 N. 50th Street",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33619",
    "name": "Drug Abuse & Comprehensive Coordinating Office (DACCO)",
    "organization": "Drug Abuse & Comprehensive Coordinating Office (DACCO)",
    "phone": "(813) 384-4170",
    "website": "https://www.dacco.org/",
    "description": ""
  },
  {
    "addressLine1": "4612 N. 56th Street",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33610",
    "name": "ACTS Tampa",
    "organization": "ACTS Tampa",
    "phone": "(813) 246-4899",
    "website": "http://www.actsfl.org/",
    "description": "Hours: Mondays through Fridays 8am to 5pm.\n\n"
  },
  {
    "addressLine1": "401 E Jackson St Ste 2340",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33602",
    "name": "New Life Transitional Services, Inc",
    "organization": "New Life Transitional Services, Inc",
    "phone": "(813) 710-3818",
    "website": "https://nlths.org/",
    "description": ""
  },
  {
    "addressLine1": "11330 Countryway Blvd",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33626",
    "name": "Discovery Village at Westchase | Senior Living Facilities Florida",
    "organization": "Discovery Village at Westchase | Senior Living Facilities Florida",
    "phone": "(813) 536-6764",
    "website": "https://www.discoveryvillages.com/discovery-village-at-westchase/",
    "description": ""
  },
  {
    "addressLine1": "901 East Seward Avenue",
    "city": "Tampa",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33604",
    "name": "New Beginnings of Tampa Hope House for Women",
    "organization": "New Beginnings of Tampa Hope House for Women",
    "phone": "(813) 347-1199",
    "website": "https://www.newbeginningsoftampa.org/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 2240",
    "city": "Venice",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "34284",
    "name": "Our Mother's House",
    "organization": "Our Mother's House",
    "phone": "(941) 485-6264",
    "website": "https://catholiccharitiesdov.org/charities/our-mothers-house/?fbclid=IwAR3_bMdDAMXM1mS23JH14qAWW3sff",
    "description": "Mission: We offer single mothers and their children a safe and secure environment in which to achieve increased self-sufficiency through education, vocational training and personal growth.\n\n\nLow cost housing and free child care see website for more details.\n\nOur Mothers House is a non-profit, non-denominational residential housing program offered by Catholic Charities, Diocese of Venice, Inc.\n\nWe have 17 apartments for homeless mothers with one or two children under 3 years of age."
  },
  {
    "addressLine1": "3650 41st St",
    "city": "Vero Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "32967",
    "name": "Samaritan Center Transititional Housing",
    "organization": "Samaritan Center Transititional Housing",
    "phone": "(772) 770-2900",
    "website": "https://www.ccdpb.org/programs/samaritan-center/",
    "description": "Transitional Housing from Catholic Charities\nThe Samaritan Center provides transitional housing and guidance to homeless families in Indian River County and prepares them to live independently. The average length of stay is 6-9 months. During their stay, the Samaritan Center partners with resident families to provide a nurturing environment, safe housing, case management, support/educational services, and connection to community resources. \n\nOur resident clients are responsible to do the work leading to independence and self-sufficiency. Families must obtain employment and open a bank account and save 75% of their earnings per the financial stability contract. Required educational opportunities are offered to help residents gain independent living skills.  Topics include positive parenting techniques, financial management/ budgeting, health and safety, conflict resolution, and household management. Our Four-Tiered Level Program assists clients in progressively moving forward in their independent living skills development.\n\n\nThe Samaritan Center is guided by a service philosophy that values client choice and promotes resident's integration into the community, as evidenced by our success rate of 75% clients living independent 6 months after exiting the program at Level III or higher.\nAdmissions\n\nSamaritan Center serves \"homeless\" families (adults and children who meet the following eligibility and suitability criteria):\n\n    Homeless \n    Resident of Indian River County\n    Families may be intact (2 parents with children) or single parent families. \n    Parents must have legal custody or be in a reunification process with the child/children \n    At least one, preferably both, parent(s) must be willing and physically able to work.\n    High School Diploma or GED or is required to enroll in IRSC Adult Education\n\n\nTo apply for admissions, potential resident(s) must call Samaritan Center for a telephone interview. The Assistant Program Administrator will contact them to discuss the program and take information to determine the basic eligibility. If deemed eligible for assistance, the potential resident(s) will be placed on a waiting list until housing becomes available. Admission is granted on a first-come, first-served basis and is open to families of all faiths.\n\n\n\n"
  },
  {
    "addressLine1": "102 Carlton St",
    "city": "Wauchula",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33873",
    "name": "Hannah's House (Home for Women & Children)",
    "organization": "Hannah's House (Home for Women & Children)",
    "phone": "(863) 773-5717",
    "website": "https://www.aofm-hannahshouse.org/",
    "description": "Beyond a shelter - it is a home for battered or homeless women and their children. This is a faith based program designed to help women change their lives, free of abuse, homelessness, and the difficulties of life on the streets....through supplying their needs, classes, counseling, completing their education and job placements. Our goal is to help them become an independent and successful person that can go back into our community. Although, our average length of stay may be 3-6 months, some stay much longer if that is what is needed. We also have Hannah's House Complex, which provides independent apartment living based on income, available for those who are ready to move on to the next phase of their life or if they become homeless and already have an income. This is also considered permanent supportive housing for homeless women and children."
  },
  {
    "addressLine1": "4158 Lado Dr",
    "city": "Wesley Chapel",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33543",
    "name": "The Lado Loop Home and Sanctuary",
    "organization": "The Lado Loop Home and Sanctuary",
    "phone": "(813) 395-6402",
    "website": "mailto:lisad.lltheladoloop@gmail.com",
    "description": "This is not a shelter Safe affordable housing $100 a week no deposit"
  },
  {
    "addressLine1": "2122 Palm Beach Lakes Blvd",
    "city": "West Palm Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33409",
    "name": "Salvation Army Area Command",
    "organization": "Salvation Army Area Command",
    "phone": "(561) 686-3530",
    "website": "http://www.salvationarmyflorida.org/westpalmbeach/",
    "description": "Food and emergency services provided"
  },
  {
    "addressLine1": "1577 North Military Trail",
    "city": "West Palm Beach",
    "state": "Florida",
    "stateAbbreviation": "FL",
    "postal": "33409",
    "name": "The Salvation Army Center of Hope West Palm Beach",
    "organization": "The Salvation Army Center of Hope West Palm Beach",
    "phone": "(561) 682-1118",
    "website": "",
    "description": "The Salvation Army Center of Hope is a transitional housing program which has been operating since 2000. The Center provides substance abuse and mental health treatment services along with case management and housing up to 24 months for eligible single men and veterans. The Center's programming is designed to reduce barriers to economic self-sufficiency for homeless men. Its goals are to increase skills and/or income, residential stability, and self determination. Center of Hope services include transitional housing, meals, assistance with clothing and transportation, life skills and GED classes, on-site NA/AA meetings and a comprehensive substance abuse and mental health program. The 95-bed Center of Hope is a 24-hour, seven-days-a-week, year-round program providing a stable living environment for homeless men and/or chronically homeless chronic substance abusers who are residents of Palm Beach County.\n\nThe Salvation Army's Chaplain serves full-time and offers weekly bible study, meditation, counseling, and other Christian programming for residents who desire spiritual activities while at the Center.\n\n\nThe Center of Hope contracts Addictions Research & Consulting Corporation and its Paige Foundation to provide treatment and services for COH residents and for others who are at risk of homelessness, those referred by Drug Courts and dually diagnosed clients whose needs and profiles are consistent with the HUD residential Supportive Housing Program. Approximately 95% of the Center's residents receive evidence-based drug or alcohol treatment for their addictions and up to one-third may also be dually diagnosed with mental illnesses.\n\nAddiction and /or mental illness is not a criterion for enrollment in the Center of Hope... however, applicants must be homeless."
  }
]