[
  {
    "addressLine1": "4306 W State",
    "city": "Boise",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83703",
    "name": "Salvation Army Housing and Homeless Services",
    "organization": "Salvation Army Housing and Homeless Services",
    "phone": "(208) 343-5429",
    "website": "https://boise.salvationarmy.org/",
    "description": "The \"Finally Home\" program was established in fall 2012 to help families with children and single individuals obtain permanent housing and become self-supporting. Local emergency shelters refer eligible families and individuals to the program, where a licensed professional social worker helps them find apartments and basic furnishings.\n\nThe Salvation Army pays rent and utility expenses for a period of time agreed to by both parties. When the household is ready to graduate from the program, the family or individual will take over their own expenses, remaining in the apartment.\n\n\nFinally Home provides weekly case management with professional social workers including weekly goal setting for saving money and securing employment, among others. Client accountability is emphasized. Social skills groups teach budgeting, nutrition, child care and self-esteem building."
  },
  {
    "addressLine1": "575 S. 13th St",
    "city": "Boise",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83702",
    "name": "River of Life - Boise Rescue Mission",
    "organization": "River of Life - Boise Rescue Mission",
    "phone": "(208) 389-9840",
    "website": "https://boiserm.org/facilities/river-of-life/",
    "description": "Emergency men's shelter. Provides 3 meals a day, clothing, job search help.\n\n\nCheck in: 4pm daily for overnight shelter.\n\nMeal times (for men, women and children)\n\nBreakfast: 6:30am every day.\n\nLunch: 12pm (Mondays through Saturdays), 1pm on Sundays.\n\nDinners: 5pm for community guests. 7pm for guests staying at the River of Life.\n\n\nIf you are homeless, hungry or struggling, we invite you to join us at River of Life. No matter where you are at in life, our doors are always open to you \" we will never turn you away due to lack of space.\nContact us about visiting our Boise, ID men's homeless shelter for food, a place to sleep, or any of our other services or programs."
  },
  {
    "addressLine1": "1404 W. Jefferson",
    "city": "Boise",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83702",
    "name": "Boise Rescue Mission - City Light Home For Women & Children",
    "organization": "Boise Rescue Mission - City Light Home For Women & Children",
    "phone": "(208) 368-9901",
    "website": "https://www.facebook.com/BoiseRescueMission",
    "description": "Women's and children's shelter. Provides 3 meals a day, clothing, job search help, employment re-entry program, etc.\n\n\nThis facility offers emergency services such as meals, shelter and clothing in addition to education, work-search assistance, mental health, counseling, addiction recovery (New Life Program), and children's programs.\n\nCheck-in:4:00 PM Daily for Overnight Shelter\n\nThis shelter for women and children offers a safe haven of hope and love, providing emergency services such as meals, shelter and clothing, as well as education, work-search assistance, mental health counseling, addiction recovery through the New Life Program, and children's programs.\n\nHours\nMeal Times\nBreakfast - 6:45 a.m. (Sunday - Friday), 8:00 a.m. (Saturday)\nLunch - 12:00 p.m. (Daily)\nDinner - 4:45 p.m. (Daily)\nCheck-In\nOvernight Shelter - 4:00 p.m. (Daily)\nCall 208-368-9901 or come by to find out how to check in for the night.\nChapel\nService - 6:15 p.m. (Daily)\nCity Light Home for Women & Children is a ministry of Boise Rescue Mission Ministries. Located in Boise, ID on W. Jefferson St., this shelter serves homeless women and children across the Treasure Valley area.\n\n"
  },
  {
    "addressLine1": "720 W. Washington",
    "city": "Boise",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83702",
    "name": "Women's and Children's Alliance",
    "organization": "Women's and Children's Alliance",
    "phone": "(208) 343-7025",
    "website": "http://www.wcaboise.org/",
    "description": "Secure Shelter & Transitional Living\nThe WCA provides a comprehensive and secure 120-day residential shelter program and transitional housing, in confidential locations with round-the-clock staff assistance, private rooms and common living facilities for women and children who are fleeing domestic and/or sexual assault.\nWhile living at the WCA, residents participate in a comprehensive program including:\n\n    Group and Individual Counseling for Women and Children\n    Case Management\n    Life Skills, Parenting and Recovery Classes\n    Safety Planning\nOn-site child care is provided for mothers participating in the residential program. All residents receive the benefit of the WCAs other services free of charge while residing in our shelter.\nIf you need safe shelter, call our 24-Hour Crisis Hotline 208.343.7025."
  },
  {
    "addressLine1": "308 S. 24th St.",
    "city": "Boise",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83702",
    "name": "Boise Rescue Mission - Ministry Center",
    "organization": "Boise Rescue Mission - Ministry Center",
    "phone": "(208) 343-2389",
    "website": "http://www.boiserm.org/",
    "description": "Since 1958 the Boise Rescue Mission has been serving the Treasure Valley by meeting the spiritual, physical and psychological needs of people who are homeless or in need who live in our community and those who pass through on a daily basis.\n\nThe Boise Rescue Mission provides food, clothing and shelter for men, women and children 365 days a year.\n\n\nThe Ministry Center and Warehouse serves as the hub for all of Boise Rescue Mission's activities. In addition to housing administrative operations, it includes the development department, volunteer/events staff, and warehouse services."
  },
  {
    "addressLine1": "1620 W. River Street",
    "city": "Boise",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83702",
    "name": "Interfaith Sanctuary Shelter",
    "organization": "Interfaith Sanctuary Shelter",
    "phone": "(208) 343-2630",
    "website": "http://interfaithsanctuary.org/",
    "description": "Phone: (208) 343-2630 after 6:00pm, or during the daytime to leave a message.\n\nHours: 5:30pm to 7:00am Monday-Saturday and until 8:00am on Sunday. (PLEASE NOTE: The shelter is closed during the day. However, if scheduled in advance, it is possible to make arrangements for a drop off or visit.)\n\nEmergency Shelter\nOur Emergency Shelter Program provides overnight shelter for up to 164 men, women and children each night of the year. Shelter services are available from 6:00pm to 7:00am daily (8:00am on Sunday), and are supplemented by light dinners provided in partnership with Life's Kitchen and the Idaho Foodbank.\nSingle men and women have separate sleeping facilities in the shelter while sharing a common dining/recreation hall. Families are housed in another section of the shelter and share their own hospitality room.\n\nSanctuary offers services to a wide sector of those experiencing homelessness, including two-parent intact families, single father families, and single mother families with a male child over age 12, who are not eligible for emergency shelter services at any other location in Boise. While our target population is men, women, and families who are homeless, other underserved populations are represented in this group, including victims of domestic abuse, persons with mental and/or physical illness, veterans, persons with drug/alcohol abuse issues, and those facing under/unemployment.\nIf you are seeking shelter:\n    Call the shelter at (208) 343-2630 after 6:00pm\n    Visit the shelter at 1620 River St. in Boise around 5:45pm"
  },
  {
    "addressLine1": "525 S Americana Blvd",
    "city": "Boise",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83702",
    "name": "Corpus Christi House",
    "organization": "Corpus Christi House",
    "phone": "(208) 426-0039",
    "website": "https://corpuschristiboise.org/",
    "description": "Currently open Monday through Saturday, from 10:00 a.m. to 2:00 p.m.\n\nMeals, showers, laundry, new clothes, rest from the heat and cold.\n\nMeal Services\n\nNOTE: Due to the safety of our community and our volunteers, we are not currently serving a meals until it is safe to do so.\n\n7:00 a.m. Breakfast\nFamilies with children are first so they can catch their bus to school\n\n9:30 a.m. Mid Morning Meal\nPrimarily provided with food donating that morning\n\n2:00 p.m. Afternoon Meal\nOne last hot meal to get through the day until the night shelters open\n\nHot Coffee is available from 7:00 a.m. 3:00 p.m. or until its gone.\nHospitality\n\nEasing the burden of being homeless\n    Public Bathroom & Shower-  Towels and soap provided\n    Laundry Services    Clothes can be dropped off for washing and drying\n\n    Public Phone Access   Make calls and receive messages\n\n\nDue to social distancing requirements, we are not currently offering services inside our facility. We hope to soon again offer the following services:\n    Space to Socialize, Develop Friends and Network\n    Getting out of the weather to warm up or to cool down\n    Having a place to sit, read, visit, and recreate without being hassled\n"
  },
  {
    "addressLine1": "1412 4th St South",
    "city": "Nampa",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83651",
    "name": "The Salvation Army Family Shelter",
    "organization": "The Salvation Army Family Shelter",
    "phone": "(208) 461-3733",
    "website": "http://thesalvationarmynampa.org/family-shelter-activities/",
    "description": "The Community Family Shelter (CFS), located in Nampa, provides emergency housing and transitional housing for intact families, women with children and single women. CFS serves families and individuals that are homeless with low or no income. It is the only emergency shelter facility in Nampa for intact families.\n\nResidents may remain in the emergency housing program up to 90 days and the transitional housing program for up to two years. Our comprehensive program includes case management, counseling, education on managing savings accounts, education, three meals per day, access to laundry facilities, a playground for children, personal necessities, transportation assistance, and more.\n\n\nCFS conducts a daily outreach program for low-income, homeless, or at-risk persons including men by offering hot lunches, showers, laundry facilities, clothing, transportation assistance, bread and other resources."
  },
  {
    "addressLine1": "869 W. Corporate Ln.",
    "city": "Nampa",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83651",
    "name": "Valley Women & Children's Shelter in Nampa, ID",
    "organization": "Valley Women & Children's Shelter in Nampa, ID",
    "phone": "(208) 475-0725",
    "website": "https://boiserm.org/facilities/valley/",
    "description": "Valley Shelter is the only emergency shelter for women and children in the Nampa and Western Treasure Valley area.\nIf you need help now, we welcome you to Valley Shelter  our doors are always open. In fact, Boise Rescue Mission Ministries has a policy to never turn down anyone for food or shelter due to a lack of space.\n\nHours\nMeal Times\nBreakfast   5:45 a.m. (Monday-Saturday), 6:30 a.m. (Sunday)\nDinner   6:15 p.m. (Daily)\nCheck-In\nOvernight Shelter   4:00 p.m. (Daily)\nCall 208-475-0725 or come by to find out how to check in for the night.\nChapel\nService   6:45 p.m. (Daily)\nValley Women and Children's Shelter is a ministry of Boise Rescue Mission Ministries. Located in Nampa, ID on W. Corporate Ln., this shelter serves homeless women and children in Southwestern Idaho."
  },
  {
    "addressLine1": "1508 Hope Lane",
    "city": "Caldwell",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83605",
    "name": "Hope's Door",
    "organization": "Hope's Door",
    "phone": "(208) 459-6330",
    "website": "http://www.aafvhope.org/",
    "description": "Hope's Door is an emergency shelter for victims of domestic abuse and sexual assault. The shelter is staffed 24 hours a day, 365 days per year.\n\nHope's Door is the only domestic violence specific to women and children shelter in Canyon County.  We provide protection not only for victims in Idaho, but across the entire United States.\n\n\nWhile staying at Hope's Door Shelter, survivors are able to take part in many different educational courses that focus on healthy relationships and life skills. Our goal is to empower individuals to set the course for eliminating violence in their lives and throughout our community.\n\nHow long can I stay at Hope's Door Shelter?\nYou can stay at Hope's Door Shelter for up to 90 days. After your 90 day stay, we offer transitional affordable housing for 2 years.\n\nHow many rooms are available at Hope's Door Shelter?\nHope's Door Shelter has 28 private bedrooms where women and their children have the security and safety needed to begin moving forward with a violence-free future.\n\nHow can I apply for a room at Hope's Door Shelter?\nTo apply for a room at Hope's Door Shelter, please call the Shelter for a phone interview, (208) 459-6279."
  },
  {
    "addressLine1": "2480 S. Yellowstone",
    "city": "Idaho Falls",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83405",
    "name": "The Haven (Women & Children’s Shelter) Run by Idaho Falls Rescue Mission",
    "organization": "The Haven (Women & Children’s Shelter) Run by Idaho Falls Rescue Mission",
    "phone": "(208) 523-6413",
    "website": "https://ifrescuemission.org/the-haven-women-childrens-shelter/",
    "description": ""
  },
  {
    "addressLine1": "1820 E. 17th Street Suite 150",
    "city": "Idaho Falls",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83404",
    "name": "CLUB, Inc. - Idaho Falls",
    "organization": "CLUB, Inc. - Idaho Falls",
    "phone": "(208) 529-4673",
    "website": "http://clubinc.org/",
    "description": ""
  },
  {
    "addressLine1": "840 Park Avenue",
    "city": "Idaho Falls",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83402",
    "name": "City of Refuge (Men’s Shelter) Run by Idaho Falls Rescue Mission",
    "organization": "City of Refuge (Men’s Shelter) Run by Idaho Falls Rescue Mission",
    "phone": "(208) 552-5575",
    "website": "https://ifrescuemission.org/city-of-refuge-mens-shelter/",
    "description": "Located in down town Idaho Falls, provides services to homeless men 18 years old and older. It was actually the genesis of the Idaho Falls Rescue Mission. City of Refuge was established in September of 1999 as a mens emergency shelter offering shelter, meals and clothing. Over the years, City of Refuge has evolved to a community resource serving the evening meal to the hungry in Idaho Falls. We also provide food boxes, hygiene products, shower and laundry facilities to those in need.\nCity of Refuge currently has 20 beds available in two dorm areas. We also have a classroom, a full commercial grade kitchen and our Sonshine Room where we serve dinner every evening to as many as 120 hungry folks from our community. The Sonshine Room also serves as our location for evening bible studies.\n\nCheck-in: 4:00 PM\nDinner Served: 6:00 PM\nCall 552-5575 for evening bible study times and topics\n\n\nIdaho Falls Rescue Mission exists to serve, rescue, and transform those in greatest need through the power and grace of Jesus Christ, using the resources provided by our donors, volunteers and our community. City of Refuge Men's Emergency Shelter, ARK Men's Transitional Housing, Ruth House Women's Transitional Housing, Evergreen Emergency Shelter for women and children.\n\n\nThe Idaho Falls Rescue Mission provides essential services, and hope to homeless men at City of Refuge, and to homeless women, and women with children at the Evergreen Emergency Shelter . Our purpose is to provide emergency shelter, meals, clothing and essentials. Idaho Falls Rescue Mission also offers case management to all who choose to stay with us. This includes life directional counseling, and referrals for educational, employment, medical and disability needs.\n\nResidents at the City of Refuge and Evergreen Emergency Shelter have the opportunity to participate in one of four track programs. Christian Discipleship is available on request.\n\nTransient Track\nTransients are allowed to stay for one week. They are provided basic services and will have the opportunity to inquire about other tracks during the entrance interview with the Case Manager.\n\nFast Track\nThe Fast Track is designed for those who simply need a place to stay while they find a job and obtain a permanent residence. The timeline designated for this is generally six weeks, but this can change depending on their circumstances. Residents on this track will be expected to aggressively pursue employment, applying at a minimum of 24 locations each week. Each week the resident meets with the Case Manager to discuss the progress and problems with finding employment and housing. After the resident acquires employment, they will be required to complete a budget to live by after they move out.\n\nGold Track\nResidents who are serious about a change in their lives may be interested in the Gold Track. While involved with this track, the resident will evaluate their life, come to terms with their current direction, and take steps to turn it in a direction they would like it to go. In order to do this, the resident will complete a Goals Sheet in which they will make goals addressing topics such as addictions, education/career, employment, finances, mental health, relationships, etc. Following completion of the Goals Sheet the resident and the Case Manager will develop a plan to strive to accomplish these goals. Throughout his stay, the resident meets weekly to discuss progress and possible setbacks with the Case Manager. The Gold Track duration is roughly three months. During these three months the resident will be required to find employment and permanent housing.\n\nBlue Track\nThe Blue Track is for those coming out of prison/jail. This track is designed to help men or women who do not have the resources to find their own housing, or transition back into society. Those on this track are required to apply before they are released from incarceration. The Blue Track is similar to the Gold Track with a few additions. Upon arriving at the mission, the resident will live according to a very structured time schedule. Later, this schedule will be relaxed in order to help the resident successfully respond to the responsibilities, privileges, and disciplines needed to function in society.\n\nChristian Discipleship\nWe believe that people are spiritual beings created by God. Therefore, in order for people to become whole it is necessary to be set right with God and to follow Christ. Accordingly, residents participating in all tracks are encouraged, but not required, to participate in Christian discipleship. Discipleship involves, but is not limited to, participating in Bible discussions, setting a time of regular prayer and Bible reading, attending a local church, and meeting regularly with a Christian mentor. Residents who show a desire to change their lives are invited to enroll in our Discipleship Programs."
  },
  {
    "addressLine1": "P.O Box 51822",
    "city": "Idaho Falls",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83405",
    "name": "Promise Ridge Emergency Family Shelter",
    "organization": "Promise Ridge Emergency Family Shelter",
    "phone": "(208) 346-8320",
    "website": "https://promiseridge.com/",
    "description": ""
  },
  {
    "addressLine1": "3130 S Yellowstone Hwy",
    "city": "Idaho Falls",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83402",
    "name": "Ruth House (Women's Shelter) Run by Idaho Falls Rescue Mission",
    "organization": "Ruth House (Women's Shelter) Run by Idaho Falls Rescue Mission",
    "phone": "(208) 552-5575",
    "website": "https://ifrescuemission.org/ruth-house-womens-shelter/",
    "description": ""
  },
  {
    "addressLine1": "1904 Dakota Lane",
    "city": "Ammon",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83406",
    "name": "CLUB, Inc.- Drop-In Center",
    "organization": "CLUB, Inc.- Drop-In Center",
    "phone": "(208) 529-4673",
    "website": "https://clubinc.org/drop-in-center/",
    "description": ""
  },
  {
    "addressLine1": "300 Main St",
    "city": "Lewiston",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83501",
    "name": "YWCA of Lewiston",
    "organization": "YWCA of Lewiston",
    "phone": "(208) 743-1535",
    "website": "http://ywcaidaho.org/",
    "description": "The ywca of Lewiston, ID - Clarkston, WA serves victims of domestic violence, sexual assault, stalking, and other crimes as well as those in immediate crisis.\nWe are a non discriminating agency that provides services regardless of race, gender, color, national origin, gender idenity and orientation, creed, age, marital status, mental or physical disability or financial status. Our service area covers over 15,000 square miles with services in Nez Perce, Lewis, Idaho & Clearwater County in Idaho along with Asotin & Garield Counties in Washington."
  },
  {
    "addressLine1": "350 SE Fairmont Road",
    "city": "Pullman",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "99163",
    "name": "Community Action Center",
    "organization": "Community Action Center",
    "phone": "(509) 334-9147",
    "website": "https://www.cacwhitman.org/",
    "description": ""
  },
  {
    "addressLine1": "627 N Van Buren St",
    "city": "Moscow",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83843",
    "name": "Sojourners' Alliance",
    "organization": "Sojourners' Alliance",
    "phone": "(208) 883-3438",
    "website": "http://sojournersalliance.org/",
    "description": "Sojourners' Alliance operates a transitional housing facility for homeless men, women and families. Our program offers\nlong-term housing, supplemental food assistance, on-site case management, counseling services, and referrals to other area agencies in an effort to help our clients become self-sufficient and get back on their feet.\n\nHow to Apply\n1. Call the office at 208-883-3438 to speak with a\nstaff member for a pre-intake interview over the phone.\n2. Following this interview, staff may meet to discuss whether this program is appropriate for the potential client.\n\n3. If all requirements and criteria are met, an appointment will be made to come in for the intake with the case manager.\n4. At this point, policies will be reviewed with the client, all necessary paperwork will be signed, and the client will be ready to move in to the facility.\n\nIntake appointments are only scheduled on Tuesdays\nMissing a scheduled appointment results in the individual being ineligible for the program for 90 days;\ncall to cancel or reschedule if necessary"
  },
  {
    "addressLine1": "260 Mission Street",
    "city": "McCall",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83638",
    "name": "The Shepherd's Home",
    "organization": "The Shepherd's Home",
    "phone": "(208) 634-1152",
    "website": "http://shepherds-home.org/",
    "description": "Provide a safe and loving home to children who are victims of abuse, neglect or crisis.\nProvide additional programs for our residents to help them adopt healthy habits and be successful.\n\nWe seek to provide not only temporary shelter, but a new road map for life after residence in the home.\n\nHours\nTuesdays through Thursdays: 9am - 4pm\n\nThe Shepherd's Home nurtures children in need by providing a loving family home. We serve publicly or privately placed children of all ages. Our trained and compassionate team values each child, offers unconditional love, and encourages in each child a sense of self-worth. As a result, we play a part in breaking the cycle of abuse and neglect."
  },
  {
    "addressLine1": "585 NW 1st St.",
    "city": "Ontario",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "97914",
    "name": "Project DOVE",
    "organization": "Project DOVE",
    "phone": "(800) 889-2000",
    "website": "http://blog.projectdoveor.org/",
    "description": "This shelter is specifically for victims of domestic and/or sexual violence. Project DOVE offers safe refuge and support to victims of domestic and sexual violence."
  },
  {
    "addressLine1": "653 S. 4th Ave",
    "city": "Pocatello",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83201",
    "name": "Aid for Friends",
    "organization": "Aid for Friends",
    "phone": "(208) 232-5669",
    "website": "http://aidforfriendspocatello.com/",
    "description": "Day Resource Center & Emergency Shelter\n\nDay Resources\nShower, laundry, hot meal, and clean clothes\n\nDaily\n1:00 pm to 5:00 pm\n\nFood boxes\nFriday\n1:30 pm to 3:00 pm\n\nDay Office Hours\nMonday to Friday\n8:00 am to 11:00 am & 12:00 pm to 4:00 pm\n\nEmergency Shelter is open every day, 24 hours a day.\n\nAid For Friends is a private, non-profit organization that provides emergency shelter, transitional housing, and other supportive services to individuals and families facing homelessness"
  },
  {
    "addressLine1": "620 W. Fremont",
    "city": "Pocatello",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83206",
    "name": "Bannock Youth - Bannock House",
    "organization": "Bannock Youth - Bannock House",
    "phone": "(208) 234-1122",
    "website": "http://www.byfhome.com/bannock-house.html",
    "description": "Residential Treatment Program\nBannock House provides residential treatment for young people exclusively through a contract with the State of Idaho, Department of Health and Welfare, Children and Family Services, Region 6. Those eligible for services are males or females between the ages of 10 and 18 in the custody of the State of Idaho as determined by legal action. Placement is determined by the State of Idaho Regional Placement Authority.\n"
  },
  {
    "addressLine1": "641 N. 8th Ave",
    "city": "Pocatello",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83201",
    "name": "Freedom LZ Veterans Transitional Housing",
    "organization": "Freedom LZ Veterans Transitional Housing",
    "phone": "(208) 234-0966",
    "website": "http://www.seicaa.org/crisis-services/veteran-s-housing",
    "description": "SEICAA's Freedom LZ transitional facility is available to military veterans who for one reason or another are homeless. Crisis intervention and case management are provided to the veterans so they can make informed decisions regarding the services needed to enable them to secure employement and move to the community of their choice in permanent housing. Each participant in the Veteran Services Program completes an entrance and exit plan. The plan will state the goals they want to attain, and the resources they will need and use to reach their goals. All support services will be specific to each participant's needs, and will be provided by SEICAA programs, the Vet Center, Job Service and other community service providers.\nEach Veteran has a different set of circumstances that will determine how long they stay in the program. Their stay may be for only a few weeks to a year or more, depending on the number of services they need to complete their plan."
  },
  {
    "addressLine1": "PO Box 8517",
    "city": "Moscow",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83843",
    "name": "Alternative To Violence Of The Palouse",
    "organization": "Alternative To Violence Of The Palouse",
    "phone": "(877) 334-2887",
    "website": "http://atvp.org/",
    "description": "ATVP provides 24 hour emergency and supportive services to family and sexual violence victims and survivors and their children. Services are available for concerned, supportive family members, friends and community members.\nATVP services are free, confidential, and provided to clients without discrimination on the basis of race, color, religion, disability, pregnancy, national origin, sexual orientation, gender, age, ethnicity,income, veteran status, marital status, or any other basis prohibited by federal, state, or local law.\n\nATVP also has an outreach and education program that focuses on increasing understanding, awareness, and ultimately on preventing family and sexual violence.\n\nATVP provides services to all crime victims through the Region 8 Crime Victim Service Center for Whitman County."
  },
  {
    "addressLine1": "212 North 4th Ave. #160",
    "city": "Sandpoint",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83864",
    "name": "Bonner County Homeless Task Force",
    "organization": "Bonner County Homeless Task Force",
    "phone": "(208) 265-2952",
    "website": "http://www.bonnerhomelesstransitions.org/",
    "description": "Supportive Housing - Our Facilities\nWe currently have two residential sites in the Sandpoint area.\nOur Blue Haven complex in Sandpoint consists of two adjacent residences, one owned and one leased, consisting of nine units with the capacity to house up to 14 adults and 18 children, including single parents and families.\n\nThe Trestle Creek facility, just outside of Sandpoint in Hope, Idaho, provides 4 single family homes and a fifth residence with four units for single women known as The Holland House. Women in the Holland House each have their own bedroom and bathroom and share a comfortable, spacious common area and kitchen. All of our Trestle Creek homes were funded by grants through Idaho Housing and Finance Association and were built by the combined efforts of AmeriCorps and Young Community Builders. The five acre parcel of land was provided by donation for use as transitional housing.\n\nOur Programs\nOur housing programs include assisting individuals and families with case management, food, clothing, medical assistance, transportation, counseling and skills classes such as budgeting, employment, parenting and nutrition. We also provide resource and referral information with our collaborative partners within the community and throughout the region."
  },
  {
    "addressLine1": "1350 West Hanley",
    "city": "Coeur d Alene",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83814",
    "name": "Children's Village",
    "organization": "Children's Village",
    "phone": "(208) 667-1189",
    "website": "https://twitter.com/childrencda",
    "description": ""
  },
  {
    "addressLine1": "507 Addison Ave. West",
    "city": "Twin Falls",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83301",
    "name": "Valley House Homeless Shelter",
    "organization": "Valley House Homeless Shelter",
    "phone": "(208) 734-7736",
    "website": "https://valley-house.org/",
    "description": "Homeless Shelter for up to 6 months for single men, women, and families. ( 3 different shelters).\nAssists homeless persons, families, single men and women get on their feet.\nShelter Services:\nFood Boxes\nHygiene Bags\nShower facilities\nClothing Vouchers\nVarious classes\nBus tickets\nMotel stays when there is no shelter available\nThey accept donations during business hours.\n\n"
  },
  {
    "addressLine1": "594 Washington St. S.",
    "city": "Twin Falls",
    "state": "Idaho",
    "stateAbbreviation": "ID",
    "postal": "83301",
    "name": "Victory Home Shelter",
    "organization": "Victory Home Shelter",
    "phone": "(208) 733-2002",
    "website": "http://www.victoryhomeid.com/",
    "description": "Men's Shelter\nWomen's Shelter\nRecovery programMen's Recovery program\n\nA Program of the Victory Home Restoration Center. Check in time for overnight stay is 8:30 pm to 9:00 pm and check out time is 8:00 am. Can stay for a maximum of 7 nights at no charge. Not a medical facility and unable to accept men in need of constant medical attention. No sexual offenders accepted. At the end of 7 nights you can qualify for the Guest Stay program which includes meals, laundry service and showers."
  }
]