[
  {
    "addressLine1": "3600 State Highway N",
    "city": "Advance",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63730",
    "name": "The Amen Center",
    "organization": "The Amen Center",
    "phone": "(573) 794-2900",
    "website": "http://www.amencenter.org/",
    "description": "Transitional shelter for homeless adults, families, and families with children."
  },
  {
    "addressLine1": "820 Anderson Street",
    "city": "Sikeston",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63801",
    "name": "DAEOC Homeless Services",
    "organization": "DAEOC Homeless Services",
    "phone": "(573) 471-6014",
    "website": "https://www.daeoc.com/",
    "description": "Non profit organization that operates an emergency homeless shelter. Call for more information.Open 24 hours.\n"
  },
  {
    "addressLine1": "not disclosed",
    "city": "Cape Girardeau",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63701",
    "name": "Safe House For Women",
    "organization": "Safe House For Women",
    "phone": "(800) 341-1830",
    "website": "http://www.semosafehouse.org/",
    "description": "The Safe House for Women, Inc. is a 24-Hour emergency shelter for women and their dependents who are victims of domestic violence. Our shelter can accommodate 22 women and children at anytime. It is a communal living situation with a large living room, kitchen, laundry facilities, outside play area and 5 bedrooms. Our location is confidential and monitored by security cameras for safety reasons.\nAll services are FREE and CONFIDENTIAL\nWe provide residents with all of the items necessary to sustain everyday life while they reside in the shelter such as hygiene items, towels, bedding and some food.\n\nSafe House for Women 24-Hour Hotline: 573-651-1614 or 1-800-341-1830"
  },
  {
    "addressLine1": "PO Box 343",
    "city": "Blue Eye",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65611",
    "name": "Lori's House Maternity Home",
    "organization": "Lori's House Maternity Home",
    "phone": "(417) 779-9314",
    "website": "http://www.lorishouse.org/",
    "description": "We are a maternity home for pregnant women over the age of 18. We offer free housing, food, job training, parenting classes, GED/HiSET tutoring, life skills classes, and much more."
  },
  {
    "addressLine1": "600 E. Stephenson",
    "city": "Harrison",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "72601",
    "name": "House of Hope",
    "organization": "House of Hope",
    "phone": "(870) 704-8077",
    "website": "https://www.houseofhopeharrison.org/",
    "description": ""
  },
  {
    "addressLine1": "518 Grove Street",
    "city": "Bonne Terre",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63628",
    "name": "Shared Blessings Transitional Homeless Ministry",
    "organization": "Shared Blessings Transitional Homeless Ministry",
    "phone": "(573) 358-2998",
    "website": "mailto:sharedblessingsshelter@gmail.com",
    "description": ""
  },
  {
    "addressLine1": "10057 Jaguar Rd",
    "city": "Mineral Point",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63660",
    "name": "New Life Evangelistic Center Homeless Shelter Potosi",
    "organization": "New Life Evangelistic Center Homeless Shelter Potosi",
    "phone": "(573) 438-8201",
    "website": "https://www.facebook.com/NewLifeEvangelisticCenter?ref=stream",
    "description": "Services provided: Food Pantry, Free Store, Homeless Shelter for men, women, children.\n\nFaith Based."
  },
  {
    "addressLine1": "1224 Rural Street",
    "city": "Boonville",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65233",
    "name": "Harvest House Inc",
    "organization": "Harvest House Inc",
    "phone": "(660) 537-4278",
    "website": "http://www.harvesthouseshelter.org/",
    "description": "Homeless shelter with mission \"to feed, shelter and educate people for success\".\nHarvest House Programs\nThe programs available to clients of the Harvest House include the following:\n1. 3 Day Temporary Emergency Shelter - If you are homeless and need a warm and clean place to stay, Harvest House is available for you and your children. We are here to help \"pick up the pieces\" in your situation. After this 3-day period, you will be asked to enroll in one of our other programs or leave.\n\n2. 30 Day Emergency Shelter Work Program - Residents enrolled in this program are required to complete job applications and make application for public assistance. We have Internet-connected computers to assist in making on-line applications and offer employment counseling on an as-needed basis.\n3. 120 Day Transition Shelter Program - Residents enrolled in this program must have a job or have another source of income such as social security or disability. Each person enrolled in this program must participate in our Savings Program, where 65% of their wages are given to the Harvest House for safe keeping. At the end of the 120 days, 80% of these savings will be returned to the resident to be used for a deposit toward a rental apartment or house, or a down payment toward the purchase of a home. The remaining portion will be donated to Harvest House to help pay for the utilities used while clients have been participating in the Program. The Boonslick Heartland YMCA generously offers free access to its facilities to those clients who are enrolled in this program.\nWe do not discriminate anyone with regard to handicap, color, age, gender, race, religion, sexual preference or national origin."
  },
  {
    "addressLine1": "109 West Forest Avenue",
    "city": "Columbia",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65203",
    "name": "Presbyterian Children's Transitional Housing for Boys and Girls",
    "organization": "Presbyterian Children's Transitional Housing for Boys and Girls",
    "phone": "(573) 442-9916",
    "website": "https://www.pchas.org/where-we-work/missouri",
    "description": "Presbyterian Children's Homes and Services (PCHAS) assists young adults with their transition from living in foster care to living on their own. Please note that individuals must fill out an application and go through an interview and assessment.\n\n\nPCHAS' offers the following programs:\nTransitional Living - This is along-term residential program, which has the goal of empowering individuals to achieve goals and reach self-sufficiency. Individuals will receive: counseling, educational resources, employment guidance, financial education, health and self-care awareness, job skills training, life skills training, mentoring, personal and professional goal development, residential housing.Level 3 Residential - Has 24-hour supervision and uses a transitional living curriculum to assist struggling youth grown and accomplish their goals. Individuals will receive residential housing, counseling, educational resources, mentoring in some locations, case management and coordination of therapeutic services, employment counseling and job-skills training, money management and life-skills training, health and self-care awareness, and assistance with obtaining social services\n\n\nPCHAS Additional Locations:\n\nAshley House (females only) - located in Springfield, MO (417-862-9634)\nHarris House (males only) - located in Farmington, MO\n\n\nFor additional information please contact the Toll Free number800-888-1904.\n\n\n\n\n"
  },
  {
    "addressLine1": "901 Wilkes Blvd",
    "city": "Columbia",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65201",
    "name": "Columbia MO Men Only Shelter",
    "organization": "Columbia MO Men Only Shelter",
    "phone": "(573) 875-0603",
    "website": "http://www.newlifeevangelisticcenter.org/shelters/",
    "description": "Faith based emergency shelter for men provided by the New Life Evangelistic Center.\n\nOpen: 6:30PM - 6:30AM The New Life Evangelistic Center provides up to 14 days of emergency shelter for men in need."
  },
  {
    "addressLine1": "1206 Rangeline",
    "city": "Columbia",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65201",
    "name": "Welcome Home Inc.- Serving Homeless Veterans",
    "organization": "Welcome Home Inc.- Serving Homeless Veterans",
    "phone": "(573) 443-8001",
    "website": "http://www.welcomehomelessveterans.org/",
    "description": "Food and counseling for veterans.We provide emergency food, shelter, transportation, and clothing to all Veterans of the United States of America who reside in the Mid-Missouri area.\n\nWe provide emergency food, shelter, transportation, and clothing to all Veterans of the United States of America who reside in the Mid-Missouri area.\n\nIf you or someone you know are homeless or in danger of becoming homeless, please contact our office to schedule an interview.\nWe are excited to announce that Welcome Home, Inc. was awarded the full amount of our VA Supportive Services for Veteran Families Program request! With this program we will be able to provide assistance to qualified Veterans in obtaining and maintaining permanent housing in our area.\n\nSupportive Housing\nThe Supportive Services for Veteran Families (SSVF) program is designed to assist Veterans and their families who are literally homeless, or are imminently in danger of becoming homeless, in obtaining and maintaining stable housing. Welcome Home, Inc. was awarded the grant from the United States Department of Veteran Affairs to serve Veterans throughout Mid-Missouri. The program was developed in response to a redirection of focus toward the homeless Veteran population that includes homeless prevention, rapid re-housing, and Housing First Models to combat the disproportionate number of Veterans experiencing homelessness. Assistance to Veterans will be delivered through a variety of services to address current gaps in continuum of care for this group of individuals.\nWho is Eligible for SSVF?\nIn order to be eligible for the SSVF program you must meet the following criteria:\n    Veteran and Veteran Family status a single Veteran, or a family in which the head of household or the spouse of the head of household is a Veteran.\n\n    Low income that does not exceed 50% of your areas median income.\n    Occupying Permanent Housing you are either already in permanent housing and are trying to avoid eviction OR you are homeless but are scheduled to move into permanent housing within 90 days.\nWelcome Homes SSVF Program provides services to the following counties:\nAudrain, Boone, Callaway, Cooper, Cole, Gasconade, Howard, Macon, Moniteau, Monroe, Montgomery, Osage, and Randolph."
  },
  {
    "addressLine1": "602 North Ann Street",
    "city": "Columbia",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65201",
    "name": "Salvation Army Harbor House Shelter",
    "organization": "Salvation Army Harbor House Shelter",
    "phone": "(573) 442-1984",
    "website": "https://www.rocktheredkettlecomo.org/provide-shelter",
    "description": "Provides emergency and transitional housing.\nOpen 24 hours a day, every day even on holidays\nA free community lunch is offered every day between 12 p.m. and 1 p.m. to those in the community who are not residents\n\nComplete list of services:\nHousing/Residence Services - Emergency Shelter\nAdult Program Services - Food & Nutrition\nHousing/Residence Services - Transitional Housing\nHarbor House is the largest shelter in Boone County. Harbor House is the only shelter in Boone County that helps parents and children of all ages stay together, and the only shelter in Boone County that has single men's and women's beds.\n\nFor those facing extreme heat (hot cots), unbearable cold (cold cots) weather Harbor House is a welcome respite featuring a safe place to eat and sleep at no cost.\n\n\nHarbor House offers a 90 day program and offers three meals a day, shelter, showers and laundry as well as case management that provides educational support, counseling services, and vocational direction, Harbor House programs help residents cultivate vital life skills through life skills classes for a successful and stable position in society.\n"
  },
  {
    "addressLine1": "1611 Towne Drive",
    "city": "Columbia",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65203",
    "name": "Rainbow House - Children's Emergency Shelter",
    "organization": "Rainbow House - Children's Emergency Shelter",
    "phone": "(573) 474-6600",
    "website": "http://www.rainbowhousecolumbia.org/",
    "description": "Rainbow House is a children's emergency shelter and regional child advocacy center. Children from birth to 18 years of age that are going through a family crisis or have been/are experiencing neglect or abuse in their home or can stay at the Rainbow House. Children may be admitted by the Children's Division if they were removed from their houses and placed in foster care or they may be admitted through the Crisis Care program, which is more of a preventive service that can potentially prevent abuse or neglect to the children.\nThe main goal of the shelter is to reduce emotional trauma in children that have been neglected, abused or affected by a family crisis whilst providing a safe and loving space.\n\n\nChildren Emergency Shelter:\nProvides temporarily housing to children that are in foster care.Assists parents that request placement for their children during a family crisis.\n\nRegional Child Advocacy Center (CAC):\nProvides forensic interviewing, advocacy and therapy for children that have been sexually abused and/or severely physically abused.\n\nAdditional Services:\n\nClinical Programs - Combines therapy services with outreach programs with the goal of ending child maltreatment and focusing in their healing.\nTherapy Services - Therapy is focused on abuse and trauma. Play therapy and other approaches might be used to assist children and their families. Also, assists families in connecting with qualified therapists for long term counselling needs. For additional information, please contactThe Child Advocacy Center at 573.474.6600 extension 2123.\n\nRainbow House Support Groups - Family Advocate Program that assists the child and non-offending caregiver who have been through child abuse and neglect by focusing on supporting the family, their needs, and provide assistance in connecting them with adequate community resources. Along with other agencies, the goal is to ensure that the children get the best services available so that the family can move forward.\n\n\nFor additional information or question, please contact the office.\n"
  },
  {
    "addressLine1": "68 Holden Drive",
    "city": "Camdenton",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65020",
    "name": "Lake Area Helping Hands Homeless Shelter",
    "organization": "Lake Area Helping Hands Homeless Shelter",
    "phone": "(573) 346-4968",
    "website": "http://www.helpinghandsvillage.com/",
    "description": "Emergency Shelter\nOffice Hours: Mondays through Saturdays 9am - 5pm.\n\nLake Area Helping Hands Homeless Shelter provides temporary and emergency shelter and transitional housing for homeless men, women, children and families in Camden County.  We provide a safe environment for residents to live in while seeking employment, saving money and receiving the counseling needed to become independent.  We provide referrals to local agencies, arrange for transportation to and from work and medical appointments, some meals and/or a portion of meals, personal care products and clothing.  Our Shelter is here to provide assistance to those in need by giving them a hand up, not a hand out.\n"
  },
  {
    "addressLine1": "1809 Historic 66 W",
    "city": "Waynesville",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65583",
    "name": "Good Samaritan Resource Center",
    "organization": "Good Samaritan Resource Center",
    "phone": "(573) 774-5113",
    "website": "http://www.goodsam-genesis.org/",
    "description": "Good Samaritan Resource Center of Pulaski County Inc. is a non-profit 501(c)3 organization. It operates thrift stores, food pantries, and a domestic vionlence shelter.\n\nEMERGENCY FOOD\nFamilies must be residents of Pulaski County in order to receive a food basket from our pantry. The following items are required:\nProof of residency\nSocial security cards for every one in the household\nA Picture I.D.\nWaynesville - Monday, Wednesday-Friday 9-5\n\nGenesis Women's Domestic Violence Shelter\nAt Genesis, we not only shelter survivors, but we also equip them to begin new lives free from further victimization. Our services are designed to address all of the complicating factors that keep battered women trapped in abusive relationships. The director, shelter manager, shelter relief advocates, and volunteers work to make positive changes in their lives."
  },
  {
    "addressLine1": "100 S Main St",
    "city": "Carthage",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64836",
    "name": "Carthage Crisis Center",
    "organization": "Carthage Crisis Center",
    "phone": "(417) 358-3533",
    "website": "https://carthagecrisiscenter.org/",
    "description": "Faith Based Homeless Center\n\nFor immediate needs and assistance, please call (417) 358-3533.\n\nIntake hours are usually 9 AM - 5 PM.\n\nThe Carthage Crisis Center is not your ordinary homeless mission. Although we provide temporary emergency housing, we have a more long-term approach to the problem of homelessness. Our mission is to restore homeless and needy people to self-sufficiency with Gods help.\nTo that end, all of our residents are involved in opportunities for Spiritual growth. We all share in a weekly Saturday evening Bible Study at the center. On Sundays, all of our residents attend local congregations where they find friendly Biblical communities that help to build them up spiritually, and on Monday evenings, all of our residents attend a local Celebrate Recovery meeting at the First Nazarene Church.\n\nThroughout each week our residents have opportunities to counsel with the staff to learn life skills and how to apply Biblical principles to their daily lives."
  },
  {
    "addressLine1": "531 Kentucky Ave",
    "city": "Joplin",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64801",
    "name": "Watered Gardens Gospel Rescue Mission",
    "organization": "Watered Gardens Gospel Rescue Mission",
    "phone": "(417) 623-6030",
    "website": "https://wateredgardens.org/",
    "description": "Day Outreach\n\nHours: 9 AM to 2 PM, Mondays, Tuesdays, Thursdays, and Fridays\n\nThrift store with clothing, furniture, and household items\nFood pantry\n"
  },
  {
    "addressLine1": "817 South Main Street",
    "city": "Joplin",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64802",
    "name": "Souls Harbor",
    "organization": "Souls Harbor",
    "phone": "417-623-7927",
    "website": "https://soulsharborjoplinblog.wordpress.com/",
    "description": "Souls Harbor is a Christ centered multifaceted human services agency and homeless shelter"
  },
  {
    "addressLine1": "1809 South Connor Ave",
    "city": "Joplin",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64804",
    "name": "Lafayette House",
    "organization": "Lafayette House",
    "phone": "(417) 782-1772",
    "website": "http://lafayettehouse.org/",
    "description": "Lafayette House emergency shelter is available 24 hours a day for women and children who need a safe place to stay to escapeLafayette House Logo Joplin MO domestic violence. If you are being abused or beaten by your husband or partner, call Lafayette House any time day or night. If you are in immediate danger, call 911.\n\nLafayette House provides services to domestic violence victims on a residential or outpatient basis.  In addition to safe shelter, we offer individual, group and family counseling, community support, child care, childrens therapy, and a full menu of support services.  The caring staff at Lafayette House can help you access clothing and basic needs, as well as jobs, transportation and a safe place to live.\nLafayette House serves families in a 7-county area in southwest Missouri (Jasper, Newton, Barry, Lawrence, McDonald, Dade and Barton). We offer residential shelter and services at our Joplin location, and an outreach office in Neosho.\nThere is no charge for shelter and support please call if you need help.\nPlease contact us via email here, or call for immediate help at (800) 416-1772."
  },
  {
    "addressLine1": "913 Webster St",
    "city": "Chillicothe",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64601",
    "name": "Community Resource Center",
    "organization": "Community Resource Center",
    "phone": "660-646-1667",
    "website": "https://communityresourcecenterblog.wordpress.com/",
    "description": "Office Hours: 9 A.M to 5 P.M\nMonday -Friday\n24 hour shelter\n\nThe Community Resource Center is an EMERGENCY OVERNIGHT CENTER for men, women and families that are experiencing homelessness.\n\n\nThe services offered by the CRC are dedicated to helping the homeless\nObtain emergency shelter\nObtain benefits from federal and state programs like the VA, SNAP, and Social Security\nApply for and obtain employment\nOther services available to the community\nAssistance with complicated paperwork to obtain benefits, assistance, medical coverage, citizenship, etc.\nTax preparation and tax credit paperwork for poor and elderly\nClothing and household goods for needy\nDesignated emergency shelter for the American Red Cross\nSource of information about services available at other agencies and who to contact\nPartners with the Community Garden\nPartners with the Livingston County Humane Society\nCRC Academy\nBenefits of the services offered as delivered from the CRC include\n\nCrime reduction in the area because of the voucher/check-in system through the police department\nSafe shelter for shelter occupants though drug and alcohol testing of anyone staying in the shelter, 24/7 surveillance, and the resident manager on premises.\nGainful employment of those previously unemployed improves the local economy as does obtaining benefits which lead to improving the income of these individuals and families\nThe longer the CRC has been in Chillicothe, the fewer transients Chillicothe has seen because the community sends them to the CRC, not hotels\nCRC is saving the county money by taking probation/parolees instead of the county sending them to Pattensberg DeKalb/Daviess County facility\nThe CRC helps connect individuals with health providers\nResource for community service such as the Community Garden, Churches, Livington County Humane Society\nResources, such as clothing , offered to the CRC are shared with other agencies in the community\nRed Cross volunteers are able to use the CRC as emergency shelter to families and individuals when they lose their residences"
  },
  {
    "addressLine1": "1506 Oklahoma Avenue",
    "city": "Trenton",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64683",
    "name": "Green Hills Community Action Agency",
    "organization": "Green Hills Community Action Agency",
    "phone": "(660) 359-3907",
    "website": "http://www.ghcaa.org/",
    "description": "Green Hills Community Action Agency main focus is to assist low-income individuals so that they can become self-reliant.\nFor additional information, please contact the main office toll free number (855) 290-8544.\n"
  },
  {
    "addressLine1": "PO Box 1367",
    "city": "Columbia",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65205",
    "name": "The True North Emergency Shelter",
    "organization": "The True North Emergency Shelter",
    "phone": "(800) 548-2480",
    "website": "http://truenorthofcolumbia.org/",
    "description": "Provides emergency and transitional shelter for victims of domestic and sexual violence. Also, offers counseling, advocacy and case management services to residents.\n\nTrue North emergency shelter provides a safe place for victims of domestic and sexual violence fleeing from their abuser. Our statewide hotline is available toll-free and provides referral information, emotional support and safety planning twenty-four hours a day, three hundred and sixty five days a year."
  },
  {
    "addressLine1": "831 Jefferson",
    "city": "Fulton",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65251",
    "name": "Wiley House Emergency Shelter for Men and Women",
    "organization": "Wiley House Emergency Shelter for Men and Women",
    "phone": "(573) 642-6065",
    "website": "https://ourhousecallaway.org/",
    "description": "Emergency shelter for adult men and women. Along with nightly shelter, Our House provided guests with food, laundry service, transportation, toiletry items, and assistance with acquiring identity documents (birth certificates and photo IDs).\n\nHours:\nOpen Nightly\n\nNovember - March:\nMon-Sun - 6:00pm to 8:00am\n\nApril - October:\nMon-Sun - 8:00pm to 8:00am"
  },
  {
    "addressLine1": "907 Jefferson Street",
    "city": "Jefferson City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65101",
    "name": "Salvation Army Jefferson City, MO Center of Hope Family Shelter",
    "organization": "Salvation Army Jefferson City, MO Center of Hope Family Shelter",
    "phone": "(573) 635-1975",
    "website": "http://www.usc.salvationarmy.org/",
    "description": "Homeless Shelter and lunch, dinner food bank.\n\nCenter of Hope is a 40-bed shelter for homeless men, women and families with children. In fact, it is the only shelter in our area where parents and their children, along with single men and women can live and work to overcome their homelessness.  We are proud to be a United Way of Central Missouri agency.\nCenter of Hope provide residents:\n    3 meals daily\n    Safe environment\n    Bed and linens\n    Shower and laundry facilities\n    Toiletries\n    Clothing\n    Individualized case management\n    Referral services\n    Transportation (limited)\n    Life skill classes\n    Caring, professional staff\n    Spiritual counseling upon request"
  },
  {
    "addressLine1": "200 North Oakland Street",
    "city": "Harrisonville",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64701",
    "name": "Hope Haven of Cass County - Domestic Abuse Shelter",
    "organization": "Hope Haven of Cass County - Domestic Abuse Shelter",
    "phone": "(816) 380-2833",
    "website": "https://www.hopehavenofcasscounty.org/",
    "description": "Emergency domestic violence only.Hope Haven provides services to survivors of domestic and sexual violence.\n24 hour crisis line 816-380-4663\nSafe shelter\nCounseling\nHospital Advocacy\n\nFor more information, call our admin line at 816-380-2833.\n\nMission: Each person, every man, woman, and child, has the right to live and grow within an environment free from physical, emotional, and sexual abuse, free from fear and unnecessary anxiety and free from isolation. All persons have the right to be treated with dignity and respect, to have all their feelings and thoughts taken seriously, and above all, to be acknowledged as persons of value and worth\n\n\nHope Haven is a 26-bed, safe sanctuary providing temporary shelter where women and children of all ages are welcomed, supported, provided respite and a time to heal.  We have been providing services and shelter to victims of domestic and sexual violence since 1995."
  },
  {
    "addressLine1": "6046 Swope Pkwy",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64130",
    "name": "AngelEyes Maternity Home",
    "organization": "AngelEyes Maternity Home",
    "phone": "(816) 368-4994",
    "website": "http://www.angeleyeskc.org/",
    "description": "AngelEyes Maternity Home is a nonprofit organization located in Kansas City, Missouri that provide shelter, resources and training to pregnant young girls between the age of 13 and 21 with no other children in their care.\n\nMission:The mission of AngelEyes Maternity Home is to give pregnant teens a safe place to live during their pregnancy while providing them with the resources, education and job training needed to prepare for motherhood, successful independent living, eliminate future unplanned pregnancies and homelessness."
  },
  {
    "addressLine1": "425 E 63rd ST",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64110",
    "name": "Jewish Family Services",
    "organization": "Jewish Family Services",
    "phone": "(913) 327-8250",
    "website": "http://www.jfskc.org/",
    "description": "JFS Food Pantry is a client choice pantry. Please call to make an appointment to visit with one of our case managers"
  },
  {
    "addressLine1": "3721 Delridge",
    "city": "Independence",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64055",
    "name": "Mother's Refuge",
    "organization": "Mother's Refuge",
    "phone": "(816) 353-8070",
    "website": "https://www.mothersrefuge.org/",
    "description": "Office Hours:\nMonday-Friday 9am-5pm\n\nOur mission is to shelter and educate homeless, pregnant, and parenting young women by providing comprehensive services that empower them to make successful life decisions for themselves and their babies.\n\nWe are located at:\n3721 Delridge, Independence, MO 64052\n(One block north of Highway 40 and Hardy St.)\nOur home is filled with love, warmth and acceptance to all the young ladies that call Mothers Refuge home.\nMore than 1,550 pregnant young women have found refuge at our home since 1987. With a sun deck, shade trees and swings, our residents have plenty of reasons to enjoy the warm summer sun. During the cold winter months, they may enjoy hot cocoa and popcorn while playing board games, cards or watching movies in the great room.\n\nThe home has seven bedrooms, a beautiful kitchen, a dining room and television room for residents and their babies. Girls also have access to a computer-learning center to learn computer skills, complete homework assignments or research community services. Washers and dryers make laundry convenient. Residents can walk to nearby restaurants, Gates BBQ, QT, Subway, Cool Crest Miniature Golf and a nearby bus stop.\nWe are located on a spacious corner lot in Independence, Missouri, not far from the Truman Sports Complex and down the road from Blue Ridge Corners and Wal-Mart.\nPregnant residents share a bedroom while waiting to give birth. After their baby is born, they share a private bedroom with their baby."
  },
  {
    "addressLine1": "420 E. Santa Fe",
    "city": "Olathe",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "66061",
    "name": "Salvation Army - Johnson County Family Lodge",
    "organization": "Salvation Army - Johnson County Family Lodge",
    "phone": "(913) 829-0578",
    "website": "https://centralusa.salvationarmy.org/olathe/",
    "description": "Johnson County Family Lodge provides shelter to families in the Johnson County area that are homeless. Families must have at least one dependent under the age of 18 that is currently in school to be eligible for the program; can stay at the shelter for 3-6 months.\n\nOffice hours:\nMondays through Fridays 9am - 4pm."
  },
  {
    "addressLine1": "9400 Pflumm",
    "city": "Lenexa",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "66215",
    "name": "Project 10 20 Cold Weather Shelter",
    "organization": "Project 10 20 Cold Weather Shelter",
    "phone": "(913) 219-3347",
    "website": "https://www.project1020.com/",
    "description": ""
  },
  {
    "addressLine1": "14700 E Truman Rd",
    "city": "Independence",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64050",
    "name": "The Salvation Army Crossroads Family Emergency Shelter",
    "organization": "The Salvation Army Crossroads Family Emergency Shelter",
    "phone": "(816) 252-3200",
    "website": "http://salarmymokan.org/locations/independence-mo/",
    "description": ""
  },
  {
    "addressLine1": "3220 E 23rd St",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64127",
    "name": "Benilde Hall",
    "organization": "Benilde Hall",
    "phone": "(816) 842-5836",
    "website": "http://www.benildehall.org/",
    "description": "Open 24/7, office staff on site 8-5pm M-F.Benilde Hall provides transitional housing and substance abuse treatment to indigent homeless men, and also runs Matt Talbot, a 12 unit permanent housing apartment building for men who successfully completed the Benilde Hall program.\n\nServices include mental health treatment, substance abuse treatment, jobs program, health education, food, clothing, case management, and an opportunity to reconnect to the community."
  },
  {
    "addressLine1": "2611 E. 11th Street",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64127",
    "name": "Kansas City Rescue Mission Women’s Ministries",
    "organization": "Kansas City Rescue Mission Women’s Ministries",
    "phone": "(816) 348-3287",
    "website": "https://kcrm.org/",
    "description": "The 20-bed KCRM Womens Center provides a safe, homelike environment where traumatized women can find hope, peace and security as they work to overcome life-challenging barriers to stability and success.\n\nMost of the Womens Centers residents were sexually abused as children and have coped with their pain through drugs, alcohol, gambling, hoarding and other addictions. Many have spent time behind bars, prostituted for money, food or shelter, and have suffered continued physical and sexual abuse as adults.\n\n\nThe KCRM Womens Center provides each resident with a long-term recovery and case management program designed just for her. After an intake assessment, she is paired with a case manager and certified counselor to determine a course of objectives that guide her toward freedom from the past and hope for the future.\n\nClinical case managers and counselors at the KCRM Womens Center work with each client to achieve these outcomes:\n    Ongoing addiction recovery with support\n    A sustainable mental health treatment plan\n    A reliable stream of income\n    A productive lifestyle through volunteerism or a paying job\n    A support network that includes a doctor or clinic\n    Appropriate housing"
  },
  {
    "addressLine1": "1520 Cherry Street",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64108",
    "name": "Kansas City Rescue Mission Men's Mission - KCRM",
    "organization": "Kansas City Rescue Mission Men's Mission - KCRM",
    "phone": "(816) 421-7643",
    "website": "https://kcrm.org/",
    "description": "Kansas City Rescue Mission offers its services at no charge (with very rare exceptions) to homeless individuals. Its services and programs are available to any individual, 18 or older, regardless of race, religion, gender, lifestyle or creed."
  },
  {
    "addressLine1": "1100 E. 11th St.",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64106",
    "name": "City Union Mission",
    "organization": "City Union Mission",
    "phone": "(816) 474-9380",
    "website": "http://www.cityunionmission.org/",
    "description": "Hotline for the Homeless: 816-474-4599\n\nMen, women and families who call the Hotline are directed to actual shelter housing when available space is known. The no-charge Hotline provides the Mission and the community with statistical information regarding the availability or lack of availability of emergency shelter space in the greater Kansas City area.\n\nMen's Mission\nEach day, hundreds of men come to City Union Mission Men's Center for clothing, food and temporary refuge from life on the streets.\nHere they find people who care about them, listen to them, and work with them to meet their physical and spiritual needs.\n\nWomen's Mission\nThe Women and Family Center at City Union Mission is a safe haven for families and single women. There are many causes of homelessness in families, including financial setbacks, addiction, family violence, and mental illness. The Women and Family Center provides a safe place to stay, nutritious meals, spiritual counsel, and case management to address and help resolve the issues they face every day."
  },
  {
    "addressLine1": "750 Paseo Blvd",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64106",
    "name": "Kansas City Community Kitchen",
    "organization": "Kansas City Community Kitchen",
    "phone": "(816) 561-8920",
    "website": "https://nourishkc.org/programs/community-kitchen/",
    "description": "We serve balanced, nutritious meals for lunch every weekday from 11 a.m. - 2 p.m. and ALL are welcome to eat.\n\nWe call ourselves a \"Community Kitchen\" rather than a soup kitchen because we believe food is the basic human right and great equalizer - everyone needs to eat, and we all do better when we eat better. We encourage anyone to come eat with us, get a quality meal for free and see who you meet in the process. Volunteers serve as hosts and wait staff to make this a restaurant style experience, offering all of our guests a bit of dignity and the power of choice.\n\n\nKansas City Community Kitchen has been serving the hungry of downtown Kansas City since 1989. We began as a ministry of Grace & Holy Trinity Cathedral (Episcopal Church) but grew and came under the leadership of Episcopal Community Services while still housed at the cathedral. In 2010 the kitchen moved to its current home in the lower level of the Downtown Community Services Center at 8th/Paseo."
  },
  {
    "addressLine1": "705 Virginia Ave",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64106",
    "name": "Hope Faith - Homeless Assistance Campus",
    "organization": "Hope Faith - Homeless Assistance Campus",
    "phone": "(816) 471-4673",
    "website": "https://www.hopefaith.org/",
    "description": ""
  },
  {
    "addressLine1": "918 E 9th Street",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64106",
    "name": "reStart Inc.",
    "organization": "reStart Inc.",
    "phone": "(816) 472-5664",
    "website": "http://www.restartinc.org/",
    "description": "Emergency Shelter Nights Only.\n\nOffering a full range of services for Kansas City's homeless men, women, youth, and families, reStart provides everything from emergency overnight shelter to transitional living and permanent housing. Equipped to handle all persons, including those with special needs, reStart offers the tools, assistance, and support to help our clients make the transition to permanent housing.\n\nreStart's Housing Solutions Center (HSC) is at the forefront of a new approach to working with the homeless in our community. Providing street outreach, a drop in center, and hotline to rapidly finding new housing for individuals who have recently lost their homes.\n\nProviding case management and supportive services to disabled and chronically homeless individuals and families, the HSC is a permanent supportive housing program that provides 20 units for families and individuals.\n\n    Youth Services\n    Family Services\n    Single Adult Services\n    Permanent Housing\n    Outreach\n\n\nRESTART, Inc.\n918 East 9th Street\nKansas City, MO 64106-3072\n816.472.5664\nFax: 816.472.6127\n\nYOUTH SERVICES\n816.472.5664 ext. 238\nHotline: 816.309.9048\n \nOVERNIGHT EMERGENCY SHELTER (OES) & Front Desk Monitor\n816.472.5664\n \nHOUSING SOLUTIONS CENTER (HSC)\n1444 East 8th Street\nKansas City, MO 64106\n816.842.1199\nFax: 816.842.6811"
  },
  {
    "addressLine1": "207 Ming Street",
    "city": "Warrensburg",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64093",
    "name": "Refuge on Ming",
    "organization": "Refuge on Ming",
    "phone": "(660) 624-1062",
    "website": "https://www.houseonahillfoundation.org/",
    "description": ""
  },
  {
    "addressLine1": "1130 Troup Avenue",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "66104",
    "name": "Mt. Carmel Community Outreach Ministries",
    "organization": "Mt. Carmel Community Outreach Ministries",
    "phone": "(913) 621-4111",
    "website": "http://www.mtcarmelrc.org/",
    "description": ""
  },
  {
    "addressLine1": "1418 Garfield Ave",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "66102",
    "name": "Della Gill - Joyce H. Williams Center",
    "organization": "Della Gill - Joyce H. Williams Center",
    "phone": "(913) 321-0951",
    "website": "http://www.friendsofyates.org/",
    "description": "Emergency Shelter Domestic Violence Victims Only\nThe Della Gill/Joyce H. Williams Center is dedicated to providing a safe, warm and caring environment to victims of domestic violence.  Our supportive services promote and empower domestic violence victims in establishing 'violence free' lives. \n\nOffice Phone: 913-321-1566\nAdministrative Hours: Monday-Friday 8:30am-5:00pm."
  },
  {
    "addressLine1": "2601 Ridge Ave",
    "city": "Kansas City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "66104",
    "name": "Shalom House",
    "organization": "Shalom House",
    "phone": "(913) 321-2206",
    "website": "https://catholiccharitiesks.org/where-we-work/shalom-house/",
    "description": "Services 24 men of all faiths in need of shelter, food and companionship daily.\n\nServices are provided at no charge and include a safe place to sleep, eat dinner and breakfast, shower (toiletries and other necessities provided), do laundry and get clothing. In addition, men get employment assistance as well as referrals for medical care. Most of all, the men have the support of people who genuinely care about their life and future. They find the resources and the encouragement that they need to help them develop a plan to successfully transition to permanent housing.\n\nWe provide a place to sleep, a breakfast and dinner, clothes, showers, and referrals for medical and employment assistance. Each evening the community gathers in prayer to reflect and pray for the needs of the men they served and for those who touched their lives. In all that we do, we strive to practice the discipline of hospitality, whoever the guest.\nWe invite those who are able to work as a member of the live-in staff. Please call for more information on this commitment. Students and recent graduates are encouraged to live and learn with us."
  },
  {
    "addressLine1": "108 W. Washington St.",
    "city": "Kearney",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64060",
    "name": "Kearney Food Pantry",
    "organization": "Kearney Food Pantry",
    "phone": "(816) 903-4763",
    "website": "https://www.kearneyfoodpantry.com/",
    "description": "We are open Tuesday's 2:00 to 4:00 and Thursday's 3:00 to 6:00pm."
  },
  {
    "addressLine1": "215 N. High St.",
    "city": "Kirksville",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63501",
    "name": "AM Housing, Inc.",
    "organization": "AM Housing, Inc.",
    "phone": "(816) 372-4559",
    "website": "http://www.amhousing.org/",
    "description": "Homeless/Transitional Housing\nAM Housings overarching mission is: \"To provide shelter, awaken hope, honor, and dignity in every person who seeks comfort, support, or assistance through our programs in the NE MO area.\" We plan to achieve this mission by focusing on two areas of need: a) in the immediate term, we will help housing insecure individuals who have a limited, but stable income; b) in the longer term, it is our goal to help housing and income insecure individuals who are seeking a path to housing and job security."
  },
  {
    "addressLine1": "6809 West Florissant Ave.",
    "city": "Saint Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63136",
    "name": "Project Downtown Saint Louis",
    "organization": "Project Downtown Saint Louis",
    "phone": "(314) 556-0938",
    "website": "http://www.pdstl.org/",
    "description": "Our mission is to provide essential services for homeless and impoverished segments of the St. Louis community. Furthermore, the organization strives to uphold the principles and spirit of Islam in our endeavors. We believe we can promote a positive image of Islam through such social work and adherence to Islamic ideals."
  },
  {
    "addressLine1": "1000 N 19th Street",
    "city": "Saint Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63106",
    "name": "Gateway 180 Homeless Services",
    "organization": "Gateway 180 Homeless Services",
    "phone": "(314) 231-1515",
    "website": "https://gateway180.org/",
    "description": "Gateway180 :: Homelessness Reversed is a valuable resource for women, children and families experiencing the unimaginable burden of homelessness. We provide safe, nurturing emergency shelter and supportive housing services designed to empower adults and families to become independent and permanently housed.\n\nGateway180 :: Homelessness Reversed operates its 171-bed emergency shelter in a 90-year-old building. With the community's continued support, we will improve our building and improve the quality of support and care we provide for women, children, and families experiencing homelessness. Here are some of our most exciting renovations:\n\nInstallation of a new roof and guttering (through a grant from Roofers Local 2 Industry Advancement Fund and Kirberg Company)\nWeatherization, including boiler replacement, new water heater, new air-conditioning/heating unit for cafeteria, new appliances, new fire doors, roof insulation, and infiltration work throughout the building (through Department of Natural Resources and the Urban League of Metro St. Louis)\n\n"
  },
  {
    "addressLine1": "2300 Lafayette Ave",
    "city": "Saint Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63104",
    "name": "HomeFirst STL, Inc.",
    "organization": "HomeFirst STL, Inc.",
    "phone": "(314) 669-4980",
    "website": "https://www.missionstl.org/homefirst",
    "description": "Provides supportive transitional housing. Not a shelter.\n\nWe are dedicated to providing supportive housing to help end homelessness. We do not provide temporary shelter, but partner with other organizations in the area providing these services. Potential residents complete an application to become part of the program."
  },
  {
    "addressLine1": "1225 Warren St",
    "city": "Saint Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63106",
    "name": "The Haven of Grace",
    "organization": "The Haven of Grace",
    "phone": "(314) 621-6507",
    "website": "http://havenofgracestl.org/",
    "description": "Shelter and transitional living facilities for homeless young women, ages 18 to 24 who are pregnant.\n\nThe Haven of Grace provides a home for young, homeless pregnant women to redefine their lives. The Haven offers a caring environment for young mothers to heal and bond with their infants while providing programing designed to empower each woman."
  },
  {
    "addressLine1": "Not disclosed",
    "city": "Lake Saint Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "00000",
    "name": "First Step Back Home",
    "organization": "First Step Back Home",
    "phone": "(636) 466-1365",
    "website": "http://firststepbackhome.net/",
    "description": "St. Charles leader in Shelter.\n\nLimited homeless services and financial assistance. 3 nights at week with $100 match from client.\n\nShelter\nGet homeless off the streets or out of the elements providing temporary lodging in local motels\nSupport fragile families in their own homes with rent or utility assistance and more\n\nWho Is Eligible\nFirst Step Back Home strives as its main objective to help the homeless and working poor work toward full self-supporting status. With that goal, it is unable to provide assistance to those that might have serious physical or mental issues that would prevent them realistically attaining a job and becoming self-supporting. Such individuals will be referred to other agencies.\nPermanent housing, transportation, higher education and/or trade school to get a better job. The minimum goal should be to obtain a job making a living wage of $18 per hour for family of 2.\n\nFSBH will not provide any assistance whatsoever to:\n    Active drug/substance addicts or alcoholics\n    Sex offenders\n    Those with outstanding arrest warrants\n    Con artists\n    Any person that does not want to find and hold a job\nFSBH will also have much greater difficulty helping find jobs for those with felony records. A current clean background check in hand by those seeking assistance will greatly speed FSBHs approval process, and will make finding a job faster.\nOur most important initial requirement of clients is that they must make a minimum of 15 inquiries per day in an attempt to find work.  Clients will be required to complete a daily job search form, detailing the name of the business they applied to, the name and phone number of the person they talked to, and the results of the call. They are required to turn these sheets into the motels front desk office at the end of each day.\nWhen a client does obtain a job, FSBH will strive to pay for their motel bill for the two weeks until they get their first pay check. As they progress in their job, we try to assist them with their permanent housing and transportation needs."
  },
  {
    "addressLine1": "1402 Hebert Street",
    "city": "Saint Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63107",
    "name": "Stepping Into The Light Ministry",
    "organization": "Stepping Into The Light Ministry",
    "phone": "(314) 231-5175",
    "website": "https://www.sitlm.org/",
    "description": "Shelter and Rehabilitation.\nThey house and feed homeless/addicted to drugs and/or alcohol.\n90 day program that encourage the men to stay at least one year. They have Bible study daily and plenty of love to go around.\n\n\nNon-profit 501-3c organization. A drug and alcohol treatment center and faith based first and foremost.Stepping Into The Light Ministry is one of the best rehabilitation program for men in Saint Louis, MO for those that are wanting to get closer to God and know what being a man is really about.\n"
  },
  {
    "addressLine1": "1 William Booth Dr",
    "city": "O Fallon",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63366",
    "name": "Salvation Army O'Fallon",
    "organization": "Salvation Army O'Fallon",
    "phone": "(636) 240-4969",
    "website": "",
    "description": "Homeless shelter for families.\nOffice Hours: Mon - Fri, 8:30am - 5pm; Sat, Sun, closed.\n\nhomelessness, by addressing its root causes and breaking the cycle of poverty.We operate four shelters in the St. Louis Metro area that serve the neediest men, women and children in the region. Residents of these shelters are afforded up to 120 days to get back on their feet. They are provided with meals, beds and assistance with medical treatment and job searches. Once they are ready to transition to more permanent housing, Salvation Army case managers work to help them find suitable accommodations which will allow them to transition back into their lives successfully."
  },
  {
    "addressLine1": "PO Box 52",
    "city": "Malden",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63863",
    "name": "BRAVE Domestic Violence Center",
    "organization": "BRAVE Domestic Violence Center",
    "phone": "(573) 276-2815",
    "website": "http://www.daeoc.com/domestic-violence.php",
    "description": "Domestic Violence Resource Center\nA safe haven to rebuild lives.  At the center, we celebrate the resiliency of the human spirit and the capability that lives in each of us to overcome obstacles.  Comprehensive shelter services are provided to those women and children who are fleeing domestic violence situations.  The goal of the program is to empower battered women, giving them the tools to rebuild their lives in order to assure future safety for themselves and their children.  Our residents are made to feel safe, allowed to determine the next step in their lives and to explore the alternatives in breaking the cycle of domestic violence. \n\nOur guiding principle is empowerment.  The non-profit organization operates under the DAEOC umbrella and all programs are provided free of charge to participants on a non-discriminatory basis.  This emphasizes regaining personal power from within, rather than seeking the approval and power from outside sources.  By reclaiming their own power, battered women can live their life free of fear and violence. \n\n\nOur services are available 24-hours-a-day, seven days a week are available for the Missouri counties of Dunklin, Mississippi, New Madrid, Pemiscott, Scott and Stoddard.\n\nServices\nReferrals/Resource Provision -Survivors and community residents are able to call and get community referrals and resources for services being sought.   Referrals are accepted from various agencies, individuals, schools, law enforcement, and court officials, ect.  Services are provided at no cost to the participant.\nServices offered during shelter stay-Emergency shelter, crisis intervention, clothing, meals, basic needs, transportation assistance with medical treatment, housing and job searches just to name a few.  Victim advocacy and follow-up services available after leaving the shelter.\nCase Management/Life Coaching and Parenting Workshops-Case management services are tailored to each individual and meeting schedules are determined on a case-by-case basis.  Assistance with goal development, planning, obtainment, and resource linkage are managed by trained agency staff.  Life skills work shops offer a variety of topics dealing with improving parenting skills, nutrition, building self-esteem, dating/domestic violence, etc. can be adapted to needs of participant.\n\n\nVictim/Court Advocacy (court advocacy services are offered as needed)\nCrisis intervention, Safety planning-Assist victims in implementing safety plans and accessing needed services/tangible goods for safety planning.  Accompany victims through the judicial process.  Assistance with filing Personal Protection Orders (PPO).  Act as a liaison between the victim and various community agencies involved with them.  Assist with transportation to court attendance. "
  },
  {
    "addressLine1": "421 W Pine St",
    "city": "Poplar Bluff",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63901",
    "name": "United Gospel Rescue Mission",
    "organization": "United Gospel Rescue Mission",
    "phone": "(573) 785-4683",
    "website": "http://www.pbrescue.com/",
    "description": "Services\nTransient Men Housing\nEach night at 8:00 our doors open to those men who find themselves with no place to be.  These men find a small snack and a hot shower as well as a warm bed awaiting them.  As we are a small shelter men are only allowed 3 nights of shelter a month,  However our director is willing to talk to any man about an extension and exceptions have been made.  After a good nights sleep, these men are offered a breakfast and then dismissed for the day.\n\n\nNew Life Discipleship Program\nWe strive to teach our men that they are, in fact, a new creature in Christ when they put their faith in Him. Their old life is gone. They may choose to serve the flesh but they do not have to live that way. We believe in the cognitive therapy approach. In other words, until an addict is thinking correctly, his actions will continue to cause him failure and heartache.\n\nOur goal is to see men recover, and not return to their old lifestyle. Instead, we want to assist them in finding victory in Christ, and living a new life full of happiness and God's blessings.\nWe help them accomplish this by providing a structured program that will prepare them to re-enter society as responsible citizens. We strive to teach them the importance of completing tasks and being timely in all job duties. An example of the daily schedule is as follows:\nDAILY SCHEDULE\n6:00 AM Wakeup and breakfast\n7:00 AM Morning Classes\n8:00 AM Daily Work Assignments\n12:00 PM Lunch\n1:00 PM Resume Daily Work Assignment\n3:00 PM Study Time\n5:00 PM Supper/Clean Up\n6:00 PM Evening Bible Study\n7:00 PM Free Time (on site)\n10:00 PM Lights Out\nThis schedule teaches them that there is a proper time for everything, so they can establish a routine that is necessary in daily life.\nWhether it is the residential program, community food boxes for the Sr. Citizens, or assistance with household needs, the mission strives to help those in need."
  },
  {
    "addressLine1": "2750 McKelvey Road.",
    "city": "Maryland Heights",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63043",
    "name": "Loaves & Fishes for St. Louis",
    "organization": "Loaves & Fishes for St. Louis",
    "phone": "(314) 291-3857",
    "website": "https://www.loavesandfishes-stl.org/",
    "description": "Food Pantry & Family shelter.\nThe Loaves and Fishes Bridge Program is dedicated to serving area veterans by helping them bridge the gap between homelessness and housing.\nThrough the Bridge Program, they place homeless veterans into interim housing while they wait for their permanent housing units to become available.\n\nServices include:\nA safe and comfortable place to stay\nAdditional Case Management\nFood/Prevention Services (on-going)\nTransportation Services\nGas vouchers for employment and appointments\nReferrals to mainstream resources beyond just veteran services\nHygiene products\nEncouragement\n"
  },
  {
    "addressLine1": "10740 West Page Ave",
    "city": "St. Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63132",
    "name": "The Salvation Army Family Haven",
    "organization": "The Salvation Army Family Haven",
    "phone": "(314) 423-7770",
    "website": "https://www.twitter.com/salarmystl",
    "description": "Available services include:\nAlcohol & Drug Treatment (NON-RESIDENTIAL), Community Recreation Programs, Counseling Services, Day Care Programs (CHILDREN), Domestic Violence, Emergency Assistance, Health Services, Housing/Residential (EMERGENCY SHELTER), Housing/Residential (TRANSITIONAL HOUSING).\n\nFamily Haven is a Community in Partnership serving the homeless population in St. Louis. Our program is 120 days where each resident is assigned a case manager and counselor to help them obtain a job and housing. We are here to empower St Louis county residents to come to a place of self sufficiency"
  },
  {
    "addressLine1": "1815 Boone\\'s Lick Road",
    "city": "St. Charles",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63301",
    "name": "Youth In Need Emergency Shelter",
    "organization": "Youth In Need Emergency Shelter",
    "phone": "636-946-5600",
    "website": "https://www.youthinneed.org/",
    "description": "Youth In Need's Emergency Shelter is a 12-bed emergency residential center for male and female children and teens, ages 10-18, who are in crisis. Continuously in operation since 1974, Youth In Need has developed a comprehensive temporary shelter services program, structured to meet the unique needs of each child and teen. Youth In Need's Emergency Shelter program provides a safe haven from abuse, a 'family timeout' to provide a cooling off period during a time of intense family conflict and shelter for homeless children and teens. Youth In Need meets the basic needs of housing, food and safety while providing counseling and other support services to help youth re-unite with their families, when appropriate, or find an alternative living situation.\n\nThe Emergency Shelter offers individual, family and group counseling, crisis intervention and case management services and daily educational groups.\n\nEligibility, Enrollment and Cost\nParticipation in the program is voluntary, and the program is free to participants. Children and teens must be between the ages of 10 and 19 to enroll. Enrollment intakes are scheduled via the 24-Hour Help Line or on a walk-in basis at the Emergency Shelter. During the enrollment assessment, Youth In Need staff will provide the child or teen with their immediate needs, explain the program, services and participation requirements and secure voluntary commitment from the child or teen to participate in the program.\n"
  },
  {
    "addressLine1": "308 E Spring St",
    "city": "Neosho",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "64850",
    "name": "Restoration Life Center Emergency Shelter",
    "organization": "Restoration Life Center Emergency Shelter",
    "phone": "(417) 451-0157",
    "website": "https://www.rlcneosho.org/",
    "description": "The Restoration Life Center Emergency Shelter:\n     Is a 30 day shelter for individuals and a seven day shelter for families. Provided that certain criteria is met, individuals may have the option to stay up to one year.\n    Offers three meals a day plus snacks.\n    Provides use of a washer and dryer and supplies.\n    Provides a daily shower and hygiene supplies.\n    Gives vouchers to residents for clothing, shoes and coats from the RLC Family Store.\n    Assists residents with permanent housing arrangements.\n\n    Prepares residents to go back to the work place through our mandatory work program at the RLC Family Store.\n    Gives our residents hope by helping each one realize their unique value to God and discover His plan for their lives.\n\nRestoration Life Center does not have a prescribed length of stay for residents. Because we are an emergency shelter, generally individuals can stay up to 30 days and seven days for families. However, provided that certain criteria is met, individuals may have the option to stay up to one year in transitional housing. Those residents are encouraged to stay until they acquire the skills and savings necessary to become independent community members.\n\nThe Restoration Life Center provides emergency shelter to families and single adults who are experiencing homelessness in Neosho/Newton County and surrounding areas.\n\n\nBed space is given on a first come first serve basis for individuals. Individuals seeking shelter must complete the eligibility assessment interview given by the staff members of Restoration Life Center.\n\nRestoration Life Center focuses on empowering individuals to be self-reliant, independent community members. We require that adults leave the shelter during the day to work, seek employment, or attend a work study shift at the RLC Family Store. Once a shelter resident obtains employment, they are required to save a portion of their income to go towards future housing."
  },
  {
    "addressLine1": "PO Box 231",
    "city": "Perryville",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63775",
    "name": "Regional Family Crisis Center",
    "organization": "Regional Family Crisis Center",
    "phone": "(573) 547-2480",
    "website": "http://facebook.com/regionalfamilycrisiscenter",
    "description": "Regional Family Crisis Center is a domestic and sexual violence residential shelter. We are open 24/7, and offer emergency shelter to victims of crime, along with court advocacy, child advocacy, crisis intervention, counseling, support groups, and information and referrals."
  },
  {
    "addressLine1": "8943 Commercial Blvd.",
    "city": "Pevely",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63070",
    "name": "Jefferson County Rescue Mission",
    "organization": "Jefferson County Rescue Mission",
    "phone": "(636) 475-3030",
    "website": "http://www.orgsites.com/mo/jeffersoncountyrescuemission/",
    "description": "The mission of our organization is to provide food, clothing and shelter for the needy who come to us from Jefferson County and a portion of St. Louis County, Missouri. We serve the homeless and other hungry people, the unemployed, victims of abuse, children, the elderly and dysfunctional family members. The hurting people who come to us are clearly in need of more than the obvious food, clothing and shelter which they may be lacking. Some seek a refuge from violence. Some want help finding assistance in overcoming drug or alcohol abuse. Some seek referrals to educational assistance or job training. All who cannot help themselves turn to us, and we have never turned away a call for help. But, because the calls for help are coming in ever-increasing numbers in our part of Missouri, we often cannot help our clients to the full extent that their needs demand."
  },
  {
    "addressLine1": "2612 Wyoming St",
    "city": "St. Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63104",
    "name": "Peter & Paul Community Services",
    "organization": "Peter & Paul Community Services",
    "phone": "(314) 588-7111",
    "website": "http://www.ppcsinc.org/",
    "description": "GET HELP\nTo get a bed in the emergency shelter, you need to first go to the Housing Resource Center. The address is 800 N Tucker Blvd, St. Louis. Get there early, 7:30 am if possible, to speak with the staff there.\nCall the Housing Resource Center phone line. The line opens at 8 am, so call as early as possible. The number is 314-802-5444. If you do not get a bed at the emergency shelter on the first day, continue to try every day until a bed opens up.\n\nOnce you have gotten a bed at the emergency shelter through the Housing Resource Center, arrive at the shelter to speak with staff. The shelter is in the basement of the Saints Peter and Paul Church on 1919 S 7th St, St. Louis 63104. The door to the shelter is on the Allen Avenue side of the church.\n\n\nPeter & Paul Community Services offers a year-round emergency shelter for homeless single adult men. The shelter provides beds, food, showers, laundry, lockers, and a safe, caring alternative to living on the street.\n\nProvides 60 beds, all occupied every night\nResidents may stay up to 90 days\nMore than 50% of residents are employed\n30% of residents are mentally ill\n30% of residents have substance abuse problems\n15% of residents are veterans\n\nEmergency Shelter staff members also educate residents on community resources available to them, including:\nHealth and mental health services\nDevelopmental disability services\nVA Services"
  },
  {
    "addressLine1": "6816 Washington Ave.",
    "city": "University City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63130",
    "name": "Epworth Youth Emergency Services (YES) Shelter",
    "organization": "Epworth Youth Emergency Services (YES) Shelter",
    "phone": "(314) 727-6294",
    "website": "http://epworth.org/",
    "description": "The Youth Emergency Service shelter provides food and housing to youth experiencing homelessness or family crisis. The safe, nurturing environment and therapeutic services help youth and families rebound.\n\n\n\n- accommodates six girls and six boys, ages 11 to 19\n\n\n\n- Typical challenges include family conflict, homelessness, abuse and school issues\n\n\n- The program includes individual, group and family counseling, attendance at community schools or GED programs\n\n\n- A licensed therapist and highly trained youth advisors work with the child and family\n\n\n- Program accepts pregnant females up to 26 weeks pregnant\n\n\n\n\nThe YES Helpline operates 365 days a year/24 hours a day. Call for assistance.\n\n"
  },
  {
    "addressLine1": "800 North Tucker",
    "city": "St. Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63101",
    "name": "St. Patrick Center Shelter For Women",
    "organization": "St. Patrick Center Shelter For Women",
    "phone": "(314) 802-0700",
    "website": "http://www.stpatrickcenter.org/",
    "description": "The Womens Night program is an emergency shelter that provides temporary housing for women who are homeless and have a history of or are experiencing mental illness. The Womens Night program is an Enhanced Shelter Program, which offers services requiring clients participation. Case management services focus on trauma intervention and treatment, in addition to helping women identify permanent housing opportunities, attain financial stability and obtain psychiatric and/or medical services.\nThe Womens Night program seeks to provide shelter and services to up to 15 homeless women each night. Women are admitted to the shelter for a four-month term, which can be extended in certain circumstances. Women residing in the shelter participate in the Shamrock Club Intensive Case Management program and work individually with the shelter manager for ongoing psycho-therapeutic treatment and case management.\n\nIf you or someone you know is interested in this and the many other St. Patrick Center programs, visit our Welcome Center at 800 N. Tucker Blvd. We are open Monday-Friday from 8am-4:30pm."
  },
  {
    "addressLine1": "1000 N 19th St",
    "city": "Saint Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63016",
    "name": "Gateway 180 Homeless Services - Emergency Shelter",
    "organization": "Gateway 180 Homeless Services - Emergency Shelter",
    "phone": "(314) 231-1515",
    "website": "http://www.gateway180.org/",
    "description": ""
  },
  {
    "addressLine1": "510 N. 25th Street",
    "city": "East Saint Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "62205",
    "name": "The Family Living Center",
    "organization": "The Family Living Center",
    "phone": "(618) 274-7832",
    "website": "http://www.cdbgops.org/",
    "description": ""
  },
  {
    "addressLine1": "1315 Howard Street",
    "city": "St. Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63106",
    "name": "Sunshine Mission Emergency Homeless Shelter",
    "organization": "Sunshine Mission Emergency Homeless Shelter",
    "phone": "(314) 231-8209",
    "website": "http://www.sunshineministries.org/",
    "description": "When a homeless man walks through Sunshine Ministries doors, they are not initially seeking a complete life change. They are coming in off the dangerous streets, escaping the summer heat or winter cold seeking two simple things shelter and food.\nSunshine Ministries provides emergency services for men in need of immediate assistance in a caring and accepting environment. Food, shelter and other basic needs are provided for each man. A simple hot meal could be their first step to a new life!\nEach evening our shelter guests are given:\n    A nutritious, hot dinner prepared in a meticulously clean kitchen\n    A chapel service presented by volunteers that shares the Gospel message of Gods love and mercy\n    A comfortable heated and air-conditioned dormitory\n    Clean bathroom facilities and toiletries for a warm shower and shave before bed\n    A warm, comfortable bed with fresh linens\n    A nutritious breakfast and sack lunch for the day\n    Safe storage for their personal possessions overnight\n    Counseling and encouragement from our staff and volunteers\n    Special holiday meals and celebrations\n    And the safety and security that comes from knowing that our staff is on duty all night to protect them.\n\nAddiction Recovery\nFor men who are ready to change their lives, Sunshine Ministries offers a 13-month Resident Program to help them recover from substance abuse and past failures, and equip them for a productive, God-honoring future.\n\nThe men arrive at the mission facility each day to participate in a rigorous program schedule including:\n    A self-paced adult education program that allows the men to improve their reading, writing and math skills or prepare to take the GED test\n    Behavioral, spiritual and personal counseling\n    Life-skills classes that teach basic skills for independent living\n    A Christian 12-Step Addiction Recovery Program\n    Daily work details that train the men to have a good work ethic\n    Computer literacy training\n    Career Employment Services which include testing, classes and personal tutoring that equips students to find and keep a job\n    Spiritual development activities such as Bible studies and church\n    participation\n\n"
  },
  {
    "addressLine1": "2727 North Kingshighway Blvd",
    "city": "Saint Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63113",
    "name": "Covenant House Missouri - Saint Louis",
    "organization": "Covenant House Missouri - Saint Louis",
    "phone": "(314) 533-2241",
    "website": "https://www.covenanthouse.org/homeless-charity/missouri",
    "description": "Covenant House Missouri (CHMO) empowers homeless, runaway and at-risk youth to live independently and become contributing members of the community. With open doors and open hearts, more than 6,400 young people (16 - 21 years of age) in the St. Louis metropolitan area are provided programs and resources every year.As one of the leading St. Louis nonprofits servicing youth, CHMO is dedicated to providing hope, enrichment and a positive direction to all youth in need. This all-encompassing approach is housed within the CHMOs Center for Youth, a welcoming, bright environment with dorm-like floors and classrooms.\n\nIn addition to emergency shelter services, the Center for Youth provides educational resources, job skill development, personal counseling and numerous life skill classes.\n\n\nThere is also an extensive transitional living program where youth can live in the facility for up to two years. Moreover, youth with mental health issues who have left the CHMO program (for up to six months) are personally called by After-care Program staff to ensure stability and if essential needs are being met.Outside of the Center for Youth, CHMO staff bring awareness of youth homelessness and services to schools (safe outreach) and on poverty stricken streets (street outreach). The outreach team continuously educates the public and directly assists youth in crisis with resources and immediate supplies like food and clothing."
  },
  {
    "addressLine1": "4302 Farlin Ave",
    "city": "St. Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63115",
    "name": "Genesis Men's Home",
    "organization": "Genesis Men's Home",
    "phone": "(314) 381-0700",
    "website": "http://www.stldreamcenter.org/",
    "description": "Our mission is to provide men the most effective comprehensive faith-based opportunity for life transformation by moving students from a self-centered paradigm to a Christ-centered paradigm. We are committed to helping and equipping men in the discipleship process find freedom from addictive behaviors and assisting them in becoming mentally sound, emotionally balanced, socially adjusted, physically well, and spiritually alive.\n\nThe Genesis Mens Home is a 9 to 12 month residential program that teaches men to rely on the power of Christ to break free from addiction, while also providing comprehensive recovery and rehabilitation assistance.By trusting God's infinite forgiveness, and working to restore a relationship with Him, men will find their way on the path to true recovery, no matter how far addiction has steered them off course.\n\nFor more information, please call.."
  },
  {
    "addressLine1": "7 Vieux Carre Dr",
    "city": "East Saint Louis",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "62203",
    "name": "Catholic Urban Programs Holy Angels Shelter and Food Pantry",
    "organization": "Catholic Urban Programs Holy Angels Shelter and Food Pantry",
    "phone": "(618) 398-5616",
    "website": "http://www.catholicurbanprograms.org/cup",
    "description": "The purpose of Holy Angels Shelter is to provide shelter, support services, and transitional case management for citizens in the Metro East. The staff strives to identify the needs, as well as the holistic care and concerns of women, men, and children who are caught in the temporary web of poverty and homelessness or are recovering from some catastrophic experience that rendered them without a stable living situation.\n\nServices:\n\nEMERGENCY SHELTER\n18-bed, 24/7 shelter program serving single women, mothers with children, and intact families, meeting basic needs of safety, food, clothing, and shelter, CUPs intensive case management program is centered on personalized housing stability plans.\n\n\nEMERGENCY MOTEL PROGRAM\nEmergency motel nights for people in short-term housing crises, including victims of issues such as domestic violence. The voucher program adds capacity when shelters are full and keeps families together and safe until permanent housing solutions are found.\nFOOD PANTRY HOURS:\nTuesday, Wednesday and Thursday 9:00am to 12:00pm, and, 1:00pm to 3:00pm\n\n\n\n"
  },
  {
    "addressLine1": "901 E. Lake",
    "city": "Paragould",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "72451",
    "name": "Mission Outreach of Paragould",
    "organization": "Mission Outreach of Paragould",
    "phone": "(870) 236-8080",
    "website": "http://missionoutreachnea.com/",
    "description": "Emergency Homeless Shelter, Transitional Living Program, Soup Kitchen, Food pantry, clothing.\nHousing the Homeless\n\nMission Outreach operates an emergency shelter, 365 days a year. Homeless clients of NEA can find a bed, shower, food, and hope all under one roof. Mission Outreach offers job hunting resources, mental health therapy, medication assistance, and much more to each person who claims Mission Outreach as a temporary home.\n\n\n\nOur facility is a sixty bed homeless shelter for a six county region in Northeast Arkansas. We also operate a full-time soup kitchen that serves three meals a day, year round, and a full-time food pantry.\n\nShelter: Mission Outreach of NEA, Inc. is a 60 bed emergency shelter for the homeless in a six county region of Northeast Arkansas. The facility, which was built in 1982, has a separate dorm area for men, women and families. The average length of stay in our shelter is 40 days.\n\nSoup Kitchen: An on-site soup kitchen serves 3 meals per day, 365 days per year. The kitchen is staffed by volunteers and residents. Breakfast is served at 6:30 AM, lunch is served at 12 PM and dinner is served at 5 PM. You do not have to be a resident to eat in the soup kitchen as it is open to the public. We serve an average 140 meals per day.\n\n\nFood Pantry: An on-site food pantry distributes canned goods, fresh fruits, frozen foods and other food items twice a week. Our pantry, which is staffed by volunteers, is open on Monday's and Thursday's from 9 AM to 4 PM. Individuals must meet certain income guidelines and complete minimal paperwork to be eligible for assistance. In 2011, over 5,200 food boxes were distributed through our food pantry.\n\nFree Clinic: Mission Outreach of NEA, Inc. in partnership with Arkansas Methodist Medical Center provides basic medical services to those who otherwise have no access to healthcare. The clinic is staffed completely by volunteer physicians, nurses, pharmacists, lab technicians and other professionals. It is open from 6 PM to 9 PM on each first and third Thursday of each month. Our charitable medical clinic has a fully stocked pharmacy on-site and fills prescription at no cost to individuals. Eligibility requires that an individual have no form of health insurance, including Medicaid and Medicare. Our clinic is located at #1 Medical Drive, Paragould, AR 72450.\n\nAssistance Programs: Our benevolent services offer rent, utility, fuel and prescription assistance. Individuals must first qualify and be approved by our benevolent services manager and are eligible for assistance once every 12 months. No cash or checks are ever exchanged as our system works entirely off of vouchers that individuals can use with cooperating providers. Our benevolent services are open from 9 AM to 4 PM each Tuesday and Thursday.\n\nSupportive Services: Other services offered by Mission Outreach of NEA, Inc. include transportation to and from employment (limited time), transportation to and from staffing agencies, social security and other document retrieval assistance, day labor opportunities and more."
  },
  {
    "addressLine1": "5515 Old Walcott Rd.",
    "city": "Paragould",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "72450",
    "name": "Children's Home, Inc.",
    "organization": "Children's Home, Inc.",
    "phone": "(870) 239-4031",
    "website": "http://www.childrenshomes.org/",
    "description": "Residential Group Home. Boys and girls who need care from birth to 17 years old"
  },
  {
    "addressLine1": "1095 N. Service Rd. West",
    "city": "Saint Clair",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63077",
    "name": "Agape House Of Franklin County",
    "organization": "Agape House Of Franklin County",
    "phone": "(636) 629-9899",
    "website": "https://www.facebook.com/AGodlyKindofLove/",
    "description": "Homeless shelter and food bank.\n\nFood Pantry\nMon 12:00 - 2:00 pm\nThurs 11:00 am - 1:30 pm\nFri 1:00 - 3:00 pm\n\nCall to confirm pantry hours and shelter hours."
  },
  {
    "addressLine1": "636 North Boonville Avenue",
    "city": "Springfield",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65806",
    "name": "Salvation Army Harbor House",
    "organization": "Salvation Army Harbor House",
    "phone": "(417) 831-3371",
    "website": "http://www.salvationarmyspringfield.org/",
    "description": "Programs at the Harbor House include:\n    Harbor House Rehabilitation Program: Men in this program maintain sobriety, work towards a college education, enter the workforce, receive counseling, drug and alcohol rehabilitation, and much more.\n    Front Line Feeding Program: Free lunch served daily from Noon-1:00 p.m. to anyone who is hungry."
  },
  {
    "addressLine1": "730 N Glenstone Ave",
    "city": "Springfield",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65802",
    "name": "The Kitchen Inc - Emergency Shelter",
    "organization": "The Kitchen Inc - Emergency Shelter",
    "phone": "(417) 225-7499",
    "website": "http://www.thekitcheninc.org/",
    "description": "The Kitchen, Inc.s Emergency Shelter provides temporary shelter for people experiencing homelessness. Case managers work with each individual to assess their needs and barriers with the goal of moving to another housing program of The Kitchen, Inc. within 90 days.\nOne Door Program:\nTo find out if you qualify for this or other programs, contact One Door at (417) 225-7499 or visit the One Door at 1518 E Dale St.\nOne Door is the coordinated entry point for homeless services for Greene, Christian, and Webster counties.\n\nOne Door also maintains a resource directory for other social service organizations in the area.\nVeterans can call (417) 225-7410 to screen for services."
  },
  {
    "addressLine1": "1715 N. Boonville Ave.",
    "city": "Springfield",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65801",
    "name": "Springfield Victory Mission",
    "organization": "Springfield Victory Mission",
    "phone": "(417) 831-6387",
    "website": "http://www.victorymission.com/",
    "description": "Springfield Victory Mission operates Victory Square, a men's facility that provides shelter and other services through four areas, namely Victory Lodge, Victory Transitions, Victory Trade School and Victory Life."
  },
  {
    "addressLine1": "1610 N. Broadway Ave.",
    "city": "Springfield",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65803",
    "name": "Victory Square Men's Shelter",
    "organization": "Victory Square Men's Shelter",
    "phone": "(417) 864-2235",
    "website": "http://www.victorymission.com/",
    "description": "Victory Square is the largest homeless men shelter in Springfield and the Ozarks with 150 beds. We provide our shelter guests with a clean, safe and sober place to stay, and the support they need to get back on their feet.\n\nHere, they receive a bed to sleep on, nutritious meals, healthcare services and access to the 12/12 Program, Bible studies, life skills courses and Christian counseling.\n\nThe gospel message of Jesus Christ is presented in nightly chapel services and through ongoing interaction with staff and volunteers.\n\nVictory Square is divided into three main areas:\n    Transitions - Free lodging for 30 to 90 days.\n    Lodge - Unlimited stay in four- to eight-men bedrooms for a small nightly fee.\n    Student Dorms - Lodging for Victory Trade School students.\n\nHours & Location\n1610 N. Broadway Ave.\nOpen 24 Hours, 365 Day a Year\n(417) 864-2235"
  },
  {
    "addressLine1": "1825 Delmar Blvd.",
    "city": "Granite City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "62040",
    "name": "The Good Samaritan House of Granite City",
    "organization": "The Good Samaritan House of Granite City",
    "phone": "(618) 876-0607",
    "website": "mailto:goodsamaritanhouse@gshofgc.org",
    "description": "The Good Samaritan House enriches the lives of homeless women and children by supporting them in a loving Christian environment. While providing safe and temporary housing, basic human needs and supportive services, the Good Samaritan House offers residents opportunities to enhance life skills, increase self-esteem and become self-sufficient.\n\n\nTemporary Shelter\n\nGood Samaritan House provides temporary shelter for up to ten women and their children who are facing homelessness. While in the shelter, residents participate in activities to build their self-sufficiency, self-esteem, and chance of succeeding in life.\n\n\n\nTransitional House\n\nGood Samaritan House's transitional housing program provides longer-term housing in nine single-family dwellings. These units are offered to women who have demonstrated self motivation in the shelter setting, depending on availability."
  },
  {
    "addressLine1": "Rt 1 Box 92",
    "city": "Van Buren",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "63965",
    "name": "Closed: New Life Evangelistic Center Shelter For Men Van Buren",
    "organization": "Closed: New Life Evangelistic Center Shelter For Men Van Buren",
    "phone": "(573) 663-2199",
    "website": "http://www.newlifeevangelisticcenter.org/shelters/",
    "description": ""
  },
  {
    "addressLine1": "111 Market St",
    "city": "Alton",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "62002",
    "name": "Oasis Women's Shelter",
    "organization": "Oasis Women's Shelter",
    "phone": "(618) 465-1978",
    "website": "http://www.oasisshelter.org/",
    "description": "Domestic Violence shelter for women or women with children."
  },
  {
    "addressLine1": "114 East 5th",
    "city": "Alton",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "62002",
    "name": "Salvation Army Booth House",
    "organization": "Salvation Army Booth House",
    "phone": "(314) 960-2532",
    "website": "https://twitter.com/salarmystl",
    "description": "Services: Provides residential housing. EMERGENCY SHELTER.\n\nHousing for men, women and their children."
  },
  {
    "addressLine1": "610 N SIlver Street",
    "city": "Silver City",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "88061",
    "name": "SPIN (Supporting People In Need) Shelter",
    "organization": "SPIN (Supporting People In Need) Shelter",
    "phone": "(575) 494-1128",
    "website": "https://spinhousingnm.org/",
    "description": ""
  },
  {
    "addressLine1": "715 Missouri Ave",
    "city": "West Plains",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "65775",
    "name": "Martha Vance Samaritan Outreach Center",
    "organization": "Martha Vance Samaritan Outreach Center",
    "phone": "(417) 257-7792",
    "website": "http://samaritanoutreachcenter.com/",
    "description": "We are a 36 bed coed shelter and offer soup kitchen 3 times a day, 7 days a week and food and diaper pantry.\n\nMVSOC'S mission is to provide emergency shelter, transitional housing and a viable means of support to persons who are defined as homeless along with assistance in reentering society in a self-sufficient manner.\n\n\nIn addition, we strive to address the underlying causes of homelessness.\n\nAlso provides a soup kitchen. Open to everyone for three meals a day, seven days a week. Meal times are as follows:\nBreakfast: 7:00 am\nLunch 12:00 noon\nDinner: 5:30 pm\n"
  },
  {
    "addressLine1": "104 East 10th Street",
    "city": "Mountain Home",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "72653",
    "name": "Gamma House Mountain Home Arkansas",
    "organization": "Gamma House Mountain Home Arkansas",
    "phone": "(870) 425-9186",
    "website": "http://www.gammahouse.org/",
    "description": "Non Profit Transitional Housing Shelter for homeless women and children.\n\nThe goal of transitional housing is to end chronic homelessness by creating an environment that enables women to find the tools they need to build a successful and self-sufficient life for themselves and their children. Residents are offered services and support which will assist them in getting back on their feet again, physically, spiritually and emotionally. It is not our purpose to assist residents with their responsibilities, but rather to assist each resident in taking responsibility for her own life."
  },
  {
    "addressLine1": "1015 Hwy 62 W",
    "city": "Mountain Home",
    "state": "Missouri",
    "stateAbbreviation": "MO",
    "postal": "72654",
    "name": "Serenity Main Office",
    "organization": "Serenity Main Office",
    "phone": "(870) 424-7576",
    "website": "https://serenityinc.org/",
    "description": ""
  }
]