[
  {
    "addressLine1": "381 North Main Street",
    "city": "Buffalo",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82834",
    "name": "Family Services Department JOHNSON COUNTY",
    "organization": "Family Services Department JOHNSON COUNTY",
    "phone": "(307) 684-5513",
    "website": "",
    "description": "Emergency assistance for people in need. Call between 8am and 5pm"
  },
  {
    "addressLine1": "1876 S. Sheridan Avenue",
    "city": "Sheridan",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82801",
    "name": "VOA Homeless Services",
    "organization": "VOA Homeless Services",
    "phone": "(307) 751-5708",
    "website": "https://www.voanr.org/homeless-services",
    "description": "Hours: Monday - Friday from 8:00 am - 5:00 pm.\n\n\nThe Homeless Outreach Program is a lifeline for our neighbors struggling with homelessness. Volunteers of America is committed to extending a hand up to those in need through homeless prevention, rapid rehousing and emergency shelter in the Sheridan community. Whether it's the single mother who fell short on rent while she was starting a new job, or the family that has to choose between paying rent and taking their child to the hospital, WE ARE HERE TO MAKE A DIFFERENCE. Seven days a week VOA provides individualized service coordination to find collaborative solutions that combat homelessness in the Sheridan community.\n\nServices: The Homeless Outreach Program focuses on housing first case management driven solutions. Through homeless prevention, rapid rehousing and emergency shelter (as funding allows), our staff provide individualized service coordination to find creative, collaborative, solutions using available resources to combat homelessness in the Sheridan community\n\n\nSupport: The Homeless Outreach Program is a community-based program reliant upon the community to aid in rebuilding the lives of our neighbors. The program relies on the generosity of individuals, local churches, businesses, foundations and state and federal funding."
  },
  {
    "addressLine1": "115 Rohan Avenue",
    "city": "Gillette",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82716",
    "name": "Waystation",
    "organization": "Waystation",
    "phone": "(307) 686-0191",
    "website": "https://www.facebook.com/ccswy/posts/apply-online-at-ccsgilletteorg-or-through-indeedcomway-station-intake-clerkjob-d/2872890642812987/",
    "description": "Check in is 05:45 PM to 07:00 PM after 07:00 must go to Gillette Police Department for referal.No Drugs/Alchohol or be under the influence of said substances upon check-in. Breathalyzer required upon check in."
  },
  {
    "addressLine1": "230 North Park",
    "city": "Casper",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82602",
    "name": "Central Wyoming Rescue Mission",
    "organization": "Central Wyoming Rescue Mission",
    "phone": "(307) 265-2251",
    "website": "https://wyomission.org/",
    "description": "homeless shelter for all. men, women, and children."
  },
  {
    "addressLine1": "1514 E. 12th Street, Suite 200",
    "city": "Casper",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82601",
    "name": "Life Steps Community - Transitional Housing Center",
    "organization": "Life Steps Community - Transitional Housing Center",
    "phone": "(307) 235-4703",
    "website": "https://www.facebook.com/LSCCasperWyoming/",
    "description": ""
  },
  {
    "addressLine1": "103 South 8th Street",
    "city": "Douglas",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82633",
    "name": "FATHER HUBBARD'S CUPBOARD",
    "organization": "FATHER HUBBARD'S CUPBOARD",
    "phone": "(307) 358-3889",
    "website": "https://www.facebook.com/FatherHubbardsCupboard/",
    "description": "Provides food to people in need."
  },
  {
    "addressLine1": "3304 Sheridan Ave",
    "city": "Cheyenne",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82009",
    "name": "CHEYENNE HOUSING AUTHORITY",
    "organization": "CHEYENNE HOUSING AUTHORITY",
    "phone": "(307) 634-7947",
    "website": "https://www.facebook.com/Cheyenne-Housing-Authority-142832572430055/",
    "description": "public housing provided for homeless or low income families and persons."
  },
  {
    "addressLine1": "1504 Stinson",
    "city": "Cheyenne",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82001",
    "name": "Comea House",
    "organization": "Comea House",
    "phone": "(307) 632-3174",
    "website": "http://www.comeashelter.org/",
    "description": "homeless shelter. Provides evening meals. Check in at 5:30pm. Check out between 8 - 9am in the morning. Must be alcohol free to enter shelter.\nEmergency Shelter Duration of Stay: 5 Days\nCOMEA offers up to 5 days in the emergency dorm and provides the basic services of a warm, clean bed, breakfast and an evening meal, a hot shower, toiletry needs (hygiene products, towels, and linens), and clothing. New residents will be expected to meet with a case manager during that time, who will help them find the resources in town that can also help them meet their needs. This case management session also helps new residents learn about the Journey Program and decide if they would like to be involved in the program to become self-sufficient.\nJourney ProgramsDuration of Stay:\nJourney 1: 30 DaysJourney 2: 30 DaysOur Journey Program has gone through a few changes to become more successful at meeting the needs of our clients. At this point, Journey now has two groups that depend on the time a person has spent in the program. The Journey 1 program is available to anyone staying at the shelter who has shown a strong desire to escape homelessness. They are given a period of 30 days to find employment; their employment must have them working 32+ hours per week (16+ hours per week for those on disability benefits) for a legitimate employer (no under-the-table cash jobs). The program participants are also expected to commit 3 hours per week to volunteer work and one extra hour on self-improvement or community service. Residents can be in Journey 1 for up to 30 days. Journey 2 is for those who have found a job and are working towards becoming independent. The residents in Journey 2 are expected to work with their caseworkers on a long-term case plan, which includes establishing a savings account, paying off debts, developing good credit, and developing positive relationships with friend, family, & others in their community that can aid in their success. Residents can be in Journey 2 for up to 30 days. If residents in either Journey program fail to meet the program expectations, they will be asked to leave and cannot return for 30 days.\n\n\nPay To Stay ProgramDuration of Stay: 120 Days\nThe P2S Program is designed to be the next step for those who complete the Journey Program by maintaining employment and meeting their goals established by their caseworkers. P2S residents pay $200 per month for a semi-private living cubicle; P2S Overflow residents will sleep in the regular emergency dorms for only $150 per month if there are no available P2S beds. Those in the overflow beds will be placed on a waiting list until a P2S bed is available. Residents may stay in the Pay-to-Stay Program for up to 120 days. During that time, they are expected to meet weekly with their case manager to further develop savings plans, maintain sobriety, receive mental health services, or any other services that would contribute to their goal of self-sufficiency. After completing their stay in this program, they should have the skills and plans necessary to maintain independent housing and employment without the continued services from the CCRC.\n\nTransitional Housing ProgramDuration of Stay: 24 Months\n\nThe Transitional Living Program serves those with circumstances that make independent living exceptionally difficult, including people struggling with mental/physical disabilities, substance abuse, those recently released from prison, and any others who struggle self-sufficiency. TLP Residents pay a percentage of their monthly income to rent a studio apartment. Similar to previous programs, these residents have a case manager who helps them work through their individual case plans to learn skills necessary for independent living and to develop a plan to keep them from returning to homelessness. Residents in this program may have rental periods ranging from 6 to 24 months.\n\nNon Resident ServicesWe provide regular meals for breakfast and dinner daily; the breakfast is available to residents, but dinner is open to anyone in the community. We provide limited gas vouchers for people passing through Cheyenne who and cannot afford gas to continue to their final destination. Additionally, while we refer to other agencies often, non-residents may receive limited resources from COMEA such as bus vouchers for people who are stranded or limited food boxes for non-residents who are struggling to pay for groceries."
  },
  {
    "addressLine1": "1504 Stinson",
    "city": "Cheyenne",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82003",
    "name": "COMEA House Resource Center",
    "organization": "COMEA House Resource Center",
    "phone": "(307) 632-3174",
    "website": "http://www.comeashelter.org/",
    "description": ""
  },
  {
    "addressLine1": "604 E. 25th St",
    "city": "Cheyenne",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82003",
    "name": "PEAK WELLNESS CENTER",
    "organization": "PEAK WELLNESS CENTER",
    "phone": "(307) 637-3953",
    "website": "https://www.facebook.com/PeakWellnessCenterWyoming/",
    "description": "Homeless outreach services. Monday - Friday 8am - 5pm. Emergency services 24 hours a day."
  },
  {
    "addressLine1": "4700 Ocean Loop",
    "city": "Cheyenne",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82009",
    "name": "Richards Center",
    "organization": "Richards Center",
    "phone": "(307) 634-8499",
    "website": "",
    "description": "For all homeless."
  },
  {
    "addressLine1": "601 East 20th St",
    "city": "Cheyenne",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82001",
    "name": "SALVATION ARMY",
    "organization": "SALVATION ARMY",
    "phone": "(307) 634-2769",
    "website": "https://www.facebook.com/TSACheyenne/?hc_ref=ARR0WDCSUZn9o2EbPDexosVwWGOBc4Tn68chv8fewQtGjDAPE7ADQe-iiYVueGjxhuc&ref=nf_target&fref=tag&rf=11586789510",
    "description": "Soup Kitchen: Mon-Sat, 12:00 p.m.-12:30 p.m.; Sun 2:00 p.m. - 2:30 p.m."
  },
  {
    "addressLine1": "2360 E. Pershing Blvd",
    "city": "Cheyenne",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82001",
    "name": "Va Homeless Program",
    "organization": "Va Homeless Program",
    "phone": "(307) 778-7550",
    "website": "https://www.va.gov/directory/guide/facility.asp?id=736",
    "description": ""
  },
  {
    "addressLine1": "2326 E. Pershing Blvd",
    "city": "Cheyenne",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82001",
    "name": "VETERANS ADMIN. MEDICAL CENTER",
    "organization": "VETERANS ADMIN. MEDICAL CENTER",
    "phone": "(307) 775-7550",
    "website": "https://www.facebook.com/VeteransAffairs",
    "description": "For veterans only. Monday - Friday 8am - 4:30pm. Health care, drug rehab"
  },
  {
    "addressLine1": "907 Logan Avenue",
    "city": "Cheyenne",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "82001",
    "name": "Welcome Mat Day Center",
    "organization": "Welcome Mat Day Center",
    "phone": "(307) 634-8499",
    "website": "http://www.wyhomeless.org/",
    "description": "Shelter for all. Monday - Friday 9am - 3pm. Saturday/Sunday 9am - 1pm. Provides numerous things including: 1st aid supplies, gasoline, laundry, dog food for pets, etc\n\nOpen Monday - Saturday and holidays from 9am - 3pm.\n\nThe Welcome Mat Day Center provides a positive, caring spot for those in need. It is a safe place where homeless people are accepted without judgement, and where they can find community, friendship, and encouragement.\n\nDonations\nThe Wyoming Coalition for the Homeless is a 501(c)(3) non-profit organization. We rely on your donations as well as grants from foundations and corporations for funding. Your tax deductable donations of cash and in-kind items are needed year round and are accepted at The Welcome Mat Day Center, located at 907 Campbell Avenue.\n \nHours are Monday - Saturday and holidays from 9am - 3pm.  You can also make a tax deductable, online donation to WCH via PayPal here...\n \nMOST NEEDED DONATIONS:\n    Coffee, oatmeal, tuna or chicken salad kits, cup of soup, cup of noodles, and microwavable individual size meals.\n    Special foods are needed for Easter, Thanksgiving and Christmas and gifts are needed for those coming into the WCH Welcome Mat during the Christmas holiday.\n    Napkins, paper towels, paper plates\n    Toilet paper\n    Clorox, Lysol cleaner\n    Laundry detergent\n    Dishwashing soap\n \nOTHER ITEMS NEEDED:\n    Material for sewing sleeping bags such as comforters and sheets\n    Old neck ties used to tie the sleeping bags rolls together   (making it easier to carry)\n\n    Snack items such as granola bars, cup o noodles, bread, etc.\n    Art supplies\n    Stamps\n    Band aids\n    Combs/brushes\n    Deodorant\n    Feminine hygiene products\n    Foot powder\n    Disposable razors\n    Reading glasses\n    Toothbrushes / tooth paste (no mouth wash, shampoo/conditioner, bath soap, or lotions please.)\n    Pens - black or blue only (no pencils please.)\n    Camping gear\nUntil further notice, no clothing is being accepted at either location.\nAs much as they are needed and appreciated, all the in-kind donations in the world do not count if no funds are received to pay for the day to day operating expenses.\n\nVolunteers are urgently needed to work weekends and holidays at the Welcome Mat Day Center. Volunteers check in clients, make sure things run smoothly, answer questions, make referrals and other duties.\n \nGroups are encouraged to participate.\n \n    Make sleeping bags for homeless children and adults. Patterns and kits are available.\n    Teach classes for Art From the Streets Empowerment programs.\n    Keep the food pantry and clothing closet organized.\n    Help with annual \"WALK IN MY SHOES\" fundraiser.\n    Teach classes related to resumes, job skills, life skills.\n    Pick up donations and food bank orders.\n    Help with building and yard maintenance.\n    Run errands.\n    Write grants and develop fundraising projects."
  },
  {
    "addressLine1": "242 Conifer Street",
    "city": "Fort Collins",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "80524",
    "name": "Murphy Center for Hope - Homeward Alliance",
    "organization": "Murphy Center for Hope - Homeward Alliance",
    "phone": "(970) 658-9878",
    "website": "https://www.murphycenter.org/",
    "description": "Hours: 7 days a week, 8:00 am 5:00 pm (indoor services limited due to COVID-19)\n"
  },
  {
    "addressLine1": "460 Linden Center Dr",
    "city": "Fort Collins",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "80524",
    "name": "Samaritan House Fort Collins",
    "organization": "Samaritan House Fort Collins",
    "phone": "(970) 484-5010",
    "website": "https://ccdenver.org/larimer-county-services/the-mission-in-fort-collins/",
    "description": "Samaritan House Fort Collins previously known as Mission Fort Collins assist anyone in need of shelter or food or who needs help getting a fresh start.\nExtended-stay housing program for men,women and families: includes shelter, meals, clothing, case management, housing placement, spiritual support, and other assistance. The program is up to 120 days for individuals and up to 180 days for families.\nCall 970-493-0141.\nExtended-stay program for veterans: In concert with the VA, provide shelter, meals, housing placement and case management to veterans experiencing homelessness. Call 970-616-8636.\n\nEmergency Overnight Shelter Call 970-493-0141- Families: Year-round lottery at The Mission at 3:30 p.m., entrance at 5 p.m.- Women: Nov. 1 - April 30, entrance at 10 p.m. at Community of Christ, 220 E. Oak St., Fort Collins, CO.- Men: Year-round lottery and entrance at The Mission at 10 p.m.\n\nHelp people threatened by homelessness:\nFamilies\nSingle men & women\nVeterans\nSeniors\n\nProvide a temporary home, a place for new beginnings.\nEach of the residents is matched with a case manager who helps him/her navigate 120-day Levels Program. Each resident commits to goals that will help them obtain stable income and housing.\n\n120-Day Levels Program Requirements:\nAttend \"Employment\" and \"Life Skills\" class series\nAttend \"Housing\" and \"Money Management\" class series\nRegularly submit \"Job Search\" and \"Housing Search\" logs\n\nRegularly deposit earnings into a supervised, personal housing fund\nMeet regularly with Case Manager\n\nPermanent Shelter:\nMens Dorm with 18 beds\nWomens Dorm with 6 beds\nFour, separate Family Rooms\n\nEmergency \"Overflow\" Shelter:\nMens room with 24 beds\nFour additional beds for women or families\n\nVeterans Program:\nShelters up to 16 men\nProvides veterans with 24/7 access to a housing facility\nConnects veterans to case management services\nAssists veterans in obtaining:\nIncome and Benefits\nStable Housing\nPhysical and Mental Health Services.\n"
  },
  {
    "addressLine1": "316 Jefferson St",
    "city": "Fort Collins",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "80524",
    "name": "Fort Collins Rescue Mission",
    "organization": "Fort Collins Rescue Mission",
    "phone": "(970) 224-4302",
    "website": "https://www.fortcollinsrescuemission.org/",
    "description": "The homeless find a safe haven at Fort Collins Rescue Mission, where 75 warm beds await. A hot meal and warm shower here offer relief and comfort. Those who stay the night have the opportunity to seek recovery and a new direction through our Steps to Success Program, at the Mission, and through our New Life Program at Harvest Farm. Trained professionals also assess and serve the needs of individuals and families who are just struggling to make ends meet.\n\n\n\nFort Collins Rescue Mission offers emergency services to thousands of needy people throughout the year:\n\n\n\nFood\n\n\nBreakfast and dinner are served daily; lunch is served to those in programs.\n\n150 meals are served daily.\n\nBreakfast is from 6 a.m. to 7:30 a.m. Dinner is from 4:30 p.m. to 6:30 p.m. daily.\n\n\n\nShelter\n\n\nThe shelter has capacity for 90 men and women nightly.\n\n\n\nClothing\n\n\nDistribution for men, women and children.\n\n"
  },
  {
    "addressLine1": "285 West Pearl Avenue",
    "city": "Jackson",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "83001",
    "name": "Good Samaritan Mission",
    "organization": "Good Samaritan Mission",
    "phone": "(307) 733-3165",
    "website": "https://gsmjh.org/",
    "description": "shelter for men. provides showers, chapel, 2 meals a day.We are a working mission and short term shelter, helping people get back on their feet and move forward in their lives. All guests are required to have a job and pay weekly dorm fees. If you are not employed, you can not stay at the mission. We shelter men and women separately and do not have facilities for families. Routine background checks are done for all guests at the mission.\n\nGood Samaritan Mission has been quietly serving the physical, emotional and Spiritual needs of the hungry, hurting, homeless people in Teton County for over 40 years. The mission is a true part of the Jackson Hole Community. Good Samaritan Mission began in 1970 from an urging of the Holy Spirit to serve those less fortunate. Good Samaritan Mission is completely overseen by a local professional Board of Directors drawn from local businesses and professions that have a desire to serve God in this way.\n\nMeal Times:\nThe Good Samaritan Mission Serves hot nutritious meals 7 days a week, 365 days a year.\nDaily: Breakfast - 7:00am   Dinner - 5:30pm\nLunch: Weekends - 12:00pm\nCome join us for Bible Studies:\nBible Studies are held Monday - Friday at 8:30am and 4:00pm\nSunday Chapel Service at 1:30pm"
  },
  {
    "addressLine1": "1904 Dakota Lane",
    "city": "Ammon",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "83406",
    "name": "CLUB, Inc.- Drop-In Center",
    "organization": "CLUB, Inc.- Drop-In Center",
    "phone": "(208) 529-4673",
    "website": "https://clubinc.org/drop-in-center/",
    "description": ""
  },
  {
    "addressLine1": "1820 E. 17th Street Suite 150",
    "city": "Idaho Falls",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "83404",
    "name": "CLUB, Inc. - Idaho Falls",
    "organization": "CLUB, Inc. - Idaho Falls",
    "phone": "(208) 529-4673",
    "website": "http://clubinc.org/",
    "description": ""
  },
  {
    "addressLine1": "840 Park Avenue",
    "city": "Idaho Falls",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "83402",
    "name": "City of Refuge (Men’s Shelter) Run by Idaho Falls Rescue Mission",
    "organization": "City of Refuge (Men’s Shelter) Run by Idaho Falls Rescue Mission",
    "phone": "(208) 552-5575",
    "website": "https://ifrescuemission.org/city-of-refuge-mens-shelter/",
    "description": "Located in down town Idaho Falls, provides services to homeless men 18 years old and older. It was actually the genesis of the Idaho Falls Rescue Mission. City of Refuge was established in September of 1999 as a mens emergency shelter offering shelter, meals and clothing. Over the years, City of Refuge has evolved to a community resource serving the evening meal to the hungry in Idaho Falls. We also provide food boxes, hygiene products, shower and laundry facilities to those in need.\nCity of Refuge currently has 20 beds available in two dorm areas. We also have a classroom, a full commercial grade kitchen and our Sonshine Room where we serve dinner every evening to as many as 120 hungry folks from our community. The Sonshine Room also serves as our location for evening bible studies.\n\nCheck-in: 4:00 PM\nDinner Served: 6:00 PM\nCall 552-5575 for evening bible study times and topics\n\n\nIdaho Falls Rescue Mission exists to serve, rescue, and transform those in greatest need through the power and grace of Jesus Christ, using the resources provided by our donors, volunteers and our community. City of Refuge Men's Emergency Shelter, ARK Men's Transitional Housing, Ruth House Women's Transitional Housing, Evergreen Emergency Shelter for women and children.\n\n\nThe Idaho Falls Rescue Mission provides essential services, and hope to homeless men at City of Refuge, and to homeless women, and women with children at the Evergreen Emergency Shelter . Our purpose is to provide emergency shelter, meals, clothing and essentials. Idaho Falls Rescue Mission also offers case management to all who choose to stay with us. This includes life directional counseling, and referrals for educational, employment, medical and disability needs.\n\nResidents at the City of Refuge and Evergreen Emergency Shelter have the opportunity to participate in one of four track programs. Christian Discipleship is available on request.\n\nTransient Track\nTransients are allowed to stay for one week. They are provided basic services and will have the opportunity to inquire about other tracks during the entrance interview with the Case Manager.\n\nFast Track\nThe Fast Track is designed for those who simply need a place to stay while they find a job and obtain a permanent residence. The timeline designated for this is generally six weeks, but this can change depending on their circumstances. Residents on this track will be expected to aggressively pursue employment, applying at a minimum of 24 locations each week. Each week the resident meets with the Case Manager to discuss the progress and problems with finding employment and housing. After the resident acquires employment, they will be required to complete a budget to live by after they move out.\n\nGold Track\nResidents who are serious about a change in their lives may be interested in the Gold Track. While involved with this track, the resident will evaluate their life, come to terms with their current direction, and take steps to turn it in a direction they would like it to go. In order to do this, the resident will complete a Goals Sheet in which they will make goals addressing topics such as addictions, education/career, employment, finances, mental health, relationships, etc. Following completion of the Goals Sheet the resident and the Case Manager will develop a plan to strive to accomplish these goals. Throughout his stay, the resident meets weekly to discuss progress and possible setbacks with the Case Manager. The Gold Track duration is roughly three months. During these three months the resident will be required to find employment and permanent housing.\n\nBlue Track\nThe Blue Track is for those coming out of prison/jail. This track is designed to help men or women who do not have the resources to find their own housing, or transition back into society. Those on this track are required to apply before they are released from incarceration. The Blue Track is similar to the Gold Track with a few additions. Upon arriving at the mission, the resident will live according to a very structured time schedule. Later, this schedule will be relaxed in order to help the resident successfully respond to the responsibilities, privileges, and disciplines needed to function in society.\n\nChristian Discipleship\nWe believe that people are spiritual beings created by God. Therefore, in order for people to become whole it is necessary to be set right with God and to follow Christ. Accordingly, residents participating in all tracks are encouraged, but not required, to participate in Christian discipleship. Discipleship involves, but is not limited to, participating in Bible discussions, setting a time of regular prayer and Bible reading, attending a local church, and meeting regularly with a Christian mentor. Residents who show a desire to change their lives are invited to enroll in our Discipleship Programs."
  },
  {
    "addressLine1": "P.O Box 51822",
    "city": "Idaho Falls",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "83405",
    "name": "Promise Ridge Emergency Family Shelter",
    "organization": "Promise Ridge Emergency Family Shelter",
    "phone": "(208) 346-8320",
    "website": "https://promiseridge.com/",
    "description": ""
  },
  {
    "addressLine1": "2480 S. Yellowstone",
    "city": "Idaho Falls",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "83405",
    "name": "The Haven (Women & Children’s Shelter) Run by Idaho Falls Rescue Mission",
    "organization": "The Haven (Women & Children’s Shelter) Run by Idaho Falls Rescue Mission",
    "phone": "(208) 523-6413",
    "website": "https://ifrescuemission.org/the-haven-women-childrens-shelter/",
    "description": ""
  },
  {
    "addressLine1": "3130 S Yellowstone Hwy",
    "city": "Idaho Falls",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "83402",
    "name": "Ruth House (Women's Shelter) Run by Idaho Falls Rescue Mission",
    "organization": "Ruth House (Women's Shelter) Run by Idaho Falls Rescue Mission",
    "phone": "(208) 552-5575",
    "website": "https://ifrescuemission.org/ruth-house-womens-shelter/",
    "description": ""
  },
  {
    "addressLine1": "805 Pine street",
    "city": "Pine Bluffs",
    "state": "Wyoming",
    "stateAbbreviation": "WY",
    "postal": "00000",
    "name": "CHRYSALIS HOUSE",
    "organization": "CHRYSALIS HOUSE",
    "phone": "(307) 632-6433",
    "website": "",
    "description": "Women's and children's shelter for long term drug and alcohol treatment."
  }
]