[
  {
    "addressLine1": "225 S. Kellogg Ave",
    "city": "Ames",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50010",
    "name": "The Bridge Home",
    "organization": "The Bridge Home",
    "phone": "(515) 232-8075",
    "website": "https://www.thebridgehome.org/",
    "description": "The Bridge Home (formerly Emergency Residence Project) provides shelter, support for men, women, and families experiencing or on the verge of homelessness.\nYou should call ahead (515-232-8075) to see if they have available space.\n\nService Area:\nStory, Marshall, Boone, Greene, and Hardin counties.\nServices:\nStreet Outreach\nShelter Diversion\nEmergency Shelter\nSupportive Housing\nRapid Rehousing\nFor more information about their services, visit their website or contact them by phone or email.\n\n\n"
  },
  {
    "addressLine1": "Address Confidential",
    "city": "Ames",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50010",
    "name": "Martha's House of Hope",
    "organization": "Martha's House of Hope",
    "phone": "(515) 337-0618",
    "website": "https://www.marthashouseofhope.org/",
    "description": ""
  },
  {
    "addressLine1": "2301 Hickman Road",
    "city": "Des Moines",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50310",
    "name": "Freedom for Youth Ministries",
    "organization": "Freedom for Youth Ministries",
    "phone": "(515) 282-4822",
    "website": "mailto:djuhl@freedomforyouth.org",
    "description": "We have two Christ Centered Transitional homes for young adults (ages 18-22). The Promise House for Young Men and Safe Haven for young women. The Young Adults may live in our Freedom Transitional homes for up to two years while working on life goals and gaining work experience from the work and educational training programs provided at Freedom for Youth."
  },
  {
    "addressLine1": "1310 6th Ave",
    "city": "Des Moines",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50314",
    "name": "Bethel Mission Men's Shelter",
    "organization": "Bethel Mission Men's Shelter",
    "phone": "(515) 244-5445",
    "website": "https://www.hopeiowa.org/",
    "description": "Men's homeless shelter. Provides meals, bible study, christian counseling, and case management.\n\n110 bed emergency shelter for homeless men.\n\nThrough our rescue services, we are providing the basic necessities of life for those in need in Des Moines and central Iowa including shelter, food and clothing.\n\nWe provide emergency shelter for homeless men at our Bethel Mission ministry center and short-term programming for women and children at our Hope Center for Women and Children. While with us, these individuals and families receive three meals a day, clothing and Christian love and guidance. And our case managers offer referrals to vital community resources, including our long-term life-recovery programs.\n\n\nWe also serve the community at-large through our meals program, providing three free meals every day of the year at our Hope Cafe, and through our King's Closet clothing program."
  },
  {
    "addressLine1": "3333 E. University Ave",
    "city": "Des Moines",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50317",
    "name": "Hope Center for Women and Children",
    "organization": "Hope Center for Women and Children",
    "phone": "(515) 264-0144",
    "website": "http://www.hopeiowa.org/",
    "description": "Women's and children's family shelter. Provides 2 year residential and recovery program.\nLocated at 3333 E. University Avenue in Des Moines, our Hope Family Center includes three eight-bedroom houses which become home to single women and children during their time in our H.E.A.R.T. Recovery Program.\n\n\nUnlike many shelters which only house homeless women and families up to 30 days, leaving them still in crisis on day 31, our recovery program is an 18- to 24-month program designed help residents break free from the cycle of poverty and addiction so they can go on to become productive members of our community."
  },
  {
    "addressLine1": "1420 Mulberry Street",
    "city": "Des Moines",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "00000",
    "name": "Central Iowa Shelter & Services",
    "organization": "Central Iowa Shelter & Services",
    "phone": "(515) 284-5719",
    "website": "https://centraliowashelter.org/",
    "description": "Our Mission\n\nCentral Iowa Shelter & Service's mission is to provide free shelter and meals to homeless adults regardless of physical or emotional conditions, and to facilitate their move toward self-sufficiency.\n\n\n\nAgency Overview\n\nOne hundred two emergency shelter beds are available for homeless men and women from 4 pm - 8 am daily, with an additional 14 beds allocated as longer-term transitional housing for homeless veterans. Guests are provided evening and breakfast meals; access to shower and laundry facilities, a weekly medical clinic, and group counseling; as well as individualized case management, life skills instruction, and referrals to other community services/benefits, where appropriate. These services are provided at a cost of approximately $13/guest/day, with no fees charged to guests."
  },
  {
    "addressLine1": "304 Chestnut",
    "city": "Atlantic",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50022",
    "name": "West Central Development Corporation",
    "organization": "West Central Development Corporation",
    "phone": "(712) 243-5421",
    "website": "",
    "description": "homeless shelter."
  },
  {
    "addressLine1": "354 Public Square",
    "city": "Greenfield",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50849",
    "name": "Matura Adair County Neighborhood Center",
    "organization": "Matura Adair County Neighborhood Center",
    "phone": "(641) 743-2424",
    "website": "http://www.maturacommunityaction.com/",
    "description": "Provides assistance to families who are facing a crisis situation with food and/or shelter. Homeless prevention services can assist families who are facing eviction or utility disconnection in preventing their family from becoming homeless. Can also assist homeless families with an emergency motel stay and in securing either temporary or permanent housing. The Emergency Food and Shelter program may be used for one months rent, utilities, or groceries for a short period of time. This assistance is intended for families who need temporary, one-time assistance to resolve an emergency situation."
  },
  {
    "addressLine1": "123 Marshall St",
    "city": "Burlington",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52601",
    "name": "Burlington Area Homeless Shelter",
    "organization": "Burlington Area Homeless Shelter",
    "phone": "(319) 754-6791",
    "website": "https://burlingtonareahomelessshelter.wordpress.com/",
    "description": ""
  },
  {
    "addressLine1": "1306 Maple Ave # T",
    "city": "Macomb",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "61455",
    "name": "Samaritan Well",
    "organization": "Samaritan Well",
    "phone": "(309) 837-3357",
    "website": "https://www.samaritanwellinc.org/",
    "description": ""
  },
  {
    "addressLine1": "318 5th Street SE",
    "city": "Cedar Rapids",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52401",
    "name": "Madge Phillips Center Waypoint",
    "organization": "Madge Phillips Center Waypoint",
    "phone": "(319) 366-7999",
    "website": "https://www.waypointservices.org/what-we-do/housing-homeless-services/madge-phillips-center-shelter-",
    "description": "Coordinated\nEntry is the front door to homeless services. It is the first point of\ncontact individuals need to reach out to who are in need of shelter\n\nservices. It will provide guidance to anyone experiencing homelessness\nto the correct supports and housing programs most appropriate to their\nsituation.\n\n\n\nEligibility\n\n\n\nHomeless individuals and families, must be\nliving in a shelter, the street, car, tent or a place not meant for\nhabitation, cannot assist anyone who is doubled up at another person's\nresidence\n\nProviding women and their children with secure housing and stabilizing resources, Waypoint's Madge Phillips Center Shelter (MPC) helps those in crisis rebuild their lives. Since opening in 1995, MPC has served as a vital community resource, providing emergency overnight shelter for homeless women and their children.\nWhile residing at the Madge Phillips Center Shelter, women receive access to proactive services and resources to help them attain stability. Specifically, case management, children's activities and support, and safe shelter for domestic violence are vital components of the Madge Phillips Center Shelter.\n\nCase management\nHelping individuals overcome barriers to housing hinges on the guidance and information provided by case management services. Case managers provide homeless women with tailored support designed to help them overcome housing obstacles. By identifying each woman's household needs, case managers create a service plan with goals and objectives to increase outcome achievement.\n\nChildren's activities and support\nOn-site childrens activities provide positive interactions and planned activities during their stay. Shelter staff provide parent support; arrangements for transportation to school; and advocacy for children at school or with other community resources. Women in shelter have access to free drop-in child care services Monday Friday from 9 a.m. - 12 p.m.\n\nEmergency, safe shelter for those experiencing domestic violence\n\nFor individuals experiencing domestic violence, Waypoint provides emergency shelter in a safe, confidential place. Victims have access to Waypoint's Domestic Violence Victim Services Program, allowing them to work with an advocate on overcoming the effects of domestic violence."
  },
  {
    "addressLine1": "1027 5th Avenue SE",
    "city": "Cedar Rapids",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52403",
    "name": "St. John of the Cross - Catholic Worker House",
    "organization": "St. John of the Cross - Catholic Worker House",
    "phone": "(319) 366-7999",
    "website": "http://www.catholicworkerhouse.org/",
    "description": ""
  },
  {
    "addressLine1": "3015 12th Avenue SW",
    "city": "Cedar Rapids",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52404",
    "name": "Foundation 2",
    "organization": "Foundation 2",
    "phone": "(319) 366-8797",
    "website": "https://www.foundation2.org/",
    "description": "They provide meals, counseling, schooling, and health care for youths ages 11-17.\n"
  },
  {
    "addressLine1": "603 Second Street S.W.",
    "city": "Cedar Rapids",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52404",
    "name": "Closed - Cedar House Shelter",
    "organization": "Closed - Cedar House Shelter",
    "phone": "(319) 364-2630",
    "website": "http://sites.google.com/site/thecedarhouseemergencyshelter/",
    "description": "NOTE: This shelter has closed.\n\nEmergency shelter for all. Can stay up to 25 days, but there is a fee (currently $3) after the first 5 days.The Cedar House provides emergency shelter services for homeless men and women (with or without children). Check out our website for full details."
  },
  {
    "addressLine1": "1247 4th Avenue SE",
    "city": "Cedar Rapids",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52403",
    "name": "Willis Dady Emergency Shelter",
    "organization": "Willis Dady Emergency Shelter",
    "phone": "(319) 362-7555",
    "website": "https://www.willisdady.org/",
    "description": "Emergency shelter for all. Evening shelter only during the week.\n\nCan provide shelter for up to 16 single men and 4 families.\n\n\nAfter checking-in, the bed/apartment is yours for the next 30 days (provided you follow basic rules and work on finding housing).\n\nDuring the day, you'll leave the shelter to work, look for work, look for housing, attend meetings, and take care of any other responsibilities.\n\nStaff will help you find housing while you're staying here.\n\nWe can provide bedding, hygiene items, food, clothing, laundry, household items, and other basic needs to shelter clients.\n\n* Clients in need of shelter first contact Waypoint's Shelter Services coordinated entry program by calling (319) 366-7999. Shelter Services talks with the caller about their current situation and attempts to identify non-shelter, temporary housing options, such as living with a family member of friend for a short period of time. If no alternative to shelter is determined, Shelter Services will contact the most appropriate shelter in Linn County to let them know a client will be coming for check in.\n\n"
  },
  {
    "addressLine1": "211 Park Ct SE",
    "city": "Cedar Rapids ",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52403",
    "name": "Mission of Hope Shelter",
    "organization": "Mission of Hope Shelter",
    "phone": "(319) 365-0502",
    "website": "http://www.missionofhopecr.org/",
    "description": "24/7 emergency shelter accepting adult males, including former offenders and those who've been drinking. First three days free, $3/day thereafter. Nightly curfew is 6 pm. Supper meal served each evening. Residents required to do daily chores. Regular meetings with staff to determine progress made. Various referral services offered.\nAdult men and women arewelcomed with a kind word,a warm shower, a\n\nclean bed, and a hot meal. Mission of Hope Shelter provides safe housing\nfor individuals including the formerly incarcerated, personsin\nrecovery, the homeless, and others inneed of emergency shelter."
  },
  {
    "addressLine1": "429 Southgate Avenue",
    "city": "Iowa City",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52240",
    "name": "Shelter House Iowa City",
    "organization": "Shelter House Iowa City",
    "phone": "(319) 351-0326",
    "website": "https://shelterhouseiowa.org/",
    "description": "Emergency Shelter\n\nOur overnight emergency facility operates a 70-bed shelter open to men, women, and families with children experiencing homelessness. Men and womens rooms are dormitory style with twin size beds. Six family rooms with personal bathrooms are available. Due to space limitations, some families may be asked to share rooms. Stays typically range from several days to a maximum of 45 days.\n\nShelter House provides cold breakfast and dinner meals to all residents during their stay. Packed lunches are available for employed residents by request.\n\n\nIf you are seeking emergency shelter, call (319) 351-0326 or come to 429 Southgate in person to access the Coordinated Entry system. Staff will assess your options and let you know what is available.\n\nAdditional resources for shelter residents\n\n    Childrens play area\n    Computer lab (limited hours)\n    Mailing address service\n    Recreation area with TV\n    Shower and laundry facility\n    Telephone access\n"
  },
  {
    "addressLine1": "505 9th Ave. S.",
    "city": "Clinton",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52732",
    "name": "Victory Center Ministries - Rescue Mission",
    "organization": "Victory Center Ministries - Rescue Mission",
    "phone": "(563) 242-9016",
    "website": "https://www.victorycenter.com/",
    "description": "Hours of Operation\nMon-Sat 9 am-5 pm, Sun 1:30 pm-5 pm\n\nVictory Center Men Shelter is a 48 bed facility that functions as a emergency shelter and transitional housing. The shelter serves hot meals twice a day, 7 days a week.\n\nThe Victory Center  is a christian organization and provides it's residents daily opportunities to learn about  receive Jesus  Christ.  Victory Center offers resume assistance to help it's residents seek and find employment. Victory Center cares about it's residents well being and interviews everyone that comes in and helps those needing extra care get in touch with care providers. Many come in needing glasses, dental work, court appointments, mental therapy and we do our best to accommodate these request so they can receive all that we a teaching them.  We desire to see you prosper and be in good health functioning independent of any illegal substances and are able to maintain their resources to sustain permanent housing and meet their obligations.\n\n\nOur shelter provides residence for up to 48+ people.  Three balanced nutritious meals are served in the dining room everyday.  A clean change of clothes and a comfortable bed are prepared for the needy every evening.  There are also showers, laundry facilities and a chapel available.  Most importantly, we provide a caring and supportive environment where lives are changed and individuals regain their self-esteem.\n \nAll of our services are available to anyone, regardless of their sex, race, religious preference,nationality, financial status. We are here to help everyone who asks for a hand up!\n\nNEW LIFE PROGRAM\nYOUR DAILY BREAD\nWe know it takes more than a hot meal and a few nights stay to get men and women back on their feet.  For those willing to take the journey...we offer a way out through our NEW LIFE Program.\n \nWe have seen 40% of those who enter the program complete it.  That means the addictions that were holding them in bondage are gone!  They have continued to live healthy, productive lives!\n \nWhat a Blessing to God they have become.\n \nResidents who enroll must commit to a 28-week program, during which the resident attends many different classes: Spiritual Recovery I, Spiritual Recovery II, Financial Budgeting, Job Search Skills and Substance Abuse.  G.E.D. assistance is also available."
  },
  {
    "addressLine1": "217 6th Avenue South",
    "city": "Clinton",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52731",
    "name": "King House",
    "organization": "King House",
    "phone": "(563) 242-6805",
    "website": "https://twitter.com/ASACiowa",
    "description": "Homeless shelter"
  },
  {
    "addressLine1": "111 East 29th Street",
    "city": "Sterling",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "61081",
    "name": "Twin Cities PADS",
    "organization": "Twin Cities PADS",
    "phone": "(815) 626-2210",
    "website": "http://www.twincitiespads.org/",
    "description": "Our Hours\nWe are open 7:00 P.M. to 7:00 A.M. October 1st thru April 30th. Please call ahead prior to visiting.\n\nThis is an emergency shelter and entry point into other outreach programs. From here the individuals are directed to organizations like the following...\n\n    Tri County Opportunities\n    Northwestern Illinois Center for Independent Living\n    YWCA\n    Sinnissippi Mental Health\n\nClick here to see information for the Homeless for the Holidays Donation.\n\nWe are very proud of the Shelter on many levels. We do a lot with a little and this fundraiser represents nearly half of our annual budgets. We a primarily funded through the community. The shelter is also primarily run by volunteers, and always has a constant level of supervision and over site.\n\n\nWe are one of many great organizations and the competition for money is tough. Our mission is to help people and be a light to those lost in the darkness. Please help us keep the lights on!"
  },
  {
    "addressLine1": "1415 Ave J",
    "city": "Council Bluffs",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "51501",
    "name": "Micah House",
    "organization": "Micah House",
    "phone": "(712) 323-4416",
    "website": "http://www.themicahhouse.org/",
    "description": ""
  },
  {
    "addressLine1": "1435 N. 15th St.",
    "city": "Council Bluffs",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "51501",
    "name": "New Visions Homeless Shelter Council Bluffs",
    "organization": "New Visions Homeless Shelter Council Bluffs",
    "phone": "(712) 256-3940",
    "website": "https://www.newvisionshs.org/",
    "description": "Joshua House\nLocated on the Council Bluffs campus, Joshua House is a 24-hour emergency shelter that meets the needs of homeless men in and around the Council Bluffs and Omaha-metro area.  Each year, the program shelters 800+ men who are experiencing homelessness.  Joshua House is the only mens shelter in southwest Iowa, offering the following services:\n\n    Safe environment with access to on-site laundry, shower and meal services\n    Case management\n    Counseling/Therapy referrals\n    Housing resources\n    Income/Employment resources\n    Transportation\n    On-site health and dental services provided by All Care Health Center"
  },
  {
    "addressLine1": "2828 North 23rd Street East",
    "city": "Omaha",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "68119",
    "name": "Open Door Mission",
    "organization": "Open Door Mission",
    "phone": "(402) 422-1111",
    "website": "http://www.opendoormission.org/",
    "description": "Emergency Shelter Open 24 Hours a Day\nSeeking Emergency Shelter, please call us at: 402-422-1111\n\nLydia House / Women & Families\nEmergency and transitional services for single women & families in need of assistance. Food, shelter, clothing, and other basic needs are provided. Case managers guide women & families through opportunities for life change the first steps toward preventing future homelessness. Special services provided for children, domestic violence, and family reunification.\nCall (402) 829-1531 for shelter availability. Ask for staff on duty.\n\nApplications for the Lydia House are also accepted at 1:00 p.m. every Monday and Wednesday, except holidays and Omaha Public School weather closure days.\n2809 N 20th St E\nOmaha, NE 68110\n\nGarland Thompson Men's Center\nProvides emergency services for men in need of immediate assistance. Food, shelter, clothing and other basic needs are provided and each man is offered an opportunity for life change through resource case management, which provides the first steps toward preventing future homelessness. Special services provided for Veterans.\nWalk-ins accepted\n2705 N 20th St E\nOmaha, NE 68110\n(402) 829-1500 ext. 2100\n\nLife-Changing Programs\nNew Life Recovery Program\nBible-based 12-step residential program committed to providing men, women, and families with the tools needed to become self-sufficient community members.\n\nJourney to Work Program\nResidential Work program focused on personal development, money management, job training, and educational skills.\n\nRental Housing\nPermanent Supportive Apartments\nWaitlist available for families and single women.  Two and three bedroom apartment rentals for women and families desiring to live independently in an affordable, stable, supportive, sober-living community.\n\nSingle Room Occupancy Rentals\nWaitlist available for single men & male Veterans.  Independent-affordable-long term rentals located in a stable, supportive, sober-living community focused on the needs of single men and Veterans.\n\nFree Hot, Nutritious Meals for the Hungry and Homeless Prevention Programs for the Poor and Needy\nMonday-Sunday\nHot Lunch\n11:00 a.m. 1:00 p.m.\nHot Dinner\n6:15 7:00 p.m.Garland Thompson Men's Center\n2705 N 20th St E\nOmaha, NE 68110\n\nFurniture & Appliance Assistance\n(402) 829-1560\nCall for instructions and available items.\nOnly at the\nTimberlake Outreach Center\n2107 E Locust St\nOmaha, NE 68110\n\nHomeless Prevention Programs\n(402) 829-1510\nFree clothing, shoes, toys, household items, diapers and food pantries. Some USDA foods are used in food pantries.  (USDA is an equal opportunity provider and employer.)  Resources are provided once every 30 days throughout all four Outreach Centers.To receive assistance, bring a current ID and proof of address.\n"
  },
  {
    "addressLine1": "2828 N. 23rd St. East",
    "city": "Omaha",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "68108",
    "name": "Jacob Rand Day Room",
    "organization": "Jacob Rand Day Room",
    "phone": "(402) 422-1111",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "1702 Nicholas Street",
    "city": "Omaha",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "68102",
    "name": "Siena Francis House",
    "organization": "Siena Francis House",
    "phone": "(402) 341-1821",
    "website": "https://sienafrancis.org/",
    "description": "Siena Francis House operates Nebraskas largest emergency shelter and is located at 17th & Nicholas Streets in downtown Omaha, Nebraska.\n\nSiena Francis House provides emergency overnight shelter for individuals experiencing homelessness. Siena Francis House also provides food to the hungry and homeless through our Meal Program, clothing, and case management outreach services through our Rehousing and Reintegration Services program\n\nPermanent Supportive HousingSienna Francis House also provides two permanent supportive housing residences.\nEach building contains 24 efficiency apartment units (48 total units). Each apartment houses an individual who was chronically homeless and has a disabling condition. The apartment facilities constructed along 18th Street, directly west of our existing facilities complement our women's and mens shelters, as well as the transitional housing we currently provide. Individuals who live in these efficiency apartment units also have the ability to utilize the services provided in our Services Center.\n\nThe Service Center is located immediately north of the apartments. This facility contains a reception area, offices for our employees and for employees of our partnering agencies, classrooms, meeting rooms and nursing stations. Our case managers work closely with, and provide services to, the individuals who stay in the apartments, as well as to all of the homeless who come to us in need of services. The Service Center is a one stop service center that helps people experiencing homelessness to obtain employment, off campus housing, healthcare, education, social services, veterans-specific services and other government assistance, and mental health services.\n\n\nFor tenancy, Siena/Francis House prioritizes individuals who have a disability and are chronically homeless. Referrals for units are received through the Metro Area Continuum of Care for the Homeless (MACCH), HUD CoC NE 501, Coordinated Entry System.\n\nLocation: Siena Francis House campus is located two blocks north of Cuming on 17th Street.\n"
  },
  {
    "addressLine1": "2723 Q St",
    "city": "Omaha",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "68107",
    "name": "Pettigrew Emergency Shelter",
    "organization": "Pettigrew Emergency Shelter",
    "phone": "(402) 731-0238",
    "website": "https://www.stephencenter.org/",
    "description": ""
  },
  {
    "addressLine1": "1016 West 5th Street",
    "city": "Davenport",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52802",
    "name": "Humility of Mary Shelter, Inc.",
    "organization": "Humility of Mary Shelter, Inc.",
    "phone": "(563) 322-8065",
    "website": "http://humilityofmaryshelter.com/",
    "description": "The Humility of Mary Shelter, Inc. provides emergency shelter 24 hours a day / 7 days a week / 365 days a year for adult men and women.The Humility of Mary Shelter is located in Davenport, IA. Our Mission is to provide emergency shelter, transitional and permanent supportive housing programs that offer opportunities for men and women experiencing homelessness to become emotionally, mentally and physically more stable.\n\nHumility of Mary Shelter, Inc. offers services to its program participants to facilitate their desired transition into housing of their own choosing.\n\nGuidelines for those in need of emergency shelter:\nHumility of Mary Shelter, Inc. accepts new participants as space allows on a first come, first served basis. If you or someone you know needs emergency housing help, the procedures on this page will assist you. We do not make reservations, but receive new participants as beds become available.\n    Intakes for emergency shelter are completed Monday-Thursday starting at 7AM at HMSI. Alternate entry times are the decision of the Director of Services/Operations.\n\n    Participants seeking shelter should arrive at shelter at 7AM.\n    If there are more people seeking shelter than available openings, an assessment tool will be used to determine an individuals vulnerability and HMSI will prioritize those with the highest level of need.\n    Once a participant has entered HMSI's emergency shelter they are eligible to stay up to 90 days in a calendar year. If a person does not return to shelter for 3 nights, they will lose their place and must follow the above procedure for re-entry.\nIt is HMSI's goal to provide emergency shelter to any adult experiencing homelessness. When that is not possible, because we are full, we want to communicate clearly the next possible opportunity for checking in. In addition, we want people to have the opportunity to speak with someone who can help provide appropriate referrals or connection to resources until more stable housing is identified.\nWomen and mens accommodations are on separate floors. Due to restricted storage space, participants must limit belongings to two bags or suitcases. No weapons are allowed on the premises.\n\nParking is available for vehicles in the lot directly in front of the shelter entrance.\n\n\nMental Health Assistance\nThe stresses of homelessness strain those who deal every day with housing insecurity. Some also deal with medical health problems, mental health problems, difficulties due to their legal history and substance abuse issues.\nHumility of Mary Shelter, Inc. contracts with professionals in the community to ensure participants have ready access to mental health services. HMSI also utilizes the outreach of the Vera French Community Mental Health Clinic.\n\nLife Skills Classes\nRegularly scheduled small group classes provide opportunities for participants to acquire skills that will help them gain employment and strengthen their abilities.\n\nSupportive Services\n\nClothing Room\nAdult clothing is available free of charge on Mondays and Wednesdays from 9 AM until 11 AM. This is used clothing that has been donated from members of the community and sorted, sized and arranged by volunteers. Volunteer help is welcome each Monday and Wednesday to oversee the clothing distribution. Contact Shelter if youre available to assist.\n\nDonation Room\nWe organize and store donations of clothing and personal necessities that we have received from the community. This makes emergency assistance available on site for those in urgent need."
  },
  {
    "addressLine1": "100 Kirkwood Blvd",
    "city": "Davenport",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52801",
    "name": "The Salvation Army of The Quad Cities",
    "organization": "The Salvation Army of The Quad Cities",
    "phone": "(563) 324-4808",
    "website": "https://centralusa.salvationarmy.org/quadcities/",
    "description": "The Salvation Army Quad Cities Family Services provides homeless prevention and shelter services to families in Scott and Rock Island Counties"
  },
  {
    "addressLine1": "824 West 3rd Street",
    "city": "Davenport",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52802",
    "name": "King's Harvest Ministries Homeless Shelter - Cold Weather Shelter",
    "organization": "King's Harvest Ministries Homeless Shelter - Cold Weather Shelter",
    "phone": "(319) 800-4169",
    "website": "http://www.kingsharvest.net/",
    "description": "We are open every night From December 1 through April 15. Doors are open from 9 PM until 10 PM for check-in.\n\nWe serve a light meal at 9:15 PM each night. Guests must be checked in to eat.\n\nWe serve lunch on Wednesday and Friday from 12 PM to 1 PM.\nWe serve a weekly brunch on Saturday from 9 AM to 10 AM.Food Pantry - Kings Harvest is currently giving groceries to needy and homeless families twice a month.\nThe second and fourth Saturdays at 9:30am.\nThe monthly giveaway is open to the community the 2nd Saturday of the month from 8:30 till 10:00 a.m.Kings Harvest is able to provide toiletry items, jackets, socks and underwear, and bedding for those in need.Pet Food Distribution - 1st and 3rd Saturday from 9-10 am and Wednesday and Friday from 12-1 pm.King's Harvest Ministries Mission - To serve the poor and homeless in the Quad Cities.Providing for the community, by meeting their physical, emotional and spiritual needs.Showing them who Jesus is, through compassion, unconditional love and relationships."
  },
  {
    "addressLine1": "2209 3rd ave",
    "city": "Rock Island",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "61201",
    "name": "Christian Family Care Center",
    "organization": "Christian Family Care Center",
    "phone": "(309) 786-5734",
    "website": "http://www.christiancareqc.org/",
    "description": "We operate a 24/7 Crisis Hotline that primarily receives calls from those who are homeless, those in danger of being beaten or killed, and those contemplating suicide.\nIf you or someone you know is in any kind of danger, please don't hesitate to give us a call at 309.788.2273. We have resources readily available and will be able to assist you in any way that we can.\n\nWe have both a men's rescue mission providing meals, clothing, and housing as well as a women and children's domestic violence shelter.\n\nWe primarily provide care to residents of the Quad Cities, but we also have taken in individuals from other states and even other countries.\nWe serve:\nHomeless individuals\nVictims of Domestic Violence\nVictims of Sexual Assault\nChildren and Adolescents\nIndividuals struggling with mental illness\nMen and Women transitioning out of prison\nVeterans\n\nThe Rescue Mission provides shelter for homeless men. Our facility is an alcohol and drug free environment. Although many of our residents are recovering from substance abuse, not every man who stays with us is a drug addict or an alcoholic. Many of our men suffer from mental health issues, some are developmentally challenged, and some have recently been released from jail or prison. Many of our men have experienced hard times--loss of a job, health issues, divorce, etc. All are experiencing circumstances beyond their control and desperately want their lives to return to normal.\nResidents have access to skill-building groups, job searches, personal counseling, and case management. They can attend chapel services nightly, meditate daily and participate in Bible studies each week night.\n\nCommunity Meals\nWe provide three meals a day most days, not only for our residents but also for any hungry person who comes to our door. Last year we served well over 60,000 meals to the community.\nHere is our schedule:\nBreakfast: Daily at 6:30 a.m.\nLunch: Monday Friday at 12:15 p.m.\nDinner: Daily at 6:30 p.m."
  },
  {
    "addressLine1": "398 Main Street",
    "city": "Dubuque",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52004",
    "name": "Dubuque Rescue Mission",
    "organization": "Dubuque Rescue Mission",
    "phone": "(563) 583-1394",
    "website": "http://www.dbqrescue.org/",
    "description": ""
  },
  {
    "addressLine1": "1111 Bluff Street",
    "city": "Dubuque",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52001",
    "name": "Teresa Shelter",
    "organization": "Teresa Shelter",
    "phone": "(563) 690-0086",
    "website": "https://www.openingdoorsdbq.org/",
    "description": ""
  },
  {
    "addressLine1": "1561 Jackson Street",
    "city": "Dubuque",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52001",
    "name": "Maria House",
    "organization": "Maria House",
    "phone": "(563) 582-6286",
    "website": "https://www.openingdoorsdbq.org/maria-house/",
    "description": "Maria House offers transitional housing for up to two years. Women continue to work on goals, and build skills that empower them toward a goal of becoming self-sufficient. The Case Manager continues to guide and support clients."
  },
  {
    "addressLine1": "1592 Locust St",
    "city": "Dubuque",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52001",
    "name": "Hope House Catholic Worker",
    "organization": "Hope House Catholic Worker",
    "phone": "(563) 582-9079",
    "website": "https://www.catholicworker.org/",
    "description": ""
  },
  {
    "addressLine1": "1345 Water Street",
    "city": "Platteville",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "53818",
    "name": "Lutheran Church of Peace Emergency Homeless Shelter",
    "organization": "Lutheran Church of Peace Emergency Homeless Shelter",
    "phone": "(608) 348-9057",
    "website": "https://www.lutheranchurchofpeace.org/",
    "description": "Emergency Shelter for family with 2 or less children or singles"
  },
  {
    "addressLine1": "1021 1st Ave North",
    "city": "Fort Dodge",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50501",
    "name": "Beacon-Hope Men's Homeless",
    "organization": "Beacon-Hope Men's Homeless",
    "phone": "(515) 955-3366",
    "website": "https://beaconofhopeshelter.com/",
    "description": "At this time, they are able to house 40 to 52 men.\nThey house 40 men in our large dormitory, 8 beds in the Program dorms upstairs, and 4 overflow beds in our day room.\nThey provide a Christ Centered shelter that is open-minded, specializes in mental health, addiction recovery (program), and integrating those just out of prison but anyone is welcome.\n\n"
  },
  {
    "addressLine1": "307 N Monroe",
    "city": "Mason City",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50401",
    "name": "Northern Lights Emergency shelter",
    "organization": "Northern Lights Emergency shelter",
    "phone": "(641) 380-0047",
    "website": "http://northernlightsshelters.org/",
    "description": "This is an emergency shelter for men located in Mason City, Iowa.\n\n\n\nCounties We Serve\nCerro Gordo, Floyd, Franklin, Kossuth, Mitchell, Worth, Winnebago and Wright"
  },
  {
    "addressLine1": "Adams Ave and 2nd Street SW",
    "city": "Mason City",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50401",
    "name": "Salvation Army",
    "organization": "Salvation Army",
    "phone": "(641) 424-4031",
    "website": "https://centralusa.salvationarmy.org/western/masoncity",
    "description": ""
  },
  {
    "addressLine1": "311 N Monroe",
    "city": "Mason City ",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50401",
    "name": "Courage Hall",
    "organization": "Courage Hall",
    "phone": "(641) 380-0047",
    "website": "",
    "description": "Courage Hall is a shelter for Homeless Veterans"
  },
  {
    "addressLine1": "420 3rd St.",
    "city": "Mason City",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50401",
    "name": "Walters House",
    "organization": "Walters House",
    "phone": "(641) 380-0047",
    "website": "",
    "description": "Walters House is a Shelter for Homeless Men"
  },
  {
    "addressLine1": "202 1st Street NW",
    "city": "Mason City",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50401",
    "name": "New Beginnings House of Hope",
    "organization": "New Beginnings House of Hope",
    "phone": "(641) 423-5920",
    "website": "http://northernlightsshelters.org/shelters-for-women/",
    "description": ""
  },
  {
    "addressLine1": "2202 Stevens Street",
    "city": "Albert Lea",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "56007",
    "name": "Freeborn County Homeless Shelter",
    "organization": "Freeborn County Homeless Shelter",
    "phone": "(507) 373-1329",
    "website": "http://www.semcac.org/",
    "description": "The homeless shelter consists of three apartments adjoining Semcac's Freeborn County Contact Center in Albert Lea, MN. A case manager meets regularly with each shelter household, helping residents work toward stability, secure permanent housing and transition back into the community. The case manager works one-on-one with the household to develop a growth plan, improve financial literacy, and access other resources such as transportation, child care, job seeking skills, medical care, food and clothing. Residents may stay at the shelter for up to 90 days."
  },
  {
    "addressLine1": "409 1st Ave NE",
    "city": "Austin",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "55912",
    "name": "Salvation Army Austin Minnesota",
    "organization": "Salvation Army Austin Minnesota",
    "phone": "(507) 437-4566",
    "website": "http://salvationarmynorth.org/community/austin",
    "description": "The Salvation will provide short time housing assistance to people in crisis. Call for full details."
  },
  {
    "addressLine1": "312 Iowa Ave",
    "city": "Muscatine",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "52761",
    "name": "MCSA - Muscatine Center For Social Action",
    "organization": "MCSA - Muscatine Center For Social Action",
    "phone": "(563) 264-3278",
    "website": "http://www.mcsaiowa.org/",
    "description": "Office Hours of Operation\n\n\n\n\n\nMon-Fri 8 am-5 pm\n\nMCSA provides temporary shelter, basic health care, educational and vocational support services for those in need in Muscatine County while working to reduce these needs through long-term social change.\nTransitional Housing\nThe Transitional Family & Individual Housing Units provide a secure living space for women and children.\n\nThere are 9 private rooms available and accommodations can be made for any size family. Each unit includes 2 full size beds, bedding and pillows, towels, and basic supplies. Additional beds or cribs are available as needed.\n\n\nThe units share a large open living space, kitchenette, bathroom, and laundry.\n\nOvernight Housing\nOvernight housing is available for single men. At 9:00 pm each evening, our gymnasium converts into a sleeping space. The gym can accommodate up to 45 for sleeping each evening.\n\nGuests have a designated space within the gym, a mattress, bedding and pillows, towels, and basic supplies. A locker and tub are also assigned for storage of personal items.\n\nOvernight housing guests share a dining space, bathroom, and laundry.\n\nHours for rest are 10:00 pm until 5:30 am. Those staying in Overnight housing have specific hours that the MCSA campus is available to them for use.\n\n\nThis short-term overnight shelter is generally limited to a two-month period to enable guests to transition into on-site apartment living while securing an income source.\n\nThe following is also available to guests of MCSA:\n24 hour staffing assistance.\nEducational opportunities and support programs.\nGymnasium access.\nComputer lab access.\n\nCheck-in for Transitional and Overnight Housing is available:\nDaily from 6:00 am until 10:00 pm\nFor residents of Muscatine County. Identification will be requested at the time of check-in."
  },
  {
    "addressLine1": "415 Bluff St",
    "city": "Sioux City",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "51103",
    "name": "Sioux City Gospel Mission",
    "organization": "Sioux City Gospel Mission",
    "phone": "(712) 255-1119",
    "website": "",
    "description": "Women's and children's Christian based shelter."
  },
  {
    "addressLine1": "1307 Court St",
    "city": "Sioux City",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "51105",
    "name": "Warm Shelter",
    "organization": "Warm Shelter",
    "phone": "(712) 274-1610",
    "website": "mailto:jlogan@caasiouxland.org",
    "description": "The Welcome Home Program is an innovative initiative that combines transitional housing and outreach services to get homeless families in Siouxland off the streets as soon as possible. Our mission is to give them first a safe, furnished place to live, clothing and food; but most importantly a chance to work one-on-one with a family development specialist so they can obtain permanent housing and self-sufficiency. The Welcome Home program has been developed by an Advisory Board. A goal of this program is to address any barriers families may have that contributed to their homelessness. Families that are homeless often have many barriers including: mental health, substance abuse issues, disabilities, transportation, and lack of knowledge about available services. The Family Specialist will help identify and overcome those barriers by forging a relationship with the family and providing intensive support. In the past year the program has assisted 25 families; 72 individuals with a place to live while they worked to find permanent housing."
  },
  {
    "addressLine1": "916 Nebraska Street",
    "city": "Sioux City",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "51105",
    "name": "The Warming Shelter Sioux City",
    "organization": "The Warming Shelter Sioux City",
    "phone": "(712) 255-0084",
    "website": "mailto:Lebowich.j@gmail.com",
    "description": "Hours:  4pm to 8am daily from Nov 1 to April 30\n\nThe Warming Shelter seeks to provide temporary emergency shelter for men, women, and families who have no other shelter options in the Siouxland Area. All services and assistance are offered in context of the furtherance of human dignity with the primary goal of harm reduction during the coldest weather months.\n\nThe Warming Shelter provides a dormitory style shelter facility for men, woman, and families in the greater Siouxland area. Located near the Siouxland Community Health Center and District Health.\n916 Nebraska Street."
  },
  {
    "addressLine1": "1308 Nebraska Street",
    "city": "Sioux City",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "51105",
    "name": "Shesler Hall Transitional Housing For Women",
    "organization": "Shesler Hall Transitional Housing For Women",
    "phone": "(712) 258-8059",
    "website": "http://www.sheslerhall.com/",
    "description": ""
  },
  {
    "addressLine1": "412 E. 4th Street",
    "city": "Yankton",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "57078",
    "name": "Pathways Shelter for the Homeless",
    "organization": "Pathways Shelter for the Homeless",
    "phone": "(605) 665-8994",
    "website": "https://www.yanktonpathways.org/",
    "description": "Hours\nIntakes are performed Monday through Friday, 8:00am-4:00pm.\n\n\nPathways offers emergency shelter to individuals and families experiencing homelessness within a 60 mile radius of Yankton. While in shelter, clients are given food, clothing, toiletries and other basic necessities free of charge. We offer shelter for a period of 2 weeks to 30 days, depending on the situation.\n\n\nDuring the intake process, staff will work with clients to develop achievable goals towards getting back on their feet. Life skills training will be provided to clients lacking skills in a certain area.\n\nGuidelines for Emergency Shelter\n    Individuals must be age 18 or older. Individuals under the age of 18 must be accompanied by a parent or guardian\n    Adults seeking shelter must receive a background check from the Yankton Police Department and have it printed at the Clerk of Courts. The background check must then be given to Pathways staff.\n    Intakes are performed Monday through Friday, 8:00am-4:00pm.\n\nBarriers from Pathways\n    Must have no active warrants or pending charges.\n    Must not be on the sex offender registry.\n    Must be located within a 60-mile radius of Yankton. Pathways is not set up to be a relocation service or transitional housing."
  },
  {
    "addressLine1": "216 Logan Ave",
    "city": "Waterloo",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50703",
    "name": "Salvation Army Women and Children Lodge",
    "organization": "Salvation Army Women and Children Lodge",
    "phone": "(319) 232-0397",
    "website": "",
    "description": "Women's and children's shelter."
  },
  {
    "addressLine1": "222 Logan Ave",
    "city": "Waterloo",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50703",
    "name": "Salvation Army Men's Lodge",
    "organization": "Salvation Army Men's Lodge",
    "phone": "(319) 236-2263",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "1003 Mulberry St.",
    "city": "WATERLOO",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50703",
    "name": "Cedar Valley Hospitality House",
    "organization": "Cedar Valley Hospitality House",
    "phone": "(319) 234-1311",
    "website": "http://www.cvhospitalityhouse.net/",
    "description": ""
  },
  {
    "addressLine1": "1003 Mulberry St",
    "city": "Waterloo ",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50703",
    "name": "Hospitality House",
    "organization": "Hospitality House",
    "phone": "(319) 234-1311",
    "website": "mailto:cvhospitalityhouse@hotmail.com",
    "description": "Daytime shelter open 9am til 4pm daily including weekends.\nLunch served daily."
  },
  {
    "addressLine1": "420 16th St. NW",
    "city": "Waverly",
    "state": "Iowa",
    "stateAbbreviation": "IA",
    "postal": "50677",
    "name": "LZ Phoenix",
    "organization": "LZ Phoenix",
    "phone": "(515) 999-5699",
    "website": "http://www.rallypointcvv.org/",
    "description": "Rally Point Cedar Valley Veterans was first envisioned several years ago when members of the local Veterans Affairs office noticed an inordinate number of veterans without the tools necessary to find safe, sustainable housing. Little was acted upon at the time since funding for such a project would be fraught with barriers raised by government officials.However, in November, 2014, Waverly Homes offered us use to one of their newly purchased properties at NO COST!\n\nThe only expenses would be the day to day operations of such a vision and the Veterans Affairs staff immediately began garnering support for the project through our elected officials and the residents who elected them.After nearly ten months, the county denied the project and the Veterans Affairs staff, along with community organizers, scrambled to make the project a reality, through a nonprofit, 501(c)(3) entity. Within a month, Articles of Incorporation were submitted and the required documentation through the Internal Revenue Service were completed.Alas, Rally Point Cedar Valley Veterans and its homeless and transitional shelter, LZ Phoenix, were born. In mid-September, the shelter opened its doors and our first residents began to move in!!!\n\n\nAt present, the shelter is funded by private donations and organizations are requested to sponsor their active duty service member or veteran by making a $10 donation, per day, for the families housed. Whether there are five members of the family or one, the $10 donation will cover the costs associated with their stay.\n\nEligibility\n    Applicants must be active duty service members or veterans who have received a discharge other than dishonorable.\n    All applicants are approved on a case-by-case basis.\n    Due to the proximity of schools, applicants may NOT be registered on ANY sex offender list.\n    The active duty service member or veteran must be the primary applicant, not a family member.\n    Applicants and their party must agree to abide by all guidelines, fully participate in all program activities, and refrain from any inappropriate activity\n\n    Applicants and their party must be coherent and detoxified with at least seventy-two hours since their last use of alcohol or drugs\n    Applicants and their party must be mentally and physically able to exercise proper personal hygiene and self-care, perform task assignments, and participate in all program functions within a non-medical, non-psychiatric facility.\n    Applicants and their party must be employed full-time or have an equivalent combination of job search, educational development, and/or volunteer hours within the community\nApplication & Supporting Documentation\nThe following application needs to be completed by either the veteran, agency or via phone with Rally Point CVV. Our application form provides a more complete picture of the service member, veteran and/or his or her family and it can more quickly be completed via phone with Rally Point CVV staff.\nThe following items must be included in the application and can be emailed via our SECURE UPLOAD PAGE:\n    Valid Picture Identification (Driver's License, Student ID, State-Issued ID Card, etc.)\n    Social Security Card (We may require Social Security Cards on each member of the household)\n    Income Verification for all Household Members (Not just those related to you)\n    Reporting of Assets for all Household Members (Not just those related to you)\n    Bank & Investment Statements for all Household Members (Last three months)"
  }
]