[
  {
    "addressLine1": "103 S. Eisenhower Drive",
    "city": "Beckley",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25801",
    "name": "RCCAA Emergency Housing Center",
    "organization": "RCCAA Emergency Housing Center",
    "phone": "(304) 255-9124",
    "website": "https://www.rccaa.org/emergency-housing-center",
    "description": ""
  },
  {
    "addressLine1": "42 Cherry Street",
    "city": "Daniels",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25832",
    "name": "Exceptional Youth Emergency Shelter (EYES)",
    "organization": "Exceptional Youth Emergency Shelter (EYES)",
    "phone": "(304) 255-0408",
    "website": "http://www.childhswv.org/about/locations/the-southern-west-virginia-exceptional-youth-emergency-shel",
    "description": "Provides respite care to youth with disabilities and their families. EYES accepts youth who are WV residents age 718, with an IQ below 70, for placement in emergency shelter care from the WVDHHR, law enforcement agencies, parents, legal guardians, or caregivers."
  },
  {
    "addressLine1": "2203 Bluefield Avenue",
    "city": "Bluefield",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "24701",
    "name": "Bluefield Union Mission",
    "organization": "Bluefield Union Mission",
    "phone": "",
    "website": "https://twitter.com/union_mission",
    "description": "Bluefield Union Mission is a food pantry. Serves Mercer County, Bland County, Buchanan County &Tazewell County\n\nFood pantry service hours: Mondays through Fridays 9:00am -4:00pm. .\n\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "505 Leon Sullivan Way",
    "city": "Charleston",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25301",
    "name": "Roark-Sullivan Lifeway Center - Giltinan Center",
    "organization": "Roark-Sullivan Lifeway Center - Giltinan Center",
    "phone": "(304) 340-3581",
    "website": "https://www.roarksullivan.com/",
    "description": "60 bed all male homeless facility that provides supportive services, housing, mental health and substance abuse, health care, aftercare and more.\nThe Giltinan Center (GC) is a 60 bed emergency homeless facility for adult men.  With the guidance and assistance of case managers, residential coordinators, peer counselors, and direct service staff, clients strive to establish personal goals, find employment, save money, and find suitable. safe and stable permanent housing. \n\n\nServices\nSupport, Hope, Advocacy, Personal Responsibility - Education (SHAPE)\nSHAPE is a SAMHSA grant in which RSLC partners with Prestera Center for Mental Health Services. This program provides supportive services to individuals and families in Charleston and Huntington who are chronically homeless. A team of four support staff in each city offers supportive housing services to assist individuals served with obtaining and maintaining safe affordable housing. Additional services consist of case management, in home therapy, housing support services, peer support, transportation, employment assistance and help with activities of daily living.\n\nResident Healthcare Program\nRSLC's Healthcare Program employees Nursing Staff on-site to assist individuals with medication monitoring, health education, basic health screenings, health promotion and maintenance to hundreds of individuals a year. This project not only serves individuals within RSLC facilities, but also serves individuals through extensive street and community outreach to other areas in which individuals experiencing homelessness are known to frequent.\n\nPeer 2 Peer Project\nThis project uses peer specialists who are formerly homeless individuals in recovery from substance abuse and/or mental health issues and have gone through intensive training to engage residents to face their own obstacles. This project is a huge success, as the specialists can truly say 'I understand' and assist those  that the RSLC provides services for in an approach that other staff may not be able to deliver given their own experience.\n\nProjects to Assist in Transition from Homelessness (PATH)\n\nThe PATH Project supports individuals with a mental illness and/or substance abuse issues gain access to treatment, achieve psychiatric stabilization and acquire housing.  This project supports individuals by offering supportive counseling to those living in all RSLC programs and those receiving aftercare services. This program provides for a more specialized focus for individuals in need of specific mental health and substance services.\nOutreach Program\nRSLC maintains a coordinated outreach effort in the Kanawha Valley. Outreach occurs on a routine basis with teams of staff frequenting local soup kitchens, bridges and other areas where individuals are known to reside that have no permanent residence. Information is given to individuals as well as food, beverages, etc. Given the weather (hot or cold), other items of need may be handed out. Individuals are offered shelter and transported if necessary.\nVeterans Program\nMany individuals that are served by RSLC are Veterans that are experiencing homelessness. The RSLC Veterans Program provides a Service Center component that focuses on Veteran specific issues. The Veterans Administration is on-site providing benefit assistance, eligibility, etc. to any Veteran in the community in need of services.  Many other services are available to Veterans such as: individual and group sessions, case management, transportation, mental health and substance abuse support services and on-site therapy provided by a Clinical Therapist, as well as, a variety of community organizations that provide additional on-site services to our Veterans.\nBridging the Gap (Aftercare)\nThis program supports individuals with a mental illness and/or substance abuse issues as they gain independence in the community. As individuals move out of our programs into the community, an Aftercare Specialist assists individuals with budgeting, medication monitoring, grocery shopping, transportation and maintaining social connections and resources to prevent isolation. This program has proven successful year after year in reducing the recidivism rate of individuals returning back to the shelter.\nLife Skills Program\nRSLC, across all programs, understands the importance of not only just providing a safe place to lay your head at night and a warm meal, but the importance of providing quality classes geared to assist individuals to move to self-sufficiency and into the community.  A central part of RSLC programming is life skills groups that are offered at all sites. These are groups that occur throughout the week during the day and evening that assist individuals in the following areas: Money Management, Employment Education, Addiction and Recovery Issues, Healthcare 101, IMR (Illness Management and Recovery Groups), Community Supports and Veterans Computer Classes.\n\nSupportive Services Project\nThe Supportive Services Project is a collaborative program with three other local providers of homeless services in the area. This project provides comprehensive case management and supportive services to those living on the streets and in the shelters.  This project is aimed to work with individuals where they are and provide services that will support them as they become self-sufficient.\n\n\n\n\n\n\n"
  },
  {
    "addressLine1": "700 South Park Road",
    "city": "Charleston",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25304",
    "name": "Brookside Women and Children Center",
    "organization": "Brookside Women and Children Center",
    "phone": "(304) 925-0366",
    "website": "http://unionmission.com/brookside-women-and-children-center/",
    "description": "The Brookside Womens and Childrens Center is a residential program for young, at-risk and abused single mothers and their children, as well as expectant single mothers. The driving mission behind Brookside is to share the love of Christ with these hurting women and children in every aspect of Union Missions ministry to them. The Womens and Childrens Center consists of three programs:\n    Nourished Hearts Emergency Shelter\n    This program is designed to meet the emergency housing and nourishment needs of single-mother families who find themselves in need of shelter, whether because they have lost their housing or are escaping a dangerous or abusive situation. No commitment is required of the families sheltered. The campus provides a haven of safety and security while our staff works compassionately with the mother to remedy the circumstances which brought her to us.\n    Cornerstone Maternity Home\n    The maternity home is a refuge for single mothers-to-be in need of love and support. We want to encourage and enable each of these young women to choose life for the unborn baby she carries. Staff will offer encouragement and comfort throughout the pregnancy and during the difficult months that follow it. During her stay, the expectant mother will also have access to the same life management skills training used in the Grace Home.\n    Grace Home\n    This is a long-term transitional living program with a strong focus on development of life management skills. Mothers who are ready to take steps toward positive change will be encouraged to enroll. Staff will work with each family to develop a \"life plan,\" with which the mother and her children will agree. This plan of action will incorporate counseling and training drawn from our life management skills curriculum. Training offered will enable mothers to develop physically, spiritually, emotionally, and socially."
  },
  {
    "addressLine1": "700 South Park Road",
    "city": "Charleston",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25321",
    "name": "Union Mission Crossroads Men’s Shelter",
    "organization": "Union Mission Crossroads Men’s Shelter",
    "phone": "(304) 925-0366",
    "website": "http://unionmission.com/crossroads-mens-shelter/",
    "description": "The Crossroads Homeless Shelter provides service to the homeless and hurting every hour of the day, year-round. It provides between 150 and 200 meals per day, and it has a maximum lodging capacity of 76. The men who come to Crossroads do so knowing their physical needs will be met; the staff and chaplains of the shelter, while meeting these physical needs, also tend to the spiritual needs in a practical way.\nEmergency shelter is offered as a refuge to men needing temporary housing. Residents receive three hot meals every day, as well as a hot shower, clean clothes and pajamas, fresh toiletries, and a clean bed. The shelter is open throughout the day, and residents are welcome to access the facility whenever they wish (except during the daily cleaning). If after a short initial period a transient decides to make the shelter his home, he must commit to finding a steady job. Residents are attributed the dignity they deserve as human beings, but they are also kept accountable for the management of their time and money.\n\nResidents are also encouraged daily in their spiritual walk. Chapel services are held every morning and evening, with a special service on Sunday morning. The nightly speakers come from all around the area, providing variety. Every speaker is doctrinally sound, and each message includes a challenge to focus on a personal relationship with Jesus Christ. Many men have come to know Jesus Christ as Lord and Savior as a result. Outside of chapel times, the dir"
  },
  {
    "addressLine1": "505 Leon Sullivan Way",
    "city": "Charleston",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25301",
    "name": "Roark-Sullivan Lifeway Center - Veterans Program",
    "organization": "Roark-Sullivan Lifeway Center - Veterans Program",
    "phone": "(304) 720-3215",
    "website": "http://rslwc.org/",
    "description": "12 bed all male veterans transitional living program combined with intensive case management support.\n\nMany individuals that are served by RSLC are Veterans that are experiencing homelessness. The RSLC Veterans Program provides a Service Center component that focuses on Veteran specific issues. The Veterans Administration is on-site providing benefit assistance, eligibility, etc. to any Veteran in the community in need of services.  Many other services are available to Veterans such as: individual and group sessions, case management, transportation, mental health and substance abuse support services and on-site therapy provided by a Clinical Therapist, as well as, a variety of community organizations that provide additional on-site services to our Veterans."
  },
  {
    "addressLine1": "609 Shrewsbury Street",
    "city": "Charleston",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25301",
    "name": "Roark-Sullivan Lifeway Center - Liberty Center",
    "organization": "Roark-Sullivan Lifeway Center - Liberty Center",
    "phone": "(304) 414-3114",
    "website": "https://www.roarksullivan.com/",
    "description": "4 bed transitional program for individuals referred from prisons to reintegrate back into the community successfully."
  },
  {
    "addressLine1": "1418 Washington Street East",
    "city": "Charleston",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25301",
    "name": "YWCA Sojourner’s Shelter for Homeless Women and Families",
    "organization": "YWCA Sojourner’s Shelter for Homeless Women and Families",
    "phone": "(304) 340-3562",
    "website": "https://www.ywcacharleston.org/sojourners",
    "description": "Business offices hours: Monday - Friday 8:30am - 5:00pm.\n\nProvides emergency shelter and supportive services around the clock, every day of the year for homeless single women, women with children, men with custody of their children and intact families. This 75-bed facility offers a secure, healthy environment with crisis intervention, case management and counseling to help individuals achieve long-term self-sufficiency. We maintain a successful recidivism rate of about five (5) percent annually, well below the national average of individuals returning to shelters. Childrens programs include computer and art classes, tutoring, drug-free education, supportive counseling and field trips. Recovering from and preventing future homelessness is our goal for all who take shelter with us.\n "
  },
  {
    "addressLine1": "1704 Washington Street",
    "city": "Charleston ",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25311",
    "name": "Harvest Time",
    "organization": "Harvest Time",
    "phone": "(304) 343-9332",
    "website": "http://www.harvesttimewv.org/",
    "description": "This Shelter for Homeless Men. Halfway House for men.We serve Two meals a day. We do food baskets ones a monthto community."
  },
  {
    "addressLine1": "5257 Big Tyler Rd",
    "city": "Cross Lanes",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25313",
    "name": "Safe sanctuary",
    "organization": "Safe sanctuary",
    "phone": "(304) 721-3358",
    "website": "https://www.safesanctuarywv.com/",
    "description": "Homeless Veterans shelter.\nWe are a 20 bed facility located here in cross lanes wv , totally non profit, totally for homeless veterans"
  },
  {
    "addressLine1": "100 MacCorkle Avenue",
    "city": "Saint Albans",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25177",
    "name": "Roark-sullivan - Twin Cities Center - Lifeway Center",
    "organization": "Roark-sullivan - Twin Cities Center - Lifeway Center",
    "phone": "(304) 727-6179",
    "website": "https://www.roarksullivan.com/",
    "description": "16 male and female permanent housing program for individuals that are chronically homeless with a persistent mental health/substance abuse issue."
  },
  {
    "addressLine1": "938 S. Davis Avenue",
    "city": "Elkins",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "26241",
    "name": "Randolph County Homeless Shelter",
    "organization": "Randolph County Homeless Shelter",
    "phone": "(304) 636-5193",
    "website": "http://www.ncwvcaa.org/",
    "description": "Homeless Services and Prevention is provided by North Central WV Community Action. The shelter facilities are committed to providing a safe, sanitary, and cost-effective means of sheltering individuals and families who have little or no means of support."
  },
  {
    "addressLine1": "107 Jefferson Street",
    "city": "Fairmont",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "26554",
    "name": "Union Mission of Fairmont",
    "organization": "Union Mission of Fairmont",
    "phone": "(304) 363-0300",
    "website": "https://wvrescue.org/",
    "description": ""
  },
  {
    "addressLine1": "215 Scott Place",
    "city": "Fairmont",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "26554",
    "name": "Scott Place Shelter",
    "organization": "Scott Place Shelter",
    "phone": "(304) 366-6543",
    "website": "http://www.ncwvcaa.org/",
    "description": "Committed to providing a safe, sanitary, and cost-effective means of sheltering individuals and families who have little or no means of support.\n\nIndividuals and families at the shelter receives one-on-one case management services beginning with a needs assessment. Social service requirements and related obstacles to housing are processed in a comprehensive effort designed to assist participants in combating their homelessness. Upon admittance, guests are required to create a mutually agreed upon case plan that includes several health, training, education, employment and money management strategies."
  },
  {
    "addressLine1": "1110 University Ave",
    "city": "Morgantown",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "26505",
    "name": "Bartlett House",
    "organization": "Bartlett House",
    "phone": "(304) 292-0101",
    "website": "http://www.bartletthouse.org/",
    "description": "Provides for emergency food, shelter and medical referrals first, then one-to-one comprehensive case management to break the cycle of homelessness.\n\nBartlett House is providing our Programs and Eligibility Reference Sheet:\n\n1. The emergency shelter located on University Avenue.\n2. Nitor Transitional Housing Suites located at West Run.\n\n3. Nitor Permanent Supportive Housing Aparments located at West Run.\n4. Nitor Affordable Housing Apartments located at West Run.\n5. Rapid Rehousing program\n\nHomeless clients of the Resident Shelter Program receive comprehensive case management and set up a Service Plan with an individual case manager to address pertinent issues of joblessness, parenting, domestic violence, health, low income housing, financial dependency and other impediments to independent living.\n\nWe frequently assist people in connecting them with resources to obtain Supplemental Security Income, Temporary Assistance to Individuals and Families (TANF), Food Stamps, Emergency Assistance, Veterans Benefits, Job Training, Vocational Rehabilitation, Alcohol and Drug Abuse Treatment, Marriage and Family Counseling, HUD Subsidized Housing, Clothing and Transportation. Clients in the Resident Shelter Program are required to save 80% of their income, seek employment (if able) or apply for benefits and remain drug and alcohol free. The goal of the Resident Shelter Program is to provide transitional housing (up to 6 months) for clients experiencing difficulties while promoting self-sufficiency."
  },
  {
    "addressLine1": "P.O. Box 403",
    "city": "Huntington",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25708",
    "name": "Branches Domestic Violence Shelter",
    "organization": "Branches Domestic Violence Shelter",
    "phone": "(304) 529-2382",
    "website": "http://branchesdvs.org/",
    "description": "Victims of domestic violence. Food shelter clothing and counseling provided.\n\nAdvocates are available to talk to victims or anyone calling on their behalf 24 hours a day, 7 days a week.\n\nWe provide:\nCrisis intervention\nSafety planning\nInformation\nReferrals to community resources\nEmergency shelter services\n\nShelter services include:\nCase management\nIndividual & group counseling\n24-hour hotline\nCommunity referrals\nlegal advocacy\nSafety planning\n\nAll services are free of charge.\n\n"
  },
  {
    "addressLine1": "624 10th Street",
    "city": "Huntington",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25701",
    "name": "Huntington City Mission",
    "organization": "Huntington City Mission",
    "phone": "(304) 523-0293",
    "website": "https://www.huntingtoncitymission.org/",
    "description": "Services\nEmergency Shelter\nFood Kitchen\nProject Hope\nSpiritual and Counseling\nAdult Education\nSummer Camp\n\nClients who participate in the services of The Huntington City Mission receive food, clothing and shelter under the conditions of the Mission policy. Opportunities for personal improvement in basic education, spiritual life counseling (upon request) and case management services are available to all men and women in our care. An admission and intake process to properly track clients utilizing Mission provides consistency in services rendered in-house and in the community is required for entry and is mandatory.\nZero tolerance for substance abuse is maintained throughout Mission. All clients are required to declare all medications during admission.\n\nOur mens department dorms are divided into the transient dorm, a case management dorm and the Transformers Dorm (a spiritual life dorm for those men in our spiritual life programs). Entry into the dorms is based upon specific requirements based upon Mission policy.\nOur Women & Family Care dorms are divided into the Observation Area, Single Female Dorm (4 rooms with 18 beds) and the Family Dorm (14 rooms). Entry into the dorms is based upon specific requirements based upon Mission policy."
  },
  {
    "addressLine1": "118 Stratton St",
    "city": "Logan",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25601",
    "name": "Under The Bridge Community Outreach",
    "organization": "Under The Bridge Community Outreach",
    "phone": "(304) 896-5056",
    "website": "mailto:UTBM@yahoo.com",
    "description": "Open 24/7 everyone is welcome. We offer hot meals, hot shower and a warm place to sleep! We're open 24/7"
  },
  {
    "addressLine1": "173 Redale Road",
    "city": "Pikeville",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "41501",
    "name": "WestCare Emergency Shelter",
    "organization": "WestCare Emergency Shelter",
    "phone": "(606) 432-9442",
    "website": "https://www.westcare.com/",
    "description": "Emergency Homeless Shelter.\n\nProvides housing, substance abuse services and independent living skills for the homeless.\nWarming Station\nDuring cold weather times, shelter opens its doors for anyone who needs to stay warm or have a shower.\nFrom 7am to 7pm if temps drop below 32 degrees.\n\n"
  },
  {
    "addressLine1": "152 Douglas Parkway",
    "city": "Pikeville ",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "41501",
    "name": "Veterans Transitional Housing Center",
    "organization": "Veterans Transitional Housing Center",
    "phone": "(606) 639-3178",
    "website": "http://www.mtcomp.org/",
    "description": ""
  },
  {
    "addressLine1": "644 Kentucky Highway 122",
    "city": "Martin",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "41649",
    "name": "East Kentucky House of Hope",
    "organization": "East Kentucky House of Hope",
    "phone": "(606) 949-2018",
    "website": "https://ekyhouseofhope.com/",
    "description": ""
  },
  {
    "addressLine1": "216 E John St",
    "city": "Martinsburg",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25401",
    "name": "Community Networks Inc. - Bethany House",
    "organization": "Community Networks Inc. - Bethany House",
    "phone": "(304) 263-3510",
    "website": "https://www.facebook.com/CommunityNetworksInc/",
    "description": ""
  },
  {
    "addressLine1": "236 W. Martin Street",
    "city": "Martinsburg",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25402",
    "name": "Berkeley County Outreach Office",
    "organization": "Berkeley County Outreach Office",
    "phone": "(304) 263-8522",
    "website": "https://epecwv.org/",
    "description": "24 hour hotline: 304.263.8292\n\nIf you think you are in an abusive relationship, need emergency shelter because of your violent partner or have been sexually assaulted, you can call EPEC 24 hours a day, 7 days a week, 365 days a year. Our hotline is completely confidential. You do not have to give your name to the operator if you don't want to."
  },
  {
    "addressLine1": "608 W. King St",
    "city": "Martinsburg",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25401",
    "name": "Martinsburg Union Rescue Mission",
    "organization": "Martinsburg Union Rescue Mission",
    "phone": "(304) 263-6901",
    "website": "http://www.martinsburgrescuemission.com/",
    "description": "The Rescue Mission currently operates a guest shelter and four residential rehabilitation programs. Our current facilities have the capacity to provide shelter for up to 78 men.\n\nGuest Shelter Program: provides emergency and short-term shelter, food and clothing to adult males. Needs evaluation counseling is conducted within three days of a new man's arrival. A TB/Health check is required within seven days. Guest length of stay is limited to seven days per calendar month and a total of twenty-eight days per calendar year. After assessing a new man's needs, he may be referred to an alternative community program or organization. These include, but are not limited to Eastridge Health Systems, Veteran's Administration, Telemon, Department of Health and Human Resources, Congregational Cooperative Action Program, Red Cross, Shalom Resource Center and Salvation Army. During the 7-day period men may receive job search assistance through access to Mission telephones, computers, and the Internet. Resume preparation assistance is available.\n \nResidential Programs\n \nSupport-Rehab Program is the core mission program that new men enter into. It is a Christ-centered approach to recovery, whether suffering from drug or alcohol addiction, mental illness, or any number of other difficulties. Through the daily practice of Christian teachings, prayer, non-denominational chapel services, scripture study, and one-on-one spiritual counseling with staff and senior program participants, individuals begin to transform their lives, turning it over to a power greater than themselves. The core program brings structure and order to the men's lives through required daily routines: prayer, shared meals, personal hygiene, work, and chapel service attendance.\n \nThis regular structure and required labor helps restore dignity. It boosts self-esteem and self-confidence in participants by building a healthy work ethic, job skills, teamwork, problem solving skills, and leadership skills. A strict, no-tolerance-for-drugs-and-alcohol environment is maintained. Social skills are developed through peer and community interaction. Participation in church, social, and civic groups is strongly encouraged. If needed, involvement with Alcoholics Anonymous and similar groups are encouraged. Participants can avail themselves of life skills training, conducted by partner organizations on topics like household budget preparation and management, meal preparation, grocery shopping, apartment rental, and proper health care. They may also complete GED requirements while in the rehab program if desired.\n\n \nA staff employee provides individualized counseling to help participants obtain qualifying social service benefits, job skill training, permanent housing, GED assistance, and employment opportunities, so participants can return to productive lives in the community.\n \nJob assignments for participants in the Support-Rehab Program include warehouse helpers, who assist with the recycling program; cook helpers, who assist with preparing and serving meals; housekeepers, who clean and perform light building maintenance; driver's assistants, who help with community donation pick-ups and store deliveries; and grounds maintenance workers, who care for the mission's grounds.\n \nJob-Training Program is available to those who desire to continue their education. These residents are required to participate in the Mission's core recovery program while attending classes at a post secondary educational facility in the community.\n\n \nCommunity-Employment Program is a halfway program that allows men to reside at the Mission while employed in the community. Employment may be full-time or a combination of part-time in the community and part-time at the Mission. These men are also required to participate in the Mission's core recovery program.\n \nPermanent-Supportive-Housing Program is designed to allow men to continue in the Mission's core recovery program while providing avenues for increased responsibility and authority. A participant in this program assumes a residential staff position in administration, food services, housekeeping, transportation, store operations or facilities and grounds maintenance.\n \nIn return the men are provided room, board, clothing, toiletries, and a small weekly stipend. Participants in this program have found that they need the daily supportive structure of the mission to maintain their sobriety and live productive lives. Many of these men have no family support and are ineligible for social services or health care programs.  The mission is their home and their family support.\n \nNon-Residential Programs\n \nClothing, Emergency Food, Emergency Furniture Program: serves the needs of community families and individuals.  It is available to anyone in need. Three meals are served at the mission daily, of which families or individuals may partake without cost. Additionally, families and individuals can receive free monthly vouchers to shop for clothing in the mission's thrift store. Free food boxes and furniture are also available to families or individuals on an emergency basis when referred by churches or local aid-assistance organizations. Hundreds of families are served each year.\n"
  },
  {
    "addressLine1": "116 W. Baltimore Street",
    "city": "Hagerstown",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "21740",
    "name": "CASA: Citizens Assisting and Sheltering the Abused",
    "organization": "CASA: Citizens Assisting and Sheltering the Abused",
    "phone": "(301) 739-4990",
    "website": "http://www.casainc.org/",
    "description": "For battered/homeless women & their children. Emergency shelter. Meals, Counseling. Case management, Employment assistance. Support group. 301-739-8975 (CASA Hotline). TDD - 301-739-8975"
  },
  {
    "addressLine1": "117 Summit Ave",
    "city": "Hagerstown",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "21740",
    "name": "Washington County Community Action Council, Inc",
    "organization": "Washington County Community Action Council, Inc",
    "phone": "301-797-4161",
    "website": "https://www.wccac.org/",
    "description": "Emergency shelter (for families).\nAdditional Services:\nFinancial assistance\nFood\nCase management\nRental allowance program\nHeating & electric bill assistance\n"
  },
  {
    "addressLine1": "534 W. Franklin Street",
    "city": "Hagerstown",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "21740",
    "name": "Salvation Army - Hagerstown",
    "organization": "Salvation Army - Hagerstown",
    "phone": "(301) 733-2440",
    "website": "https://www.facebook.com/SalvationArmyUSA",
    "description": "Emergency and transitional shelter. Meals, Counseling"
  },
  {
    "addressLine1": "140 West Franklin Street, Suite 300",
    "city": "Hagerstown",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "21740",
    "name": "REACH of Washington County",
    "organization": "REACH of Washington County",
    "phone": "(301) 733-2371",
    "website": "http://www.reachcaregivers.org/",
    "description": "REACH assists the often forgotten members of our community...the poor and homeless through the following programs:\n\nCrisis Intervention\nSummer Hours: Mon-Thur, 9am-1pm\nMon - Shower and Laundry for the homeless\nTue/Thur - Crisis Intervention for county residentsVolunteers provide assistance to those facing housing and utility emergencies as well as other basic needs. Program includes 24-hour emergency shelter assistance.\n\nCold Weather Shelter\nProvides homeless adults a safe shelter of last resort to avoid the risk of death or bodily harm from hypothermia. Operates from the last Sunday of October to the first Sunday of April each year."
  },
  {
    "addressLine1": "125 N. Prospect Street",
    "city": "Hagerstown",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "21740",
    "name": "The Hope Center at Hagerstown Rescue Mission",
    "organization": "The Hope Center at Hagerstown Rescue Mission",
    "phone": "(301) 739-1165",
    "website": "https://www.hagerstownhopecenter.com/",
    "description": "Hours: 24 hours a day, 365 days a year.\n\nShelter for men only.\n\nAt this time we do not have enough space to accomodate day guests.  In addition, we encourage people staying here to be out and about looking for work and actively working their way out of homelessness.\n\nDue to limited space we currently have no place to store your belongings. We recommend that you come with the minimum amount you can get along with. Hopefully this will fit in a backpack that you can take with you.\n\n\nWhile a guest at The Hope Center you are provided three free meals a day. This allows you to save your money towards your future housing needs. In addition to The Hope Center, there are a few other places that serve meals.\n\nDo you allow people to come there from jail, prison or on parole?\nYes, we know that many people being released have no where to go and we, like Jesus, do not discrimate due to your past. If you are on parole from another county, we will ask you to communicate with your current agent and have them seek a transfer before coming.\n\n\nCan I bring a vehicle?\nYou may bring your vehicle and park it here overnight but it must be off property during the day. If you have a special circumstance you may request a short term exception.\n\n\nDo you have private rooms?\nUnfortunately due to space limitations we do not. Overnight guests sleep in an open area and mattresses are given out each night.\n\nHow long can I stay?\nGuests are allowed to stay for up to thirty (30) days if they follow our rules. Futhermore, if they follow the rules they may request two (2) one week extensions. However, if you are professionally homeless it will be up to the discretion of the evening chaplains if they will grant any of these extensions. Simply put they are not a right.\n\n\nWhat about in the winter months?\nIn the winter the stay can be longer but we still encourage everyone to seek long term work and housing during their stay.\n\nDo I have to attend religious services?\nYes, there is a ten (10) minute devotional before Soup Line (lunch) and an hour long service before the evening meal. Refusal to attend will cause you to miss a meal or even lose the privilege of staying."
  },
  {
    "addressLine1": "1725 Latrobe St",
    "city": "Parkersburg",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "26101",
    "name": "Latrobe Street Mission",
    "organization": "Latrobe Street Mission",
    "phone": "(859) 443-0735",
    "website": "https://www.latrobestreetmission.org/",
    "description": "The Latrobe Street Mission offers emergency housing to anyone in need. There is no minimum or maximum length of stay.\n\nIf you need a place to stay, please come to the Mission between 4-6 pm. If you can NOT come between 4 to 6 pm, come through the glass double doors on the parking lot side of Latrobe. Come to the front desk and ask for Brenda.\n\nResident Schedule\nWake-up: 7:00 am\nBreakfast: 7:15 am\nMorning Devotional: 8:00 to 8:15 am\nCheck-out: 8:30 am\nCheck-in: 4:00 to 6:00 pm\nShowers: 4:30 to 5:30 pm\nFamily showers: 5:30  to 6:30 pm\nOther showers: 6:30 to 9:00 pm\nQuiet Time: 9:00 pm\nCurfew: 9:00 pm\nLights Out: 11:00 pm\nThe Emergency Shelter fulfills immediate basic needs (food, shelter, clothing), connects individuals with available resources, and guides them toward experiencing freedom and self-sufficiency.\n\nIndividuals seeking emergency shelter can check-in at any point during the day to complete an in-take form and drug screening. Shelter services are available to men, women and children. Separate, secure areas separate men from the women and children.\n\n\nOn week days, local churches and groups provide dinner for all residents. Hot showers and laundry services are also available to any resident. Shelter doors are locked at 9pm each night and residents are only permitted to leave with approval from the Shelter Manager (Exception are made for those who work later than 9pm).\n\nLight breakfast snacks are available each morning. Residents are required to exit the facility no later than 8:00 a.m. each morning.\n\nEvery resident must:\n\n    Have a photo ID\n    Pass a background check, be free of any open warrants and cannot be on the sex-offender registry\n    Pass an initial drug screening to be permitted to stay, as well as agree to random testing throughout their stay\n\n    Complete a tracking card which tracks referrals to area services such as identification services, job resources, veteran assistance, etc. A standing-meeting is held every Tuesday at the Mission which brings these resources to the resident.\n    Agree to a maximum stay of eight weeks in the Mission. Any exceptions must be approved by the Shelter Manager.\n    Agree to follow all posted rules\n\nGrace Project:\nThe Grace Project is Latrobe Street Missions long-term recovery program designed to assist individuals to attain and maintain a life of freedom from addiction and other life-dominating behaviors. The Grace Project is not an addictions treatment program, rather, it is a lifestyle recovery program.\n\nMeals: The Latrobe Street Mission provides dinner Monday through Friday at 6:00 pm. Old Man Rivers provides a meal on Saturdays and Sundays at 4:30 pm. (Meals on Saturdays and Sundays at 4:30 pm are open to the community. You do NOT need to be a Latrobe resident to join us for those meals.)\n\nClothing\nClothing is provided to anyone staying at the shelter. If youre not staying at Latrobe, but are in need of clothing come to the shelter on Thursday from 11 to 2 or contact the shelter (304) 893-9248 in case of an emergency need."
  },
  {
    "addressLine1": "413 8th Street",
    "city": "Parkersburg",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "26101",
    "name": "House To Home",
    "organization": "House To Home",
    "phone": "(304) 893-5353",
    "website": "https://www.housetohomepkb.com/",
    "description": ""
  },
  {
    "addressLine1": "534 5th Street",
    "city": "Parkersburg",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "26101",
    "name": "Salvation Army Parkersburg Shelter",
    "organization": "Salvation Army Parkersburg Shelter",
    "phone": "(304) 485-4529",
    "website": "http://salvationarmymwv.org/get-help/emergency-shelters/",
    "description": "Emergency shelter, transitional housing program, other services.\nServices:\nserve the homeless by providing food and overnight lodging.\nprovide educational, counseling and vocational services to homeless and destitute individuals and families for extended periods.\n\naddress long-term specific issues of youth for whom family care is undesirable or unavailable. Education, counseling, health care and specific training seek to meet the needs of such groups as pregnant teens, emancipated minors, and wards of the juvenile court.\naddress specific health or societal driven needs of particular populations."
  },
  {
    "addressLine1": "27375 Ohio 7",
    "city": "Marietta",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "45750",
    "name": "Cornerstone Messianic Congregation and Ministries",
    "organization": "Cornerstone Messianic Congregation and Ministries",
    "phone": "(740) 374-5381",
    "website": "https://www.facebook.com/people/Cornerstone-Messianic-Congregation-and-Ministries/100064506889495/",
    "description": "Emergency shelter and services provided.\n\nCMCM is a 24/7 Emergency Ministry working with individuals, families and the community to provide emergency shelter, food, and guidance. Our extended programming also includes education in a variety of areas including alcohol and substance abuse, domestic violence, stress management, relationships, communications, and Biblical inquiries."
  },
  {
    "addressLine1": "2735 Ohio 7",
    "city": "Marietta",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "45750",
    "name": "Cornerstone Ministries Faith Based Shelter",
    "organization": "Cornerstone Ministries Faith Based Shelter",
    "phone": "(740) 374-5381",
    "website": "https://www.emeraldjennyfoundation.org/listing/cornerstone-ministries-emergency-shelter/",
    "description": ""
  },
  {
    "addressLine1": "306 12th Street",
    "city": "Point Pleasant",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "25550",
    "name": "Mason County Homeless Shelter",
    "organization": "Mason County Homeless Shelter",
    "phone": "(304) 675-1124",
    "website": "http://www.scacwv.org/mason-county-homeless-shelter",
    "description": ""
  },
  {
    "addressLine1": "91 Central Ave",
    "city": "Athens",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "45701",
    "name": "Good Works Timothy House",
    "organization": "Good Works Timothy House",
    "phone": "(740) 594-3333",
    "website": "https://good-works.net/the-timothy-house/",
    "description": "Provides the only shelter for people without homes in nine southeast Ohio counties.\n\nTimothy House operates 24 hours daily. The Timothy House has provided around 100-200 men, women and children with about 3500 to 4500 nights of shelter. Anyone seeking shelter at The Timothy House must contact us first by telephone at 740.594.3333. We do not accept people into the house until they complete a telephone interview. After the telephone interview, a time for a face-to-face interview will be set. In most cases, this can occur within 24 hours."
  },
  {
    "addressLine1": "3333 Eoff St.",
    "city": "Wheeling",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "26003",
    "name": "The Salvation Army",
    "organization": "The Salvation Army",
    "phone": "(304) 233-4413",
    "website": "http://www.salvationarmyusa.org/",
    "description": "Emergency Shelter Provided at this location."
  },
  {
    "addressLine1": "55 Whittlesey Ave.",
    "city": "Norwalk",
    "state": "West Virginia",
    "stateAbbreviation": "WV",
    "postal": "44857",
    "name": "The Salvation Army",
    "organization": "The Salvation Army",
    "phone": "(419) 668-4090",
    "website": "",
    "description": "The Salvation Army is a food pantry. .\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  }
]