[
  {
    "addressLine1": "684 Forest Street",
    "city": "Dover",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19901",
    "name": "Dover Interfaith Mission for Housing",
    "organization": "Dover Interfaith Mission for Housing",
    "phone": "(302) 736-3600",
    "website": "mailto:interfaithdover@verizon.net",
    "description": "The Dover Interfaith Mission for Housing (DIMH) is a non profit corporation of local individuals, faith communities, and organizations dedicated to providing shelter and services to homeless men."
  },
  {
    "addressLine1": "381 College Road",
    "city": "Dover",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19904",
    "name": "Peoples Place Ruth N. Dorsey Relief Shelter",
    "organization": "Peoples Place Ruth N. Dorsey Relief Shelter",
    "phone": "(302) 734-0319",
    "website": "http://peoplesplace2.com/",
    "description": ""
  },
  {
    "addressLine1": "338 Hiawatha Lane",
    "city": "Dover",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19901",
    "name": "K.I.S.H. Home,Inc.",
    "organization": "K.I.S.H. Home,Inc.",
    "phone": "(302) 399-6477",
    "website": "http://kishhomeinc.org/",
    "description": "Transitional Living Program Kent County Site\nK.I.S.H. Home Transitional Living Program provides a 24-hour supervised residential home for young women ages 18-21 who have aged out of the foster care system in Delaware.\n\n K.I.S.H. Home Transitional Living Program  provides support services to help find permanent housing, to provide physical, emotional, educational, and social supports for women presently in, or have aged out of the foster care to achieve and sustain self sufficiency.\n\n\nAdditionally, K.I.S.H. Home, Inc. Transitional Living Services provides guidance in the following areas:\n\n    Independent Living Skills\n    Mentoring\n    Case Management\n    GED Preparation\n    College Entrance Assistance\n    Preparation for Adult Living Programs\n    Housing\n    Career Development\n    Employment & Educational Programs\n    Health & Wellness Program\n    Personal Development Plans\n\n \nEligibility\n\nThe K.I.S.H. Home resident program is for a period of up to 12 months. After completing this program, the women will be monitored at their permanent housing for 6 months by a Mentor.\n\nTo be eligible for the Transitional Living Program a potential woman must:\n\n\n    Be a single woman presently in, or have aged out of the foster care ages 18-21\n    Be willing to work with a case manager; mentors and direct staff\n    Be willing to achieve permanent housing\n    Be willing to pay a portion of the rent, up to of their income\n    Be drug and alcohol-free\n    Be willing to maintain employment or enrollment in school\n    Be willing to attend conferences, workshops and seminars"
  },
  {
    "addressLine1": "801 W Division St",
    "city": "Dover",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19904",
    "name": "House of Hope Emergency Shelter",
    "organization": "House of Hope Emergency Shelter",
    "phone": "(302) 883-2655",
    "website": "mailto:hoh19903@gmail.com",
    "description": ""
  },
  {
    "addressLine1": "1362 S. Governors Avenue",
    "city": "Dover ",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19904",
    "name": "The Shepherd Place",
    "organization": "The Shepherd Place",
    "phone": "(302) 678-1909",
    "website": "http://www.shepherdplace.org/",
    "description": "THE SHEPHERD PLACE IS AN EMERGENCY HOMELESS SHELTER THAT BEGAN OPERATION IN JANUARY OF 1990. WE ARE INCORPORATED UNDER THE LAWS OF THE STATE OF DELAWARE (NOVEMBER, 1988) AND HAVE BEEN OPERATING IN OUR PRESENT LOCATION SINCE THAT TIME. WE HAVE ONLY THE ONE LOCATION AND PROVIDE ALL OUR SERVICES FROM 1362 SOUTH GOVERNORS AVENUE IN DOVER, DELAWARE. DESPITE OUR ADDRESS, WE ARE NOT LOCATED WITHIN THE CITY LIMITS OF DOVER BUT, RATHER, IN THE UNINCORPORATED AREA OF KENT COUNTY.\n\nTHE SHELTER IS STAFFED 24/7 AND HAS DEDICATED PHONE & FAX LINES AS WELL AS INTERNET ACCESS. THE POSITION OF DIRECTOR IS A FULL TIME, COMPENSATED POSITION AS IS THE SHELTER MANAGER AND CASE MANAGER.\n\n\nOUR RESIDENTS ARE PRIMARILY FROM DOVER AND KENT COUNTY DELAWARE (80%), HOWEVER, WE FREQUENTLY SERVE HOMELESS FAMILIES AND INDIVIDUALS FROM SUSSEX AND NEW CASTLE COUNTIES, (18%), AND OCCASIONALLY, OUT OF STATE FAMILIES AND INDIVIDUALS, (2%).\n\nAPPROXIMATELY 50% OF OUR REFERRALS COME FROM THE DELAWARE STATE SERVICE CENTERS, THE REMAINDER COMING FROM CHURCHES, OTHER SOCIAL SERVICE ORGANIZATIONS AND SELF-REFERRALS.\n\n\nTransitional Housing is available for those clients that qualify, however, there is a waiting list for the limited space in the program. Those clients who can work are encouraged and assisted with finding employment, those who cannot receive whatever assistance they need with getting the ongoing support they need. They also receive help finding permanent housing, or if needed, space in another shelter when their Thirty Day stay at the Shepherd Place is over. That step between being in a shelter and being in a more permanent leased space that will be 'theirs'. And, as with the shelter itself, it is provided at no charge. The money the client earns is saved for things like future down payments and deposits on utility service. The list of restrictions on who is eligible for the place is long. They must be employed in a stable long-term job, they must not have outstanding legal trouble, they must not have a history of substance abuse or have successfully completed treatment and remain clean, the family must be stable and school age children must be enrolled in school, and .... and so on. Yes the restrictions are tight, but the need is great, and the house had a waiting list before it was more than a gleam in the Shelter Director's eye."
  },
  {
    "addressLine1": "204 East North Street",
    "city": "Georgetown",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19947",
    "name": "Sussex Community Crisis Housing Services, Inc.",
    "organization": "Sussex Community Crisis Housing Services, Inc.",
    "phone": "(302) 856-2246",
    "website": "https://www.scchsinc.org/",
    "description": "To provide safe and secure temporary housing to the homeless throughout Sussex County.\n\nTo facilitate the transition from homelessness to financial and housing independence. Our agency has been providing shelter and support individuals and families since 1981.\n\n\nWe provide an environment that nurtures personal and family dignity, enhances self-esteem, and promotes independence and housing stability."
  },
  {
    "addressLine1": "127 Broad Street",
    "city": "Milton",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19968",
    "name": "Catholic Charities Casa San Francisco",
    "organization": "Catholic Charities Casa San Francisco",
    "phone": "(302) 684-8694",
    "website": "http://www.ccwilm.org/casa-san-francisco/",
    "description": "We have 12 beds and provide residents with food, clothing, counseling and referrals to appropriate services. This is a single adult-only shelter. We do not accept families or children.\n\nCasa San Francisco, located in Milton, Delaware, provides a wide range of services aimed at helping low-income residents of Sussex County.\n\nEmergency Shelter\nWe provide housing and three daily meals for up to 12 adults for a maximum of 30 days. A case manager works with each resident to obtain income and locate affordable housing opportunities. We also help with medications, laundry, clothing, and transportation.\nFood Cooperative\nThe Food Cooperative helps families and individuals stretch their limited incomes by providing a supplemental bag of groceries, nutrition and budgeting information once every month. With the help of the Food Bank of Delaware, club members receive nutritious, meal-ready products for a fraction of retail value.\nCurrently, distribution sites are located in Milton, Georgetown, Lewes, Slaughter Neck, Long Neck, Bridgeville, Roxanna and Dover.\nEmergency Food Pantry\nStaffed by volunteers and stocked with donated food and USDA commodities, the pantry provides three to four days of food for persons who are in crisis and cannot buy food. Persons can pick up food bags at Casa weekdays from 9am - 3pm.\nFor more information, please contact Casa San Francisco at 302-684-8694."
  },
  {
    "addressLine1": "1328 W. Third Street",
    "city": "Wilmington",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19805",
    "name": "House of Joseph I",
    "organization": "House of Joseph I",
    "phone": "(302) 652-0904",
    "website": "https://www.ministryofcaring.org/services/emergency-shelters/",
    "description": "Mens homeless shelter. Capacity: 12 men.\n\nHouse of Joseph I provides emergency shelter and services to homeless employable men. Residents come to the shelter for reasons that include family challenges, substance abuse, mental health disorders, unemployment or underemployment. Case managers initially help the men to resolve immediate crises. Subsequently, they begin the process of identifying barriers to long-term self-sufficiency. The opportunity to learn life management skills has proven especially helpful.\n\nWhen case managers determine which residents need and desire additional supportive services, they may refer them to a transitional residence or long-term housing program of the Ministry of Caring. Throughout every residents stay, House of Joseph I strives to help each man reach his next step on the road to independent living."
  },
  {
    "addressLine1": "121 N. Jackson Street",
    "city": "Wilmington",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19805",
    "name": "Mary Mother of Hope House II",
    "organization": "Mary Mother of Hope House II",
    "phone": "(302) 652-1935",
    "website": "https://www.ministryofcaring.org/services/emergency-shelters/",
    "description": "Emergency women's shelter for single women with children."
  },
  {
    "addressLine1": "515 N. Broom Street",
    "city": "Wilmington",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19805",
    "name": "Mary Mother of Hope House III",
    "organization": "Mary Mother of Hope House III",
    "phone": "(302) 652-0970",
    "website": "https://www.ministryofcaring.org/services/emergency-shelters/",
    "description": ""
  },
  {
    "addressLine1": "110 N Poplar St",
    "city": "Wilmington",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19801",
    "name": "Sunday Breakfast Mission",
    "organization": "Sunday Breakfast Mission",
    "phone": "(302) 652-8314",
    "website": "https://www.sundaybreakfastmission.org/",
    "description": "Men's Shelter\nUp to 130 men who would otherwise be homeless call our shelter \"home\" each night.\n\nCommunity Meal\nA hot, nutritious meal is served to more than 200 men, women and children each night.\n\nMen's Residential Discipleship Ministry\nThe NewLife Program offers a fresh start. While here each person is counseled, educated, trained and equipped to become the productive member of society he was created to be.\n\nWomen and Family Shelter and Discipleship Ministry\nThe NewLife Program offers a fresh start. While here each person is counseled, educated, trained and equipped to become the productive member of society he was created to be."
  },
  {
    "addressLine1": "2501 Milltown Rd",
    "city": "Wilmington ",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19808",
    "name": "Hospitality Center of Northern New Castle County",
    "organization": "Hospitality Center of Northern New Castle County",
    "phone": "(302) 998-2222",
    "website": "https://www.familypromisede.org/",
    "description": "We are an emergency hosting program. We provide emergency shelter for children and their families. We also provide case management, housing assistance and job search assistance.\n\nOur Hospitality Center provides needed temporary shelter to up to 6 families (or 20 individuals) at a time. This additional facility is helping us create twice the promise were now able to prevent & end homelessness for twice as many families annually. The Hospitality Center opened at the end of November 2018, and within 24 hours, it was already at capacity.\n"
  },
  {
    "addressLine1": "300 Bayard Avenue",
    "city": "Wilmington",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19805",
    "name": "Catholic Charities Bayard House",
    "organization": "Catholic Charities Bayard House",
    "phone": "(302) 654-1184",
    "website": "https://www.ccwilm.org/bayard-house/",
    "description": "The shelter serves 10 homeless, pregnant adolescents and young women, providing residents with food, clothing, counseling and referrals to appropriate services. Residents should be in their first or second trimester of pregnancy."
  },
  {
    "addressLine1": "104 West 5th Street",
    "city": "Wilmington",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19801",
    "name": "Booth Social Services/Emergency Housing Residence",
    "organization": "Booth Social Services/Emergency Housing Residence",
    "phone": "(302) 472-0753",
    "website": "",
    "description": "Emergency Housing Residence\n\nThe William Booth Emergency Housing Residence (EHR) is a Ninety (90) day emergency shelter for single women and women with children mainly from Wilmington and New Castle County. The Emergency Housing Residence consists of 52 beds in 13 rooms on two residential floors. The shelter operates 24/7, 365 days a year. The purpose is to provide emergency shelter services and to work toward preventing the recurrence of episodes of homelessness. The program encourages the development of self-esteem and the attainment of self-sufficiency through its commitment of providing a safe and supportive environment, and through its housing programs, advocacy and empowerment."
  },
  {
    "addressLine1": "709 North Madison Street",
    "city": "Wilmington",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19801",
    "name": "YWCA Delaware Home-Life Management Center",
    "organization": "YWCA Delaware Home-Life Management Center",
    "phone": "(302) 658-7110",
    "website": "https://www.ywcade.org/",
    "description": "Home Life Management Center (YWCA) is a shelter for homeless families. Their services range from Childcare and job training to Violence Prevention and Leadership Training. There is no limit to the length of stay."
  },
  {
    "addressLine1": "720 N Orange St",
    "city": "Wilmington",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19801",
    "name": "Friendship House Wilmington Empowerment Center",
    "organization": "Friendship House Wilmington Empowerment Center",
    "phone": "(302) 652-8033",
    "website": "https://www.friendshiphousede.org/",
    "description": "We are currently located at Saams Church location the entrance are the double red doors.\nMorning Hospitality: Mon-Fri 7:30am 8:30am\nSunday Breakfast: 7am 8am\nFor appointment call (302) 652-8033: Mon-Fri 9am-12pm.\nFriendship House views its empowerment centers as its primary contact with those facing homelessness throughout New Castle County, Delaware. At each open-door drop-in centers, staff and volunteers of Friendship House interface with over 250 people daily. The Centers are not only Ground Zero for the Friendship House Empowerment Strategy Program; it is also the agencys principal guide for the needs of the New Castle County, Delaware community.\n\n\nThe Empowerment Centers serve clients with a way home. Each center is part of the network of homeless ministries housed out of local churches which have a partnership with Friendship House. The principal services include basic hospitality (coffee/ tea, water, bathrooms), the Home Base Program (mailing address, phone service, locker & savings bank), a consultation & referral service, AA and NA meetings and the  Job Readiness Program (Computer lab, Job mentors, I.D., Resume, Bus Tickets,  Work Shoes, Equipment,  Workers Shelter).\n\nServices offered at our Empowerment Centers include:\n    Case Management\n    Access to a phone, a place to receive mail\n    Computer labs\n    A job readiness program where you will receive help on resume writing and job searches\n    Help getting replacement birth certificates and identification\n    Access to clothing\n    Help with food or shelter referrals\n    Bus tickets to verifiable appointments\n    Assistance with medical prescription\n    Hospitality of hot drinks, water, and access to a bathroom\n    Sanctuary from the elements\n\n"
  },
  {
    "addressLine1": "342 Birch St",
    "city": "Kennett Square",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19348",
    "name": "His Mission, Inc",
    "organization": "His Mission, Inc",
    "phone": "(610) 444-2559",
    "website": "https://www.facebook.com/His-Mission-Inc-918586101539867/",
    "description": "Provides shelter for men, women, and children. Family shelter."
  },
  {
    "addressLine1": "229 Norris Street",
    "city": "Chester",
    "state": "Delaware",
    "stateAbbreviation": "DE",
    "postal": "19013",
    "name": "The Family Management Center",
    "organization": "The Family Management Center",
    "phone": "(610) 872-4070",
    "website": "http://www.caadc.org/",
    "description": "Shelter for families. 10 rooms. FMC offers numerous additional programs including the After School Program, medical assessments through ChesPenn, mental health assessments through Horizon House, toys during the holiday season, play therapy and a karate program for children."
  }
]