[
  {
    "addressLine1": "624 Anderson Street",
    "city": "Bristol",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37621",
    "name": "Haven of Rest Rescue Mission, Serving the Mountain Empire",
    "organization": "Haven of Rest Rescue Mission, Serving the Mountain Empire",
    "phone": "(276) 968-2011",
    "website": "http://www.havenofrestbristol.org/",
    "description": "The Haven of Rest is about helping people meet their needs for food, shelter, clothing, a new start, forgiveness, peace, stability, love, freedom from a life controling problem in a Christian environment.\n\nThe Haven of Rest Men's Shelter provides 28 beds for homeless men. The Haven Home is a safe place for 8 women and their children. The Haven Lighthouse is a 12 bed, 8-month residential program for men with life-controling problems. The Food Ministry provides meal service for all residents and an open evening meal. The Food Pantry provides substantial groceries for needy families in the mornings, Tuesdays through Fridays. The Haven Thrift Store provides clothing and essential household and furniture items for those starting over and sells other items to benefit the Mission. The Haven of Rest is a community resource for questions about drug & alcohol addictions and their treatment, homelessness and the Christian Faith. The Haven of Rest is a referral place to other organizations in the Tri-Cities that help people in need."
  },
  {
    "addressLine1": "670 Dale Street",
    "city": "Kingsport",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37663",
    "name": "Hope Haven Ministries Inc.",
    "organization": "Hope Haven Ministries Inc.",
    "phone": "(423) 246-6012",
    "website": "http://hopehavenkpt.org/",
    "description": "Emergency Shelter. We are located on Dale St. in Kingsport, TN. Transient Program (temporary shelter for transient individuals)\n\nServices\n    SHELTER\n    FOOD\n    CLOTHING\n    CRISIS COUNSELING"
  },
  {
    "addressLine1": "505 Dale Street",
    "city": "Kingsport",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37660",
    "name": "Salvation Army Kingsport, TN",
    "organization": "Salvation Army Kingsport, TN",
    "phone": "(423) 246-6671",
    "website": "http://salvationarmykytn.org/locations/kingsport/",
    "description": "Homeless Shelter (Temporary Emergency Shelter & Veterans Transitional Shelter)"
  },
  {
    "addressLine1": "601 Holston Street",
    "city": "Kingsport",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37660",
    "name": "Family Promise of Greater Kingsport",
    "organization": "Family Promise of Greater Kingsport",
    "phone": "(423) 246-6500",
    "website": "http://fpgk.org/",
    "description": "Family Promise of Greater Kingsport, Inc. (formerly known as Interfaith Hospitality Network of Greater Kingsport) is a homeless shelter for families with minor children in the Kingsport area. We work with a group of churches that provide overnight accommodations and meals for the guests who are in our program.\n\nFamilies with children make up the fastest growing segment of the homeless population. FPGK provides a safe, family oriented place to stay, nutritious meals, and mentoring to help homeless families with children under 18 on their quest to regain independence.\n\n"
  },
  {
    "addressLine1": "123 W Millard Street",
    "city": "Johnson City",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37604",
    "name": "Haven of Mercy",
    "organization": "Haven of Mercy",
    "phone": "(423) 929-0616",
    "website": "http://www.havenofmercy.net/",
    "description": "The Haven of Mercy Ministries provides nutritious meals, assistance, and comfort to thousands, a hot shower, and a warm, safe place of rest and shelter for men who come to our doors during their most desperate times in life since 1977. It is our goal to foster an atmosphere of trust, accountability, and responsibility according to the Gospel.\n\n1. Preventative Care\n\nHot Meals\nRent/Mortgage Assistance\nUtilities\nFood\nJob Skills\nMedication (Rx only)\nChurch Service Opportunities\nCounseling\n\n2. Transitional Housing\n\nUp to 2 years\n\nMoving from Survival Mode\n\nEquipping with Life Skills\n\nJob Skills\n\nEducation\n\nMinistering to the Spiritual, Physical, Mental & Emotional Needs\n\nCounseling\n\nStabilization\n\n3. Permanent Housing\n\nRoom Rentals\n\nApartment Rentals\n\nOther Affordable Housing Opportunities\n\nJob Training/Searching\n\nEducation\n\nLife Skills\n\nCounseling\n\nChurch Service Opportunities"
  },
  {
    "addressLine1": "1512 South Holtzclaw Ave.",
    "city": "Chattanooga",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37403",
    "name": "The Chattanooga Rescue Mission",
    "organization": "The Chattanooga Rescue Mission",
    "phone": "(423) 756-3126",
    "website": "http://www.chattanoogarescuemission.org/",
    "description": "Overnight Shelter-Guest MinistryWhether people have come to the mission needing help with substance abuse, or whether they just need a little help to get back on their feet, we provide meals, a chapel service, showers, and overnight lodging to all who want to come.\n\nPrograms\nOvernight Shelter Guest Ministry\nWhether people have come to the mission needing help with substance abuse, or whether they just need a little help to get back on their feet, we provide meals, a chapel service, showers, and overnight lodging to all who have needs.\n\nWomen and Children's Ministry\nIn the early years of the ministry most of the homeless we ministered to were homeless men. Because of the increase in homeless women and children in our area, and our burden to reach all the needy in our area, in October, 2002 we opened a free, emergency shelter for 14 of the estimated 400 homeless women and children.\n\nNightly Chapel Ministries\n\nMen's Chapel Service\nFor over 35 years, the mission has provided nightly chapel services to share the good news of salvation through the Lord Jesus Christ. Our chapel speakers are volunteers who come once a month to encourage and be a blessing to those who need Christ in their lives.\n\nWomen's Chapel Service\nSeparate chapel services are provided each night for our female shelter guests and program members. Godly women from area churches volunteer their time to provide music and teach the Word of God so that these women can come to know Christ as Savior and learn to live for Him.\n\nChristian Life Programs\n\nMens Christian Life Program\nSome of those to whom we minister realize they need to make changes in their lives and will enroll in our 12-month alcohol and drug program. Because we believe that only the Word of God and His Holy Spirit can change lives, all our classes and programs are Biblically based. In addition to the extensive Bible training, our CLPs/WCLPSs receive counseling and encouragement. While in this program, all of their needs are provided for them free of charge.\n\nThe last three months of the Christian Life Program is a transition period.  CLPs work outside the mission but continue to stay at the mission where food, shelter, and guidance are provided. As they transition back into society, we continue to monitor their success and provide continued counseling as needed.\n\nWomen's Christian Life Program\nNight Shelter Schedules\n\nWomens Night Shelter Schedule\n\n    5:00 pm  Shelter staff arrive to greet shelter guests\n    5:00 pm to 5:30 pm  Check-in\n    5:45 pm  Hot, delicious, balanced dinner\n    6:15 pm  Chapel Service\n    9:00 pm  Lights out\n\n \n\nMens Night Shelter Schedule\n\n    5:00 pm  Shelter staff arrive to greet shelter guests\n    5:00 pm to 5:30 pm  Check-in\n    6:30 pm  Hot, delicious, balanced dinner\n    7:00 pm  Chapel Service\n    9:00 pm  Lights out\n\n\n\n "
  },
  {
    "addressLine1": "124 Signal Hills Drive",
    "city": "Chattanooga",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37401",
    "name": "Union Gospel Mission",
    "organization": "Union Gospel Mission",
    "phone": "(423) 752-4998",
    "website": "https://theuniongospelmission.org/",
    "description": "Emergency Shelter.\n\n\nProvides food, shelter, clothing, and other physical needs to the homeless and needy in Chattanooga and the Tri-state area; thereby gaining the opportunity to share with them the message of Hope in Jesus Christ!\nThe Union Gospel Mission is a men's faith-based, residential, program that helps individuals with life-controlling issues find their purpose in life through a personal relationship with Christ.\n"
  },
  {
    "addressLine1": "230 N. Highland Park Ave",
    "city": "Chattanooga",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37404",
    "name": "Chattanooga Room In The Inn",
    "organization": "Chattanooga Room In The Inn",
    "phone": "(423) 624-6144",
    "website": "https://chattanoogaroomintheinn.com/",
    "description": ""
  },
  {
    "addressLine1": "1184 Baldwin St",
    "city": "Chattanooga",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37403",
    "name": "Family Promise of Greater Chattanooga",
    "organization": "Family Promise of Greater Chattanooga",
    "phone": "(423) 756-3891",
    "website": "http://familypromisechattanooga.com/",
    "description": "Family Promise is a nonprofit organization committed to helping low-income families achieve lasting independence.\n\n\n\nServices:\n\nThe IHN Overnight Shelter Program is our traditional, faith-based program that operates in area congregations and continues to provide food, shelter and hospitality to families in need. Over fifty area churches and synagogues currently partner to host and support efforts to provide temporary housing for our families, which is truly a cost-effective mobilization of community resources. Seventy-five to eighty percent of families exit this program to stable housing, either employed or with income supports if disabled and securely linked to supportive and follow-up services.\n\n\n\nThe Family Promise Day Center Program provides food, transportation, day shelter, shower and laundry facilities, case management, life skills and educational classes, computers to develop resumes and apply online for jobs and housing, indoor and outdoor play areas for children and a nap room. As the name suggests, our families stay here during the day.\n\n\n"
  },
  {
    "addressLine1": "745 Wildwood Ave SE",
    "city": "Cleveland",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37311",
    "name": "Bradley County - Cleveland Emergency Shelter",
    "organization": "Bradley County - Cleveland Emergency Shelter",
    "phone": "(423) 478-1458",
    "website": "http://www.bradleyclevelandcsa.org/",
    "description": "Office hours: Mondays through Fridays 8am - 4:30pm. Provides and emergency shelter.\n\nThe Cleveland Emergency Shelter provides daily for those most vulnerable and desperate among us, first supplying emergency services of food and shelter. This comprehensive program offers support that will promote, empower, and nurture families or individuals. These services include, but are not limited to, case management, information/referral, advocacy, family/individual counseling, voucher assistance, job, life skills, and budgeting training.\n\n\nThe Cleveland Emergency Shelter has the opportunity to provide transitional housing right next to out current facility on Wildwood Avenue. Transitional housing programs assist people who are ready to move beyond emergency shelter but need additional supportive services to move out of homelessness. These programs often the bridge for those wishing to move into permanent housing. Transitional programs allow individuals and families who need services to further develop the stability, confidence, and coping skills needed to sustain permanent housing."
  },
  {
    "addressLine1": "407 South Thornton Avenue Suite #3",
    "city": "Dalton",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "30720",
    "name": "Dalton Whitfield CDC",
    "organization": "Dalton Whitfield CDC",
    "phone": "(706) 529-8270",
    "website": "https://dwcdc.business.site/",
    "description": "Business Hours:\nMon:    9:00 AM 5:00 PM\nTue:    9:00 AM 5:00 PM\nWed:    9:00 AM 5:00 PM\nThu:    9:00 AM 5:00 PM\n\nGHFA PSH (formerly known as Shelter Plus Care)\nThe GHFA Permanent Supportive Housing (PSH) Program (formerly known as Shelter Plus Care) provides permanent housing in connection with supportive services to persons who have a disability and are experiencing homelessness. The program provides rental assistance funded by the Department of Housing and Urban Development (HUD) accompanied by a range of supportive services funded by other sources. The GHFA PSH Program is designed to serve a population that has been traditionally hard to reach - homeless persons with disabilities such as (but not limited to) serious mental illness, chronic substance abuse, and/or AIDS and related diseases. This program is built on the best practice that housing and services should be connected in order to ensure stability for this population. Consequently, GHFA PSH provides rental assistance that local sub-grantees must match with supportive services appropriate to the target population. The goals of the GHFA PSH Program are to assist homeless individuals and their families to increase their housing stability, skills and/or income, and self-sufficiency."
  },
  {
    "addressLine1": "416 S. Glenwood Ave",
    "city": "Dalton",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "30721",
    "name": "City of Refuge Transitional Housing",
    "organization": "City of Refuge Transitional Housing",
    "phone": "(706) 226-1301",
    "website": "https://www.cityofrefugedalton.org/",
    "description": ""
  },
  {
    "addressLine1": "711 South Hamilton Street",
    "city": "Dalton",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "30720",
    "name": "Providence Ministries",
    "organization": "Providence Ministries",
    "phone": "(706) 275-0268",
    "website": "http://www.providenceministriesinc.com/",
    "description": "Office Hours:Mondays through Fridays 8 am - 4:30 pm.\n\nServices:\n1. Providence Ministries Homeless Men's Shelter - Providence Ministries homeless shelter is on the forefronts of the fight against the homelessness epidemic in Georgia. We believe that every man deserves dignity and refuge as they attempt to put their lives back together. The homeless situation is a tragic one. It is often a result of the all to common occurrence of people losing both their homes and their jobs at the same time, and is not a reflection of character but rather the result of ill-timed and unfortunate circumstances. We know that the homeless condition can happen to anyone.\n\n2. Men's Addiction Recovery - The Providence Ministries Christian Drug and Alcohol Recovery Program for men has been redeeming lives and saving souls in the name of Jesus Christ, since 1985. Our time-tested, long-term 6 month faith based rehab alternative to traditional drug and alcohol rehabilitation treatment has helped people from all across the nation, is extremely value packed, and extremely effective.\n\n\n3. Women's Addiction Recovery - Drug rehab, Alcohol rehab. We are more then a recovery center, we are a spiritual regeneration program, and our goal is to help women completely transform their lives. website: http://providencewomensrecovery.com/\n\n4. Homeless Women's and Children's Shelter - This mission's purpose is to offer a temporary place of refuge for homeless women and their children while the mother addresses the economic, social, and spiritual issues that led to their homelessness. It is designed to give homeless women an opportunity to take a hard look at themselves, and to take the necessary steps to move out of the bondage of homelessness.\n\nThe program can house a total of 12 persons, that being any combination of women and children. The prerequisites for approval into the shelter are that the mother be homeless, not suffering from a physical or mental disability (as we are not medically staffed but can refer), and not be in danger or dealing with a domestic dispute or battered woman situation (again, we can refer).\n\n\nWe offer one-on-one counseling, complimentary meals for the mother and children, and a fully furnished living area separated from any of the men's facilities. That said, their are some requirements. First, we require that the mother be ardently looking for work during the day. Second, we require that the women remain free of drugs and alcohol, and third, we require that the family attend church on Wednesdays, and twice on Sunday's.\n\nWe have gone to great lengths to create a safe, second-to-none shelter. The opportunity for women to grow and heal with us here at Providence is very real and very attainable. And as long as the women staying here are putting in the effort, we will stand behind them and assist them in any way we can. For more information or if you have questions, please call the women's intake coordinator at (706)275-0268.\n\n5. Free Meals.\nHours:\nMondays through Fridays: Breakfast: 7:15am, Lunch 12 noon, Dinner 5pm.\nSundays: Breakfast: 8:30am, Lunch 12 noon, Dinner, 5pm.\n\nHot Meals.Providence Ministries is fighting hunger in Georgia by serving fresh and hot meals prepared daily, and offering them for free to anyone who wants one, no questions asked... no one will be denied. Our community kitchen is open 365 days a year and serves 60-200 plates for any given meal. Also, we very often redistribute any extra unprepared donated food to our guests immediately following the serving of food (limit one small bag per family). Please take advantage of these offers as it's our pleasure to serve the community in this very important endeavor, and we hate throwing away excess food."
  },
  {
    "addressLine1": "1498 Golf Club Ln",
    "city": "Clarksville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37040",
    "name": "Room In The Inn Old Fire House Day Shelter",
    "organization": "Room In The Inn Old Fire House Day Shelter",
    "phone": "(931) 896-1800",
    "website": "http://www.cmccaa.com/community-programs/firehouse-day-shelter/",
    "description": ""
  },
  {
    "addressLine1": "210 Kraft Street",
    "city": "Clarksville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37040",
    "name": "The Clarksville Salvation Army Shelter",
    "organization": "The Clarksville Salvation Army Shelter",
    "phone": "(931) 552-5350",
    "website": "http://salvationarmykytn.org/locations/clarksville/",
    "description": ""
  },
  {
    "addressLine1": "179 Substation Loop Rd",
    "city": "Erin",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37061",
    "name": "Safe Harbor of Erin",
    "organization": "Safe Harbor of Erin",
    "phone": "(931) 709-2553",
    "website": "https://www.safeharborerin.org/",
    "description": "At Safe Harbor, we consider it a privilege to serve the men in our care. These participants have come to us from living in the streets or ex-offenders that needed somewhere to go. We strive to provide them with so much more than food and shelterwe strive to make a lasting difference through group and pastoral counseling, life building classes, and finding them permanent employment which provides stability once they leave our care.The Nehemiah Program is a Faith-Based Recovery Support Services Program. The program requires a six-month commitment.All clients must agree to comply with program guidelines at all times.Clients must work during their stay to pay for their recovery.We will attempt to secure employment for you through our Back to Work Program.Coordination with Courts and Parole or Probation Offices is provided.Transitional Housing, Meals, and Transportation are furnished."
  },
  {
    "addressLine1": "1468 Ferguson Rd",
    "city": "Decatur",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37322",
    "name": "Crooked Tree Campground",
    "organization": "Crooked Tree Campground",
    "phone": "(606) 401-9556",
    "website": "http://www.crookedreecamp.com/",
    "description": "Crooked Tree Campground is a modern-day homestead. Everyone in the homestead helps to keep the self-sustaining facility going and growing. Whether it be growing corn or raising chickens, everyone on the homestead will play a role."
  },
  {
    "addressLine1": "105 N JAMES CAMPBELL BLVD",
    "city": "Columbia",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38402",
    "name": "Place of Hope",
    "organization": "Place of Hope",
    "phone": "(931) 388-9406",
    "website": "http://placeofhopeinternational.com/",
    "description": "Our mission is to provide excellent alcohol and drug treatment programs and services, temporary shelter for the homeless, and food for the hungry, within a caring, Christian environment.\n\nHours: Always Open.\n\nAfter opening the center and beginning to provide treatment services for alcoholics and addicts, we became aware of a need to provide temporary shelter for homeless people. Having such a wonderful facility, we felt an obligation to provide a place to stay for those in need. Many churches refer homeless individuals to our facility.\n\nIn addition, Maury County Sheriffs Department, Columbia Police Department, and the Tennessee Highway Patrol refer the homeless people to us. Prior to accepting the homeless, they must be checked through one of these law enforcement agencies to ensure that they are not fugitives. We evaluate why the person is homeless. We determine whether the situation is temporary caused by an unfortunate condition caused by chemical dependency, mental illness, eccentricity, unwillingness to work, or some other reason.\n\n\nWe teach job readiness skills, Biblical principles for successful living, and independent living skills in an effort to enable individuals to get back on their feet.\n\nA recent survey taken in our immediate community of Columbia, Tennessee reported that on any given night, there are approximately 30 people who are sleeping in cars or abandoned houses or buildings."
  },
  {
    "addressLine1": "116 Hickory Dr",
    "city": "Shelbyville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37162",
    "name": "C.R.O.S.S. Shelter Project - Homeless Shelter",
    "organization": "C.R.O.S.S. Shelter Project - Homeless Shelter",
    "phone": "(931) 703-6405",
    "website": "https://crossshelter.org/",
    "description": "Hours: 24 hours a day - 7 days a week. Walk-in or call for information. Picture ID required if not referred by a church or police department.\n\nAlmost anyone from Bedford, Coffee, Moore, Marshall, or Lincoln counties if they are homeless or transients for one night. DO NOT ACCEPT battered women, people w/violent crime or sexual crime history, people who are drug/alcohol dependent, or going through withdrawal programs for addicts or those medicated for mental problems like bipolar, etc.\n\nOur services include:\nProviding shelter for the homeless\nFeeding the homeless\nProviding life skills intervention services\nCoordinating Food distribution to the poor\nOffering group home, (long term ) housing\n"
  },
  {
    "addressLine1": "P.O. Box 1180",
    "city": "Cookeville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38501",
    "name": "Genesis House",
    "organization": "Genesis House",
    "phone": "(800) 707-5197",
    "website": "http://www.genesishouseinc.com/",
    "description": "Shelter...for immediate CRISIS intervention.\n\n"
  },
  {
    "addressLine1": "1331 S. Jefferson Ave.",
    "city": "Cookeville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38506",
    "name": "Cookeville Rescue Mission",
    "organization": "Cookeville Rescue Mission",
    "phone": "(931) 528-5819",
    "website": "http://cookevillerescuemission.org/",
    "description": "Mission Central (Manned 24 Hours)24/7 Hotline Crisis calls and/or general inquiries for client services\nSingle Men's Center - Lodging, food and clothing services for men\n\nLighthouse Lodge Lodging for single women and/or families\nStep Upward Farm: 931-761-5833\nTransitional Services for Men\n\nEmergency, temporary shelter for the homeless. Offering two residential buildings plus a chapel, general store, salon and dental clinic, the Rescue Mission offers assistance lasting from three to 30 days for men, women and families in need. The Rescue Mission also operates Step Upward Farm, a seven-acre working farm that offers a three- to nine-month program designed to help young, troubled fathers turn their lives around."
  },
  {
    "addressLine1": "234 King Street",
    "city": "Sparta",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38583",
    "name": "Seeds of Hope of Tn Coldest Night's Shelter",
    "organization": "Seeds of Hope of Tn Coldest Night's Shelter",
    "phone": "(931) 303-6695",
    "website": "mailto:Seedsofhopeoftn@yahoo.com",
    "description": "Coldest nights when temperatures are below 35 degrees. Van leaves Hardee's parking lot at 530 pm"
  },
  {
    "addressLine1": "281 SW 4th St",
    "city": "Crossville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38555",
    "name": "Bread of Life Rescue Mission",
    "organization": "Bread of Life Rescue Mission",
    "phone": "(931) 707-0503",
    "website": "http://breadofliferescue.org/",
    "description": "Office Hours:\nMonday-Friday:\n9:00 a.m. - 4:00 p.m.\n\nThe Mission Provides\nEmergency shelter for displaced families and individuals.\nTransitional housing for homeless families, veterans, personal and natural disaster victims.\n\nEmergency food assistance to anyone; free medical care for the uninsured.\nSubstance abuse placement and advocacy with the local court system and Biblical counseling.\nAdvocacy for chronically homeless individuals. We advocate for the homeless with Social Security )The SOAR program), mental health programs (TN. Saftey Net), local and state public housing programs.\nFree clothing to those in need; free household items for those starting over.\nEmergency help with rent, utility bills, burial and emergency travel needs.\nSpecial help through the holidays to needy families.\nState approved transitional housing.\nSpiritual help, Christian services. The Bread of Life Rescue Mission provides Free of charge hope in our Lord Jesus Christ, for an abundant life on earth and an eternal life with Him in heaven."
  },
  {
    "addressLine1": "1273 Dayton Mountain Hwy",
    "city": "Dayton",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37321",
    "name": "We Care Community Services Center",
    "organization": "We Care Community Services Center",
    "phone": "(423) 775-4333",
    "website": "https://www.wecaredayton.com/",
    "description": "Haven House is a transitional shelter for people who need short-term housing."
  },
  {
    "addressLine1": "222B East Court Street",
    "city": "Dyersburg",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38024",
    "name": "Dyer County Day Shelter",
    "organization": "Dyer County Day Shelter",
    "phone": "(731) 478-6444",
    "website": "http://www.tnhomelesssolutions.org/",
    "description": "Hours:\n8:30am to 4pm\nMonday-Friday\n\nThe Dyer County Day Shelter will provide, free of charge, essential life skills programs and trainings to break the cycle of poverty and homelessness by acting as catalyst to bring much needed programs and services to homeless and unemployed persons in Dyer County.  All clients will have a needs assessment completed and obtain connections to the appropriate services for the individual."
  },
  {
    "addressLine1": "400 E Walnut St",
    "city": "Blytheville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "72316",
    "name": "Mississippi County Union Rescue Mission",
    "organization": "Mississippi County Union Rescue Mission",
    "phone": "(870) 763-8380",
    "website": "https://misscomission.org/",
    "description": "Mission\nTo house the homeless, provide services for those in need in our community.\n\nServices\nEmergency shelterEmergency Shelter is available 24/7 for Men, Women, and Children. The Mission currently has 23 beds for Men, and 26 beds for Women and Children. Call-ahead for bed availability suggested. For anyone being released from Jail, Hospital or Rehab this is a requirement, with a documented referral. We do not hold a license to house Parolees, nor do we accept registered Sex offenders into the Mission program. Male or Female.\nFOOD\n\nEmergency food is available to those in need three days per week Monday, Wednesday and Friday's at 1:00, other times when fresh produce is available. The Mission networks with other local food sources and feeding programs using Charity Tracker software to avoid duplicating services. Mississippi County residents only Documentation is required.\n\nCLOTHING\n\nClothing is available to the public Tuesday, Thursday  and Saturday's from 9:00 to 3:00. Monday, Wednesday and Friday's 9:00- 12:30. No residential restrictions apply. Picture ID required.\n\nFURNITURE & APPLIANCES\n\nDonated furniture, appliances, housewares, bedding and other soft furnishings are given to those from the shelter who are entering their own homes, and house-fire victims entering their new homes. We take referrals from other service agencies for families in need who are not experiencing homelessness.\n\nTRAVELER'S AID\n\nWe offer LIMITED Gas assistance for  STRANDED motorists, and LIMITED Gas assistance for out-of-town Dr. appointments for people who do not receive Medicaid and thus who cannot ride the Medicaid Van. Appointment verification required. Mississippi County residents only.\n\nPRESCRIPTIONS\n\nFinancial assistance for prescription medicines is available on a LIMITED scale, special circumstances and Co-Pays only. Mission residents who are not insured are Referred to the Great River Free Charitable Clinic.\n\nWORK PROGRAMS\n\nAll who stay at the Mission are required to work and be productive. Whether it be thru employment in the community, shelter chores, working in the kitchen, working in the office, or working in the warehouses and through the day labor program to Pay-it- Forward acquiring and honing job skills is essential in preparing for re-entering the Housed Community. Retail experience, organizational skills, and building stamina needed for an all day job are but a few of the things that can be gained by this work experience.\n\n\nWe help with emergency food and we work with the Blytheville-Gosnell Area Food Pantry"
  },
  {
    "addressLine1": "229 Carter Ave",
    "city": "Harriman",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37748",
    "name": "Dry Bones Emergency Shelter - Winter Shelter",
    "organization": "Dry Bones Emergency Shelter - Winter Shelter",
    "phone": "882-5802",
    "website": "",
    "description": "Roane County, TN. DRY BONES EMERGENCY SHELTER\nShelter is in the back downstairs.\nA collaborative effort by M-14 Ministry / Courts of Praise Church.\n At this time, it can accommodate 10 adults between 5 PM & 9 AM on nights that are below freezing or in case of house fires.\n\nSnacks, Food and Breakfast will be made available.\nIf you are aware of someone who needs these accommodations please Contact us.\n\nDonations are accepted."
  },
  {
    "addressLine1": "1513 Jeffers Rd",
    "city": "Huntsville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37756",
    "name": "Scott County Homeless Shelter",
    "organization": "Scott County Homeless Shelter",
    "phone": "(423) 663-3333",
    "website": "http://www.scottcounty.com/government/homeless-shelter/",
    "description": ""
  },
  {
    "addressLine1": "630 US-25W S,",
    "city": "Williamsburg",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "40769",
    "name": "Emergency Christian Ministries",
    "organization": "Emergency Christian Ministries",
    "phone": "606-400-1464",
    "website": "https://www.facebook.com/pages/Emergency-Christian-Ministries/195304827237175",
    "description": "Food, Clothing, Transportation Assistance, Shelter\nCheck in and intake start at 6:30pm. Come at 6pm to ensure a spot.Capacity 25 people.\n\n\nOpen to men and women, the shelter's main barrier to entry is if someone is a registered sex offender\nMust provide ID.\n\n"
  },
  {
    "addressLine1": "1970 N. Highland Ave. Suite E",
    "city": "Jackson",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38305",
    "name": "Dream Center of Jackson Shelter",
    "organization": "Dream Center of Jackson Shelter",
    "phone": "(731) 512-0095",
    "website": "https://www.dreamcenterjackson.com/",
    "description": ""
  },
  {
    "addressLine1": "418 North Broadway",
    "city": "Knoxville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37927",
    "name": "Knox Area Rescue Ministries - KARM",
    "organization": "Knox Area Rescue Ministries - KARM",
    "phone": "(865) 673-6540",
    "website": "http://karm.org/",
    "description": "Overnight Shelter\n4:30pm - 6:30pm\n(After 6:30pm, guests must present proper documentation to receive overnight shelter.)\nKARM provides the basic needs of food, safety, and shelter for those in emergency need. KARM is the only facility of this magnitude in the Knoxville area. Without KARM, most, if not all, of the Knoxville area's homeless would be living in cars, on the streets or in campgrounds.\n\nMeals\nBreakfast: 6:15am - 7:45am\nLunch: 11:15am - 12:45pm\nDinner: 4:15pm - 5:45pm\n\nCrossroads Welcome Center\n8:00am - 11:30pm\n11:30am - 1:00pm - Closed\n1:00pm - 4:00pm\n\nCrossroads Welcome Center is a welcoming place for those who truly want help and are willing to take a challenging first step towards correcting their state. Crossroads - Handing out Mail\nCrossroads is designed to be a starting point to help the homeless in the greater Knoxville area initiate the process of change in their homeless situation. Our objectives are simple meet the homeless where they are 'on the street and introduce them to the opportunities, resources and services that will help them correct their presenting problems and issues causing their homelessness.\n\nLocated on the main campus at 418 North Broadway, access via the Broadway parking area, Crossroads Welcome Center is open Monday through Saturday 8:00 a.m. to 4:00 p.m. We close daily from 11:30 a.m. to 1:00 p.m. during lunch."
  },
  {
    "addressLine1": "3009 Lake Brook Blvd.",
    "city": "Knoxville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37909",
    "name": "Samaritan Place",
    "organization": "Samaritan Place",
    "phone": "(865) 684-1880",
    "website": "https://ccetn.org/samaritan-place",
    "description": "Emergency, Transitional and Long-Term Supportive Housing for Seniors\n\nReferrals and Eligibility\nSeniors come to the program through traditional homeless shelters, hospitals, Adult Protective Services and other community resources. Basic eligibility criteria are: age 55 and older; not a threat to self or others; ambulatory; and able to manage daily activities with minimal assistance.\n\nHow the Program Works\nBecause homelessness issues are different for seniors than for their younger counterparts, Samaritan Place provides not only shelter and nourishment but intensive case management focused on that population's unique needs.\n\nSamaritan Place offers both short-term shelter and transitional housing services, which allow the guest and his/her case worker the time needed for appropriate evaluation and arrangement of the best possible living situation and supportive services. Through our long-term supportive housing program, we are able to offer housing to some seniors for whom safe and affordable housing and support services cannot be secured in the broader community.\n\nProgram Goals\nSamaritan Place focuses on the core outcomes of increased control, decreased vulnerability, access to resources and an improved support network. Our overarching goal is to help ensure that each guest is able to live in the most independent environment possible that still ensures their safety."
  },
  {
    "addressLine1": "PO Box 282",
    "city": "Knoxville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37901",
    "name": "The Next Door Knoxville",
    "organization": "The Next Door Knoxville",
    "phone": "(865) 934-2890",
    "website": "http://www.thenextdoor.org/",
    "description": "The Next Door Knoxville Residential Transitional Center opened on February 17, 2010, and the first resident arrived that same day.\nThe Next Door Knoxville has capacity to serve up to 14 women at a time. Residents come to the program from incarceration in Knoxville and the contiguous counties, to find hope and help to re-enter society and rebuild their lives. Services offered include:\n    Transitional housing\n    Recovery support services\n    Individual and group counseling\n    Workforce development support\n    Case management services"
  },
  {
    "addressLine1": "808 Sevier Avenue",
    "city": "Knoxville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37920",
    "name": "Steps House",
    "organization": "Steps House",
    "phone": "(865) 573-7152",
    "website": "http://www.steps-house.com/",
    "description": "A Home for Homeless Veterans\nSteps House Utilizes 105 beds in 38 home sites. We provide shelter and housing for our residents while they find their way back from addiction and homelessness.\nSteps House is a non-profit, (501c3) corporation located in beautiful South Knoxville, Tennessee. We utilize a well trained staff including several state and nationally licensed counselors in order to provide the best possible services to those we serve.\n\nThe Steps House admits men every day of the year.\nFor admission criteria or an application for entry into our program call the Steps House at 865-573-7152.\n\nOur Grant and Per diem program is for the men who  are making a commitment to work toward becoming independent once again. Time limit for this program is 2 years. Clients are eligible for 3 admissions in a lifetime. We can place 40 veterans in this program.\n"
  },
  {
    "addressLine1": "2247 Western Avenue",
    "city": "Knoxville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37921",
    "name": "CAC Knoxville Homeward Bound",
    "organization": "CAC Knoxville Homeward Bound",
    "phone": "(865) 546-3500",
    "website": "http://www.knoxcac.org/",
    "description": "Services: Case management and emergency services for the homeless, including housing, counseling, educational services, and job training.\n\nThe Homeward Bound Program promotes self-sufficiency by assisting homeless individuals and families in achieving their maximum level of independence through housing, education, and employment. A variety of programs serve the homeless and at-risk populations, while staff serve on a number of committees to promote an enhanced level of community services. Programs for clients include:\nREACH\nResources Extended to Assist the Chronically Homeless is a HUD funded street outreach and case management program for individuals & families who stay in camps, vehicles, & under bridges. The purpose is to bring people into shelters and/or housing, while addressing employability & substance abuse concerns.\n \nProject SUCCEED\nA HUD funded program that offers outreach and long term case management to individuals & families residing in homeless shelters or transitional housing. Housing placement, advocacy, parenting classes, budgeting, employability, & adult education are some of the supportive services provided. Case management is available for as long as the client needs to become self-sufficient.\nFamilies In Need\nA HUD funded intensive case management program for individuals and families residing in shelters & transitional programs to promote total independence from public assistance. Housing placement, employment, educational endeavors, life skills, and advocacy are all components of this program.\nEmergency Solutions Grant\nThe ESG provides cash resources to the staff to better serve the homeless clients of the above listed programs. Items regularly acquired through this grant include housing deposits, first month's rent, utility deposits, and other supportive services.\nStranded Travelers\nIndividuals & families who become stranded in the Knoxville area due to no fault of their own & have a legitimate work or medical destination, may receive travel assistance. Proper identification, verification of home, job and /or medical appointment is required. For gasoline assistance, a valid driver's license, insurance & current vehicle registration is required. This service is provided as funding is available."
  },
  {
    "addressLine1": "409 N. Broadway",
    "city": "Knoxville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37917",
    "name": "Salvation Army Knoxville TN - The Thompson Center of Hope",
    "organization": "Salvation Army Knoxville TN - The Thompson Center of Hope",
    "phone": "(865) 525-9401",
    "website": "https://www.salvationarmyknoxville.org/",
    "description": "Programs:\n1. Operation Bootstrap: Provides housing, meals counseling for men facing homelessness. The shelter can house up to 70 men and the average stay is about two weeks. Most move on from here, but many graduate to our Transitional Housing Program.\n\n2. Transitional Housing: The Salvation Army's Transitional Housing program is a more intensive program than Operation Bootstrap. The program requires a 6-month commitment. Clients are expected to maintain full-time employment, pay a minimal amount of rent, save money and work towards personal goals. Participants have a place to stay, meals and the 24-hour support of our staff.\n\nThe program strives to help those who want to regain control of their lives by providing men and women with the necessary support.The men's shelter has room for up to 48 men. The women's shelter can house 18 women. Last year 148 women and 231 men participated in the program.For more information call (865) 525-9401 anytime.\n\n3. Women's Shelter: The Joy D. Baker Center serves women with or without children affected by domestic violence and also serves as a shelter for homeless women with children. Safety is a top priority in our monitored, secure facility. In addition to providing housing and meals, our 24-hour staff serves as counselors and liaisons with both the court and the school systems and can assist with job placement or referrals to other agencies.The shelter has 6 units than can accommodate up to 28 people. The center provided shelter for 120 women and 145 children last year."
  },
  {
    "addressLine1": "801 East Building 2700 Martin Luther King Ave.,",
    "city": "SE Washington",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "20032",
    "name": "Catholic Charities 801 East Men’s Shelter",
    "organization": "Catholic Charities 801 East Men’s Shelter",
    "phone": "(202) 561-4014",
    "website": "https://www.catholiccharitiesdc.org/housinghelp/801east/",
    "description": "Hours: 7 pm to 7 am, daily\n\nEmergency Shelter\nCatholic Charities 801 East Mens Shelter is a low-barrier shelter program open to anyone who identifies as male 18 years and older. The program offers a hot dinner, access to case management staff, showers, and a bed on a nightly basis. The low-barrier shelter provides 380 beds every night and is open from 7 pm to 7 am daily.\n\nShelter hours may be extended due to weather alerts issued by DC government. DC Shelter Hotline Shuttle service to downtown Washington, DC is provided several times per day to assist clients in getting to and from our site. The shelter also serves as a hypothermia emergency shelter during the coldest months of the year, from November to March.\n\nTransitional Rehabilitation Program\nTRP provides a maximum of six months of transitional rehabilitation services for up to forty-six (46) homeless single adult males from 18 years of age and older.  The program aids clients in their recovery and search for permanent housing by offering access to mainstream programs and supportive services appropriate to the clients individual needs.  The program provides individualized case management, addiction counseling services, life skills workshops, and stable supportive housing for six months (6) in order to promote self-sufficiency, harm reduction and sobriety.\nFor intake appointments preferred but walk-ins are welcome. For an appointment call (202) 561-4014 ext.130; Monday to Friday from 10 am to 4 pm.\n\nYouth Transitional Program\nYTP provides transitional shelter services for up to twenty-four (24) homeless single adult males from 18 24 years of age.  All clients must present TB test (no older than six months). Intake appointments preferred but walk-ins are welcome. For an appointment call (202) 561-4014 ext.132; Monday to Friday from 10 am to 8 pm.  The program aids young adults in their search for permanent housing and offers access to other community programs and supportive services appropriate to the clients individual needs. The program provides individualized case management, life skills workshops, and stable supportive housing for up to twenty-four (24) months to promote self-sufficiency and independence."
  },
  {
    "addressLine1": "383 Poplar Avenue",
    "city": "Memphis",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38105",
    "name": "Memphis Day Shelter",
    "organization": "Memphis Day Shelter",
    "phone": "(901) 526-8403",
    "website": "http://www.memphisunionmission.org/",
    "description": "Because being on the streets can be so dangerous, we do everything we can to encourage homeless individuals to stay off the streets and come into our facilities to get help.\n\nOne way we do so is by keeping our Emergency Shelter at 383 Poplar Ave. and our Opportunity Center at 600 Poplar Ave. open to the public during the day. This allows guests to access our services, and discourages loitering and street crime.Because being on the streets can be so dangerous, we do everything we can to encourage homeless individuals to stay off the streets and come into our facilities to get help.\n\nOne way we do so is by keeping our Emergency Shelter at 383 Poplar Ave. and our Opportunity Center at 600 Poplar Ave. open to the public during the day. This allows guests to access our services, and discourages loitering and street crime.\n- See more at: http://www.memphisunionmission.org/how-we-can-help/emergencyservices.htm#sthash.vqYg5GmU.dpuf"
  },
  {
    "addressLine1": "766 S Highland St",
    "city": "Memphis",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "00000",
    "name": "Memphis Family Shelter",
    "organization": "Memphis Family Shelter",
    "phone": "(901) 725-4277",
    "website": "http://www.memphisywca.org/hotline-shelter/",
    "description": "Emergency Shelter for Women and Children Escaping Domestic Violence\nThe YWCA Shelter  is a 27 bed facility that provides the only 24 hour, 7 day a week emergency shelter to abused women and their children. To protect the safety of our clients, the shelter is in an undisclosed location. The YWCA is the only women's shelter of any kind in the city that allows mothers of teenage sons to keep their sons with them, provided the boy is attending high school. Residents of the YWCA shelter are provided with counseling, referrals, and connected with resources that can help them begin their transition to a new life free of abuse. To be admitted to the shelter, call the YWCA hotline at 725-4277."
  },
  {
    "addressLine1": "393 Poplar Avenue",
    "city": "Memphis",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38105",
    "name": "Memphis Union Mission",
    "organization": "Memphis Union Mission",
    "phone": "(901) 526-8403",
    "website": "http://www.memphisunionmission.org/",
    "description": "Shelter:\nMany homeless men live in fear of being robbed, beaten, or even killed. And extreme temperatures can make sleeping on the streets further dangerous.\n\nThat's why providing safe, clean shelter for our overnight guests is so important. Doing so gives hope to our guests, and communicates God's love to them in a practical way.\n\n\nTo create a physically safe environment for all of our guests, we do not tolerate violence of any kind, nor do we allow drugs, alcohol, or weapons in the building. Any guest bringing these into our facility is immediately required to leave so that we can maintain a safe environment for everyone else.\n\nWhen our shelter beds are full, particularly on cold nights, we set up over 100 additional temporary beds in our chapel and an additional 100 temporary beds at our Opportunity Center.\n\nMost of Memphis Union Mission's services are provided free of charge. Our residential recovery programs are free. Furthermore, most of our emergency services, including clothing, hygiene, and food, are also free.\n\nOvernight guests who have elected not to enter a recovery program receive four free nights each month. Once they have used up their monthly free nights, they do pay $6 a night, which includes dinner, overnight stay, and breakfast the following morning.\n\n\nOvernight guests always stay for free on nights when it is 32 degrees or below. Furthermore, we are able to provide work referrals for guests who are willing to work, and we honor vouchers from several area churches and ministries.\n\nWe are structured this way because we do not want to enable our guests. Instead, we want to encourage them to take positive steps to better their situations, including finding employment and/or confronting issues that have landed them on the streets.\n\n\nDay Shelter\nBecause being on the streets can be so dangerous, we do everything we can to encourage homeless individuals to stay off the streets and come into our facilities to get help.\n\nOne way we do so is by keeping our Emergency Shelter at 383 Poplar Ave. and our Opportunity Center at 600 Poplar Ave. open to the public during the day. This allows guests to access our services, and discourages loitering and street crime.\n\nMany\nhomeless men live in fear of being robbed, beaten, or even killed. And\nextreme temperatures can make sleeping on the streets further dangerous.\n\nThat's why providing safe, clean shelter for our\novernight guests is so important. Doing so gives hope to our guests, and\ncommunicates God's love to them in a practical way.\n\nTo create a physically safe environment for all of our\nguests, we do not tolerate violence of any kind, nor do we allow drugs,\n\nalcohol, or weapons in the building. Any guest bringing these into our\nfacility is immediately required to leave so that we can maintain a safe\nenvironment for everyone else.\n\nWhen our shelter beds are full, particularly on cold\nnights, we set up over 100 additional temporary beds in our chapel and\nan additional 100 temporary beds at our Opportunity Center.\n- See more at: http://www.memphisunionmission.org/how-we-can-help/emergencyservices.htm#sthash.vqYg5GmU.dpuf"
  },
  {
    "addressLine1": "3630 Jackson Avenue",
    "city": "Memphis",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38108",
    "name": "Safe Harbor of Memphis",
    "organization": "Safe Harbor of Memphis",
    "phone": "(901) 382-0966",
    "website": "http://www.safeharbormemphis.org/",
    "description": "Lighthouse is a faith-based recovery support services and transitional housing program. Emergency shelter is offered for three days during fair weather-longer in weather emergencies. After the initial 3 days, individuals who desire active recovery may enter a long term (6 months to 1 year) program and must work (if able)in order to contribute to the cost of their care. Fair wages are paid in the work program; on graduation a rent and utility deposit is paid on behalf of the graduate who also receives a Walmart voucher for household items. This is a Christian facility; however, our programs are inclusive, and we offers services regardless of race, creed, color, or doctrine."
  },
  {
    "addressLine1": "960 South 3rd St.",
    "city": "Memphis",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38106",
    "name": "Calvary Rescue Mission",
    "organization": "Calvary Rescue Mission",
    "phone": "901-775-2570",
    "website": "https://calvaryrescuemission.org/",
    "description": "Overnight shelter for men. Providing meals, shelter, counseling.\nIntake 4:00-7:00 pm daily.\n\nCALVARY Rescue Mission is a non-profit, independent, faith-based shelter for homeless men in Memphis, TN. We serve two full meals a day, offer clothing to the homeless, have a 2500 volume library, and provide nightly chapel services, counseling, a discipleship program, and lodging."
  },
  {
    "addressLine1": "1183 Madison Avenue",
    "city": "Memphis",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "38104",
    "name": "Alpha Omega Veterans Services, Inc.",
    "organization": "Alpha Omega Veterans Services, Inc.",
    "phone": "(901) 726-5066",
    "website": "http://www.alphaomegaveterans.org/",
    "description": "Alpha Omega Veterans Services is a 501(c)(3) non-profit charitable organization headquartered in Memphis, Tennessee that assists military veterans to reintegrate into society, often after achieving recovery and rehabilitation from chronic homelessness and debilitating mental and physical conditions. We were one of the first independent non-profit organizations in the United States that specialized in providing housing and other supportive services to military veterans.\n\nInitially serving 8 veterans, Alpha Omega now has the capacity to house over 100 veterans (male and female) and provide counseling services to many more. We have served nearly 10,000 veterans since those humble beginnings. Today, Alpha Omega provides each veteran with a 30-day to 2-year program with a goal of having them successfully rejoin society, engage in healthy independent living, and secure placement into permanent housing. Each program has an integrated system of services including food, clothing, housing, transportation and assistance with rehabilitation that have been designed to meet the needs of our veterans.\n\n\nDuring the course of their program, every veteran receives intensive counseling on both an individual and group basis to deal with combat/service-related conditions such as anger management, substance abuse, combat stress, PTSD and other mental health disorders."
  },
  {
    "addressLine1": "717 East Broadway",
    "city": "West Memphis",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "72301",
    "name": "8th Street Mission",
    "organization": "8th Street Mission",
    "phone": "(870) 735-6010",
    "website": "http://www.8thstreetmission.org/",
    "description": "We currently house both men and women at our shelter, but we do not yet have a location for women with children.\nServices:\nFood: Hot meals and emergency food boxes for the hungry\nShelter: Emergency overnight shelter for the homeless\n\nClothing: Emergency clothing and low-priced thrift stores\nGasoline and Bus Vouchers: as funding permits\nPrescription Assistance: as funding permits\n\nWe provide an array of programs and services to the homeless in Eastern Arkansas, including emergency shelter, a long-term addiction recovery program, healthcare/counseling, educational/occupational training, and other vital human services.\n\nChristian based Church/Mission/Drug and Alcohol Rehab discipleship program."
  },
  {
    "addressLine1": "104 Cypress",
    "city": "Marion",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "72364",
    "name": "East AR Youth Services",
    "organization": "East AR Youth Services",
    "phone": "(870) 739-4219",
    "website": "http://eays.org/",
    "description": "Youth shelter for boys and girls. Can stay 30 - 60 days on emergency basis. Can stay up to 1 year for residential treatment"
  },
  {
    "addressLine1": "733 W Main Street",
    "city": "Morristown",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37814",
    "name": "Ministerial Association Temporary Shelter (M.A.T.S.)",
    "organization": "Ministerial Association Temporary Shelter (M.A.T.S.)",
    "phone": "(423) 587-9215",
    "website": "https://www.matstn.com/",
    "description": "Only full service homeless shelter in Lakeway area of east Tennessee serving men, women, and children with shelter, food, and counseling.\n\n\n\nWe operate our facility in Hamblen County; however, we also serve 9 other Counties which surround us. Those counties include, Jefferson, Grainger, Hawkins, Hancock, Claiborne, Union, Greene and Sevier counties.\n\n\n\n\nWe believe that in order to change the face of homelessness, we must provide more than the basic needs (shelter, food, and clothing) to each individual we serve. This is why we are more than an emergency shelter. We are a program for the homeless which also provides their basic needs while learning new, healthy life sustaining habits.\n\n\n\nWe offer our residents a structured program to prepare to enter the community again. Residents are required to get jobs and do daily chores. Everyone meets with a case manager twice a week to review job tracking sheets, discuss mental illness, counseling, medical care, budgeting, and more."
  },
  {
    "addressLine1": "807 W 1st N St",
    "city": "Morristown",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37815",
    "name": "CEASE, Inc - Domestic Violence Shelter",
    "organization": "CEASE, Inc - Domestic Violence Shelter",
    "phone": "(800) 303-2220",
    "website": "https://ceaseabuse.sitey.me/",
    "description": "CEASE, Inc. has two full service shelters in Hamblen and Claiborne Counties with a combined total of 26 beds. We serve survivors of domestic violence and sexual assault as well as their pets, giving them a safe place to call home."
  },
  {
    "addressLine1": "1750 West Hwy 25 70",
    "city": "New Market",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37820",
    "name": "Safe Harbor of Jefferson County",
    "organization": "Safe Harbor of Jefferson County",
    "phone": "(865) 375-0382",
    "website": "http://www.safeharborjc.org/",
    "description": ""
  },
  {
    "addressLine1": "1137 West Main St",
    "city": "Murfreesboro",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37133",
    "name": "Salvation Army Center of Hope",
    "organization": "Salvation Army Center of Hope",
    "phone": "(615) 895-7071",
    "website": "https://www.salvationarmymurfreesboro.org/",
    "description": ""
  },
  {
    "addressLine1": "308 West Castle Street",
    "city": "Murfreesboro",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37129",
    "name": "Journey Home Day Shelter",
    "organization": "Journey Home Day Shelter",
    "phone": "(615) 809-2644",
    "website": "http://lovegodservepeople.org/",
    "description": ""
  },
  {
    "addressLine1": "639 Lafayette St",
    "city": "Nashville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37203",
    "name": "Nashville Rescue Mission",
    "organization": "Nashville Rescue Mission",
    "phone": "(615) 255-2475",
    "website": "https://nashvillerescuemission.org/",
    "description": "Emergency Shelter Separate men's shelter and women and children shelter.\nMen's Campus\n639 Lafayette Street\nNashville, TN 37203-4226\n\nWomen's Campus\n1716 Rosa L. Parks Blvd.\nNashville, TN 37208\n\nProgram for men:\nThe men's life-recovery program uses a Christ-centered approach to helping men 18 and over resolve personal problems and chemical addictions. During his time in the program, a man will receive Christian counseling, participate in work therapy, learn how to heal from past wounds and develop new and healthy ways of coping. He will also get the chance to study the Bible and participate in the education program to improve his academic and employment skills or obtain his GED. A life-recovery graduate contributes to the community by finding gainful employment and moving into stable housing. More importantly, a man is made spiritually whole, with many years ahead to build and grow God's kingdom. After graduating, men also have the opportunity to move into the Mission's transitional housing until they are able to get back on their feet and find permanent housing. More information and requirements are below.\n\nProgram for women\nWomen who are homeless, abused or chemically dependent can find refuge, safety and healing at the Nashville Rescue Mission. During her stay, a woman will receive Christian counseling, including one-on-one as well as group sessions, learn how to heal from past wounds and open up to new, healthy relationships. She will also have an opportunity to study the Bible and participate in the education program in order to improve her academic and employment skills or obtain her GED. Mothers are also taught good parenting techniques. Bright colors, open spaces and play areas help kids regain their childhood. Each woman and her children enjoy time together where they can establish a feeling of safety and a sense home. After graduating, women have the opportunity to move into the Mission's transitional housing until they are able to get back on their feet and find permanent housing.\n\n\n\nEmergency Services\n- Food\n- Shelter\n- Clothing\n- Hot Showers and Personal Hygiene\n- Day Room\n- Counseling\n- Spiritual Encouragement\nThe Nashville Rescue Mission operates two campuses. The main campus houses the administrative offices, as well as services for men. The second campus houses all services for women and children. Each location is applicable to the emergency services described below.\n\nFood\nIf you or your loved ones are in immediate need of food, the Nashville Rescue Mission serves 3 meals a day and we are open 365 days a year.\n\nMeal Times:\nMen's Campus: Monday-Saturday\nBreakfast - 5:30 a.m.\nLunch - noon\nDinner - 6:00 p.m.\n\nMen's Campus: Sundays\nBreakfast - 6:00 a.m.\nLunch - noon\nDinner - 6:00 p.m.\n\nWomen's Campus: Monday-Sunday\nBreakfast - 6:30 a.m.\nLunch - 11:00 a.m.\nDinner - 5:00 p.m.\n\nShelter\nIf you are homeless and wish to escape the dangers of sleeping on the street, you can find safe shelter at the Nashville Rescue Mission. We are open 365 days a year.\n\nBed assignments are given out on a first-come, first-serve basis following shower times, which are from 7:00 am to 9:00 am and again from 11:00 am to 6:00 pm.\n\nClothing\nIf you or your loved ones are in immediate need of clothing, the Nashville Rescue Mission's clothing rooms are open from 3:00 pm to 5:00 pm Monday through Saturday. Clothing is available free of charge.\n\nHot Showers and Personal Hygiene\nRestrooms, hot showers and personal hygiene supplies are all available, including diapers. Showers are open from 7:00 am to 9:00 am and again from 11:00 am to 6:00 pm.\n\nDay Room\nSeparate enclosed courtyards and spacious indoor assembly areas provide a safe, environment for hundreds of men, women and children to spend their daylight hours when environmental factors (too hot, too cold, rain, snow) might otherwise put them at risk.\n\nCounseling\nCaring counselors, who provide assistance and referrals for employment, housing, government aid, life-recovery and other services, assess each individual's unique circumstances."
  },
  {
    "addressLine1": "705 Drexel St.",
    "city": "Nashville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37203",
    "name": "Room at the Inn Nashville",
    "organization": "Room at the Inn Nashville",
    "phone": "(615) 251-9791",
    "website": "http://www.roomintheinn.org/",
    "description": "OPERATING HOURS:\nSummer (Apr to Oct): Mondays through Fridays 6am to 12 noon, 1pm to 2pm.\nWinter (Nov to March):  7 days a week, 6am to 12pm, 1pm to 4pm.\n\n\nAt Room In The Inn, home is made from tangibles and intangibles. Shelter. Respect. Food. Independence. Family. Safety. Health. Love. Support. Room In The Inns mission is to provide these to you our neighbors struggling with homelessness every day.  Room In The Inn offers emergency assistance, transitional support and permanent solutions in collaboration with more than 50 other agencies and over 190 congregations.\nPrograms and services include:\n\nCrisis Support\n    Day Shelter & Emergency Winter Shelter\n    Veterans Drop-In Center\n    Rent & Utility Deposit Assistance\n    Jail Alternative for the publicly intoxicated in partnership with Metro Police\n\nHospitality\n    Documentation Assistance\n    Meal Program\n    Transportation Services\n    Personal Care Services, Supplies & Laundry Services\n    Address/Mail Services & Telephone/Internet Access\n\nEducation\n    GED Program & Accredited Associates Degree Program\n    Literacy Programs & Lending Library\n    Workforce Development\n    Computer Skills, Creative Expression & Life Skills Classes\n    Alcohol & Drug Education & Referrals\n    Daily Spiritual Reflection\n\nShelter\n    Recuperative Care for the Medically Fragile\n    Housing for those Awaiting Alcohol & Drug Treatment Programs\n    Transitional Housing for the Chronically Homeless\n    Transitional Housing for Veterans\n    Short-Term & Long-Term Storage\n    Secure Document & Medication Storage\n\nLong-term Solutions\n    On-Campus, Permanent, Affordable Housing\n    Case Management & Supportive Counseling\n    Employment Search & Placement Assistance\n    Long-Term Communities of Support\n\nOther important services:\nYou may receive mail at Room In The Inn\nShowers are available from 6am to 8am in the morning. Basic toiletries are also available.\nTelephones are available.\nSubstance Abuse Recovery Program. Meetings help 9am to 1:30pm.\nLunch is served Mondays, Tuesdays, Thursdays, Fridays. Tickets are distributed at 10:15am.\nSunday breakfast at 9am.\nStorage is provided for your belongings.\n\nRecuperative Care\nOur recuperative care program is a residential program for men and women struggling with homelessness who are discharged from the hospital but are still in need of post-treatment care.  They may need time to recover from a trauma or assault, mange a chronic contition, stabilize on a new medication, prepare for a medical procedure, or recover from a serious viral or bacterial illness.  With this time to recuperate comes a clean bed, three meals a day, showers, help following post-care instructions, prescription assistance, help with making follow-up appointments, and assistance with other needs.\nWe have recently expanded our recuperative care program and we now have 21 beds for homeless individuals who have a need for medical respite but have no place to go.  We have strengthened our partnerships with area hospitals, including HCA/TriStar, St. Thomas, Vanderbilt Medical Center, and others. \n\nOur staff works with hospitals and other healthcare providers to take referrals, and develop post-stay exit plans for our guests.  Our goal is for each recuperative care guest to have an action plan in place by the end of their stay.  Many guests who first came to us for recuperative care have been connected with the wide array of resources available through Room In The Inn and continued their journey to permanent housing."
  },
  {
    "addressLine1": "1234 3rd Avenue South",
    "city": "Nashville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37210",
    "name": "Safe Haven Family Shelters",
    "organization": "Safe Haven Family Shelters",
    "phone": "(615) 256-8195",
    "website": "http://safehaven.org/",
    "description": "Emergency Shelter Families Only.\n\nSafe Haven Family Shelter is now only taking referrals through Nashvilles Coordinated Entry System at Metro Social Services. If you are a family in need of housing assistance, please call 615-862-6444 to be connected with services.\n\n\n\nSafe Haven is the only shelter-to-housing program of its kind in Middle Tennessee that accepts the entire homeless family. We keep the family together and provide comprehensive services that empower them to achieve lasting self-sufficiency. As our name implies, we have an emergency shelter program, but we also offer a Transitional Housing Program and Rapid Rehousing Program. Safe Haven Family Shelter's comprehensive approach is one of service, compassion, trauma-informed care and evidenced-bases practices."
  },
  {
    "addressLine1": "1608 Woodmont Blvd",
    "city": "Nashville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37207",
    "name": "YWCA of Nashville and Middle Tennessee",
    "organization": "YWCA of Nashville and Middle Tennessee",
    "phone": "(615) 269-9922",
    "website": "https://www.ywcanashville.com/",
    "description": ""
  },
  {
    "addressLine1": "402 22nd Ave N",
    "city": "Nashville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37203",
    "name": "The Next Door Nashville",
    "organization": "The Next Door Nashville",
    "phone": "(615) 251-8805",
    "website": "https://thenextdoor.org/",
    "description": "The Next Door Nashville is located in downtown Nashville, Tennessee and provides recovery support services for women with an addiction to alcohol and drugs or co-occuring mental illness. .\n\n\n\nPrograms Offered At The Next Door Nashville\n\nResidential Treatment Program\n\nPartial Hospitalization Program\n\nIntensive Outpatient Program\n\nOutpatient Program\n\nResidential Transition Center\n\nFreedom Recovery Community\n\nLifetime Recovery Management\n\nFamily Enrichment Program\n\nWorkforce Development\n\n\n\nAt The Next Door we celebrate the transformation in the lives of women in crisis knowing God has a plan and purpose for your life that is good. No one is defined by her past. Recovery is possible.\n\n\n\nWith an evidence-based approach to clinical treatment for drug and alcohol addiction, 0ur mission is to address the physical, mental, and spiritual needs of women in crisis, equipping them for lives of wholeness and hope.\n\n\n\n\nThe Next Door, Inc. is a faith-based organization based in Nashville, Tennessee, serving women in four locations: Residential Transition Centers in Nashville, Knoxville, and Chattanooga and a permanent housing complex for women and their children, located near downtown Nashville. In each location, women are part of a supportive program that strives to help them move from lives of poor choices and a sense of helplessness to productive, independent living."
  },
  {
    "addressLine1": "631 Dickerson Pike",
    "city": "Nashville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37207",
    "name": "Salvation Army Nashville - Transitional Housing",
    "organization": "Salvation Army Nashville - Transitional Housing",
    "phone": "(615) 242-0411",
    "website": "http://salvationarmynashville.org/our-programs/supportive-housing/",
    "description": "Transitional Housing at this location.\n\nAt The Salvation Army Nashville Area Command Center of Hope, we offer long-term transitional housing programs and life skills to help people become independent and lead happier lives.\n\nTransitional Housing for Families & Single Women:\n\nProvides safe, affordable housing and social work case management for families and single women who are homeless, in transition, training programs or treatment and recovery, or who are victims of abuse and neglect. The goal of the program is to assist homeless families and single women in gaining the employment and personal skills necessary to achieve financial and personal stability and move to permanent housing. Based on our track record, approximately 65% of homeless families enrolled in the program will maintain a permanent source of income and move into permanent housing. Eighty percent of single women enrolled in the program will maintain a permanent source of income and move to permanent housing.\n\nProgram services include:\n\nKare for Kids 3 STAR licensed child care,\nLife skills learning classes, including GED tutored training, job readiness and search assistance, financial literacy (including Dave Ramsey training)\nIndividualized, plan-based case management and more!\n\n\nEach resident or family in the program has their own living quarters (apartment) and access to our shared family and women's lounges."
  },
  {
    "addressLine1": "511 S. 8th St",
    "city": "Nashville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37072",
    "name": "Ken & Carol’s Community Care Fellowship",
    "organization": "Ken & Carol’s Community Care Fellowship",
    "phone": "(615) 227-1953",
    "website": "https://www.ccfnashville.org/",
    "description": "Food. Clothing. Hygiene. Safety. Health.\n\nUrgent needs will be addressed through our stabilizing services first at CCF. Our facility is open Monday - Friday from 9am - 3pm, and we also serve a to-go style lunch on Sundays at 12:30pm\n\nBreakfast & Devotion: Monday Friday 9 9:30 a.m.\n\nLunch & Devotion: Tuesday, Thursday, & Friday, 11:30am 12:30pm\n\nShowers: Monday Friday, 9am 1pm\n\nLaundry: Monday Friday, 25 loads per day (first come, first served)\n\nHygiene Items: Monday Friday, 9:30am - 2:30pm\n\nMail Services: Monday Friday, 1pm Mail Call\n\nPhone: Monday Friday, 9:30am 2pm\n\nClothing:  Monday Friday, 1pm 3pm\n\nFree Wi-Fi:  Monday Friday, 9am 3pm\n\nOn Site Partners & Transformational Programs\n\nCCF hosts a number of community partners every week, connecting our guests to a network of services that span the city. We also offer in-house career and pastoral counseling services.\n\nMental Health Coop:  Tuesdays, 10 am 1pm\n\nSalvation Army:  Tuesdays, 10am 12pm\n\nOpen Table Nashville:  Thursdays, 9:30am 11:30am (Housing Navigation)\n\nSafe Haven Family Shelter:  Fridays, 10am 12:30pm (Housing Navigation)\n\nCareer Counseling:  Tuesdays, 10:30am 12:30pm\n\nPastoral Counseling: Monday Friday, 10am 12pm\n\nDocuments, Applications, & Referrals:  Monday Friday, 10am 12pm"
  },
  {
    "addressLine1": "1704 Charlotte Ave, Suite 200",
    "city": "Nashville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37203",
    "name": "Oasis Center - Youth Shelter",
    "organization": "Oasis Center - Youth Shelter",
    "phone": "(615) 327-4455",
    "website": "https://oasiscenter.org/",
    "description": "Crisis Services (24/7)\n615-327-4455\n\n\nOffice hours: Mondays through Fridays 9am - 5pm.\nServices:\nEmergency Youth Shelter - The only residential shelter in Nashville for teens (ages 13 - 17) who have runaway or are homeless. The Emergency Youth Shelter is a two week therapeutic program that provides young people in crisis a place of respite, support, and healing. For over 40 years, this program has demonstrated incredible success helping a young person stabilize emotionally and socially so that they can successfully reunite with their families.\n\nStreet Outreach Program- An experienced and dedicated team of staff and volunteers are on the streets of Nashville every week reaching out to homeless youth so they are aware of people and places where they can turn to for help.\n\n\nHarwell Lofts- Our Harwell Loft residential program offers homeless youth (ages 18-21) the opportunity to get back on their feet while living with us for up to 20 months."
  },
  {
    "addressLine1": "523 Church Street",
    "city": "Nashville",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37219",
    "name": "Restoration Pointe's Foundry Temporary Shelter",
    "organization": "Restoration Pointe's Foundry Temporary Shelter",
    "phone": "(615) 271-2600",
    "website": "https://mckendreenashville.com/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 5402",
    "city": "Oneida",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37841",
    "name": "Scott County Women's Shelter",
    "organization": "Scott County Women's Shelter",
    "phone": "(423) 569-3355",
    "website": "https://www.facebook.com/scws.havenofhope",
    "description": "Office: 423.569.3355\nCrisis: 423.569.3333\n\nOffice hours: Mondays through Saturdays 9am - 5pm.\n\nWalk in or call.\n\nThe Scott County Women's Shelter provides advocacy and support to victims of domestic violence. Services are FREE and confidential.\n\nServices: Emergency Shelter, Advocacy, Civil & Criminal Justice Support, Crisis Intervention & Counseling, Support Groups, Community Education, and 24-hour Crisis Line.\n"
  },
  {
    "addressLine1": "5032 HWY 230 W",
    "city": "Only",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37140",
    "name": "Safe Harbor of Bucksnort",
    "organization": "Safe Harbor of Bucksnort",
    "phone": "(931) 994-5800",
    "website": "https://www.safeharborbucksnort.org/",
    "description": "At Safe Harbor, we consider it a privilege to serve the men and women in our care. These participants have come to us from living in the streets or ex-offenders that needed somewhere to go. We strive to provide them with so much more than food and shelterwe strive to make a lasting difference through group and pastoral counseling, life building classes, and finding them permanent employment which provides stability once they leave our care.The Nehemiah Program is a Faith-Based Recovery Support Services Program. The program requires a six-month commitment.All clients must agree to comply with program guidelines at all times.Clients must work during their stay to pay for their recovery.We will attempt to secure employment for you through our Back to Work Program.Coordination with Courts and Parole or Probation Offices is provided.Transitional Housing, Meals, and Transportation are furnished."
  },
  {
    "addressLine1": "P.O Box 2611",
    "city": "Tullahoma",
    "state": "Tennessee",
    "stateAbbreviation": "TN",
    "postal": "37388",
    "name": "Citizens for Homeless Relief - Shepherds House",
    "organization": "Citizens for Homeless Relief - Shepherds House",
    "phone": "(931) 393-4818",
    "website": "https://shepherdshousetullahoma.com/",
    "description": "Our mission is to provide food, clothes, and temporary housing for the homeless while helping them gain independent employment and housing.\n\nShepherd's House is the only homeless facility in Coffee, Franklin, Moore, Grundy, and Warren counties.  The Shepherd's House mission is to provide food, clothes, and temporary housing for the homeless.  The Christian based environment provides hope in the future and helps heal broken lives.  Their goal is for each resident to find employment, move into an apartment of their own, become a buyer of goods and services, and pay taxes."
  }
]