[
  {
    "addressLine1": "445 Work Ave",
    "city": "Benedict ",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68316",
    "name": "Wetzel Homeless Shelter",
    "organization": "Wetzel Homeless Shelter",
    "phone": "(402) 732-6565",
    "website": "http://www.nethanelministries.org/",
    "description": "We are slowly decommissioning an older school building into living quarters. We have 17 classrooms that are currently being upgraded into sleeping quarters designed specifically for Nebraska only families who suddenly find themselves homeless due to fire, flood, or tornado. Cooking and bathing areas are under renovation. At this time, transportation services are not available, nor is there heat or air conditioning in the rooms. Due to our remote location, television, telephone, and internet services are also not available. Since we do not receive charitable contributions nor financial help from government agencies, we do not accept people just looking to relocate to find a job. Donations of bedroom furniture would be greatly appreciated."
  },
  {
    "addressLine1": "1471 25th Ave",
    "city": "Columbus",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68601",
    "name": "Columbus Rescue Mission",
    "organization": "Columbus Rescue Mission",
    "phone": "(402) 563-1096",
    "website": "https://twitter.com/chaplaindavid",
    "description": "Homeless shelter is a 2 week overnight program. Meals are provided. Call for details."
  },
  {
    "addressLine1": "723 North Broad Street",
    "city": "Fremont",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68025",
    "name": "LifeHouse",
    "organization": "LifeHouse",
    "phone": "(402) 721-3125",
    "website": "https://lifehousene.org/",
    "description": "Emergency Shelter & Case Management\n\nLifeHouse provides a 24/7 emergency shelter. The shelter has 60 beds with rooms for both families and singles, including rooms with bathrooms. Individuals served in the shelter program receive a bed/bedding, hot showers/towels, hygiene items, three meals/day, laundry facilities, cable TV and phone usage. One hundred percent of participants receive case management services, which can include health screenings and mental health therapy, budgeting assistance and numerous Life Skills programming. The average length of stay is just under 30 days.\n\n\n\nRapid Re-Housing Housing\n\nRapid re-housing places priority on moving a family or individual experiencing homelessness into permanent housing as quickly as possible. This follows the Housing First philosophy, which offers housing without preconditions. The model has shown success by helping households exit homelessness and not return to shelter. It also helps decrease the number of people experiencing homelessness and the amount of time households spend homeless.\n\n\nTransitional Housing\n\nThe Transitional Housing program at LifeHouse is designed to provide homeless individuals and families with the interim stability and support to successfully move to and maintain permanent housing. This program may be used to assist in costs of up to 24 months of housing with accompanying supportive services. The goal is to help participants achieve independence and long-term sustainability.\n\n\nPermanent Supportive Housing\n\nLifeHouse's Permanent Supportive Housing program is housing with indefinite leasing, or rental assistance, paired with supportive services to assist homeless persons with a disability or families with an adult or child member with a disability achieve housing stability. LifeHouse partners with nearly 10 area landlords to administer this program\n\n\nPrevention & After-care\n\nLifeHouse is one of many agencies in Fremont that administer Basic Needs funding to assist those at risk of homelessness with a one-time payment of rent or utilities. Separate from this programming, LifeHouse offers basic needs beyond shelter such as screenings, hygiene items, emergency food, Life Skills programming and more. After-care is also offered to all former program participants to help ensure they will not return to homelessness.\n\n\nLife Skills\n\nSkills such as time management, goal setting and organization are necessary to achieve success in the job market and in moving beyond homelessness. Several Life Skills classes are offered at LifeHouse weekly to help with these skills and more. Examples include Positive Aspects of Change, Love and Logic, Rent Wise, Making Healthy Decisions, Smoking Cessation, Fair Market Housing, Family and Food, Budgeting and Employment Skills Development. NA and AA meetings are held on-site as well as optional community Bible studies and after-school tutoring. Shelter participants are also responsible for a daily chore, another learning opportunity.\n\n\nFood Pantry\n\nLifeHouse's Food Pantry provides access to the basic need of food as nutrition play a vital role in the health and quality of life for individuals and families. Our program objective is to provide a seven-day supply of nutritional food so program participants' limited earnings are made available for other life necessities such as medical expenses, car maintenance, utilities, and rent. Our Food Pantry takes place every Tuesday from 10am-2pm and Thursday from 5-7pm. The Food Pantry can also be accessed outside normal pantry hours by bringing a voucher into the office during regular office hours. Foods are reflective of the USDA \"My Plate\" guidelines."
  },
  {
    "addressLine1": "1702 Nicholas Street",
    "city": "Omaha",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68102",
    "name": "Siena Francis House",
    "organization": "Siena Francis House",
    "phone": "(402) 341-1821",
    "website": "https://sienafrancis.org/",
    "description": "Siena Francis House operates Nebraskas largest emergency shelter and is located at 17th & Nicholas Streets in downtown Omaha, Nebraska.\n\nSiena Francis House provides emergency overnight shelter for individuals experiencing homelessness. Siena Francis House also provides food to the hungry and homeless through our Meal Program, clothing, and case management outreach services through our Rehousing and Reintegration Services program\n\nPermanent Supportive HousingSienna Francis House also provides two permanent supportive housing residences.\nEach building contains 24 efficiency apartment units (48 total units). Each apartment houses an individual who was chronically homeless and has a disabling condition. The apartment facilities constructed along 18th Street, directly west of our existing facilities complement our women's and mens shelters, as well as the transitional housing we currently provide. Individuals who live in these efficiency apartment units also have the ability to utilize the services provided in our Services Center.\n\n\nThe Service Center is located immediately north of the apartments. This facility contains a reception area, offices for our employees and for employees of our partnering agencies, classrooms, meeting rooms and nursing stations. Our case managers work closely with, and provide services to, the individuals who stay in the apartments, as well as to all of the homeless who come to us in need of services. The Service Center is a one stop service center that helps people experiencing homelessness to obtain employment, off campus housing, healthcare, education, social services, veterans-specific services and other government assistance, and mental health services.\n\n\nFor tenancy, Siena/Francis House prioritizes individuals who have a disability and are chronically homeless. Referrals for units are received through the Metro Area Continuum of Care for the Homeless (MACCH), HUD CoC NE 501, Coordinated Entry System.\n\nLocation: Siena Francis House campus is located two blocks north of Cuming on 17th Street.\n"
  },
  {
    "addressLine1": "2723 Q St",
    "city": "Omaha",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68107",
    "name": "Pettigrew Emergency Shelter",
    "organization": "Pettigrew Emergency Shelter",
    "phone": "(402) 731-0238",
    "website": "https://www.stephencenter.org/",
    "description": ""
  },
  {
    "addressLine1": "2828 North 23rd Street East",
    "city": "Omaha",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68119",
    "name": "Open Door Mission",
    "organization": "Open Door Mission",
    "phone": "(402) 422-1111",
    "website": "http://www.opendoormission.org/",
    "description": "Emergency Shelter Open 24 Hours a Day\nSeeking Emergency Shelter, please call us at: 402-422-1111\n\nLydia House / Women & Families\nEmergency and transitional services for single women & families in need of assistance. Food, shelter, clothing, and other basic needs are provided. Case managers guide women & families through opportunities for life change the first steps toward preventing future homelessness. Special services provided for children, domestic violence, and family reunification.\nCall (402) 829-1531 for shelter availability. Ask for staff on duty.\n\nApplications for the Lydia House are also accepted at 1:00 p.m. every Monday and Wednesday, except holidays and Omaha Public School weather closure days.\n2809 N 20th St E\nOmaha, NE 68110\n\nGarland Thompson Men's Center\nProvides emergency services for men in need of immediate assistance. Food, shelter, clothing and other basic needs are provided and each man is offered an opportunity for life change through resource case management, which provides the first steps toward preventing future homelessness. Special services provided for Veterans.\nWalk-ins accepted\n2705 N 20th St E\nOmaha, NE 68110\n(402) 829-1500 ext. 2100\n\nLife-Changing Programs\nNew Life Recovery Program\nBible-based 12-step residential program committed to providing men, women, and families with the tools needed to become self-sufficient community members.\n\nJourney to Work Program\nResidential Work program focused on personal development, money management, job training, and educational skills.\n\nRental Housing\nPermanent Supportive Apartments\nWaitlist available for families and single women.  Two and three bedroom apartment rentals for women and families desiring to live independently in an affordable, stable, supportive, sober-living community.\n\nSingle Room Occupancy Rentals\nWaitlist available for single men & male Veterans.  Independent-affordable-long term rentals located in a stable, supportive, sober-living community focused on the needs of single men and Veterans.\n\nFree Hot, Nutritious Meals for the Hungry and Homeless Prevention Programs for the Poor and Needy\nMonday-Sunday\nHot Lunch\n11:00 a.m. 1:00 p.m.\nHot Dinner\n6:15 7:00 p.m.Garland Thompson Men's Center\n2705 N 20th St E\nOmaha, NE 68110\n\nFurniture & Appliance Assistance\n(402) 829-1560\nCall for instructions and available items.\nOnly at the\nTimberlake Outreach Center\n2107 E Locust St\nOmaha, NE 68110\n\nHomeless Prevention Programs\n(402) 829-1510\nFree clothing, shoes, toys, household items, diapers and food pantries. Some USDA foods are used in food pantries.  (USDA is an equal opportunity provider and employer.)  Resources are provided once every 30 days throughout all four Outreach Centers.To receive assistance, bring a current ID and proof of address.\n"
  },
  {
    "addressLine1": "2828 N. 23rd St. East",
    "city": "Omaha",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68108",
    "name": "Jacob Rand Day Room",
    "organization": "Jacob Rand Day Room",
    "phone": "(402) 422-1111",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "1435 N. 15th St.",
    "city": "Council Bluffs",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "51501",
    "name": "New Visions Homeless Shelter Council Bluffs",
    "organization": "New Visions Homeless Shelter Council Bluffs",
    "phone": "(712) 256-3940",
    "website": "https://www.newvisionshs.org/",
    "description": "Joshua House\nLocated on the Council Bluffs campus, Joshua House is a 24-hour emergency shelter that meets the needs of homeless men in and around the Council Bluffs and Omaha-metro area.  Each year, the program shelters 800+ men who are experiencing homelessness.  Joshua House is the only mens shelter in southwest Iowa, offering the following services:\n\n    Safe environment with access to on-site laundry, shower and meal services\n    Case management\n    Counseling/Therapy referrals\n    Housing resources\n    Income/Employment resources\n    Transportation\n    On-site health and dental services provided by All Care Health Center"
  },
  {
    "addressLine1": "1415 Ave J",
    "city": "Council Bluffs",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "51501",
    "name": "Micah House",
    "organization": "Micah House",
    "phone": "(712) 323-4416",
    "website": "http://www.themicahhouse.org/",
    "description": ""
  },
  {
    "addressLine1": "3350 10th Street",
    "city": "Gering",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "69341",
    "name": "Community Action Partnership of Western Nebraska Shelter Gering",
    "organization": "Community Action Partnership of Western Nebraska Shelter Gering",
    "phone": "(308) 635-3089",
    "website": "https://capwn.org/",
    "description": ""
  },
  {
    "addressLine1": "4700 Ocean Loop",
    "city": "Cheyenne",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "82009",
    "name": "Richards Center",
    "organization": "Richards Center",
    "phone": "(307) 634-8499",
    "website": "",
    "description": "For all homeless."
  },
  {
    "addressLine1": "3304 Sheridan Ave",
    "city": "Cheyenne",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "82009",
    "name": "CHEYENNE HOUSING AUTHORITY",
    "organization": "CHEYENNE HOUSING AUTHORITY",
    "phone": "(307) 634-7947",
    "website": "https://www.facebook.com/Cheyenne-Housing-Authority-142832572430055/",
    "description": "public housing provided for homeless or low income families and persons."
  },
  {
    "addressLine1": "610 W. Division",
    "city": "Grand Island",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68801",
    "name": "Hope Harbor",
    "organization": "Hope Harbor",
    "phone": "(308) 385-5190",
    "website": "http://www.hopeharborgi.org/",
    "description": ""
  },
  {
    "addressLine1": "818 West 3rd Street",
    "city": "Grand Island",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68801",
    "name": "Salvation Army Grand Island Emergency Shelter",
    "organization": "Salvation Army Grand Island Emergency Shelter",
    "phone": "(308) 382-4855",
    "website": "https://centralusa.salvationarmy.org/grandisland/provide-housing/",
    "description": ""
  },
  {
    "addressLine1": "702 W 14th St",
    "city": "Hastings",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68901",
    "name": "Crossroads Center Rescue Mission Hastings",
    "organization": "Crossroads Center Rescue Mission Hastings",
    "phone": "(402) 462-6460",
    "website": "http://www.crossroadsmission.com/",
    "description": "Established in 1983 as a soup kitchen, Crossroads is now a 90-bed facility with a four-phase program to help homeless men, women & families get back on their feet. We are located in Hastings, Nebraska. Our mission is to bring glory to God through the helping of people."
  },
  {
    "addressLine1": "1404 E 39th Street",
    "city": "Kearney",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68847",
    "name": "Crossroads Rescue Mission Kearney",
    "organization": "Crossroads Rescue Mission Kearney",
    "phone": "(308) 236-5688",
    "website": "http://www.crossroadsmission.com/",
    "description": "Homeless shelter and services for persons from Buffalo County.\n\nCrossroads, which was established in Hastings in 1983, is a Christian organization that has a four-phase program that equips participants for successful living in the community. The phases allow participants to attend life-skills classes, do community service, attend Alcoholics Anonymous or Narcotics Anonymous meetings, attend counseling, begin a job search, begin paying off debts, begin saving money and attend leadership-skills classes."
  },
  {
    "addressLine1": "110 Q Street",
    "city": "Lincoln",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68501",
    "name": "People's City Mission",
    "organization": "People's City Mission",
    "phone": "(402) 475-1303",
    "website": "https://pcmlincoln.org/",
    "description": "Emergency Shelter for Men\n\nHow to Receive Services\nMust be a male, age 19 and over\nMust provide a valid Nebraska ID. (Out-of-state guests must obtain a valid NE ID in order to enter in our Program Tracks for extended stay.)\n\nShelter Hours\n24 hours/day, 365 days/year\nOvernight/Emergency Shelter: Check-in begins by 8:00pm\nCurfew: SundayThursday: 10:00pm // Friday & Saturday: 11:00pm\n\nMeal Times\nBreakfast: 5:30am-6:00am\nLunch: 12:30am-1:00pm\nDinner: 6:00pm-6:30pm\nSack Lunches are available if you are not able to make a mealtime because of work or an appointment, as supplies allow.\n\nEmergency Shelter policies vary based on seasonal needs, please contact the HIS Center staff with any questions: 402.475.1303\n\n\nEvery guest of the HIS Center is provided with a bed (or cot), three meals a day, shower facilities, personal hygiene items and laundry facilities.\n\nProgram Tracks\nFor eligible guests from Nebraska, we offer two program options: Short Term Stay (30 days) and The Path (90 days). Each guest participating in a program track will be assigned a PCM caseworker to help create individual goals and milestones. Community resource referrals and employment assistance are also provided to help each guest move towards independent living.\n\nDay Services\n\nHIS Center guests and former guests have access to the Agape Caf before and after meals. The Agape Caf provides shower facilities, laundry facilities, and mail services year-round. During inclement weather, the Agape Caf is open during the day to those needing a place of refuge.\nOne-on-one counseling, Bible studies, and Sunday church services are also available to all guests.\nPCM Family Shelter\nHow to Receive Services\n\nMust provide a valid photo ID.\nMust provide birth certificates for all children.\nMust provide social security cards.\n\nShelter Hours\nOvernight/Emergency Shelter: Check-in begins by 8:00 pm, but it is best to call ahead to set up an appointment.\nCurfew: SundayThursday: 10:00pm // Friday & Saturday: 11:00pm\n\nMeal Times\nBreakfast: 6:45am-7:15am\nLunch: 11:15am-Noon\nDinner: 4:45pm-5:30pm\nSack Lunches are available if you are not able to make a mealtime because of work or an appointment, as supplies allow.\n\n\nCurtis Center\nThe Curtis Center offers supportive, transitional housing for 60 men who need help getting back on their feet and are looking to improve their lives.\nThe Curtis Center is a secure building with private, comfortable sleeping rooms. Each room has a refrigerator, a microwave and a sink and is wired for basic cable TV services. Other amenities include laundry facilities, three congregate meals, a community lounge, a library for reading or studying, two outdoor courtyards, and 24-hour staff. Reduced-rate memberships are available to a local recreational facility.\n\nThe Program\nThe Curtis Center is a structured program that focuses on four areas; each area includes classes, counseling, and services designed to promote emotional health and economic self-sufficiency. Our desire is to develop a mutually trusting relationship to help residents identify and achieve program goals.\n"
  },
  {
    "addressLine1": "333 Jackson Street",
    "city": "Tecumseh",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68450",
    "name": "First Baptist Church",
    "organization": "First Baptist Church",
    "phone": "(402) 335-2225",
    "website": "https://www.tecumsehfirstbaptist.org/",
    "description": ""
  },
  {
    "addressLine1": "111 North 9th Street",
    "city": "Norfolk",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "68701",
    "name": "Norfolk Rescue Mission",
    "organization": "Norfolk Rescue Mission",
    "phone": "(402) 371-6484",
    "website": "https://norfolkrescue.org/",
    "description": "Overnight Shelter Program\nOur Overnight Guest Program offers short-term housing for men, women and families in need. New check-ins are encouraged to arrive between 3:00 pm and 5:00 pm. We have separate dorm facilities for men and women as well as hotel-style units for families.\n\nAll of your personal belongings will need to fit into the two 18 gallon totes  provided, so please bring only your clothing and basic toiletry items.\n\n\nIn this program, your primary focus will be finding and keeping full-time employment.  You will have 3 weeks to accomplish this goal and will be expected to submit at least five new job applications daily.\n\nExtensions beyond the initial 3 weeks will only be considered for those who have found full-time employment.\n\n    All guests must sign in before 5:00 pm each evening and remain on the property until 6:00 am the next morning. Exceptions may be granted for employment or medical issues only if called in prior to 5:00 pm. Guests cannot leave the grounds after 5:00 pm except by the permission of the Staff person on duty.\n    All guests are required to attend our Chapel service every evening at 5:30 pm. If your regular work hours conflict with Chapel, you will be required to attend Devotions at 8:00 am.\n\n    All guests are required to help with the daily work and chores around the Mission.\n    Guests are to be in their own sleeping rooms every night from 10:00 pm-6:00 am. Guests should not enter others sleeping rooms. All lights are to be out, and it is expected that all guests will remain quiet during these hours.\n    The doors to the Guests Dorms are locked at 7:50 am Sun-Fri (10:00 am Sat.) and unlocked at 4:00 pm. Guests must be out of the dorm buildings during these hours. The Drop-In-Center (DIC) is open weekdays from 8:30 am until 4:00 pm.\n    Breakfast is served at 7:00 am, Lunch at 11:45 am (Sunday 1:00 pm) and Supper at 6:00 pm everyday. No Food or Drink is allowed in the Dorm Rooms.\n    All guests are required to make their bed neatly every morning and clean up their living area, storing their belongings in the two totes provided. Belongings found in inappropriate places will be discarded. All guests must shower daily. Clean clothing and toiletries are available.\n    Bare feet are allowed in the bathrooms only. Footwear must be worn everywhere else.\n    There is to be NO tobacco/nicotine use in any Mission building at any time. All tobacco/nicotine use is only permitted in the designated smoking area behind the Faith House (men) and behind the Hope House (ladies). Cigarettes (or any other tobacco/nicotine products) are not to be traded, given, nor sold to any other guest.\n    Cell phones are not allowed to be used in the Dining Hall and are to remain on silent everywhere else on campus.\n    All medications (prescription and over the counter) and weapons MUST be turned in to a Staff member to be locked up. Meds will be available after all meals and before bed.\n    Guests are to avoid conversations and other contact with persons of the opposite sex or with children on Mission property and in our community. Public displays of affection or any sexual (heterosexual or homosexual) conversation or contact are prohibited on our grounds and in our community.\n\n    Guests may not use the office phones without permission from a Staff member. There are phones available for local calls in the Men's Dorm area, the Hope House and the Drop-In-Center.\n    All belongings may be searched by Staff at anytime to ensure compliance with our guidelines.\n    Guests must first visit with the Staff person on duty prior to checking out of the Mission. Any belongings left behind after three days will be disposed of, or the Mission may find an alternate use for them.\n    Guests being asked to leave must take all of their belongings immediately. Anything left behind will be disposed of at the end of the day.\n    Personal mail can be forwarded for 30 days upon checking out. (A forwarding address must be provided) No mail will be held.\n    The following will be cause for being barred from the Mission. (Note: This is not an exclusive list.)\n\n    Possession (or use of) alcohol, drugs, pornography, or weapons\n\n    Inappropriate conversations or content on cell phones\n    Abusive or violent behavior or language toward Staff, guests, or visitors\n\nSamaritan Program\nThe Samaritan Program is a great option for those who are unable to maintain full-time employment due to a number of possible reasons including:\n\n    A verifiable physical disability or condition\n    Beyond retirement age\n    Mental health issues\n    Legal problems\n    Documentation issues\n    Short-Term stay\n\nOn this half-day program, you will be expected to set goals and, on a weekly basis, demonstrate reasonable progress toward independent living. While on this program, you will be required to begin working with a case-worker or community support person from another local agency.\n\nParticipants in the Samaritan Program are required to attend the 8:00 am Devotions as well as an 8:30 am Samaritan training class. At 9:30 am, you will be assigned an on-campus chore before you head out to accomplish the goals you have set for the day.\n\n"
  },
  {
    "addressLine1": "414 E. 6th. St.",
    "city": "North Platte",
    "state": "Nebraska",
    "stateAbbreviation": "NE",
    "postal": "69101",
    "name": "The Connection Homeless Shelter",
    "organization": "The Connection Homeless Shelter",
    "phone": "(308) 532-5050",
    "website": "http://theconnectionnp.publishpath.com/",
    "description": ""
  }
]