[
  {
    "addressLine1": "10955 Watertank Road",
    "city": "Belle Fourche",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57717",
    "name": "Women of War",
    "organization": "Women of War",
    "phone": "(605) 723-8672",
    "website": "http://www.womenofwarproject.com/",
    "description": "Provide clean, safe, and dignified housing, with no more than three female veterans per room. Will offer balanced meals in a clean, healthy environment.Utilize and mobilize community's support to help our guests become contributing and valuable assets to the community. Provide one-on-one counseling services.\n\nOffer in-house classes utilizing The Six Keys To Success Approach: Teamwork, Courage, Honesty & Forgiveness, Dedication, Desire & Goal Setting\n\n\nEducation - this is for veterans........trained and placed in above average salaried positions where possible.\n\nPURPOSE & GOALSRESIDENTIAL STABILITY involves providing access to stable, safe, decent housing. The success of the program will come in addressing the problems that led to the veteran becoming homeless.\n\nINCREASED SKILL LEVEL AND/OR INCOME refers to the resources available to enable persons to live as self-sufficiently as possible. The likelihood of obtaining a job, or a higher-paying job, will be enhanced through job or skills training. Self-motivation and self-determination will be strengthened with in-house training through self-understanding.\n\n\nGREATER SELF-DETERMINATION refers to increases in the influence that participants have on decisions that affect their lives. Our program will present to the participant to be involved in volunteers services, community involvement, addressing groups, writing resumes and development of program rules and procedures.\n\n\nThe measurable objectives established by each applicant are expected to vary based on the specific needs and characteristics of the homeless veterans proposed to be served as well as the specific program chosen."
  },
  {
    "addressLine1": "615 Kansas City St",
    "city": "Rapid City",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57701",
    "name": "Hope Center - Homeless Day Center",
    "organization": "Hope Center - Homeless Day Center",
    "phone": "(605) 716-4673",
    "website": "http://hopecenterrapidcity.org/",
    "description": "Drop in Day Center.\nHOPE Center Hours:\nDay Drop-In Services: Monday - Friday 8:00 - 2:30\n\nServices offered: telephone/message center, a mailing center and a small space for individual storage.\n\nThrough God's love, the HOPE Center offers the homeless and hopeless in our community an environment of respect, encouragement and guidance as they work toward a better life."
  },
  {
    "addressLine1": "30 Main Street",
    "city": "Rapid City",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57701",
    "name": "CornerStone Rescue Mission",
    "organization": "CornerStone Rescue Mission",
    "phone": "(605) 341-2844",
    "website": "http://www.cornerstonemission.org/",
    "description": "We operate as a 24/7 shelter proving three meals a day to those in need.  You do not need to stay with us for meals. \n\nWe have separate accommodations to provide services to men, women & children, and Veterans. \n\n\nWe have case management and transitional housing resources. We accept all donations of food, clothing, and household items."
  },
  {
    "addressLine1": "P.O. Box 431",
    "city": "Burke",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57523",
    "name": "Gregory County Shelter",
    "organization": "Gregory County Shelter",
    "phone": "(605) 775-2220",
    "website": "",
    "description": "Emergency shelter for all. Toll free hotline number: 1-800-658-3486"
  },
  {
    "addressLine1": "address withheld",
    "city": "Mitchell",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57301",
    "name": "Mitchell Area Safehouse",
    "organization": "Mitchell Area Safehouse",
    "phone": "(605) 996-2765",
    "website": "http://www.mitchellareasafehouse.org/",
    "description": ""
  },
  {
    "addressLine1": "823 Dupree St.",
    "city": "Eagle butte",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57625",
    "name": "CRST New Hope Homeless Shelter & Therapeutic Garden",
    "organization": "CRST New Hope Homeless Shelter & Therapeutic Garden",
    "phone": "(605) 964-8670",
    "website": "mailto:deanna.gomez@crst-nsn.gov",
    "description": "Cheyenne River Sioux Tribe Homeless Shelter\nOur mission is to assist individuals of all races here on the Cheyenne River Sioux Tribe Indian Reservation with temporary living arrangements, while empowering residents to find their own living arrangements, assist in finding employment opportunities, and collaborating with other agencies, programs and organizations to prepare residents to succeed.\n\nThe shelter serves the homeless population and people in transition due to natural disaster and are now homeless.We only service adult men and women over the age of 21.\n\n\nThe shelter accommodates single adult men and women, 9 males and 11 single female beds are available. But please call before you come to confirm how many beds are available at any time, the availability of beds changes daily. A wall of local resources are available for the residents to pursue, such as housing & job applications."
  },
  {
    "addressLine1": "700 1st Avenue E",
    "city": "Lemmon",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57638",
    "name": "Crisis Intervention Shelter",
    "organization": "Crisis Intervention Shelter",
    "phone": "(605) 374-5334",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 398",
    "city": "Pierre",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57501",
    "name": "Missouri Shores Domestic Violence Center",
    "organization": "Missouri Shores Domestic Violence Center",
    "phone": "(605) 224-0256",
    "website": "https://www.facebook.com/missourishoresdvc/",
    "description": "Domestic violence shelter. Toll free crisis number: 800-696-7187. Provides up to 30 days emergency shelter for victims of domestic violence."
  },
  {
    "addressLine1": "P.O. Box 245",
    "city": "Lemmon",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57638",
    "name": "Communities Against Violence and Abuse",
    "organization": "Communities Against Violence and Abuse",
    "phone": "(605) 374-5823",
    "website": "https://www.instagram.com/haringeycav/",
    "description": "Shelter for victims of domestic violence and their children."
  },
  {
    "addressLine1": "P.O. Box 375",
    "city": "Madison",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57042",
    "name": "Madison House of Hope",
    "organization": "Madison House of Hope",
    "phone": "(605) 256-6188",
    "website": "https://www.instagram.com/madisonavenuedance/",
    "description": "Emergency shelter for victims of domestic violence and their children."
  },
  {
    "addressLine1": "220 N Weber Ave",
    "city": "Sioux Falls",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57102",
    "name": "Union Gospel Mission Men's and Women's Shelters",
    "organization": "Union Gospel Mission Men's and Women's Shelters",
    "phone": "(605) 334-6732",
    "website": "https://ugmsiouxfalls.com/",
    "description": "Chapel Every day at 7PM\n\nMens Dorm220 N Weber Ave, Sioux Falls\n\nWomens Shelter\n703 E 8th St, Sioux Falls\n\nThe Mission provides safe, comfortable lodging and showers for individuals who find themselves without shelter and needing a place to rest and get out of the elements. These guests might be transients passing through the area, some are people struggling as they work to get back on their feet and a few others are individuals that choose to join our discipleship program and become accountable in several areas of their life.\n\nAt our Mens Facility we have space for 70 men, and in our Women & Childrens Facility we can accommodate 48 women & children."
  },
  {
    "addressLine1": "101 N. Indiana Ave",
    "city": "Sioux Falls",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57103",
    "name": "Bishop Dudley Hospitality House",
    "organization": "Bishop Dudley Hospitality House",
    "phone": "(605) 809-8424",
    "website": "http://bdhh.org/",
    "description": "TheBishop Dudley Hospitality House offers daytime and overnight emergency shelter for the homeless and most vulnerable. For the overnight emergency shelter, 80 men and 20 women can be housed by the shelter. There is a day room for men and a separate day room for women and their families. There are separate sleeping areas for men, women and families. Also, there is an operational 24 hours a day surveillance system for the safety of staff and guests.\nFamily Room Program: There are 7 individual family rooms that have 2 queen beds and a private bathroom with a shower. These rooms can house up to 5 family members. Families are allowed to move in and stay, however they will have to work with a Family Coordinator at the same time so that they can find transitional or permanent housing.\n\n\n\nDay Program - From 8:00a.m. to 5:15p.m. every day\n\n- Day Room Shelter which has tables, chairs, books, magazines, coffee and water\n- Phone and computer use\n- Restrooms\n- Showers - Hygiene items, towels and washcloths are provided\n- Laundry - Detergent is provided\n- Lunch: Monday to Friday at 11:30a.m.\n\n\nOvernight Program - From 6:00p.m. to 7:00a.m. every day\n- Emergency nighttime shelter\n- Clean fitted sheet & clean flat sheet\n- Shower/restroom access\n\n- Laundry services\nOvernight Program Schedule: Guest Check In is between 6:30p.m. and 10:00p.m. Quiet Hours are between 10:00p.m. and 6:00a.m. Wake up call 6:00a.m. and individuals are required to vacate the building by 6:45a.m. so that they can eat breakfast at The Banquet.\n\n\n\nThe maximum staying time is 30 days for free. After 30 days there is a charging fee as follows:\n\n\nFor individuals that have an active income source: For individuals that have no income source:\n\n30 Nights: Free 1 - 30 Nights: Free must create plan\n\n31 60 nights: Evening rate is $35.00 per week 31 60: will review stay every (2) weeks\n61 90 nights: Evening rate is $49.00 per week 61 90: will review stay every (2) weeks\n\n91 120 nights: Evening rate is $70.00 per week91 120) will review stay every (2) weeks\n\nPay for stay prepay only in cash one week at a time Individual will have to comply with chore chart\n\n\n\nAdditional Services Provided:\n\nBirthright: Infant/childrens items, including diapers: Monday through Wednesday and Friday 10:30a.m. to 2:00p.m.Counseling and Veteran Assistance: Tuesdays 11:00a.m. to NoonGoodwill of the Great Plains Mobile Job Center: Every other Wednesday from 1:00p.m. to 3:00p.m.Veterans Homeless Outreach\n\nContact the office for additional information.\n\n"
  },
  {
    "addressLine1": "1301 E Austin S",
    "city": "Sioux Falls",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57103",
    "name": "St Francis House",
    "organization": "St Francis House",
    "phone": "(605) 334-3879",
    "website": "https://www.stfrancishouse.com/",
    "description": "Emergency homeless shelter."
  },
  {
    "addressLine1": "412 E. 4th Street",
    "city": "Yankton",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57078",
    "name": "Pathways Shelter for the Homeless",
    "organization": "Pathways Shelter for the Homeless",
    "phone": "(605) 665-8994",
    "website": "https://www.yanktonpathways.org/",
    "description": "Hours\nIntakes are performed Monday through Friday, 8:00am-4:00pm.\n\n\nPathways offers emergency shelter to individuals and families experiencing homelessness within a 60 mile radius of Yankton. While in shelter, clients are given food, clothing, toiletries and other basic necessities free of charge. We offer shelter for a period of 2 weeks to 30 days, depending on the situation.\n\n\nDuring the intake process, staff will work with clients to develop achievable goals towards getting back on their feet. Life skills training will be provided to clients lacking skills in a certain area.\n\nGuidelines for Emergency Shelter\n    Individuals must be age 18 or older. Individuals under the age of 18 must be accompanied by a parent or guardian\n    Adults seeking shelter must receive a background check from the Yankton Police Department and have it printed at the Clerk of Courts. The background check must then be given to Pathways staff.\n    Intakes are performed Monday through Friday, 8:00am-4:00pm.\n\nBarriers from Pathways\n    Must have no active warrants or pending charges.\n    Must not be on the sex offender registry.\n    Must be located within a 60-mile radius of Yankton. Pathways is not set up to be a relocation service or transitional housing."
  },
  {
    "addressLine1": "1 Veterans Drive",
    "city": "Pine Ridge",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57770",
    "name": "Oglala Sioux Tribe Veterans Shelter",
    "organization": "Oglala Sioux Tribe Veterans Shelter",
    "phone": "(605) 867-2466",
    "website": "http://www.oglalalakotanation.org/",
    "description": "Contact at the phone number or email for more details on this veterans only shelter."
  },
  {
    "addressLine1": "PO Box 188",
    "city": "Rosebud ",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57570",
    "name": "Sicangu Oyate Tipi Homeless Shelter",
    "organization": "Sicangu Oyate Tipi Homeless Shelter",
    "phone": "(605) 747-2096",
    "website": "",
    "description": "We are a Homeless Shelter for Native American Veteran's. but we also take in non-veteran's, but have to be a tribally enrolled member of any federally recognized tribe. We keep single men and single women"
  },
  {
    "addressLine1": "202 5th Street SE",
    "city": "Watertown",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "57201",
    "name": "Women's Resource Center",
    "organization": "Women's Resource Center",
    "phone": "(605) 886-4300",
    "website": "",
    "description": "Emergency shelter for victim's of domestic violence. Women and children."
  },
  {
    "addressLine1": "415 Bluff St",
    "city": "Sioux City",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "51103",
    "name": "Sioux City Gospel Mission",
    "organization": "Sioux City Gospel Mission",
    "phone": "(712) 255-1119",
    "website": "",
    "description": "Women's and children's Christian based shelter."
  },
  {
    "addressLine1": "1308 Nebraska Street",
    "city": "Sioux City",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "51105",
    "name": "Shesler Hall Transitional Housing For Women",
    "organization": "Shesler Hall Transitional Housing For Women",
    "phone": "(712) 258-8059",
    "website": "http://www.sheslerhall.com/",
    "description": ""
  },
  {
    "addressLine1": "916 Nebraska Street",
    "city": "Sioux City",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "51105",
    "name": "The Warming Shelter Sioux City",
    "organization": "The Warming Shelter Sioux City",
    "phone": "(712) 255-0084",
    "website": "mailto:Lebowich.j@gmail.com",
    "description": "Hours:  4pm to 8am daily from Nov 1 to April 30\n\nThe Warming Shelter seeks to provide temporary emergency shelter for men, women, and families who have no other shelter options in the Siouxland Area. All services and assistance are offered in context of the furtherance of human dignity with the primary goal of harm reduction during the coldest weather months.\n\nThe Warming Shelter provides a dormitory style shelter facility for men, woman, and families in the greater Siouxland area. Located near the Siouxland Community Health Center and District Health.\n916 Nebraska Street."
  },
  {
    "addressLine1": "1307 Court St",
    "city": "Sioux City",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "51105",
    "name": "Warm Shelter",
    "organization": "Warm Shelter",
    "phone": "(712) 274-1610",
    "website": "mailto:jlogan@caasiouxland.org",
    "description": "The Welcome Home Program is an innovative initiative that combines transitional housing and outreach services to get homeless families in Siouxland off the streets as soon as possible. Our mission is to give them first a safe, furnished place to live, clothing and food; but most importantly a chance to work one-on-one with a family development specialist so they can obtain permanent housing and self-sufficiency. The Welcome Home program has been developed by an Advisory Board. A goal of this program is to address any barriers families may have that contributed to their homelessness. Families that are homeless often have many barriers including: mental health, substance abuse issues, disabilities, transportation, and lack of knowledge about available services. The Family Specialist will help identify and overcome those barriers by forging a relationship with the family and providing intensive support. In the past year the program has assisted 25 families; 72 individuals with a place to live while they worked to find permanent housing."
  },
  {
    "addressLine1": "111 North 9th Street",
    "city": "Norfolk",
    "state": "South Dakota",
    "stateAbbreviation": "SD",
    "postal": "68701",
    "name": "Norfolk Rescue Mission",
    "organization": "Norfolk Rescue Mission",
    "phone": "(402) 371-6484",
    "website": "https://norfolkrescue.org/",
    "description": "Overnight Shelter Program\nOur Overnight Guest Program offers short-term housing for men, women and families in need. New check-ins are encouraged to arrive between 3:00 pm and 5:00 pm. We have separate dorm facilities for men and women as well as hotel-style units for families.\n\nAll of your personal belongings will need to fit into the two 18 gallon totes  provided, so please bring only your clothing and basic toiletry items.\n\n\nIn this program, your primary focus will be finding and keeping full-time employment.  You will have 3 weeks to accomplish this goal and will be expected to submit at least five new job applications daily.\n\nExtensions beyond the initial 3 weeks will only be considered for those who have found full-time employment.\n\n    All guests must sign in before 5:00 pm each evening and remain on the property until 6:00 am the next morning. Exceptions may be granted for employment or medical issues only if called in prior to 5:00 pm. Guests cannot leave the grounds after 5:00 pm except by the permission of the Staff person on duty.\n    All guests are required to attend our Chapel service every evening at 5:30 pm. If your regular work hours conflict with Chapel, you will be required to attend Devotions at 8:00 am.\n\n    All guests are required to help with the daily work and chores around the Mission.\n    Guests are to be in their own sleeping rooms every night from 10:00 pm-6:00 am. Guests should not enter others sleeping rooms. All lights are to be out, and it is expected that all guests will remain quiet during these hours.\n    The doors to the Guests Dorms are locked at 7:50 am Sun-Fri (10:00 am Sat.) and unlocked at 4:00 pm. Guests must be out of the dorm buildings during these hours. The Drop-In-Center (DIC) is open weekdays from 8:30 am until 4:00 pm.\n    Breakfast is served at 7:00 am, Lunch at 11:45 am (Sunday 1:00 pm) and Supper at 6:00 pm everyday. No Food or Drink is allowed in the Dorm Rooms.\n    All guests are required to make their bed neatly every morning and clean up their living area, storing their belongings in the two totes provided. Belongings found in inappropriate places will be discarded. All guests must shower daily. Clean clothing and toiletries are available.\n    Bare feet are allowed in the bathrooms only. Footwear must be worn everywhere else.\n    There is to be NO tobacco/nicotine use in any Mission building at any time. All tobacco/nicotine use is only permitted in the designated smoking area behind the Faith House (men) and behind the Hope House (ladies). Cigarettes (or any other tobacco/nicotine products) are not to be traded, given, nor sold to any other guest.\n    Cell phones are not allowed to be used in the Dining Hall and are to remain on silent everywhere else on campus.\n    All medications (prescription and over the counter) and weapons MUST be turned in to a Staff member to be locked up. Meds will be available after all meals and before bed.\n    Guests are to avoid conversations and other contact with persons of the opposite sex or with children on Mission property and in our community. Public displays of affection or any sexual (heterosexual or homosexual) conversation or contact are prohibited on our grounds and in our community.\n\n    Guests may not use the office phones without permission from a Staff member. There are phones available for local calls in the Men's Dorm area, the Hope House and the Drop-In-Center.\n    All belongings may be searched by Staff at anytime to ensure compliance with our guidelines.\n    Guests must first visit with the Staff person on duty prior to checking out of the Mission. Any belongings left behind after three days will be disposed of, or the Mission may find an alternate use for them.\n    Guests being asked to leave must take all of their belongings immediately. Anything left behind will be disposed of at the end of the day.\n    Personal mail can be forwarded for 30 days upon checking out. (A forwarding address must be provided) No mail will be held.\n    The following will be cause for being barred from the Mission. (Note: This is not an exclusive list.)\n\n    Possession (or use of) alcohol, drugs, pornography, or weapons\n\n    Inappropriate conversations or content on cell phones\n    Abusive or violent behavior or language toward Staff, guests, or visitors\n\nSamaritan Program\nThe Samaritan Program is a great option for those who are unable to maintain full-time employment due to a number of possible reasons including:\n\n    A verifiable physical disability or condition\n    Beyond retirement age\n    Mental health issues\n    Legal problems\n    Documentation issues\n    Short-Term stay\n\nOn this half-day program, you will be expected to set goals and, on a weekly basis, demonstrate reasonable progress toward independent living. While on this program, you will be required to begin working with a case-worker or community support person from another local agency.\n\nParticipants in the Samaritan Program are required to attend the 8:00 am Devotions as well as an 8:30 am Samaritan training class. At 9:30 am, you will be assigned an on-campus chore before you head out to accomplish the goals you have set for the day.\n\n"
  }
]