[
  {
    "addressLine1": "930 N. Henry St.",
    "city": "Alexandria",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22314",
    "name": "Carpenter's Shelter Alexandria Virginia",
    "organization": "Carpenter's Shelter Alexandria Virginia",
    "phone": "(703) 548-7500",
    "website": "https://carpentersshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "2355-B Mill Road",
    "city": "Alexandria",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22314",
    "name": "Alexandria Community Shelter",
    "organization": "Alexandria Community Shelter",
    "phone": "(703) 746-3660",
    "website": "https://www.voachesapeake.org/acs",
    "description": " ACS is a City-owned 64 bed year round emergency shelter serving men, women, and families providing housing-focused case management, education training, job training, referral services, and behavioral health treatment services. VOAC offers case management services to all clients and assists with developing an individualized plan to address financial stability, increasing employment, assessing for housing type, and assists with how clients can remain permanently housed. The shelter is co-located with the DCHS' Substance Abuse Outpatient and Detoxification programs.\n\nACS is designed to provide supportive services to help each participant to increase and develop self-sufficiency in multiple areas such as housing, substance abuse, and mental health. Comprehensive case management is of primary importance and a case manager is assigned to each participant and is responsible for providing a comprehensive assessment of needs, ongoing support and coaching, as well as the formulation, implementation and management of an individualized service plans. Case management efforts are collaborative and client-focused in nature to ensure empowerment of the vulnerable populations we serve. ACS services are targeted towards adults and families experiencing a housing crisis in the City of Alexandria."
  },
  {
    "addressLine1": "1554 Columbia Pike",
    "city": "Arlington",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22204",
    "name": "The Arlington Homeless Services Unit Residential Program Center",
    "organization": "The Arlington Homeless Services Unit Residential Program Center",
    "phone": "(703) 228-0022",
    "website": "https://www.voachesapeake.org/rpc",
    "description": "Located in Arlington, Virginia, Volunteers of America Chesapeake's Residential Program Center provides three crucial services - non-medical detoxification, substance abuse recovery and homeless services for single adults - all under one roof.\n\nWe have a 12 bed Detoxification Unit provides social model detoxification services for up to 14 days; a 10-bed Early Recovery Unit provides intensive post-detoxification treatment services for up to three months; and a 44-bed homeless shelter provides hi-intensity case management, education, training and referral services for single adults. - See more at: http://www.voachesapeake.org/Services/Homeless-Services/Residential-Program-Center#sthash.Qz7r1q0v.dpuf"
  },
  {
    "addressLine1": "1554 Columbia Pike",
    "city": "Arlington",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22204",
    "name": "New Hope Housing- Residential Program Center",
    "organization": "New Hope Housing- Residential Program Center",
    "phone": "(703) 228-0022",
    "website": "https://www.newhopehousing.org/",
    "description": "The Residential Program Center Shelter is a 44 bed shelter for men and 12 women, run in partnership with Arlington County Department of Human Services. New Hope Housing took over operations of RPC on February 3rd, 2020.\nEligibility\n\nShelter is available for adults only.\n\n"
  },
  {
    "addressLine1": "2020-A N 14th St",
    "city": "Arlington",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22201",
    "name": "Arlington County Homeless Services Center",
    "organization": "Arlington County Homeless Services Center",
    "phone": "(703) 228-1775",
    "website": "https://pathforwardva.org/impact/shelter-services/",
    "description": ""
  },
  {
    "addressLine1": "46 S Glebe Rd Suite 201",
    "city": "Arlington",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22204",
    "name": "Bridges to Independence Arlington - Sullivan House Emergency shelter",
    "organization": "Bridges to Independence Arlington - Sullivan House Emergency shelter",
    "phone": "(703) 525-7177",
    "website": "https://bridges2.org/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 100185",
    "city": "Arlington",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22210",
    "name": "Doorways for Women and Families",
    "organization": "Doorways for Women and Families",
    "phone": "(703) 504-9400",
    "website": "https://www.doorwaysva.org/",
    "description": "24-Hour Domestic & Sexual Violence Hotline: 703-237-0881\nAccess to Doorways Freddie Mac Foundation Family Home and other Arlington homeless shelters is provided through Arlington Countys Centralized Access System (CAS). If you or someone you know is homeless or at risk of becoming homeless in our community, please contact the Department of Human Services Community Assistance Bureau at 703-228-1300. In case of shelter need during non-business hours, households should call 703-228-1010 for assistance.Please note that shelter beds are reserved for Arlington, Virginia residents.\n\n\nCommunity-Based SupportDoorways' community-based support is available to all survivors in the Arlington communityincluding women, men, trans and nonbinary folks, and teenswhether or not they are in our shelters or housing programs.\n24-Hour Domestic & Sexual Violence Hotline (703-237-0881)Doorways 24-hour domestic and sexual violence hotline provides an immediate, safe response for survivors of domestic violence and sexual assault.Hospital Accompaniment Response Program (HARP)Doorways hospital accompaniment services provide immediate, in-person support for survivors of domestic and sexual assault seeking medical care.Court AdvocacyLocated at the Arlington County Courthouse, Doorways court advocacy program assists survivors in need of assistance navigating restraining orders and other long-term protections to support their survivorship.Revive Domestic & Sexual Violence Counseling ProgramThrough our Revive Counseling Center, Doorways provides customized counseling and support for those who experience trauma including a plan for restoring long-term stability.Prevention ProgramDoorways Prevention Program aims to change social norms and conditions so sexual and intimate partner violence is less likely to happen. Programming is designed to shift attitudes, behaviors, and norms that support and perpetuate the root causes of violence by promoting healthy behavior and communities.\n\nShelter and Housing\nDomestic Violence Safehouse, Safe Apartments, and Safe KennelDoorways provides emergency shelter for individuals and families escaping abuse including a space that allows survivors to bring their pets.Family HomeDoorways also provides shelter for youth and families experiencing homelessness. The Freddie Mac Foundation Family Home is more than a shelter; it is a safe, temporary home offering comprehensive services to help youth and families work towards stability.HomeStart Supportive Housing ProgramDoorways' supportive housing programs provide support and wrap-around services to empower clients throughout their shelter stay and their transition to safe, long-term housing of their own.\n\nShelter- and Housing-Based Support\nGoal Planning & Case Management ServicesEach individual and family partners with a primary Client Services Counselor (case manager) to help coordinate services and ultimately reach goals towards self-sufficiency.Pathways for YouthThrough Pathways for Youth, Doorways addresses the needs of transition-aged youth (18-24 years of age) and young families across Doorways emergency shelter and housing programs. Doorways provides intensive, developmentally tailored services with an emphasis on building life skills with a hands-on approach.Childrens ServicesDoorways provides dedicated case workers and counselors to the children in our care, making sure they heal, grow, and thrive.Financial Independence Track (FIT)Financial Independence Track (FIT), Doorways' economic empowerment program, helps clients manage their daily finances, gain control over debt, and create a financial safety plan."
  },
  {
    "addressLine1": "2049 N. 15th St. and Courthouse Rd.",
    "city": "Arlington",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22201",
    "name": "Emergency Winter Shelter",
    "organization": "Emergency Winter Shelter",
    "phone": "(703) 228-7395",
    "website": "https://publicassistance.arlingtonva.us/shelters/",
    "description": "Single men and women shelter.Open every night November 1 through March 31"
  },
  {
    "addressLine1": "1041 Wisconsin Av Nw",
    "city": "Washington",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "20007",
    "name": "Georgetown Ministry Center Drop-In Center",
    "organization": "Georgetown Ministry Center Drop-In Center",
    "phone": "(202) 338-8301",
    "website": "http://www.gmcgt.org/",
    "description": "Provides homeless people and people at risk of becoming homeless information, referrals, casework, advocacy, winter shelter and street outreach services. Services are mainly focused on Georgetown/Foggy Bottom area and are designed not only to get people off the street but to keep them off.\n\n\nGeorgetown Ministry Center is a non-profit social service organization dedicated since 1987 to finding lasting solutions for people who are homeless on the streets of Georgetown. Our goal is to get each homeless person we meet off the street and into safe, appropriate housing. GMC offers counceling and information services, provides street outreach, showers and laundry, and employs a consulting psychiatrist who sees people in our office and on the street. GMC also operates the congressional-based shelter seven days a week, from 7:00PM to 7:00AM during the winter. GMC is located at 1041 Wisconsin Avenue, NW."
  },
  {
    "addressLine1": "20684 Ashburn Road",
    "city": "Ashburn",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "20147",
    "name": "The Good Shepherd Alliance",
    "organization": "The Good Shepherd Alliance",
    "phone": "(703) 724-1555",
    "website": "https://www.loudoun.gov/",
    "description": ""
  },
  {
    "addressLine1": "19520 Meadow view Court",
    "city": "Leesburg",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22076",
    "name": "Loudoun Homeless Services Center",
    "organization": "Loudoun Homeless Services Center",
    "phone": "(571) 258-3033",
    "website": "https://www.loudoun.gov/",
    "description": ""
  },
  {
    "addressLine1": "10499 Jericho Rd",
    "city": "Bealeton",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22712",
    "name": "Community Touch, Inc.",
    "organization": "Community Touch, Inc.",
    "phone": "(540) 439-9300",
    "website": "https://www.communitytouchinc.org/",
    "description": ""
  },
  {
    "addressLine1": "95 Keith St",
    "city": "Warrenton",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "20188",
    "name": "Fauquier Family Shelter Services",
    "organization": "Fauquier Family Shelter Services",
    "phone": "(540) 351-0130",
    "website": "https://www.familyshelterservices.org/",
    "description": "Emergency Shelter     540 351 0130\nVint Hill Housing         540 347 7374\nAdministative Office  540-341-0900\n\nLocated at 95 Keith Street in Warrenton, this is the only emergency shelter in Fauquier County.We're open 24 hours/ 7 days per week.\n\nProvides emergency shelter and transitional housing.\n\n\nThe Emergency Shelter is the only emergency shelter in Fauquier County. The facility is a 7,100 square foot building that includes a fully-equipped modern kitchen and dining area, washer and dryer facilities, library and reading room, a group meeting area, office space for staff, family bedrooms, adult male bedrooms and adult female bedrooms. Our 52-bed configuration can accommodate up to eleven families and eight single adults at any one time. The ground level is 100% accessible to persons with physical disabilities.\n\nVint Hill Transitional Housing\nOur transitional housing program is an intensive, one year program assisting families in the transition from being homeless to acquiring the skills necessary to maintain stable and independent living.\nThe community provides a structured, safe environment for the nurturing of families, the growth and well-being of children, and a fostering community.\n\nTo be eligible for the program, applicants must meet the requirements listed below:\n    Verifiable homeless condition\n    Work a minimum of 35 hours per week\n    Have children living with you under the age of 18\n    Own a car that is registered and insured in your name\n    If applying as a couple, must be married\nAll participants are held accountable for:\n    maintaining full-time employment\n    learning budgeting skills, including paying off debt and responsibly managing credit\n    attending program classes\n    attending to the well-being of their children\nResidents pay 30% of their gross income per month. The program provides the utilities.\n"
  },
  {
    "addressLine1": "112 W. Market St.",
    "city": "Charlottesville",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22902",
    "name": "The Haven Day Shelter",
    "organization": "The Haven Day Shelter",
    "phone": "(434) 973-1234",
    "website": "http://www.thehaven.org/",
    "description": "Day shelter only, no overnight accommodation available. Open every morning until noon, 365 days a year. All services free. Breakfast. Showers. Laundry. Computers. Referrals. Housing programs.\n\nThe Haven is a multi-resource day shelter for people facing homelessness in downtown Charlottesville, Virginia.\n\n\nHours:Monday through Saturday, 7:00am to 12:00pm (noon) , Sun, 7:00am - 3:00pm.\n\nDrop In Day Shelter\nThe Haven Day Shelter is a safe and welcoming place for the homeless and very poor of Central Virginia. We provide basic respite services (breakfast, showers, laundry) as well as helping guests access the resources they need to secure housing.\n\nWe provide respite services for people who are homeless, or living in extreme poverty in our community, as well as supportive case management for guests who are eligible for programs to help get them back into stable housing.\n\nRespite services\n healthy, hearty breakfasts every day of the year\n storage bins and a place to receive mail\n shower and laundry facilities\n computers and job- and housing-search assistance\n a safe, supportive, comfortable environment\n a convenient, central place to meet\n\nHousing Programs\nThe Haven also administers funds for Housing First Programs: Rapid Rehousing, Housing Navigation, Homelessness Prevention, Housing Stabilization, as well as a specialized program for veterans.\n\nToo see if you qualify for one of our housing assistance programs, you must make an appointment for an intake by calling (434) - 973-1234 ext. 113.\n\n\nYou must meet at least one of the following criteria in order to be potentially eligible for rental assistance under one of our housing programs:\n\na previous experience of homelessness that can be documented AND must be currently living with family or friends (those living in their own rental/home do not qualify).\nyou must be literally homeless, that is, living on the street, in an emergency shelter, in a vehicle or another place not meant for habitation. Those residing in a hotel or living with family or friends do not qualify.\n\nAppointments are available with our Housing Program Team, Monday to Friday, 9am - 5pm\n\nThe Charlottesville Help Line\nIf you or someone you know needs emergency help paying a bill, the central help line is the best place to start.\n\nHours  Mon to Fri, 11am - 2pm\n\nPhone  (434) 234-4490\n\nYou must speak to a live person. No voicemails are accepted.\n\n "
  },
  {
    "addressLine1": "PO Box 14",
    "city": "Charlottesville",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22902",
    "name": "PACEM",
    "organization": "PACEM",
    "phone": "(434) 973-1234",
    "website": "http://pacemshelter.org/",
    "description": "Emergency overnight shelter that moves around between 80 host churches & organizations during the cold season\nIntake 5:30-5:45pm nightly during shelter season at The Haven.PACEMs shelters open in late October and remain open through the end of March. Our shelter season spans the time of year when the risk of freezing to death is real for those sleeping on the streets. Our shelters host as many as 45 men and 20 women each night.\n\nOur Role as a Community Safety NetPACEMs shelters are \"Last Resort,\" a place to go when a person is seeking shelter and has no other options. As a result, we are sometimes required to help individuals recognize that they have other choices. Below are some of the reasons why a guest may be referred elsewhere, encouraged to move forward, or assigned a limited length of stay:\nthey are eligible to stay at the Salvation Army and there are open beds;they have family or friends they can stay with and we know of no reason that this is not a safe alternative;they have voluntarily left another shelter within the last 30 days;they have support resources such as a social worker in another community.Coming to PACEMEach night between 5:30 and 5:45 p.m., individuals in need of shelter sign in at Intake at The Haven (112 West Market Street) in downtown Charlottesville."
  },
  {
    "addressLine1": "207 Ridge Street",
    "city": "Charlottesville",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22902",
    "name": "Salvation Army Emergency Shelter",
    "organization": "Salvation Army Emergency Shelter",
    "phone": "(434) 295-4058",
    "website": "http://virginiasalvationarmy.org/",
    "description": "The Emergency Shelter is a 58 bed shelter available for overnight stay or for stays of several weeks or months at a time. There is no charge for the service. Residents are given linens, three free meals a day, and casework when needed. We assist the residents in finding employment, saving their money, and locating suitable housing. The Center of Hope Transitional Housing Program opened in 1994, there are nine one- and two-bedroom apartments in a two-story building located at 207 Ridge Street. Guests share a furnished apartment, food service through our world-famous soup kitchen, and set life-changing goals. A waiting list is maintained as this program fills quickly. This program is based on prior success as a resident of the shelter and a holistic approach working with the Corps Officers and corps staff."
  },
  {
    "addressLine1": "P.O. Box 1013",
    "city": "Charlottesville",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22902",
    "name": "Shelter for Help In Emergency",
    "organization": "Shelter for Help In Emergency",
    "phone": "(434) 963-4676",
    "website": "http://www.shelterforhelpinemergency.org/",
    "description": "24-hour Hotline: 4342938509Community Outreach Center: 4349634676\nShelter ServicesThe Shelter offers a variety of services designed to empower victims of domestic violence and create a community of support. For more information about these and other services, please email us at info@shelterforhelpinemergency.org or call our Community Outreach Center at 434-963-4676.\n\n24-Hour Hotline: The Shelter for Help in Emergency operates a 24-hour hotline for victims and survivors who need a safe place to talk, and for families and friends of survivors who may seek information to help their loved one. The hotline number is 434-293-8509 V/TTY (collect calls accepted). Language interpretation is available.\nShelter: The Shelter for Help in Emergency offers emergency, temporary housing to victims of domestic violence in need of safety. There are 25 beds available and priority is given to residents of Planning District Ten, which encompasses the city of Charlottesville and the surrounding counties of Albemarle, Fluvanna, Greene, Louisa and Nelson. Maximum stays at the Shelter are six weeks, with each stay evaluated in terms of the clients danger level and available resources.\nCounseling: The Shelter provides free individual and group counseling to residents of the Shelter and community members seeking assistance in dealing with domestic violence. Support groups, including a Women in Transition group, are offered periodically throughout the year.\nCase Management: Shelter staff work with victims and survivors to build a large and diverse safety net of support and help them access community resources such as housing, employment, child care, substance abuse treatment, clothing, and food.\n\nChildren and Teen Programs: An important step in breaking the cycle of abuse is to work with children and adolescents who have witnessed domestic violence. We offer structured group and individual therapeutic sessions for children and adolescents, as well as support for parents to help families overcome domestic violence.\nLegal Advocacy: While the Shelter does not employ a lawyer, staff members are available to assist victims of domestic violence in navigating the legal system. Advocates can assist victims in obtaining protective orders and can provide court accompaniment. These services are offered to residents of the Shelter and community members.\n\nAddress Confidentiality Program: A cost-free, confidential mail-forwarding service for victims of domestic violence who have recently relocated.\nServices for the Spanish-speaking Community: Recognizing the need to reach this growing population, the Shelter for Help in Emergency is able to provide a Spanish-speaking advocate for counseling, outreach, and legal advocacy.\nTransitional Housing: The Shelter for Help in Emergency offers transitional housing for families moving from emergency shelter to permanent housing. Families may stay from 6 months to two years as they work to become self-sufficient.\nPet-Safe: Our Pet-Safe Foster Program allows our clients to take their pets with them when they leave home seeking emergency shelter. We utilize volunteers who are willing to foster an animal in their home on a temporary basis, knowing that by providing kindness and care, they make a difference to families and animals in need. The volunteers compassion also provides the animals owner with peace of mind, and allows the individual time to seek counseling, develop new personal and professional skills, as well as increase self-esteem and independence.\nEducational Programs: The mission of the Shelter for Help in Emergency is to end domestic violence in our community. With that goal in mind, Shelter staff provide free educational programs to civic organizations, schools, workplaces, allied professionals, the faith community and other community groups requesting a training.\n\nVolunteer Opportunities: The Shelter offers many volunteer opportunities for those in the community interested in helping with this important issue. Click here to view our volunteer opportunities."
  },
  {
    "addressLine1": "1035 Fairfax Ave",
    "city": "Waynesboro",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22980",
    "name": "WARM Waynesboro Area Refuge Ministry",
    "organization": "WARM Waynesboro Area Refuge Ministry",
    "phone": "(540) 324-8166",
    "website": "https://www.warmwaynesboro.org/",
    "description": "This is a rotating Thermal Shelter. It runs from November through March. It rotates between area churches, and runs from Monday to Monday. We provide a cot, a hot dinner and breakfast. Shelter opens at 6:00 pm and guests leave at 7:00 am.\n\nWARM serves the city  of Waynesboro's neediest citizens through the ministry of a thermal shelter. Our thermal shelter, a low-barrier winter emergency shelter, operates from November to March of each year. During those winter months we provide shelter, transportation, community referrals, linens, and some personal care and basic need items to homeless adults at no cost. To do so, we coordinate services with area church congregations and leaders who participate as weekly shelter sites and volunteers.\n\n\nHomeless adults (18 years or older) without accompanying children may participate in the Shelter of Last Resort (thermal shelter) at anytime throughout the winter season. There are not any formal eligibility requirements except, in addition to being 18 years or older without children, guests must be respectful of WARM staff, volunteers, church sites, other guests, and the minimal shelter rules. Homeless individuals may participate by contacting Ted Perry,Thermal Shelter Manager at ted@warmwaynesnboro.org or by meeting at Basic United Methodist Church (on the corner of 5th Street and Delphine Avenue, Waynesboro, VA) each night at 6:00 pm or in front of Waynesboro Public Library at 6:05 pm. (The transportation schedule is subject to change and pickups/drop offs are generally offered for weeks that the shelter sites are not located in the downtown Waynesboro and surrounding area)\n\n\nEach church that hosts the shelter provides an onsite sleeping area for WARM's guests, meals, evening volunteers, overnight volunteers, and a Church/Site Coordinator that works alongside the Thermal Shelter Manager and acts as a liaison for the church and WARM. Prior to becoming a hosting site each church is offered an onsite volunteer training provided by WARM to help ensure that each church partner is fully acclimated with the program's operation, confidentiality, and expectations. Any churches that are interested in participating with the shelter or community members who want to support the shelter's work through financial donations, food, supplies, and/or volunteering may contact Debra Burns, Executive Director at (540)324-8166 or debra@warmwaynesboro.org."
  },
  {
    "addressLine1": "110 Roanoke St",
    "city": "Christiansburg",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24073",
    "name": "To Our House",
    "organization": "To Our House",
    "phone": "(540) 382-6186",
    "website": "https://newrivercommunityaction.org/to-our-house/",
    "description": "WINTER OVERNIGHT SHELTER FOR HOMELESS MEN AND WOMEN\nThe mission of To Our House is to provide winter shelter for single, homeless men and women in the NRV and connect them with resources that lead to employment, housing, and personal economic sustainability.\n\nHOW TO OUR HOUSE WORKS:\n\nDuring winter operation months, guests arrive at the Intake Center at the New River Community Action offices at 110 Roanoke Street, Christiansburg (across from Hardees) between 5:00 5:30 p.m.\nNote: Due to limited bed space, please call 540-320-1273 to check for bed availability.\n\nFollowing sign-in and distribution of house rules, guests are transported to a warm location for the night.\nA hot evening meal is provided with time for fellowship.\n\nGuests enjoy breakfast in the morning and transportation back to the Intake Center. A bag lunch is provided for the day.\n\n\nNew River Community Action works with our communitys most vulnerable residents including the homeless, ex-offenders, the disabled, and struggling young families. NRCA offers a variety of programs to improve the lives of low-income people. Some services address basic needs such as food, shelter, and utilities. Comprehensive early childhood programs promote school readiness, healthy families, and effective parenting. We serve about 12,000 local residents each year.\n"
  },
  {
    "addressLine1": "404 Elm Ave SW",
    "city": "Roanoke",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24016",
    "name": "Trust House Roanoke",
    "organization": "Trust House Roanoke",
    "phone": "(540) 344-8060 EXT 103",
    "website": "http://trusthouseroanoke.org/",
    "description": "Shelter Provided:\nTrust House is a 501c3 designated non-profit providing programming for homeless individuals, families and veterans experiencing crisis.\n\nWe operate from two homes in Old Southwest Roanoke.\n\n\nSingle residents live 3-4 to a bedroom. Families are housed in their own rooms. Residents share kitchens, baths, living rooms, laundry and lounge areas. Residents are responsible for their own cooking. Trust House residents may visit our food pantry if they need assistance with groceries. Residents complete daily chores to maintain the house in addition to caring for their own living space. Residents have access to computers with internet connection. Residents are offered weekly Life Skills training, the option to attend a sober living group and multiple other activities that are captured on a monthly calendar of events."
  },
  {
    "addressLine1": "402 4th Street Southeast",
    "city": "Roanoke",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24013",
    "name": "Rescue Mission - Roanoke",
    "organization": "Rescue Mission - Roanoke",
    "phone": "(540) 343-7227",
    "website": "http://rescuemission.net/",
    "description": "Men's shelter opens at 4:30pm. \nRegistration 4:30pm to 6:30pm.\nDinner 6:30pm\nShelter curfew 7:30pm\nBed Assignments, laundry, shower: 8:30pm.\nLights out 10pm.\nWake up 5am.\n\n\nNon-profit faith based women's shelter and men's shelter segregated.\n\nThree meals served daily to which anyone is welcome.\n\n\nGuest must clean their own rooms and vacate room before breakfast and not return to room until after lunch.Guests are expected to attend prayer before each meal. Individual nice rooms.\nRooms have bunk beds, single beds and television.\nBathrooms in each room.\nKitchen with refrigerator for guests,as well a play room for children.\nCounseling services,job assistance, medical clinic.\nLaundry and church on premises.\nNon smoking within a one block radius of facility.\nAlcohol and rehab programs.\nGuests are expected to work to get back on their feet within a certain time frame.\n\nEmergency Shelter\nThe Rescue Mission has three emergency shelters and a respite care unit committed to offering safe shelter to those who are homeless.\n    Family Shelter\n    Single Women's Shelter\n    Single Men's Shelter\n    Respite Care Shelter\nThe shelters offer a safe environment for people in crisis. In addition to a warm bed and three meals per day, there is medical attention, legal assistance and clothing assistance available. Spiritual guidance is offered through our nightly chapel services which are hosted by local churches of all denominations.\nThe Case Management Team does an initial assessment to establish the guests employment, housing, educational, legal, medical, childcare needs in order to make a realistic plan to exit homelessness.\n\nThis plan will help the guest access appropriate social services and create a workable solution leading towards a more stable life. It is the Rescue Mission's desire for each person to feel welcome and to be empowered to live as independently and abundantly as possible."
  },
  {
    "addressLine1": "206 S. Ridge St.",
    "city": "Danville",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24541",
    "name": "House of Hope",
    "organization": "House of Hope",
    "phone": "(434) 549-1459",
    "website": "http://www.danvillehoh.org/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 878",
    "city": "Danville",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24543",
    "name": "HAVEN of the Dan River Region, Inc.",
    "organization": "HAVEN of the Dan River Region, Inc.",
    "phone": "(434) 483-5482",
    "website": "http://www.havenofthedanriverregion.com/",
    "description": "HAVEN provides information, services, and shelter for victims of domestic Violence and sexual assault in the Danville, Virginia and Pittsylvania County area. The program provides support groups, a crisis-line, advocacy, shelter, referrals for services, and other related services for victims and their children."
  },
  {
    "addressLine1": "13 Cleveland",
    "city": "Martinsville",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "00000",
    "name": "Rainbow House",
    "organization": "Rainbow House",
    "phone": "(276) 632-8701",
    "website": "",
    "description": "Citizens Against Family Violence offers 31 days of shelter for women and their children in domestic violence, sexual assault, stalking, or homelessness situations.   Safety planning, advocacy, documentation of assault, assistance with protective orders and counseling are all services available."
  },
  {
    "addressLine1": "180 Harvest Home Drive",
    "city": "Duffield",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24244",
    "name": "Harvest Child Care Ministries",
    "organization": "Harvest Child Care Ministries",
    "phone": "(276) 546-4400",
    "website": "https://harvestccm.org/",
    "description": "The Emergency &Assessment Shelter is located on State Route 702, off of Highway 58 in the Stickleyville Community of Lee County. Stickleyville is located between Duffield and Jonesville. This home is surrounded by 36 beautiful rolling acres of land owned by Harvest Child Care Ministries.\n\n \n\nThe Shelter shares this property with our Stickleyville Cottage. This facility can house up to 22 children at any time. The shelter has two separate wings for boys and girls monitored by a security alarm system. Separate boys and girls units hold up to eleven children each between the ages of 5 and 18. Each separate unit contains five bedrooms, three baths, and a large day room. The day room is filled with video games, board games, satellite television, and lots of videos and DVD's to keep the children busy. A glass office allows the staff private areas to perform their necessary paperwork. A central dining area and a commercial kitchen provides three meals a day for the children at this facility. Downstairs, there is a large recreation room filled with video games, a pool table and air hockey. 24-hour awake staff provides for the children's daily needs and manage their behavior. Social workers manage each child's assessment and treatment during this 45-day program.\n\n \n    45-day Assessment Program\n    Daily Care and Nurturing\n    24 Hour awake staff\n    Academic testing (available upon request)\n    Psychological Evaluation and testing\n    Dr. Ralph Ramsden, PhD\n    Social History\n\n\n    Medical Care\n        Dr. Bryston Winegar, M.D.\n        Kimberly  Mullins, FNP\n    Psychiatry & Counseling (Individual and Family)\n        Crystal McGlothin, FNP\n        Kelly Munier, LPC\n    Recreation Program\n    Transportation Services\n    Spiritual Guidance\n\n    Assessment Profile (presented to the court or placing agency)\n        Academic and Psychological testing results\n        Social history\n        Physical exam report\n        Behavioral Observations\n        Recommendation for long-term placement"
  },
  {
    "addressLine1": "601 Holston Street",
    "city": "Kingsport",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "37660",
    "name": "Family Promise of Greater Kingsport",
    "organization": "Family Promise of Greater Kingsport",
    "phone": "(423) 246-6500",
    "website": "http://fpgk.org/",
    "description": "Family Promise of Greater Kingsport, Inc. (formerly known as Interfaith Hospitality Network of Greater Kingsport) is a homeless shelter for families with minor children in the Kingsport area. We work with a group of churches that provide overnight accommodations and meals for the guests who are in our program.\n\nFamilies with children make up the fastest growing segment of the homeless population. FPGK provides a safe, family oriented place to stay, nutritious meals, and mentoring to help homeless families with children under 18 on their quest to regain independence.\n\n"
  },
  {
    "addressLine1": "505 Dale Street",
    "city": "Kingsport",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "37660",
    "name": "Salvation Army Kingsport, TN",
    "organization": "Salvation Army Kingsport, TN",
    "phone": "(423) 246-6671",
    "website": "http://salvationarmykytn.org/locations/kingsport/",
    "description": "Homeless Shelter (Temporary Emergency Shelter & Veterans Transitional Shelter)"
  },
  {
    "addressLine1": "670 Dale Street",
    "city": "Kingsport",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "37663",
    "name": "Hope Haven Ministries Inc.",
    "organization": "Hope Haven Ministries Inc.",
    "phone": "(423) 246-6012",
    "website": "http://hopehavenkpt.org/",
    "description": "Emergency Shelter. We are located on Dale St. in Kingsport, TN. Transient Program (temporary shelter for transient individuals)\n\nServices\n    SHELTER\n    FOOD\n    CLOTHING\n    CRISIS COUNSELING"
  },
  {
    "addressLine1": "701 Kentucky Ave SE",
    "city": "Norton",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "00000",
    "name": "Family Crisis Support Services",
    "organization": "Family Crisis Support Services",
    "phone": "(276) 679-7240",
    "website": "https://www.family-crisis.org/",
    "description": ""
  },
  {
    "addressLine1": "17866 Main Street",
    "city": "Dumfries",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22026",
    "name": "ACTS Homeless Shelter",
    "organization": "ACTS Homeless Shelter",
    "phone": "(703) 221-3188",
    "website": "https://www.actspwc.org/",
    "description": "Beverly Warren House\nOne of the very first buildings acquired by ACTS, this home originally served as a shelter (upstairs), a thrift store (main floor), and a food pantry (basement) back in 1979.  It was named after Beverly Warren, a longtime volunteer committed to helping people in need in our community.  Today, Beverly Warren is exclusively an Emergency Shelter with up to 18 beds available for single females or females with children.  We will help you fill out an intake form, conduct a background check, and bring you in, if we have a bed available. If we are full, we can often still help place you somewhere else using the same intake application. If you have children, we will ensure they stay in school and have plenty to do while they are here.  We strive to make this as comfortable as possible for them by providing activities, play equipment, and even birthday parties.  if you are already employed, you will be able to keep your job.  If not, we will do our best to help you find one.\n\n\nHow to Get Assistance\nEveryone with needs related to housing in the Prince William region must go through the Coordinated Entry System.   This includes those looking for emergency shelter, rapid re-housing, or permanent supportive housing.\n\n    To begin the process, you can call CES at 703-792-3366.\n\nRapid Re-Housing Program\nRapid Re-housing is a federal and state funded program designed to give literally homeless individuals and families the opportunity to rent their own place. Those that qualify as literally homeless can come from places not meant for habitation, such as cars, campsites, and benches. Persons coming from Emergency Shelters, Domestic Violence Shelters, Hospitals, Hotels, and Transitional Living Programs may also qualify for Rapid Re-Housing assistance.\nIf you qualify for Rapid Re-Housing\n\n    Call 703-792-3366\n    Make an appointment\n    Complete paperwork to see if you qualify\n\nWhile with us we will help you with:\n    Case management services\n    Housing location services\n    Employment services\n    Resume writing\n    Other referral services as needed\n\nCase Managers work closely with clients to create a financial plan and budget that is catered to affording a room, an apartment, or house for rent. The program provides clients with direct financial assistance towards their security deposit and/or towards rent. The program also ensures case management for clients.\n\n\nAffordable Housing Program\n\nACTS Affordable Housing Program provides qualified low- and moderate-income households the opportunity to live at a reduced rent in privately-owned and privately managed market-rate units located in Prince William County. The Department of Housing and Community Development works with ACTS Sustainable Housing Team to ensure units rented under the program are comparable to market rate apartments, are occupied by households who meet the income guidelines of the program, and that eligibility recertification for the program is completed on an annual basis."
  },
  {
    "addressLine1": "14730 Potomac Mills Road",
    "city": "Woodbridge",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22192",
    "name": "Bill Mehr Drop In Center",
    "organization": "Bill Mehr Drop In Center",
    "phone": "(703) 792-7648",
    "website": "http://www.pwcgov.org/government/dept/socialservices/Pages/Homeless-and-Winter-Shelters.aspx",
    "description": "The Bill Mehr Drop-in Center (DropIn Center) is operated by the Prince William County Department of Social Services. The Drop-In Center operates six days week, Monday-Friday 7:00 a.m. to 12:00 p.m and Saturday 7:00 a.m to 10:00 a.m. and provides meals, showers, clothing, opportunities for spiritual/social interaction, as well as assistance in meeting health, employment, education, and housing needs through referrals.\n\nIn the event the temperature reaches 95 degrees or above  (Monday-Friday) the Drop In Center hours will be extended to provide cool center services.  When temperatures or wind-chill fall below 32 degrees (Monday-Friday) the Drop-In Center hours will be extended to provide warm out of the cold.\n\n\n The Drop-In-Center is located at 14716 Potomac Mills Road in Woodbridge, VA. For more information, call 703-792-7648."
  },
  {
    "addressLine1": "14730 Potomac Mills Road",
    "city": "Woodbridge",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22192",
    "name": "StreetLight Overnight Shelter",
    "organization": "StreetLight Overnight Shelter",
    "phone": "(703) 897-0199",
    "website": "http://thestreetlight.org/",
    "description": "The Overnight Shelter is operated by Streetlight Ministries, and is a 47-bed, shelter for single adult men and women that is in operation 365 days a year, from 6:00 p.m. to 7 a.m. In the event temperatures/wind-chill fall below 32 degrees (on weekends and holidays), the overnight Shelter will operate under extended hours. When temperatures reach 95 degrees or above (on weekends and holidays) the overnight shelter will operate under extended hours."
  },
  {
    "addressLine1": "14945 Jefferson Davis Highway",
    "city": "Woodbridge",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22191",
    "name": "The Hilda M. Barg Homeless Prevention Center",
    "organization": "The Hilda M. Barg Homeless Prevention Center",
    "phone": "(571) 492-7359",
    "website": "http://www.nvfs.org/hildabarg",
    "description": "The Hilda Barg Homeless Prevention Center, operated by NVFS, is a 30-bed family shelter open 24/7 year-round."
  },
  {
    "addressLine1": "4213 Dale Blvd",
    "city": "Woodbridge",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22193",
    "name": "Elect Ladies Transition Home",
    "organization": "Elect Ladies Transition Home",
    "phone": "(703) 730-1393",
    "website": "https://www.electladiestransitionhome.org/",
    "description": ""
  },
  {
    "addressLine1": "5914 Seminary Rd.",
    "city": "Falls Church",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22041",
    "name": "Bailey’s Shelter & Supportive Housing",
    "organization": "Bailey’s Shelter & Supportive Housing",
    "phone": "(703) 820-7621",
    "website": "https://www.newhopehousing.org/our-services/shelters/baileys-shelter-supportive-housing/",
    "description": "Baileys Shelter & Supportive Housing is operated by New Hope Housing.\nEligibility:\n50 bed emergency shelter for adult men and women. No one is turned away from shelter.\nShelter Hours:\n24 hours a day, 7 days a week, 365 days a year.\n\nServices:\nCommunity Case Management\nHousing Location Services\nHypothermia Program (November 1 - March 31)\nDrop-In Program: offers homeless individuals the opportunity to bathe, receive a healthy meal and wash their clothes\n\n\n"
  },
  {
    "addressLine1": "303 S Maple Ave",
    "city": "Falls Church",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22406",
    "name": "Homestretch",
    "organization": "Homestretch",
    "phone": "(703) 237-2035",
    "website": "https://homestretchva.org/",
    "description": ""
  },
  {
    "addressLine1": "217 Gordon Rd.",
    "city": "Falls Church",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22046",
    "name": "Friends of Falls Church Homeless Shelter",
    "organization": "Friends of Falls Church Homeless Shelter",
    "phone": "(703) 854-1400",
    "website": "https://fcshelter.org/",
    "description": "Provide overnight housing to homeless individuals during the winter months.\nTemporary Shelter:\nWinter only November 15 through March 31\nEligibility:\nSingle Adults Only.\nServices:\nHot meals every eveningBreakfast items (milk, juices, bread, fruit, snacks, etc.) Shelter staff provides intake and crisis counseling to all shelter residentsAdvises residents on available city, county, and other social servicesLife skills classes and resources are made available to all Shelter residents. Classes are held weekly Flu shots and outreach nurse practitioners provide services and medicines A year-round case manager\nVolunteer Information:\nemail volunteer@fcshelter.org for volunteer opportunities.\n\n\n\n"
  },
  {
    "addressLine1": "3080 Patrick Henry Drive",
    "city": "Falls Church",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22044",
    "name": "Patrick Henry Family Shelter",
    "organization": "Patrick Henry Family Shelter",
    "phone": "(703) 536-2155",
    "website": "https://shelterhouse.org/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 213",
    "city": "Farmville",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23901",
    "name": "Farmville Area Rescue Mission",
    "organization": "Farmville Area Rescue Mission",
    "phone": "(434) 390-5553",
    "website": "mailto:jeshular@yahoo.com",
    "description": "Temporary overnight housing for individuals without safe shelter or the means to pay for shelter or transportation to safe shelter. \nHours: 6pm through 7am."
  },
  {
    "addressLine1": "2999 River Road West",
    "city": "Goochland",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23063",
    "name": "Goochland Cares",
    "organization": "Goochland Cares",
    "phone": "(804) 556-6260",
    "website": "http://www.goochlandcares.org/",
    "description": ""
  },
  {
    "addressLine1": "9155 Richmond Hwy",
    "city": "Fort Belvoir",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22060",
    "name": "New Hope - Eleanor U. Kennedy Shelter",
    "organization": "New Hope - Eleanor U. Kennedy Shelter",
    "phone": "(703) 799-0200",
    "website": "https://www.newhopehousing.org/our-services/shelters/eleanor-u-kennedy-shelter/",
    "description": "Eleanor U. Kennedy Shelter is a 50 bed shelter located in a historic building on Fort Belvoir grounds outside the Tulley Gate, operated by New Hope Housing.\n\nMust call to get on waiting list, call back for availability.\n\nHours:\nThe Kennedy Shelter is open 24 hours a day, 7 days a week.\n\nServices:\nCase management, advocacy, employment assistance, housing assistance, meals, and connection with community resources and programs.\n\nEligibility:\nAdults only\nDuring winter months, you can go directly to site for availability.\nAdditional Information:\nFairfax Connector Bus Route 171 is located directly in front of the shelter.\nVolunteer Opportunities:\nVolunteers are needed, must be 18 years of age or older.\n\n"
  },
  {
    "addressLine1": "471 Central Rd.",
    "city": "Fredericksburg",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22401",
    "name": "Thurman Brisben Center",
    "organization": "Thurman Brisben Center",
    "phone": "(540) 899-9853",
    "website": "https://brisbencenter.org/",
    "description": "The Brisben Center is a safe, secure and supportive place where women, men, children and families without housing are provided shelter, a caring staff, a shower, a bed and meals, 24 hours a day/365 days a year at no cost to residents.\n\nBrisben Center also offers a temporary platform with opportunities to regain housing, obtain a job, address challenges, acquire new life skills and get a second chance.\nAdmission Criteria\nMust be at least 18 years old and homeless under the HUD definition.\n\n[\"Literally Homeless Individual or family who lacks a fixed, regular or adequate nighttime residence, meaning: 1- Has a primary nighttime residence that is a public or private place not meant for human habitation; 2- Is living in a publicly or privately operated shelter designated to provide temporary living arrangements (including congregate shelters, transitional housing, and hotels and motels paid for by charitable organizations or by federal, state, and local government programs); or 3- Is exiting an institution where (s)he has resided for 90 days or less and who resided in an emergency shelter or place not meant for human habitation immediately before entering institution.]\n\n\nMust be physically and mentally capable of independently providing adequate care for yourself and any children in Brisbens communal dormitory environment.\nDo not present a threat of harm or danger to yourself or others, including clients, volunteers, staff or the facility.\n\nExpectations\nAgree not to consume alcohol or use illegal substances at the Center.\nWilling to adhere to Center policies and staff direction as they pertain to facility operations, safety, security, and health matters; and obey applicable governmental regulations/laws.\n\nWilling to treat other clients, volunteers, staff and the facilities with respect.\nWilling to engage in case management services for housing and related matters. Actively participate in a housing stabilization plan.\n\nWilling to commit to overcoming housing barriers and returning to permanent housing as quickly as possible.\n"
  },
  {
    "addressLine1": "724 Warren Ave",
    "city": "Front Royal ",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22630",
    "name": "Warren County Front Royal House of Hope",
    "organization": "Warren County Front Royal House of Hope",
    "phone": "(540) 635-2466",
    "website": "https://www.warrencountyhomeless.org/",
    "description": ""
  },
  {
    "addressLine1": "724 Warren Avenue",
    "city": "Front Royal",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22630",
    "name": "House of Hope Front Royal",
    "organization": "House of Hope Front Royal",
    "phone": "(540) 635-2466",
    "website": "http://www.warrencountyhomeless.org/",
    "description": "HOUSE OF HOPEThe only residential rehabilitation program serving men in Warren County, Virginia. Opening the door to hope and housing.\n\nThe House of Hope is a 24 hour facility at 724 Warren Avenue. The residence has 16 beds and is alcohol and drug free. We provide showers, food, clothing, laundry facilities, case management, consultation, referrals, job counseling, outreach and support on all levels, to nurture body, mind and soul.\n\nINTAKE CRITERIA:\nAll residents must be drug and alcohol free. House of Hope administers breathalyzers daily and drug tests randomly.\n \nHouse of Hope does not accept sex offenders."
  },
  {
    "addressLine1": "PO Box 454",
    "city": "Front Royal",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22630",
    "name": "Thermal Shelter of Front Royal",
    "organization": "Thermal Shelter of Front Royal",
    "phone": "(540) 892-6108",
    "website": "mailto:michelle.smeltzer@dss.virginia.gov",
    "description": "We are open during the winter months, moving each week to a different church in Warren County. The shelter hours are from 7 pm - 5-7 am (depending on the church) every day. This is a no barrier shelter for adult men and women. No children. Hot dinner is provided each night as well as breakfast and a bag lunch."
  },
  {
    "addressLine1": "217 Opequon Church Lane",
    "city": "Winchester",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22602",
    "name": "Winchester Area Temporary Thermal Shelter",
    "organization": "Winchester Area Temporary Thermal Shelter",
    "phone": "(540) 514-7218",
    "website": "http://www.watts-shelter.org/schedule.php",
    "description": "Provides safe, temporary, overnight, shelter during the coldest winter months.\n\nWATTS is a non-profit, charitable organization (501c3) that provides a safe, temporary, overnight, cold-weather shelter for homeless guests at host sites in Winchester, Frederick and Clarke Counties, Virginia.\n\n\nWATTS operated for 16 consecutive weeks last season.  Guests arrived and registered at 7:00 p.m. each night and departed by 7:00 a.m. the following morning.  Depending on the particular ministry of a given faith community, these times are somewhat negotiable.\n\nTo view the schedule, visit the website provided."
  },
  {
    "addressLine1": "408 West Center St",
    "city": "Galax",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24333",
    "name": "Hope House -The Good Shepherd",
    "organization": "Hope House -The Good Shepherd",
    "phone": "(276) 236-7573",
    "website": "mailto:galaxhostel@embarqmail.com",
    "description": "We are a homeless shelter/recovery center helping the homeless and hurting to help themselves. The Galax Hope House is a Faith-based Ministry. The Mission of the Hope House of the Good Shepherd, Inc of Southwest Virginia is to provide a Christ-based recovery program for the homeless and hurting that will help them to be healthy, happy, productive and self-sufficient."
  },
  {
    "addressLine1": "227 Rockford Street",
    "city": "Mount Airy",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "27030",
    "name": "The Shepherd's House",
    "organization": "The Shepherd's House",
    "phone": "(336) 786-1420",
    "website": "mailto:director@shepherdshousema.org",
    "description": "If you or someone you know is homeless or at imminent risk of losing housing, have them call us at (336)786-1420. We are staffed 24/7 and are always eager to help out those in need. Even if we cannot help you out directly, it is our hope that we can direct you to the appropriate resource for whatever need you may have."
  },
  {
    "addressLine1": "2220 Stockton Street",
    "city": "Richmond",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23224",
    "name": "CARITAS Shelter Placement Referrals",
    "organization": "CARITAS Shelter Placement Referrals",
    "phone": "(804) 358-0964",
    "website": "http://caritasva.org/",
    "description": ""
  },
  {
    "addressLine1": "511 W. Grace Street",
    "city": "Richmond",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23230",
    "name": "Commonwealth Catholic Charities - Homeless Point of Entry",
    "organization": "Commonwealth Catholic Charities - Homeless Point of Entry",
    "phone": "(804) 648-4177",
    "website": "http://www.cccofva.org/homelesspointofentry.html",
    "description": "Hours: Monday-Friday: 9 a.m.-5:00 p.m.\n\nHomeless Point of Entry is the starting point for anyone who is homeless and in need of shelter, case management, and related services. This free program helps clients achieve self-sufficiency and gain permanent housing. Staff works directly with area emergency shelters to fill available beds in greater Richmond.\n\n\nWhen you come to Homeless Point of Entry, please bring:\n1. ID.\n2. Documentation regarding your homelessness.\n\n"
  },
  {
    "addressLine1": "2 E Main St",
    "city": "Richmond",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23219",
    "name": "HomeAgain",
    "organization": "HomeAgain",
    "phone": "(804) 782-9778",
    "website": "http://homeagainrichmond.org/",
    "description": "SHELTER\nIn need of shelter? Contact Homeless Point of Entry\nTEL. (804) 648-4177\n\nEmergency and transitional housing for men, women, children, and veterans.\n\nCOMMUNITY OUTREACH & CASE MANAGEMENT\nThe services provided by the Community Case Manager ensure that those who are most vulnerable receive the services they need to get off the streets and into permanent housing.\n\nEMERGENCY SHELTER FOR FAMILIES\nHouseholds are connected to appropriate services to move them from homelessness to safe, affordable permanent housing as quickly as possible.\n\nMEN'S EMERGENCY SHELTER\nAll residents have access to case management, housing services, and substance abuse services. Program participants are connected with additional services in the community.\n\nPERMANENT SUPPORTIVE HOUSING PROGRAM\nProvides a long-term rental subsidy and case management services to eligible families. Families must meet the HUD definition of homeless and disability.\n\nVETERAN'S TRANSITIONAL HOUSING PROGRAM\nThis program is a partnership with the Veteran's Administration and serves Veterans experiencing a housing crisis.\n\nRAPID REHOUSING SERVICES\nThe INRICH program serves families of any composition. Shelter is provided in apartments located in the Richmond Region and children receive services by a certified Child Services Coordinator."
  },
  {
    "addressLine1": "1320 LaSalle Avenue",
    "city": "Hampton",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23669",
    "name": "H.E.L.P. Inc. - Hampton Roads Ecumenical Lodgings and Provisions, Inc",
    "organization": "H.E.L.P. Inc. - Hampton Roads Ecumenical Lodgings and Provisions, Inc",
    "phone": "(757) 727-2577",
    "website": "https://www.helphampton.org/",
    "description": ""
  },
  {
    "addressLine1": "3700 Huntington Ave.",
    "city": "Newport News",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23607",
    "name": "Peninsula Rescue Mission",
    "organization": "Peninsula Rescue Mission",
    "phone": "(757) 380-6909",
    "website": "http://www.prm.info/",
    "description": "Men's short term emergency shelter, daily check in from 4pm to 9pm.\n\nHelp with meals, clothing, medication, and more.\n\nProviding food assistance for families, Thanksgiving meals for families, and Christmas gifts for children.\n\nOperates a free summer camp for needy families.\n\nCall for information."
  },
  {
    "addressLine1": "Scattered Sites",
    "city": "Newport News",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23601",
    "name": "PORT Emergency Winter Shelter",
    "organization": "PORT Emergency Winter Shelter",
    "phone": "(757) 595-1953",
    "website": "http://www.linkhr.org/programs/winter-service",
    "description": "Shelter is a thermal shelter run from November - March annually. Low barrier, provision of evening meals, breakfast, hygiene items, clothing, obtaining identifications, DD214's, birth certificates, assistance with getting people back to family members if stranded in Newport News. Employment specialist on site 3 nights per week, housing resources and placement assistance, food stamp assistance and sign up, coats and other clothing needed for daily changes and to keep warm. Assistance with obtaining prescription medications when needed.Referrals for special needs for health concerns."
  },
  {
    "addressLine1": "7401 Warwick Blvd",
    "city": "Newport News",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23607",
    "name": "Four Oaks Day Service Center",
    "organization": "Four Oaks Day Service Center",
    "phone": "(757) 926-8651",
    "website": "https://www.nngov.com/2371/Day-Service-Center",
    "description": ""
  },
  {
    "addressLine1": "247 N High Street, PO Box 1478",
    "city": "Harrisonburg",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22803",
    "name": "Mercy House, Inc.",
    "organization": "Mercy House, Inc.",
    "phone": "(540) 432-1812",
    "website": "http://www.themercyhouse.org/",
    "description": "Mercy House is not a \"cookie-cutter\" organization. Each family and individual has different needs and we strive to meet the families at their needs holistically. Each individual completes a service strategy plan. We look at the areas of education, job skills, life resources, personal hygiene, emotional health, physical and dental health, social relationships, childcare needs, spiritual needs, time management, legal issues and diversity abilities. Residents set goals in each of these areas as needed and along with their case manager, set priorities and make a plan for those goals to be met.We also administer the following programs: HIP (Homeless Intervention Program)VIDA (Savings program)Angelfood Ministries distribution point\n\nMercy House only serves families with children (under 18) in their custody.\n \nApplication Process\n 1.  Applicants must call for a initial application/screening, 540-271-1701\n 2.  Long Interview Our caseworker will set you up for a time to come to the office and talk about basic history, living arrangements, work, goals, and current situation.\n\n 3.  After long interview applications are reviewed weekly. You will be notified within one week of your interview of your status. You will then either be given immediate housing (if available) or placed on a waiting list until there is an opening.\n\n \n**Anyone who has lived at Mercy House in the past, must wait 3 months from their exit date before re-applying for housing.**"
  },
  {
    "addressLine1": "1513 W Beverley Street",
    "city": "Staunton",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24401",
    "name": "Valley Mission Inc.",
    "organization": "Valley Mission Inc.",
    "phone": "(540) 886-4673",
    "website": "https://valleymission.net/",
    "description": "Our services attempt to meet the basic needs of shelter, food, clothing, spiritual encouragement and personal growth for the homeless and hungry of our community.\n\nShelter\nliving space for single men\nliving space for single women\nliving space for families\nmeals every day *\nlaundry facilities\npersonal grooming items\ninfant needs\n\nShelter Services\nBedrooms\nWe offer shelter to men, women and families. Our capacity is currently 115 beds: 45 for men, and 27 for women and 9 families. The men reside in one large open dormitory fitted with twin bunk beds. Each man has a small amount of private storage space. The single women reside in one dormitory room, equipped with twin bunk beds. There are nine bedrooms for families, with twin beds, some twin bunks, and cribs as necessary. Most rooms for women and families have clothes dressers and hand sinks in each room.\nThe dormitories are secured at all times, 24 hours every day, seven days a week. Round-the-clock staff and security cameras safeguard residents. Access to the bedrooms is controlled at all times byshelter staff. There are curfews each evening.\n\nDuring weekday business hours, the residents leave the shelter to go to work, seek employment, obtain training, attend programs, or anything else required by their service plan. On weekends, the residents are permitted to stay in the shelter throughout the day.\n\nLaundry Facilities\nClothes washers and dryers are available for resident use at no cost. The laundry room is conveniently located on the same floor of the shelter space as the dormitories and bedrooms. Laundry detergent is made available from donations.\n\nMeals\nMeals are served in the Mission's dining hall every day of the year, three meals each weekday, brunch and dinner on weekend days. All meals served are open to the community, including all special event and holiday meals. Valley Mission encourages donation and serving of healthy and fresh foods whenever possible.\nWeekday meals are prepared by the Mission's food service staff. Most of the food and cooking materials used in the Mission kitchen comes from donations, supplemented by Mission purchases. Many of the meals, especially those served on the weekends, are cooked and served by volunteers from\n\nour community, individuals and groups from churches, synagogues, civic groups and high schools.\n\nMeal Schedule (holiday meals and special may have extended times)\nMonday-Friday: Breakfast 7 am, Lunch 12 noon, Dinner 5 pm Saturday-Sunday: Brunch 10 am, Dinner 4 pm\n\nThrift Store Vouchers\nShelter residents may receive vouchers for needed items such as clothing at the Mission's Staunton Thrift Store. Items received through vouchers are free to shelter residents. When residents move from the shelter into their own housing, needed household items including furniture are made available, also at no cost.\nManagement of Medications\nShelter staff manage the medications brought in by residents seeking shelter, in order to insure proper dosage and compliance with the doctors' orders indicated on the prescription.\n\nPersonal Grooming Items\nResidents receive all items necessary for personal hygiene and grooming. These items are made available at no cost to the resident and come from donations to the Mission.\n\nInfant Needs\nInfant needs are provided to residents from donations. When possible we also assist with these needs for community members who qualify for assistance.\n\nSchool Supplies\nSchool supplies are provided for residents, both children and adults, from donations.\n\n\n"
  },
  {
    "addressLine1": "205 Jarratt Avenue, Ste #A",
    "city": "Jarratt",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23867",
    "name": "Push Faith House",
    "organization": "Push Faith House",
    "phone": "(757) 235-6055",
    "website": "mailto:pushwakefield1@gmail.com",
    "description": "EMERGENCY SHELTER, open 24 hours a day.\n"
  },
  {
    "addressLine1": "1310 Roanoke Avenue",
    "city": "Roanoke Rapids",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "27870",
    "name": "Union Mission of Roanoke Rapids",
    "organization": "Union Mission of Roanoke Rapids",
    "phone": "(252) 537-3372",
    "website": "http://www.unionmissionrorap.org/",
    "description": "Intake Monday - Friday 10:00am -3:00 pm\n\nMinistry to Men\nEmergency shelter, Long-term recovery/rehab program (rural), Transitional housing, Case management\nWomen and Family Ministries\nEmergency shelter, Single women (with children)\n\nFood\nPrepared meals served, Community food pantry\n\nPrograms and Services\nSick at heart, alone and often suffering the devastating effects of drug use, men come to Union Mission looking for help, hope, and a chance to start their lives over again. They find all three in our Men's Program.\nThis long-term residential program offers men a safe environment in which to grow spiritually while healing from addiction and other destructive behaviors through one-on- one counseling, case management, and educational and life-skills classes.\n\nUp to 18 men reside in our facility, where they receive the tools they need to grow strong emotionally, spiritually, academically and physically, through courses like Overcoming Crisis, Codependency, Anger Management, Financial Management, Life Skills, Computer Skills, GED Preparation, and Bible Study.\nUnion Mission does everything possible to eliminate discouraging roadblocks and give our homeless residents every opportunity for success:\n-Safe shelter and an address where they can be contacted for employment\n\n-Appropriate clothing for interviews, along with instruction in personal hygiene\n-Job-skills training, resume writing, and interview coaching\n-Necessary credentials for employment\n-Transportation to training and interviews\n-Christ-centered counseling and character-building programs\n-Spiritual encouragement and moral support\n\nMonthly Food Distribution and Community Meals\nEvery 30 days, Union Mission distributes at least 200 50-pound boxes filled with meat, fresh produce and staple items to near-homeless and working-poor families right here in the Roanoke Valley.\nEach month, we provide nearly 1,000 hot, nourishing meals through our evening dinners, which are open to the community.\n\nWithout these food boxes or meals, many of our neighbors, may be forced choose between feeding their kids or paying the rent. When a family is forced to make these hard choices, they know they are welcome to share meals with us at the Mission or request a food box."
  },
  {
    "addressLine1": "1320 Washington Ave.",
    "city": "Cleveland",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "44113",
    "name": "Stella Maris Cleveland",
    "organization": "Stella Maris Cleveland",
    "phone": "(216) 781-0550",
    "website": "https://www.stellamariscleveland.com/",
    "description": "Shelter for Men with drug and alcohol addiction\n    Serves 20 single men with alcohol and drug addiction\n    Length of stay in program: four to six months\n    Services:\n        Provides intensive outpatient services\n        Provides a therapeutic community\n        Provides job readiness and permanent housing referrals\n   "
  },
  {
    "addressLine1": "18309 North Street",
    "city": "Keller",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23401",
    "name": "Light House Ministries",
    "organization": "Light House Ministries",
    "phone": "(757) 787-2535",
    "website": "http://lighthouseministriesva.org/",
    "description": ""
  },
  {
    "addressLine1": "814 Fourth Street",
    "city": "Pocomoke City",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "21851",
    "name": "Samaritan Shelter",
    "organization": "Samaritan Shelter",
    "phone": "(410) 957-4310",
    "website": "https://twitter.com/lsconnector/status/883336608753307648",
    "description": "Emergency shelter, meals. Emergency food pantry"
  },
  {
    "addressLine1": "105 E Market Street",
    "city": "Leesburg",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "20175",
    "name": "Loudoun Abused Women’s Shelter (LAWS)",
    "organization": "Loudoun Abused Women’s Shelter (LAWS)",
    "phone": "(703) 771-3398",
    "website": "https://www.loudoun.gov/",
    "description": ""
  },
  {
    "addressLine1": "124 Liberty Mtn Drive",
    "city": "Lynchburg",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24502",
    "name": "Liberty Godparent Home For Pregnant Ladies",
    "organization": "Liberty Godparent Home For Pregnant Ladies",
    "phone": "(800) 542-4453",
    "website": "https://godparent.org/",
    "description": "The Liberty Godparent Home houses pregnant young ladies ages 12-21. While residing in our home we work with clients on educational goals, Parenting/adoption plans, prenatal care, etc."
  },
  {
    "addressLine1": "915 Main Street",
    "city": "Lynchburg",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24504",
    "name": "Hand-Up Lodge",
    "organization": "Hand-Up Lodge",
    "phone": "(434) 846-2778",
    "website": "http://lyncag.org/services/hand-up-lodge/",
    "description": ""
  },
  {
    "addressLine1": "2211 Park Ave",
    "city": "Lynchburg",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24501",
    "name": "The Salvation Army Center Of Hope",
    "organization": "The Salvation Army Center Of Hope",
    "phone": "(703) 771-3371",
    "website": "http://virginiasalvationarmy.org/lynchburgva/programsservices/center-of-hope/",
    "description": ""
  },
  {
    "addressLine1": "626 Church St.",
    "city": "Lynchburg",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "24504",
    "name": "YWCA of Central Virginia",
    "organization": "YWCA of Central Virginia",
    "phone": "143) () 484-7775",
    "website": "http://www.ywca.org/site/pp.asp?c=mkI1L6MPJvE&b=919375",
    "description": "Safe, affordable housing for women 18 and older."
  },
  {
    "addressLine1": "10056 Dean Drive",
    "city": "Manassas",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "20144",
    "name": "Northern Virginia Family Service",
    "organization": "Northern Virginia Family Service",
    "phone": "571-748-2695",
    "website": "http://www.nvfs.org/",
    "description": "The office is open from Monday - Friday, 9 a.m. - 5 p.m.\n\nEmergency Assistance\n92 bed emergency shelter for families and individuals. Every client who stays at the shelter receives comprehensive case management designed to address the underlying causes of homelessness.Call 571-748-2603 for hoursFood Pantry available.Part of the Northern Virginia Family Service. The Intake Coordinator returns all calls within 24 hours on business days.\n\nFor Assistance\n\nThe county's largest food distribution center, serving over 800 families each month\nEmergency assistance for utility, rent, water and gas payments\n\nA full continuum of safe and stable housing services, including 15 housing properties\nAccess to free and reduced cost dental and medical care as well as medication\n\nEarly Head Start classroom serving eight children (plus 4 classes serving 32 children in the nearby Georgetown South neighborhood)\nHome-based Early Head Start and Healthy Families programs serving over 200 families\nJob skills and life skills training and support\n\nI need a place to stay. Is there room?\nPlease call our Intake Coordinator for SERVE Family Shelter in Manassas at 571.748.2603. All calls will be answered within 24 hours on business days.\n\nI need help paying for rent or utilities. Who do I call?\nPrince William County: 571.748.2603\nFairfax County: 571.748.2552\nPlease leave a message. The Intake Coordinator returns all calls within 24 hours on business days.\n\nIs there emergency food assistance?\nYes. SERVE's food pantry will need the following:\n1. Photo identification (driver's license, passport, school ID, etc.) for each member of the qualifying family\n2. Proof of residence in Prince William County (any current document with your home address: mortgage/rent statement, utility bill, phone bill, etc.)\n\n\n"
  },
  {
    "addressLine1": "12970 Katherine Hanley Court",
    "city": "Fairfax",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22030",
    "name": "Katherine K. Hanley Family Shelter",
    "organization": "Katherine K. Hanley Family Shelter",
    "phone": "(571) 522-6800",
    "website": "https://katherinehanleyfamilyshelter.business.site/",
    "description": "Katherine K. Hanley Family Shelter (operated by Shelter House, Inc.) is a shelter for families with children that accommodates up to 24 families; they offer sheltering service and supportive programs.\nAdditional contact information:\nTTY 703-988-0256\n\n\n\n\n"
  },
  {
    "addressLine1": "P.O. Box 22687",
    "city": "Newport News",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23609",
    "name": "Menchville House Ministries, Inc.",
    "organization": "Menchville House Ministries, Inc.",
    "phone": "(757) 833-5980",
    "website": "http://www.menchvillehouse.com/",
    "description": "Mission:\nTo help homeless families return to self-sufficiency by providing a temporary home and supportive services.\nMenchville House is a forty six-bed facility emergency housing facility for homeless families, located in the Denbigh area of Newport News on Warwick Blvd.\n\n\n18 month homeless shelter for up to 16 women and 30 children where residents are offered programs to help them return to self-sufficiency.Must be drug and alcohol free and look for work, pay HUD mandated rent.\n\nProgram Requirements\nBe at least 18 years of age.\nCommit to making positive changes in their lives.\nObtain employment.\nBe drug-free for at least six months.\nNot be involved in any criminal activities or lifestyle.\nAggressively seek affordable housing and work towards removing housing barriers.\nAccept case management.\nProgram Services\nTo help residents, Menchville House staff provides or arranges essential services and support including:\nCase Management\nHousing Assistance\nFinancial Literacy\nHousehold Budgeting & Maintenance\nHealthcare Assistance\nEmployment Assistance\nEducational Assistance\nChildren's Activities"
  },
  {
    "addressLine1": "124 Goodwin Neck Rd",
    "city": "Yorktown",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23692",
    "name": "NATASHA House, Inc",
    "organization": "NATASHA House, Inc",
    "phone": "(757) 898-1993",
    "website": "https://www.natashahouse.org/",
    "description": "NATASHA House is a transitional home for homeless women and children that empowers and equips them to achieve and maintain self-sufficiency. Resicency is 6mos to 2yrs.\nNATASHA House is a safe place for women and children that allows them to rebuild productive, thriving lives as they transition to permanent housing.\n\nNATASHA House offers a variety of educational opportunities for both mothers and children. Using both in-house and outside resources, mothers and children immediately begin their path to wholeness through programs such as HomeMakers and CHAMPS"
  },
  {
    "addressLine1": "2129 Vincent Ave",
    "city": "Norfolk",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23504",
    "name": "Barrett Transitional Home",
    "organization": "Barrett Transitional Home",
    "phone": "(757) 624-6990",
    "website": "http://www.barretthaven.org/",
    "description": "Long term transitional housing program for single and single pregnant women. Our mission is helping single and single pregnant women in crisis become confident, independent and self-sufficient. We provide comprehensive supportive services, transitional housing and the necessary skills to prevent and break the cycle of homelessness.\n\nThe women we serve have nowhere to live for a variety of reasons. Underemployment, unemployment, bad credit, substance abuse, domestic violence, and being unable to work while pregnant are just a few.\n\nWhen an individual has no safe place to sleep, shower and eat, it is almost impossible to move forward with their life. Barrett provides the first step in transition by providing a safe, supervised and stable environment. Along with a stable environment, Barrett's staff will connect women with the necessary supportive services to get back on their feet.\n\n\nAdmission Criteria:\nCandidates must be referred from a city agency or emergency/domestic violence shelter.\nCandidates may range in age from 18+ to 61 years.\nCandidates must be single females or single, pregnant females without dependent children.\nRecovering substance abusers must be verifiably drug-free for a minimum of 90 days prior to admission, and be participating in a drug rehabilitative/counseling program."
  },
  {
    "addressLine1": "5100 East Virginia Beach Boulevard",
    "city": "Norfolk",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23502",
    "name": "Union Mission",
    "organization": "Union Mission",
    "phone": "(757) 627-8686",
    "website": "http://www.unionmissionministries.org/",
    "description": "Our desire is to help all who are in need. We are a\nChristian ministry but accept anyone who needs our help.\nWe are open 24 hours a day, 365 days a year.\nEmergency Shelter for Men, Single Women and\nWomen with Children\n5100 E. Virginia Beach Blvd., Norfolk, VA 23502\n- Three meals daily\n- Clothing, toiletries\n- Shower and laundry services\n- Physical and spiritual counseling\n- Job and life skills counseling\nCase Management - Assess need, develop goals, assist with ID's, birth certificates, housing and job referrals, connect to community resources.\nDay Centers- 9am-5pm - Meals, shower and laundry facilities, case management consultation.\n\nCenters shelter guests and general public. Guests may remain in shelters to meet with case managers, seek employment and housing. Area agencies connect guests to services.\n \nSeeking Shelter?Men's Shelter- Single men 18+\n(757) 627-8686, Ext. 200\n- Intake: Daily, 365 days a year - 9:00 a.m. - 9:00 p.m. Must report in person to secure lodging.\n- Curfew - 6:45 p.m. Allowances made for those with verifiable employment or special extenuating circumstances.\n- Nightly chapel services required.\n \nWomen and Children's Shelter- Single women 18+ and\nwomen with children\n- Bed space limited. Call first for availability and phone interview.\n- Single women - 627-8686, Ext. 331.\n- Women with children - 627-8686, Ext. 335 (boys must be 10 and under).\n- Single Women - initial 30 day stay.\n- Bible Studies \" attendance required.\n- Married couples with or without children must stay in separate shelters.\n "
  },
  {
    "addressLine1": "800 Williamsburg Ave, Suite B",
    "city": "Portsmouth",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23704",
    "name": "Portsmouth Volunteers for the Homeless",
    "organization": "Portsmouth Volunteers for the Homeless",
    "phone": "(757) 399-0200",
    "website": "http://www.portsmouthhomeless.org/",
    "description": "Primary provider of emergency shelter for single homeless individuals and to move them from dependency to self-sufficiency, through supportive services in cooperation with other organizations in the Portsmouth area.\n\nPortsmouth Volunteers for the Homeless is a non-profit 501 (c) 3 corporation governed by a twenty-seven (27) member independent Board of Directors. Working with over forty-nine (60) houses of faith in Portsmouth, Chesapeake, Suffolk and students from Virginia Wesleyan College, PVH provides nightly shelter for homeless persons from mid November through the first week of May each year.\n\nEmergency winter night shelter from November to May."
  },
  {
    "addressLine1": "10455 White Granite Drive Suite 100",
    "city": "Oakton",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22124",
    "name": "Northern Virginia Family Service",
    "organization": "Northern Virginia Family Service",
    "phone": "(571) 748-2500",
    "website": "https://www.nvfs.org/",
    "description": "Shelter & Housing\n\nWith 92 beds, SERVE Family Shelter is Northern Virginias largest family homeless shelter. On average, more than 40 percent of shelter guests are children. Shelter guests stay an average of 36 days, and during that time, work with a case manager who helps connect them with the right tools, knowledge and resources for lasting well-being and self-sufficiency.\n\nNVFS housing and homelessness prevention programs also help families and individuals with rent and utility assistance to prevent evictions and disconnections.\nFood Assistance\n\nThe 8,000-square-foot Hunger Resource Center (HRC) serves more than 600 families per month, and nearly 9,000 unique individuals per year, with food and essentials. The HRC also provides nutrition education and strategies for buying healthy food on a budget."
  },
  {
    "addressLine1": "11975 Bowman Towne Drive",
    "city": "Reston ",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "20190",
    "name": "Embry Rucker Community Shelter",
    "organization": "Embry Rucker Community Shelter",
    "phone": "(571) 323-1396",
    "website": "https://www.cornerstonesva.org/",
    "description": "Hours:\nOpen 24 hours a day\nThe Embry Rucker Community Shelter is a 70-bed residential shelter that provides healthy, safe, emergency housing for families and single men and women. We are dedicated to helping our clients overcome the circumstances that led to their homelessness, and facilitate their transition to stable housing.\n\n\nWe are open 24 hours a day, 365 days a year and employ 20 full-time staff members. We also have several part-time staff and more than 400 volunteers dedicated to helping our clients get back on their feet.\n\nServices\n\nOur comprehensive services include child care, medical assistance, nutritious meals, a nurse on staff and financial counseling.\nIn addition, our in-house employment specialist helps unemployed or underemployed residents expand their skills as they prepare to look for work.\n\nFor children, we offer tutoring and mentoring assessments to help achieve developmental and academic milestones.\nWe also employ a full-time licensed housing broker who specializes in finding both traditional and non-traditional affordable housing and helps our residents settle into stable housing as quickly as possible.\n\nIn addition to our residential programs, we offer drop-in access to hot meals, laundry machines, and shower facilities for unsheltered homeless people. These are clients who, either by choice or because our beds are full, live outdoors in cars or other places unsafe for human habitation.\nDuring the winter months of December through March, Cornerstones partners with Fairfax County to operate the North County Hypothermia Prevention Program (NCHP), one of three hypothermia prevention sites in Fairfax County.\nWe operate a cooling center for the homeless as well as emergency shelter during severe storms and summer weather.\n"
  },
  {
    "addressLine1": "326 N. Main St.",
    "city": "Suffolk",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23434",
    "name": "CAPS Night Stay Winter Shelter",
    "organization": "CAPS Night Stay Winter Shelter",
    "phone": "(757) 286-9126",
    "website": "http://www.capsuffolk.com/",
    "description": "Office Hours\nMonday - Thursday 9am - 3:30pm\nFriday - Sunday Closed\n\nPick up is at the Suffolk Seaboard Train Museum, 326 N. Main St. Bus leaves for host church location promptly at 6:30 each evening. The site rotates among host churches on a weekly basis. We are unable to provide services to sex offenders or individuals with alcohol or drugs in their system.\n\nServices:\nNight Stay Program\nThe Night Stay Program is a rotating night shelter for people experiencing homelessness in the winter months. Churches take turns hosting the program for a week at a time, opening their doors to provide shelter, food, safety and a listening ear to our neighbors.\n\nWe are unable to provide these services to sex offenders or individuals with alcohol or drugs in their system.\n\nEmergency Assistance\n\nWe assist Suffolk residents who are experiencing crises by assessing their needs, praying with them, providing information and resources and directly contributing financially. Our staff meets one-on-one with individuals and families to seek to provide the most appropriate and effective assistance. Every person is unique and every situation is different so we provide tailored services rather than one-size-fits-all solutions."
  },
  {
    "addressLine1": "119 W. Constance Road",
    "city": "Suffolk",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23434",
    "name": "ForKids Suffolk Regional Services Center",
    "organization": "ForKids Suffolk Regional Services Center",
    "phone": "(757) 538-7872",
    "website": "https://www.forkids.org/",
    "description": ""
  },
  {
    "addressLine1": "157 N Main St",
    "city": "Suffolk",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23434",
    "name": "The Genieve Shelter - Domestic Violence Shelter",
    "organization": "The Genieve Shelter - Domestic Violence Shelter",
    "phone": "(757) 925-4365",
    "website": "http://www.thegenieveshelter.org/",
    "description": ""
  },
  {
    "addressLine1": "P.O. Box 139",
    "city": "Herndon",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "20170",
    "name": "Artemis House Emergency Shelter",
    "organization": "Artemis House Emergency Shelter",
    "phone": "(703) 435-4940",
    "website": "https://www.artemishouse.org/services",
    "description": "Rapid Rehousing approach, operated by Shelter House, Inc.\n56-bed program, 24 hour emergency shelter intended for sexual violence, domestic violence, stalking, and human trafficking survivors.\n\n"
  },
  {
    "addressLine1": "486 Hospital Road",
    "city": "Tappahannock",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22560",
    "name": "ECHO Shelter Tappahannock",
    "organization": "ECHO Shelter Tappahannock",
    "phone": "(804) 803-5463",
    "website": "https://www.echo-inc.org/",
    "description": ""
  },
  {
    "addressLine1": "23110 Leonard Hall Drive",
    "city": "Leonardtown",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "20650",
    "name": "St. Mary's County DSS - Joseph D. Carter Bldg.",
    "organization": "St. Mary's County DSS - Joseph D. Carter Bldg.",
    "phone": "(240) 895-7001",
    "website": "",
    "description": "Emergency shelter placement. Counseling, case management. Assistance with applying for benefits. Job development. Lexington Park: 240-725-5700/5701, 301-475-8016 (DSS Crisis Line)"
  },
  {
    "addressLine1": "10 Harrison Ave",
    "city": "Williamsburg",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "23185",
    "name": "Grace Haven Family Shelter",
    "organization": "Grace Haven Family Shelter",
    "phone": "(757) 345-2960",
    "website": "https://www.gwoutreachmission.org/",
    "description": ""
  },
  {
    "addressLine1": "300 Fort Collier Road",
    "city": "Winchester",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22603",
    "name": "The Salvation Army of Winchester VA - Center of Hope Shelter",
    "organization": "The Salvation Army of Winchester VA - Center of Hope Shelter",
    "phone": "(540) 662-4777",
    "website": "http://virginiasalvationarmy.org/winchesterva/home-2/our-location/",
    "description": "Emergency Shelter - 48 bed Homeless Shelter (Center of Hope).\n\nHomeless shelter kitchen, meals are served seven days a week, 52 weeks a year, not just to Homeless Shelter residents, but to everyone who comes to our doors.\n\nFood Pantry\nOur Food Pantry is stocked full of non-perishable food items for you and your family Call 540-662-4777, ext. 18 for more information\n(Valid Photo ID & Proof of Income Required)"
  },
  {
    "addressLine1": "435 N Cameron St",
    "city": "Winchester",
    "state": "Virginia",
    "stateAbbreviation": "VA",
    "postal": "22601",
    "name": "Winchester Rescue Mission",
    "organization": "Winchester Rescue Mission",
    "phone": "(540) 667-5379",
    "website": "https://www.winrescue.org/",
    "description": "We offer a place to stay for transients or the homeless for up to 30 nights a month, along with two warm meals, spiritual counseling services, bible study twice a day, and a chapel service nightly. Our changed life program is designed to help offer a biblically based view on the world, build character, and a practical approach to challenges they may encounter in life.\n\nIn our overnight program there will be 30 days in residence and 14 days out. After the 14 days out, you can then reapply, providing a bed is available. This program provides a bed, shower and meals for those staying. One must leave the premises by 8:00 in the morning for the purpose of work or looking or work and return by no later than 4 pm.\n\nWORKING MANS PROGRAM\nprovide housing, food, financial accountability and spiritual knowledge in a loving Christian environment for working men (full time employment) who have no other safe place to live (family or friends). This is a stepping stone for returning to independent living (renting or owning).\n\nThis is a 6 month program teaching men to save money and to take care of financial obligations. Men normally must first go through the overnight program before they join the working man program."
  }
]