[
  {
    "addressLine1": "2727 North Kingshighway Blvd",
    "city": "Saint Louis",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "63113",
    "name": "Covenant House Missouri - Saint Louis",
    "organization": "Covenant House Missouri - Saint Louis",
    "phone": "(314) 533-2241",
    "website": "https://www.covenanthouse.org/homeless-charity/missouri",
    "description": "Covenant House Missouri (CHMO) empowers homeless, runaway and at-risk youth to live independently and become contributing members of the community. With open doors and open hearts, more than 6,400 young people (16 - 21 years of age) in the St. Louis metropolitan area are provided programs and resources every year.As one of the leading St. Louis nonprofits servicing youth, CHMO is dedicated to providing hope, enrichment and a positive direction to all youth in need. This all-encompassing approach is housed within the CHMOs Center for Youth, a welcoming, bright environment with dorm-like floors and classrooms.\n\nIn addition to emergency shelter services, the Center for Youth provides educational resources, job skill development, personal counseling and numerous life skill classes.\n\n\nThere is also an extensive transitional living program where youth can live in the facility for up to two years. Moreover, youth with mental health issues who have left the CHMO program (for up to six months) are personally called by After-care Program staff to ensure stability and if essential needs are being met.Outside of the Center for Youth, CHMO staff bring awareness of youth homelessness and services to schools (safe outreach) and on poverty stricken streets (street outreach). The outreach team continuously educates the public and directly assists youth in crisis with resources and immediate supplies like food and clothing."
  },
  {
    "addressLine1": "1020 Buccaran Dr",
    "city": "SLIDELL",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "70458",
    "name": "THE CARING CENTER OF SLIDELL",
    "organization": "THE CARING CENTER OF SLIDELL",
    "phone": "(985) 646-1368",
    "website": "https://www.facebook.com/slidelladultdayhealthcare/",
    "description": "Shelter for homeless women and children in Slidell."
  },
  {
    "addressLine1": "2228 Second Street",
    "city": "Slidell",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "70458",
    "name": "Community Christian Concern",
    "organization": "Community Christian Concern",
    "phone": "(985) 646-0357",
    "website": "https://www.facebook.com/Community-Christian-Concern-of-Slidell-158369944193495/",
    "description": ""
  },
  {
    "addressLine1": "810 E Sunflower Rd",
    "city": "Cleveland",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "38732",
    "name": "Community Action Rainbow Emergency Shelter",
    "organization": "Community Action Rainbow Emergency Shelter",
    "phone": "(662) 846-1491",
    "website": "http://www.co.bolivar.ms.us/bccaa.htm",
    "description": "Homeless shelter 6 male beds 12 women and children beds. Provides case management, homeless prevention, homeless resourses. Open 24 hours a day"
  },
  {
    "addressLine1": "113 West Gaines St",
    "city": "Monticello",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "71655",
    "name": "Options, Inc.",
    "organization": "Options, Inc.",
    "phone": "(870) 460-0684",
    "website": "",
    "description": "Battered women's shelter. Females over 18 with children. Male children under 14 years old"
  },
  {
    "addressLine1": "2845 South Frontage Road",
    "city": "Columbus",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39703",
    "name": "Mississippi Regional Housing Authority IV",
    "organization": "Mississippi Regional Housing Authority IV",
    "phone": "(662) 327-0136",
    "website": "",
    "description": "Housing support services"
  },
  {
    "addressLine1": "1711 23rd Ave",
    "city": "Tuscaloosa",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "35401",
    "name": "Community Soup Bowl",
    "organization": "Community Soup Bowl",
    "phone": "(205) 752-2421",
    "website": "http://tuscaloosasoupbowl.com/",
    "description": ""
  },
  {
    "addressLine1": "2902 Greensboro Avenue",
    "city": "Tuscaloosa",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "35403",
    "name": "Salvation Army Tuscaloosa Center of Hope",
    "organization": "Salvation Army Tuscaloosa Center of Hope",
    "phone": "(205) 345-6939",
    "website": "https://salvationarmyalm.org/tuscaloosa/",
    "description": "The Salvation Army Tuscaloosa provides a homeless Drop In Centers, Homeless Shelter for Families, Homeless Shelter for Men, Homeless Shelter for Single Mothers, Homeless Shelter for Women.\n\nFood pantry available Monday through Friday from 9 a.m. until 3 p.m. Individuals can recieve help once every 90 days.\n\nOther Services Provided:\n\nChristmas Programs, Electric Service Payment Assistance, Gas Service Payment Assistance, Rent Payment Assistance, Water Service Payment Assistance.\n\nJob and Search Placement."
  },
  {
    "addressLine1": "527 Carnation St",
    "city": "Tupelo",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "38801",
    "name": "Salvation Army Homeless Shelter - Red Shield Lodge",
    "organization": "Salvation Army Homeless Shelter - Red Shield Lodge",
    "phone": "(662) 842-9222",
    "website": "https://www.salvationarmyusa.org/usn/",
    "description": "Red Shield Lodge. The lodge opens for check-in at 5:00 p.m. A photo I.D. is required and a background check will be done.We offer three meals per day, a safe place to sleep,  laundry facilities, and there are people around who have been there and are willing to listen.\n"
  },
  {
    "addressLine1": "P.O.Box 15673",
    "city": "Hattiesburg ",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39404",
    "name": "Faith Blessing PATH",
    "organization": "Faith Blessing PATH",
    "phone": "(601) 549-5884",
    "website": "mailto:faithblesspath@gmail.com",
    "description": "Serving as an emergency outreach mission for the homeless and needy families. Providing clothing, food and temporary shelter on a case by case need.\n\nPath is a homeless outreach mission providing humanitarian assistance to the homeless & needy individuals and families in crisis circumstances. Path assist homeless women with children to Safe Shelter based on crisis and circumstances. Faith Blessing PATH is a Faith based organization established in 2014."
  },
  {
    "addressLine1": "2255 Broadway Drive",
    "city": "Hattiesburg",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39402",
    "name": "Green Meadows",
    "organization": "Green Meadows",
    "phone": "(601) 296-6472",
    "website": "",
    "description": "Provides supportive housing and case management assistance to homeless women and their children."
  },
  {
    "addressLine1": "5712 US HWY 49 S",
    "city": "Hattiesburg",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39401",
    "name": "The Fieldhouse for the Homeless Day Resource Shelter",
    "organization": "The Fieldhouse for the Homeless Day Resource Shelter",
    "phone": "(601) 336-4055",
    "website": "mailto:info@fieldhouse.com",
    "description": "Hours: 8:00 AM- 4:00 PM\n\nWe have: restrooms, shower and toiletry items, laundry services, clothing room, mailing address, locked storage, voice mail, bus tokens for work and medical appointments, beverages and snacks, case management, ID assistance, telephone, life skills classes, onsite access to other service providers.\n\nPrograms and Services-Topics Include: health care, housing, alcohol and drug intervention & awareness, resumes and interviews, disaster preparedness, personal hygiene, risk prevention, money management, and decision making.Day Resource Center. Where we are making homelessness a season of life, not a way of life! We assis in getting state issued ID, Social Security Cards, Employment, Showers, Laundry Services, Mailing Address, Breakfast and Lunch on Weekends, Lunch during weeekdays MORE!"
  },
  {
    "addressLine1": "5670 Hwy 49",
    "city": "Hattiesburg",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39402",
    "name": "Salvation Army Emergency Shelter Hattiesburg",
    "organization": "Salvation Army Emergency Shelter Hattiesburg",
    "phone": "(601) 544-3684",
    "website": "http://salvationarmyalm.org/hattiesburg/center-of-hope/",
    "description": "Shelter Hours:\nMonday Friday 5 p.m. 7 a.m.\nSaturday 5 p.m. 8 a.m. Sunday 5 p.m. 8:30 a.m.\nWhite Flag (open 24 hrs): Below 40 and Above 100\n\n\nThe Salvation Army Emergency Shelter is a 43-bed facility that provides lodging and meals for transients, homeless individuals and families, as well as dislocated individuals who are in need of a shelter. The Salvation Army Shelter is dedicated to helping men, women and families overcome the situations and conditions that have brought them to our shelter.\n\n\n\nStaff is available to advocate for, provide guidance to and make referrals to private and public resources. Individuals have access to the telephones, classified ads and showers. These are all key in gaining employment, which potentially leads to becoming self-sufficient.\n\n\n\n\nThe opportunity is provided to all residents to take part in worship and other activities at The Salvation Army church or at a community church of their choice.\n\n\n\nThe Salvation Army also provides numerous in-house resources, including but not limited to: prescription assistance, transportation assistance and a food pantry. Vouchers for clothing, furniture and other items needed for setting up housekeeping are frequently given through our Family Thrift Store.\n\n\n\nThe goal for the Salvation Army Center of Hope is to provide temporary housing with the long time goal of helping individuals or families obtain permanent housing, if possible."
  },
  {
    "addressLine1": "204 Eupora Street",
    "city": "Hattiesburg",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39401",
    "name": "Lighthouse Rescue Mission",
    "organization": "Lighthouse Rescue Mission",
    "phone": "(601) 544-2169",
    "website": "https://lighthouserescuemission.org/",
    "description": "Lighthouse is a non-profit 501c3 recovery and transitional facility for mothers and their children who are victims of abuse, homelessness and addiction.\nThe Lighthouse Rescue Mission strives to provide hope, stability and new beginnings to homeless children and their mothers by meeting their physical, spiritual and emotional needs by following the example and teachings of Jesus Christ.\n\nThe Lighthouse first opened its doors in 2005 to provide new beginnings for homeless children and their mothers in the Hattiesburg area. In 2014, The Lighthouse expanded its residences to meet the needs of the increasing number of homeless women and children in the Pine Belt. In addition to meeting basic needs, our residents are offered additional support programs in GED preparation, life skills and Bible studies. The Lighthouse strives to create a safe environment while sharing the love of Jesus Christ.\nThe typical homeless family in the Hattiesburg area consists of a mother in her early twenties who did not complete high school and may not have any work experience. According to Share International, 40% of homeless persons are in families. Homeless children also experience more mental health problems such as anxiety, depression and withdrawal. They are twice as likely to experience hunger and four times as likely to have delayed development. These illnesses have potential devastating consequences if not treated early.\nAt The Lighthouse Rescue Mission, we want each parent to succeed and each child to have a safe, warm, and fun place where they can simply be a child. Families will not stay for six to nine months to leave and not be changed; they will have had an opportunity to create a new life for themselves through the power and Spirit of Jesus Christ. Through His saving grace, they will be empowered to be the people that God has called them to be. We are offering a hand up, not a hand out.\n"
  },
  {
    "addressLine1": "121 College St",
    "city": "Hattiesburg",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39401",
    "name": "121 Haven House",
    "organization": "121 Haven House",
    "phone": "(601) 450-4286",
    "website": "https://www.ascms.net/",
    "description": ""
  },
  {
    "addressLine1": "1 Veterans Drive",
    "city": "Pine Ridge",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "57770",
    "name": "Oglala Sioux Tribe Veterans Shelter",
    "organization": "Oglala Sioux Tribe Veterans Shelter",
    "phone": "(605) 867-2466",
    "website": "http://www.oglalalakotanation.org/",
    "description": "Contact at the phone number or email for more details on this veterans only shelter."
  },
  {
    "addressLine1": "748 N. President Street",
    "city": "Jackson",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39202",
    "name": "Case Management Housing Support Services",
    "organization": "Case Management Housing Support Services",
    "phone": "(601) 355-8634",
    "website": "mailto:tuckerpkelly@gmail.com",
    "description": "Catholic Charities - Domestic Violence Service Center"
  },
  {
    "addressLine1": "328 South Gallatin Street",
    "city": "Jackson",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39207",
    "name": "Gateway Rescue Mission",
    "organization": "Gateway Rescue Mission",
    "phone": "(601) 353-5864",
    "website": "https://gatewaymission.org/",
    "description": "Emergency Shelter Men Only"
  },
  {
    "addressLine1": "258 Maddox Road",
    "city": "Jackson",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39212",
    "name": "Hinds County Human Resource Agency",
    "organization": "Hinds County Human Resource Agency",
    "phone": "(601) 923-3930",
    "website": "",
    "description": "Office hours:\nMondays through Fridays 8am - 5pm.\n\nHousing support services.\n\nWe provide referrals to homeless and can guide them in the right direction."
  },
  {
    "addressLine1": "1100 W. Capitol Street",
    "city": "Jackson",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39203",
    "name": "Stewpot Community Services - Billy Brumfield Shelter",
    "organization": "Stewpot Community Services - Billy Brumfield Shelter",
    "phone": "(601) 353-2759",
    "website": "",
    "description": "The Billy Brumfield Shelter serves as an emergency shelter for homeless men, offering safe shelter, clean showers, nutritious food, and a supportive community.\n\nThe Billy Brumfield Shelter, a shelter for up to 60 men a night, provides three services. It serves as an emergency shelter for homeless men, offering safe shelter, clean showers, nutritious food, and a supportive community. It also offers a drug and alcohol rehabilitation program, supported by AA meetings, group and individual counseling, employment requirements, and a savings program. Finally, for men with medical disabilities, it provides support and a stable place to live as they navigate state and federal requirements to receive benefits and permanent housing.\n\n\nOver 700 men a year find shelter at the Billy Brumfield House.\nThe Billy Brumfield House was named for a homeless man who died of hypothermia while sleeping in his car."
  },
  {
    "addressLine1": "110 Presto Lane",
    "city": "Jackson",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39206",
    "name": "Salvation Army Center of Hope Shelter Jackson",
    "organization": "Salvation Army Center of Hope Shelter Jackson",
    "phone": "(601) 982-1828",
    "website": "http://salvationarmyalm.org/jackson/locations-salvation-army/",
    "description": ""
  },
  {
    "addressLine1": "2900 Saint Paul Street",
    "city": "Meridian",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39301",
    "name": "Frances W. Davidson Memorial Homeless Shelter",
    "organization": "Frances W. Davidson Memorial Homeless Shelter",
    "phone": "(601) 483-4838",
    "website": "",
    "description": "Provides a 34 bed shelter, temporary housing, for homeless men and women, as well as families.\n\nThe shelter includes two male dorms, a female dorm and two family units complete with bathroom and shower facilities, onsite washer and dryers (detergent furnished) and a main sitting area with a television. Cooking is not allowed, therefore meals are provided by LOVE's Kitchen or donated by local churches, restaurants and other entities. A pantry available at each of the dorms and family units is stocked with microwavable foods and snacks."
  },
  {
    "addressLine1": "710 B Street",
    "city": "Meridian",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39301",
    "name": "Shelter of Hope Salvation Army Meridian",
    "organization": "Shelter of Hope Salvation Army Meridian",
    "phone": "(601) 286-3016",
    "website": "http://salvationarmyalm.org/meridian/shelter-of-hope/",
    "description": ""
  },
  {
    "addressLine1": "109 South Union St",
    "city": "Natchez",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39120",
    "name": "Catholic Charities Guardian Shelter and Oak Towers",
    "organization": "Catholic Charities Guardian Shelter and Oak Towers",
    "phone": "(601) 442-0142",
    "website": "https://www.facebook.com/pages/Catholic-Charities-Inc-The-Guardian-ShelterOak-Towers-Supportive-Housing/106130466085321",
    "description": "The Guardian Shelter for Battered Families is designed to help victims of spouse abuse and their children during the critical time in life. The shelter provides the following services:\n30 day temporary emergency shelter\nSupport/Counseling Emotional support, short term counseling and assistance in problem solving\nAdvocacy - Information and referral\n\nOak Towers Supportive Housing provides shelter residents to live independently and continue thier established services of treatment from thier abusive past up to 6 months with 3-month extensions available. This time is given to achieve independence from an abusive relationship. Living independently with supportive services helps pave the way toward self-sufficiency.\n\nBoth programs serves domestic violence victims in 11 Mississippi counties: Adams, Amite, Franklin, Jefferson, Claiborne, Copiah, Lawrence, Lincoln, Pike, Wilkinson, Walthall & Concordia Parish, LA"
  },
  {
    "addressLine1": "81 & 85 Rainbow Drive",
    "city": "Pineville",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "00000",
    "name": "Voa Transitional Residential Services",
    "organization": "Voa Transitional Residential Services",
    "phone": "(318) 442-8026",
    "website": "http://www.voanorthla.org/",
    "description": ""
  },
  {
    "addressLine1": "620 Beauregard",
    "city": "Alexandria",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "00000",
    "name": "The Salvation Army Transient Lodge",
    "organization": "The Salvation Army Transient Lodge",
    "phone": "(318) 442-0445",
    "website": "https://www.facebook.com/AlexandriaSalvationArmy/",
    "description": "Capacity - 47  \nServing - men, women, single parent\nfamilies, adult couples, transients "
  },
  {
    "addressLine1": "1404 Murray Street",
    "city": "ALEXANDRIA",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "71301",
    "name": "TURNING POINT SHELTER - FAMILY COUNSELING AGENCY",
    "organization": "TURNING POINT SHELTER - FAMILY COUNSELING AGENCY",
    "phone": "(318) 442-7196",
    "website": "http://fca4cenla.com/",
    "description": "Shelter"
  },
  {
    "addressLine1": "29 Bolton Ave",
    "city": "Alexandria",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "71301",
    "name": "Hope House Alexandria",
    "organization": "Hope House Alexandria",
    "phone": "(318) 487-2061",
    "website": "http://www.cenlahopehouse.org/",
    "description": "Hope House is a shelter for homeless women and their children. Capacity 35.\n\nMust be a woman over 18 years old and homeless.\n\nServices:\nCase management\nchild care assistance\nchildren services\nsupportive housing\ntransportation assistance\nclothing assistance\netc"
  },
  {
    "addressLine1": "CONFIDENTIAL",
    "city": "ALEXANDRIA",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "00000",
    "name": "Tsc Emergency Shelter",
    "organization": "Tsc Emergency Shelter",
    "phone": "(318) 448-3752",
    "website": "",
    "description": "Emergency shelter for unaccompanied men and women, single and two parent families, adult couples "
  },
  {
    "addressLine1": "2804 Hynson Street",
    "city": "Alexandria",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "71301",
    "name": "House of Mercy Women's Shelter",
    "organization": "House of Mercy Women's Shelter",
    "phone": "(318) 487-8976",
    "website": "http://www.thepentecostals.org/",
    "description": "Single Women's Shelter. Must have a willingness to seek God. Spiritual based place.\n\nThe House of Mercy facilitates healing for hurting women in need of protection and shelter.  Reaching out to the homeless women of the community, House of Mercy provides temporary housing and an opportunity to overcome hardships.  The House of Mercy can accommodate six ladies at a time.\n\nWhen ladies arrive at the House of Mercy, they attend an orientation, which includes a presentation of the following:\n    the plan of salvation\n    an introduction to God's principles\n    the goal to become an overcomer and to live a life of love, peace, joy, and righteousness\n    guidelines that must be followed while in residence\n    the House of Mercy's handbook\nStaff members of the House of Mercy are responsible for scheduling chores, such as cooking and cleaning.  They also schedule mandatory events, such as Bible studies, prayer meetings, and attendance at church services.\nIn an effort to provide financial assistance, the staff helps residents obtain employment and encourages financial responsibility to prepare for the future.\nFollowing the example set by Jesus, the House of Mercy is designed to provide a covering for the hurting.  In meeting the needs of residents, the House of Mercy staff administrates, leads, and disciplines with love, compassion, forgiveness, grace, long-suffering, patience, sympathy, and tolerance."
  },
  {
    "addressLine1": "2807 Levin Street",
    "city": "Alexandria",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "71301",
    "name": "The Grace House Alexandria",
    "organization": "The Grace House Alexandria",
    "phone": "(318) 487-8976",
    "website": "mailto:rsproles@thepentecostals.org",
    "description": "Operated by the Pentecostals of Alexandria.\nMale shelter.\nMust have willingness to seek God."
  },
  {
    "addressLine1": "14200 Jericho Rd",
    "city": "Vancleave",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39565",
    "name": "Homes of Grace",
    "organization": "Homes of Grace",
    "phone": "(228) 826-5283",
    "website": "https://www.facebook.com/homeofgrace/",
    "description": "Emergency Shelter Direct Medical Assistance"
  },
  {
    "addressLine1": "14970 Mission Road",
    "city": "Mobile",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "36608",
    "name": "Mission of Hope For Men and Women",
    "organization": "Mission of Hope For Men and Women",
    "phone": "(251) 649-0830",
    "website": "https://www.missionofhopeministries.net/",
    "description": "Mission of Hope Ministries is a three month, in care, Christian program designed to help men and women who are addicted to drugs and alcohol have a NEW LIFE through JESUS CHRIST. This is offered at no cost to the client.\n\nMission of Hope (Men's Program)\nThe initial Mission of Hope men's program is a three month, in-house program.  It is located on forty, beautiful, private acres in west Mobile County. They can house up to 50 men in these dorms.\n\nHaven of Hope\n"
  },
  {
    "addressLine1": "P.O. Box 820138",
    "city": "Vicksburg",
    "state": "Mississippi",
    "stateAbbreviation": "MS",
    "postal": "39182",
    "name": "Mountai of Faith Women's Restoration Shelter",
    "organization": "Mountai of Faith Women's Restoration Shelter",
    "phone": "(601) 661-8990",
    "website": "http://mtnoffaith.org/",
    "description": "Mountain of Faith Ministries (MOFM) has been a 501(c)3 faith-based organization since 2001. We currently operate as an emergency homeless shelter in Vicksburg, Warren County, Mississippi. The City of Vicksburg and the Mississippi Department of Human Services worked in concert to donate the facility, which MOFM named The Women's Restoration Shelter. Since opening in 2005, our Shelter has housed over 800 homeless women and children in our rural area. Homeless families come from the City of Jackson, Hinds, Madison, Rankin, Copiah, Warren and other surrounding counties. We rescue women and children from abandoned buildings, parked cars, under bridges and other destitute situations. Our initial goal is to feed, clothe and shelter homeless individuals and families. Once the initial assessment has been completed, we work to remove the barriers which caused the individuals or family to become homeless..OUR GOALSOur initial goal is bringing homeless individuals and families into our program and leading them through emergency homelessness. The ultimate goal is to guide residents to transitional living and finally to permanent housing. We aim to provide an environment which assists the homeless individual and families to become self-supportive, self-reliant and in a position to make a self-determination. Our outreach program contacts referents on occasion have brought the homeless into the programs from a situation which was not meant for human habitation."
  }
]