[
  {
    "addressLine1": "360 W Main St",
    "city": "Batesville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72503",
    "name": "Family Violence Prevention Center",
    "organization": "Family Violence Prevention Center",
    "phone": "(870) 698-0010",
    "website": "http://www.batesvillefamilyviolence.com/",
    "description": ""
  },
  {
    "addressLine1": "1417 Dewey Avenue",
    "city": "Newport",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72112",
    "name": "Project New Start",
    "organization": "Project New Start",
    "phone": "(870) 523-8413",
    "website": "http://www.projectnewstart.org/",
    "description": ""
  },
  {
    "addressLine1": "14100 Vaughn Road",
    "city": "Bentonville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72712",
    "name": "Northwest Arkansas Children's Shelter",
    "organization": "Northwest Arkansas Children's Shelter",
    "phone": "(501) 795-2417",
    "website": "https://nwacs.org/",
    "description": "The Northwest Arkansas Children's Shelter is a private, nonprofit organization that provides 24-hour emergency residential care to children who are victims of family violence, neglect and physical and sexual abuse.\n\n\n\nThe Children's Shelter is designed to meet the needs of these children by providing them with a safe and loving environment to reduce their trauma, through support and nurturing.\n\n\n\n\nWe are staffed and ready, day and night, taking in and caring for children in crisis. Children may stay with us for up to 45 days in a six-month period, before being placed in another foster-care setting or returning to their families.\n\n\nThe Emergency Shelter program focuses on meeting the basic needs of the children so they can begin to feel safe and to heal from the trauma they have experienced. Meeting these basic needs is one of the first ways that our staff can begin to build trust with the children in our care many of whom have never been able to trust the adults in their lives. These basic needs include:\n\nA warm bed\nConsistent, balanced meals\nHealthy snacks\nClean, well-fitting clothing\nAccess to baths/showers and personal hygiene items\n\nAnd most importantly\n\nLoving care provided 24-hours per day"
  },
  {
    "addressLine1": "Post Office Box 572",
    "city": "Bentonville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72712",
    "name": "Benton County Women's Shelter",
    "organization": "Benton County Women's Shelter",
    "phone": "(501) 273-0730",
    "website": "",
    "description": "They provide emergency shelter to women."
  },
  {
    "addressLine1": "3305 SW I Street",
    "city": "Bentonville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72712",
    "name": "The Salvation Army Emergency Shelter",
    "organization": "The Salvation Army Emergency Shelter",
    "phone": "(479) 271-9545",
    "website": "http://salvationarmyaok.org/nwarkansas/our-shelters/",
    "description": "Emergency shelter. Provides Men's, Women's shelter and Family Suites.\n\nHours: Opens at 4:30pm.\nDinner Served at 6:00 PM\nBreakfast at 6:00 AM"
  },
  {
    "addressLine1": "808 N. Main St.",
    "city": "Bentonville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72712",
    "name": "Havenwood",
    "organization": "Havenwood",
    "phone": "(479) 273-1060",
    "website": "https://www.nwahavenwood.org/",
    "description": "Transitional housing for Single parent families with two or fewer children under ten years of age.\n\n\n\nThe Havenwood program provides transitional housing for single parents and their children in a supportive environment to help families become economically self-sufficient and transition into permanent housing.\n\n\n\n\n\n\nHavenwood is a two year program designed to help single parents overcome the barriers in their lives that lead to homelessness. Residents are required to work or attend school full time. We do NOT offer onsite child care, except during groups or special activities.\n\n\n\n\n\nResidents are required to participate in our life skill development program that requires working with our caseworker to develop a Personal Living Plan and participating in weekly group meetings. It includes a curriculum that focuses on budgeting and money management, health and wellness, personal empowerment and leadership, workforce enhancement and, family dynamics and healthy relationships. We encourage working with a counselor on therapeutic goals. Residents also receive services include individual case management, referral to resources they need to accomplish their personal living plan and a family like atmosphere to help meet the needs of their children.\n\n\n\n\n\n\nOur program helps integrate families into the community and teaches personal responsibility and self-sufficiency. Residents are required to do community service as well as contribute to the shared living areas in the form of chores.\n\n\n\n\n\nResidents sign a lease with Community Development Corporation of Bentonville/Bella Vista, Inc. and can stay up to two years. Applicants must agree to fully participate in the Havenwood Program. Havenwood provides support, resources, and referrals to break down the barriers each family faces in order to move from homelessness to self-sufficiency.\n"
  },
  {
    "addressLine1": "2215 Little Flock Drive",
    "city": "Rogers",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72756",
    "name": "Restoration Village",
    "organization": "Restoration Village",
    "phone": "(479) 631-7345",
    "website": "https://www.restorationvillage.net/",
    "description": "Long-term crisis shelter for women and children.\nRestoration Village is Northwest Arkansas' faith-based, long-term crisis shelter for women and children. We work to restore hope and break the cycle of abuse for women and children in crisis. To accomplish this, we provide safe shelter and life-changing services to our all our residents.\n\nOur ResidentsResidents come to us from a variety of different backgrounds. Some are homeless or survivors of domestic violence. Other have experienced sexual, emotional or physical abuse. While we are a womens shelter, we address a variety of crisis situations in addition to domestic violence. Both single women and women with children join us at the Village.\n\n\nWe offer our services to those from Rogers, Bentonville, Northwest Arkansas, and beyond. We have even welcomed women from as far away as Tulsa, Little Rock, and even Kenya!\n\nOur ProgramRegardless of the crisis, we work to offer hope and healing to all our residents. We restore hope and break the cycle of abuse by providing safe shelter and life-changing services. With generous support, we provide this at no cost. Residents can stay as long as needed.\n\nOur services include counseling, equine therapy, adult and child advocacy, just to name a few. Our SupportMost importantly, we do the work of restoring hope and breaking the cycle of abuse together. For more than thirty years, we have said that \"it takes a village\" to do such work. Individuals, businesses, organizations, churches, and other community groups all contribute to the life of the Village.\n\nTogether, we can restore hope. Together, we can break the cycle of abuse."
  },
  {
    "addressLine1": "1229 W. Poplar St.",
    "city": "Rogers",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72761",
    "name": "Saving Grace, Inc.",
    "organization": "Saving Grace, Inc.",
    "phone": "(479) 636-1133",
    "website": "https://www.savinggracenwa.org/",
    "description": "Transitional housing for young women (ages 17-25) who have aged out of foster care, group homes, or are facing homelessness.\n\nSaving Grace exist to help young women who have aged out of foster care or group homes or have found themselves homeless or without the necessary supportive relationships, unlock the doors of opportunity through teaching them basic life skills, financial peace, professional coaching and connecting them with three mentors....a woman their own age, one their mothers age and grandmothers age."
  },
  {
    "addressLine1": "615 West Chestnut",
    "city": "Rogers",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72756",
    "name": "May House for BOYS",
    "organization": "May House for BOYS",
    "phone": "(501) 631-0838",
    "website": "",
    "description": "shelter for boys only. Ages 13 - 18"
  },
  {
    "addressLine1": "1622 S 8th St",
    "city": "Rogers",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72756",
    "name": "Northwest Arkansas Women's Shelter",
    "organization": "Northwest Arkansas Women's Shelter",
    "phone": "(479) 621-6116",
    "website": "https://nwaws.org/",
    "description": "24-hour crisis phone line: (479) 246-9999 or 1-800-775-9011. Northwest Arkansas Women's Shelter provides 24-hour emergency shelter for men, women, and children victimized by domestic violence or sexual assault.\n\nAt the Northwest Arkansas Womens Shelter, our advocates work with clients to help them and their families secure housing so they have a place to call home upon leaving our facility. Through our housing support program, we can help survivors secure housing in Benton County, Washington County, Madison County, and Carroll County. We help with rent, utilities, and housing applications on a case by case basis\n"
  },
  {
    "addressLine1": "318 W. Elm",
    "city": "Rogers",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72756",
    "name": "Jessica House for GIRLS",
    "organization": "Jessica House for GIRLS",
    "phone": "(501) 631-0838",
    "website": "",
    "description": "shelter and transitional housing for girls only. Ages 13 - 18"
  },
  {
    "addressLine1": "1206 N. Second Street",
    "city": "Rogers",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72756",
    "name": "Souls Harbor NWA",
    "organization": "Souls Harbor NWA",
    "phone": "(501) 631-7878",
    "website": "https://www.soulsharbornwa.org/",
    "description": ""
  },
  {
    "addressLine1": "400 E Walnut St",
    "city": "Blytheville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72316",
    "name": "Mississippi County Union Rescue Mission",
    "organization": "Mississippi County Union Rescue Mission",
    "phone": "(870) 763-8380",
    "website": "https://misscomission.org/",
    "description": "Mission\nTo house the homeless, provide services for those in need in our community.\n\nServices\nEmergency shelterEmergency Shelter is available 24/7 for Men, Women, and Children. The Mission currently has 23 beds for Men, and 26 beds for Women and Children. Call-ahead for bed availability suggested. For anyone being released from Jail, Hospital or Rehab this is a requirement, with a documented referral. We do not hold a license to house Parolees, nor do we accept registered Sex offenders into the Mission program. Male or Female.\nFOOD\n\nEmergency food is available to those in need three days per week Monday, Wednesday and Friday's at 1:00, other times when fresh produce is available. The Mission networks with other local food sources and feeding programs using Charity Tracker software to avoid duplicating services. Mississippi County residents only Documentation is required.\n\nCLOTHING\n\nClothing is available to the public Tuesday, Thursday  and Saturday's from 9:00 to 3:00. Monday, Wednesday and Friday's 9:00- 12:30. No residential restrictions apply. Picture ID required.\n\nFURNITURE & APPLIANCES\n\nDonated furniture, appliances, housewares, bedding and other soft furnishings are given to those from the shelter who are entering their own homes, and house-fire victims entering their new homes. We take referrals from other service agencies for families in need who are not experiencing homelessness.\n\nTRAVELER'S AID\n\nWe offer LIMITED Gas assistance for  STRANDED motorists, and LIMITED Gas assistance for out-of-town Dr. appointments for people who do not receive Medicaid and thus who cannot ride the Medicaid Van. Appointment verification required. Mississippi County residents only.\n\nPRESCRIPTIONS\n\nFinancial assistance for prescription medicines is available on a LIMITED scale, special circumstances and Co-Pays only. Mission residents who are not insured are Referred to the Great River Free Charitable Clinic.\n\nWORK PROGRAMS\n\nAll who stay at the Mission are required to work and be productive. Whether it be thru employment in the community, shelter chores, working in the kitchen, working in the office, or working in the warehouses and through the day labor program to Pay-it- Forward acquiring and honing job skills is essential in preparing for re-entering the Housed Community. Retail experience, organizational skills, and building stamina needed for an all day job are but a few of the things that can be gained by this work experience.\n\n\nWe help with emergency food and we work with the Blytheville-Gosnell Area Food Pantry"
  },
  {
    "addressLine1": "Post Office Box 1062",
    "city": "Blytheville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72315",
    "name": "The Haven of Northeast Arkansas",
    "organization": "The Haven of Northeast Arkansas",
    "phone": "(870) 532-6669",
    "website": "https://www.thehavenofneainc.org/",
    "description": "Domestic violence shelter for women and children.\nEmergency Shelter\nA specially trained staff is available 24 hours-a-day, 7 days-a-week to provide immediate support and shelter to women and their children who find themselves in a critical situation.  At the \"safe house,\" residents are provided with food, clothing, transportation, and shelter and receive lay counseling and domestic violence education that is especially designed to meet the distinctive needs of each individual.  A child advocate is also available to assist with the unique needs of children who witness family violence.\n\nTransitional Housing\nResidents who have resided at the \"safe house\" may choose to move to more independent living into transitional housing in order to lead more active lives in a secure and comfortable environment.  Transitional residents are provided with fully furnished rent free housing.  In addition, The Haven staff assists residents in securing jobs or continuing their education to provide their quality of life.\n \nVictim and Court Advocacy\nDay Advocates are available with trained advice and support to assist victims of domestic violence regarding personal rights, pressing criminal charges, orders of protection, restitution and other remedies.  Transportation is provided for court appearances and legal matters.\n \nReferred Counseling\nThe Haven staff works continually to assist residents and clients with any physical, mental, and emotional, psychosocial or financial need; however, the staff is prepared to refer and transport clients to appropriate professional services when needs beyond the scope of the Haven services are required.\n \nNon-Resident Support\nThe Haven staff is trained to lead workshops and seminars for all victims of domestic violence.  These workshops provide not only education on domestic violence but also training and guidance for independent living, including parenting programs and financial planning.\n\n\n"
  },
  {
    "addressLine1": "222B East Court Street",
    "city": "Dyersburg",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "38024",
    "name": "Dyer County Day Shelter",
    "organization": "Dyer County Day Shelter",
    "phone": "(731) 478-6444",
    "website": "http://www.tnhomelesssolutions.org/",
    "description": "Hours:\n8:30am to 4pm\nMonday-Friday\n\nThe Dyer County Day Shelter will provide, free of charge, essential life skills programs and trainings to break the cycle of poverty and homelessness by acting as catalyst to bring much needed programs and services to homeless and unemployed persons in Dyer County.  All clients will have a needs assessment completed and obtain connections to the appropriate services for the individual."
  },
  {
    "addressLine1": "1112 W Washington St",
    "city": "Camden",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71711",
    "name": "Women's Crisis Center",
    "organization": "Women's Crisis Center",
    "phone": "(870) 836-0325",
    "website": "https://www.facebook.com/Womens-Crisis-Center-of-South-Arkansas-186248451385611/",
    "description": "Battered women's shelter.\n\nWCC is dedicated to the empowerment of victim's of domestic/sexual abuse. We believe that this type of extreme force is used to achieve and maintain control over those in intimate relationships, lending itself to societal abuses of power and domination in the forms of sex, race, class, age and other oppressions; these abuses of power in society foster battering by perpetuating conditions which condone violent crimes."
  },
  {
    "addressLine1": "419 South Madison",
    "city": "El Dorado",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71730",
    "name": "The Salvation Army",
    "organization": "The Salvation Army",
    "phone": "(316) 321-4070",
    "website": "https://centralusa.salvationarmy.org/eldorado/",
    "description": "family shelter and transitional housing. Can stay up to 3 nights in the homeless shelter and up to 12 months in the transitional housing"
  },
  {
    "addressLine1": "900 East First",
    "city": "El Dorado",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71731",
    "name": "Turning Point Shelter for Women",
    "organization": "Turning Point Shelter for Women",
    "phone": "(870) 862-0929",
    "website": "https://endallviolence.org/",
    "description": ""
  },
  {
    "addressLine1": "116 Highway 96 West",
    "city": "Cecil",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72930",
    "name": "Western Arkansas Youth Shelter (WAYS)",
    "organization": "Western Arkansas Youth Shelter (WAYS)",
    "phone": "(479) 667-2946",
    "website": "http://www.cjsinc.org/WAYS-1.html",
    "description": ""
  },
  {
    "addressLine1": "317 West Walnut Street",
    "city": "Paris",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72855",
    "name": "Community Outreach Services",
    "organization": "Community Outreach Services",
    "phone": "(479) 963-3300",
    "website": "",
    "description": "Community Outreach Services is a food pantry.\n\nFood pantry service hours: Monday, Tuesday, Thursday, Friday: 9:00am - 2:00pm and Wednesdays 9:00am - 12:00pm. .\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "805 Cherry Street",
    "city": "Clarksville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72850",
    "name": "Johnson County Helping Hands",
    "organization": "Johnson County Helping Hands",
    "phone": "(479) 754-3392",
    "website": "https://www.facebook.com/johnsoncountyhelpinghands",
    "description": "Emergency Shelter, Homeless and battered women. Can stay up to 2 weeks or more.\n\nOffice hours: 9-12 on Monday, Wednesday, and Friday. Read our Facebook page to see when we have closings."
  },
  {
    "addressLine1": "Post Office Box 806",
    "city": "Clinton",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72031",
    "name": "Dove House",
    "organization": "Dove House",
    "phone": "(501) 745-5657",
    "website": "https://www.facebook.com/The-Dove-House-Inc-439692216141908/",
    "description": "women's homeless and battered women's shelter. Homeless women can stay 3 - 7 days. Battered women can stay up to 28 days.\n\nThe thrift store and Outreach office are OPEN and ready for donations and volunteers. We take household goods, clothing, books, jewelry, craft items and much more. Our hours are Tuesdays to Fridays from 9 am to 4 pm, and Saturdays 9am to 1pm. Come by and shop! We are in need of colunteers to help man the store. If you feel called to serve, give us a call or come by. Its exciting to be serving our community again and look forward to seeing you soon."
  },
  {
    "addressLine1": "1115 Parkway",
    "city": "Conway",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72032",
    "name": "Bethlehem House",
    "organization": "Bethlehem House",
    "phone": "(501) 329-4862",
    "website": "https://www.bethlehemhouse.net/",
    "description": "A Christian Transitional Shelter providing shelter and services to homeless men, women and children.\n\n\nLength of stay for a resident is determined by the time needed to overcome the barriers to independent living. Residents meet regularly with staff to evaluate their progress toward personal goals.\n\n\nServices provided:\n\nShelterDaily Breakfast and Nightly Soup Kitchen\n\nCase Management\n\nLife Skills Training\n\nTransportation\nOutreach Services:\n\nFood boxes\n\nNightly Soup Kitchen\n\nShower Facilities\n\nLaundry Facilities"
  },
  {
    "addressLine1": "707 Robins Street, Suite 118",
    "city": "Conway",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72034",
    "name": "CAPCA Emergency Shelter",
    "organization": "CAPCA Emergency Shelter",
    "phone": "(501) 329-3891",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "Post Office Box 11348",
    "city": "Conway",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72032",
    "name": "Haven Conway",
    "organization": "Haven Conway",
    "phone": "(501) 327-1701",
    "website": "http://havenconway.org/",
    "description": "Haven is a Qualified Residential Treatment Program (QRTP) for adolescent females in foster care between the ages of 12-18 who have experienced trauma. Haven accepts children into our program from every county in Arkansas in which are all referred by the Department of Children and Family Services (DCFS). Haven is a 501c3 organization supervised by Counseling Associates with services provided by Arisa Health."
  },
  {
    "addressLine1": "PO Box 2557",
    "city": "Conway",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72032",
    "name": "Women's Shelter of Central Arkansas",
    "organization": "Women's Shelter of Central Arkansas",
    "phone": "(501) 329-7405",
    "website": "https://www.conwaywomensshelter.com/",
    "description": ""
  },
  {
    "addressLine1": "2200 Fort Roots Drive",
    "city": "North Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72114",
    "name": "Domiciliary Care for Homeless Veterans Program",
    "organization": "Domiciliary Care for Homeless Veterans Program",
    "phone": "(501) 257-2311",
    "website": "https://www.instagram.com/denise.care.limited/",
    "description": "Residential treatment for homeless veterans with medical or psychiatric problems. Veterans only"
  },
  {
    "addressLine1": "4601 W. 7th",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72205",
    "name": "Mid Ark Substance Abuse in Little Rock, Arkansas",
    "organization": "Mid Ark Substance Abuse in Little Rock, Arkansas",
    "phone": "(501) 686-9393",
    "website": "",
    "description": "Shelter for indigent and others who need detox"
  },
  {
    "addressLine1": "1111 W. Markham",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72201",
    "name": "The Salvation Army Shelter Little Rock",
    "organization": "The Salvation Army Shelter Little Rock",
    "phone": "(501) 374-9296",
    "website": "http://salvationarmyaok.org/caac/programs/center-of-hope-shelter/",
    "description": "The Center of Hope provides emergency assistance, shelter, housing, chemical dependency counseling, transitional housing, health care services and spiritual support to its clients. We operate a 61-bed shelter that houses women and families. This includes three private rooms for families.\n\nCheck-in for the Center of Hope is 6:15 p.m.\nFor shelter availability, call (501) 374-8636 after 4:30 PM daily.\nBreakfast and dinner are served daily to hungry families and individuals.\nBreakfast: 6:30 AM\nDinner: 5:30 PM\n\nSocial Services\nEach client must schedule an appointment with the Salvation Army Social Services Department upon the first business day after they check into the shelter. Social Services will work with each client to develop a case plan to accomplish each clients short-term and long-term goals.\n\nLength of Stay\nEach client is guaranteed seven FREE consecutive nights of shelter so long as they follow our rules and guidelines. Continued stay at the shelter will be determined by the clients efforts to complete the goals laid out in the clients case plan.\n\nSeeking Employment\nEach client is expected to seek long-term, sustainable employment. If unable to work due to disability or retirement, it is the clients responsibility to inform and work with Salvation Army Social Services to for a referral to apply for subsidized housing.\n\nRecovery Meetings\nAll clients are required to attend at least one in-house recovery meeting. These meetings are led by Highways & Hedges using the Celebrate Recovery curriculum. The meetings are held on Mondays starting at 7:00 PM. These meetings offer an opportunity for addicts to connect to services and for non-addicts to discuss what issues led to their homelessness.\n\nLife Skills\nOn the third Tuesday of each month, the Veterans Administration teaches life skills in our shelter at 7PM. These classes are open to all of our guests.\n\nFees\nOnce a client has obtained income, he or she may move into our transitional program and pay $75 weekly or $300 monthly for a long-term stay in our program. A one-time drug-test fee of $18 is required along with the first $75 program fee.\n\nLocation\n1111 West Markham\nLittle Rock, AR 72201"
  },
  {
    "addressLine1": "2200 East Broadway Street",
    "city": "North Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72117",
    "name": "Firm Foundation Ministries Food Pantry",
    "organization": "Firm Foundation Ministries Food Pantry",
    "phone": "(501) 945-7412",
    "website": "",
    "description": ""
  },
  {
    "addressLine1": "823 S. Park Street",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72202",
    "name": "Union Rescue Mission Dorcas House",
    "organization": "Union Rescue Mission Dorcas House",
    "phone": "(501) 374-4022",
    "website": "https://urmissionlr.org/dorcas-house/",
    "description": "Outreach to women and children begin at Dorcas House. We provide emergency services like food, shelter, clothing and crisis intervention to more than 400 women and children annually.\n\n\nDomestic Violence Program\n\nWe offer a nine-month Domestic Violence Recovery Program led by licensed therapists. The curriculum that we offer goes beyond educating women and children about the cycle of violence but rather addresses root problems through intensive group therapy. Our program encourages women and children to address deep-seeded pain and suffering like childhood sexual abuse, co-dependence and depression. We work cooperatively with law enforcement and court officials to promote the protection and safety of battered women and children. If you or someone you know needs help, then please call the national domestic violence hotline at 1-800-799-SAFE(7233); and she will be directed to the appropriate shelter or safe house.\n\nDrug and Alcohol Recovery Program\n\nWe also offer a nine-month Drug and Alcohol Recovery Program which is also led by licensed therapists. For each of our programs the clients take classes based on individual needs. The classes offered are Domestic Violence Recovery, Christian 12-Steps, Parenting, Childhood Sexual Abuse Recovery, Anger Management and Coping Skills, Breaking Free (Beth Moore), and Workforce Preparedness. We seek to help women identify sinful patterns of behavior and turn to God for restoration and transformation. We also work with area Mental Health service providers because many of our clients have a dual diagnosis of addiction and mental illness. Although we are a nicotine and narcotic free program, we do understand the importance and necessity of psychotropic medications for many of our residents. Our goal is that they receive healing to the whole person: physically, mentally, emotionally and above all spiritually.\n"
  },
  {
    "addressLine1": "307 W 7th Street",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72201",
    "name": "Lucie's Place",
    "organization": "Lucie's Place",
    "phone": "(501) 508-5005",
    "website": "http://www.luciesplace.org/",
    "description": "Lucie's Place is an organization serving LGBTQ+ young adults--ages 18-25--who are either unhoused or in a housing crisis. Our Drop-In Center, a day shelter, in downtown Little Rock is currently open Monday through Friday from 10:00-4:30. It is located at 307 W. 7th St., Little Rock, AR, 72201, where we help out with things like bus passes, cell phones & minutes, toiletries, clothes, physical and mental health care referrals, and case management.. People use the Drop-In Center to work on job applications, resumes, continuing education, or just a place to hang out during the day. There are showers, a laundry room, a kitchen stocked with food open for use, and a lounge."
  },
  {
    "addressLine1": "222 East 8th Street",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72202",
    "name": "Family Promises of Pulaski County",
    "organization": "Family Promises of Pulaski County",
    "phone": "(501) 372-0733",
    "website": "https://www.familypromisepc.org/",
    "description": "SHELTER\nThe shelter operates mid-May through mid-August and mid-November through mid-January.  Applicants must be families with children under age of 18. Must pass background check.\nPartners with churches of all faiths in Pulaski County to provide shelter, food, transportation, & case management for homeless families with children under 18.\n\n\nFamily Promise of Pulaski County services families that are experiencing or are threatened by homelessness.  We offer shelter and a variety of prevention and stabilization services to those with children 18 and under.  Please be aware that our shelter system requires running a background check which may take 2-4 days to process. If you need emergency services please give our office a call and we can refer you to a shelter that can provide the immediate care that you need.\n\nOur shelter model has undergone changes as a result of COVID-19. If you need emergency services or shelter, please fill out the form below to see if you qualify for assistance. Please be aware that funding is limited and additional information may be required. If you have been selected to receive assistance, you will be contacted within 24-48 hours of submitting your application.\n"
  },
  {
    "addressLine1": "1702 South Gaines Street",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72206",
    "name": "Gaines House",
    "organization": "Gaines House",
    "phone": "(501) 376-4015",
    "website": "",
    "description": "Gaines House is a food pantry. Documentation Required: Drivers license or photo ID, proof of income.0.\n\n* Make sure you check by calling the food pantry to confirm that they still are in operation and the hours have not changed."
  },
  {
    "addressLine1": "302 E Roosevelt Rd",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72206",
    "name": "Our House - Hope for the Working Homeless",
    "organization": "Our House - Hope for the Working Homeless",
    "phone": "(501) 374-7383",
    "website": "https://ourhouseshelter.org/",
    "description": "Shelter is a safe, dormitory-style home for 80 men, women and children. There are two dorms: one for men, and one for women and children. The campus also includes common areas, a dining room, a commercial kitchen, a playground and garden.\n\n\n\nResidents can stay up to two years. They are encouraged to stay at least six months to get the full benefits of the programs. Often residents follow a plan of increased privileges and responsibilities by moving into either the Family House or Transitions Programs. Once they leave the campus, Alumni are encouraged to continue using the services through our Homelessness Prevention program called Central Arkansas Stability Family Institute or CAFSI.\n\n\n\n\nThe Transitions Program provides housing and supportive services to women with criminal history. Clients live on campus, have access to all Our House programs, and get one-on-one case management specific to the barriers they face as job seekers and members of the community. The main areas of focus are education, money management, clearing background records, job skill, and permanent housing.\n\n\n\nThis is a men, women, and family shelter. You must be willing and able to work. We have a licensed childcare facility on campus. There is an adult learning center as well. Residents can stay up to 2 years or until they have saved 10,000 dollars."
  },
  {
    "addressLine1": "3000 Springer Blvd",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72206",
    "name": "Jericho Way, Homeless Day Center",
    "organization": "Jericho Way, Homeless Day Center",
    "phone": "(501) 916-9859",
    "website": "http://www.depaulusa.org/our-programs/little-rock-ar/",
    "description": "Homeless day center, clothing closet.\nHours of Operation\nThe Resource Center is open Monday through Friday from 7:30 AM until 3:00 PM.  Every day, the Center offers a wide-ranging list of services, including:\n    Individual case-management\n    Access to computers and internet\n    Restroom and shower services\n    A place to received and send mail\n    Access to local phone service\n    Laundry services\n    Housing referrals\n    Breakfast and Lunch\n    A place to retreat from the elements\n    Access to basic medical care\n    Access to job counseling and training\n    Transportation to and from the center"
  },
  {
    "addressLine1": "3000 Confederate Blvd",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72204",
    "name": "Union Rescue Mission Little Rock",
    "organization": "Union Rescue Mission Little Rock",
    "phone": "501-3() 780-0808",
    "website": "http://www.urmissionlr.org/",
    "description": "The Union Rescue Mission operate a transient lodge for 70 men, a 20 bed 9 month residential recovery program and a 15 bed 6 month residential program for the working homeless man in Central Arkansas\n\nDorcas House:\nThe Dorcas House reaches out to women and children of Central Arkansas with the compassion Christ. Housing, classes, counseling, daily chapel time and our other services provided begin to help change lives. Those who are trapped in domestic violence or struggling with chemical dependency and other addictions find hope and support to break the shackles of their issues and begin to rebuild their lives through a relationship with Jesus Christ.\n\nDORCAS HOUSE\n823 S. Park Street\nLittle Rock, AR 72202\nPhone (501)-374-4022\nFax (501)-370-0804\n\n\n\nNehemiah House\nThe Nehemiah House reaches out to the homeless, addicted and disadvantaged men of Central Arkansas compassion of Christ. Housing, counseling, daily chapel services and our programs begin to help change lives. Those who are struggling with chemical dependency and other addictions find hope and support to break the shackles of their addictions and begin to rebuild their lives through a relationship with Jesus Christ. We offer three programs at the Nehemiah House for Men's Recovery,\n\n2921 Confederate Blvd.\nLittle Rock, AR 72206\nPhone (501)-374-1108"
  },
  {
    "addressLine1": "8101 Frenchman's Lane",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72209",
    "name": "GYST House, Inc.",
    "organization": "GYST House, Inc.",
    "phone": "(501) 568-1682",
    "website": "http://www.gysthouseinc.com/",
    "description": "Substance Abuse Treatment shelter\n\nGYST House is dedicated to assisting men and women in a total change in life-style, not simply getting off drugs. Through provision of high quality and effective treatment services by qualified, experienced and dedicated staff we place a special emphasis on Getting Your Self Together.\nWe believe the incidence of substance abuse is approximately the same in all segments of society without regard to gender, economic level, race, employment status, or other labels separating us as a human race. Accordingly, our services are available to any individual requiring and/or seeking our assistance with few expectations.\n\nGYST House places a priority on severely dependent individuals without regard to class of drug used. Moreover, GYST House focuses on sociological factors rather than the pharmacological foundations in services. To further our mission, GYST House, supports and encourages the involvement of family and other committed to creating a life-style change in persons with drug and alcohol addictions.\n\nSERVICES WE PROVIDE\n12 Step Groups\nJob Training/Employment Assistance\nWork Ethics/Semi Skill Training\nCourt Liasion Assistance\nRestitution Monitoring Assitance\nGED/Educational Referral\nIndividual Sessions\nIndividual Family Sessions\nAA Group Sessions\nNA Group Sessions\nFamily Reunifications Classes\nLife Skills/Management Classes\nAnger Management Classes\nSelf Esteem Support Group\nSocial Skills/Management Classes\nHIV/AIDS Awareness and Testing\nFinancial Management Classes\nRelapse Prevention Classes\nResolution Oriented Classes\nParenting Class Referral\nTransition to Permanant Housing Assistance\nOutpatient Treatment\n\n"
  },
  {
    "addressLine1": "219 W 15th Street",
    "city": "Fayetteville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72701",
    "name": "Fayetteville Emergency Shelter",
    "organization": "Fayetteville Emergency Shelter",
    "phone": "(479) 521-0857",
    "website": "http://salvationarmyaok.org/nwarkansas/our-shelters/",
    "description": ""
  },
  {
    "addressLine1": "245 Alexander Street",
    "city": "Fayetteville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72701",
    "name": "The Salvation Army Pathway of Hope Shelter",
    "organization": "The Salvation Army Pathway of Hope Shelter",
    "phone": "(910) 479-4663",
    "website": "https://www.salvationarmycarolinas.org/fayetteville/",
    "description": ""
  },
  {
    "addressLine1": "4171 N. Crossover Road",
    "city": "Fayetteville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72703",
    "name": "Burrell Behavioral Health Fayetteville",
    "organization": "Burrell Behavioral Health Fayetteville",
    "phone": "(501) 521-1930",
    "website": "https://www.burrellcenter.com/arkansas/",
    "description": ""
  },
  {
    "addressLine1": "1832 S. School Ave",
    "city": "Fayetteville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72701",
    "name": "7 Hills Day Center",
    "organization": "7 Hills Day Center",
    "phone": "(479) 966-4644",
    "website": "https://7hillscenter.org/",
    "description": "Seven Hills Homeless Shelter is a day shelter providing basic services such as food, shelter, showers, laundry and telephone services. The center has created three transitional housing programs to aid individuals to achieve self-sufficiency.\n\n"
  },
  {
    "addressLine1": "505 E. Emma Ave",
    "city": "Springdale",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72764",
    "name": "House of Hope Rescue Mission",
    "organization": "House of Hope Rescue Mission",
    "phone": "(479) 756-7333",
    "website": "http://www.nwahouseofhope.com/",
    "description": "DAY CENTER\nHours of Operation: Wednesdays and Fridays from 9:00 a.m. to 2:00 p.m.\nA homemade hot meal is served at lunch on those 2 days.\n\nCoffee, water and snacks are available throughout the day.\nVolunteers can assist clients with job applications, interview process, and clothing for the interview.\nShower Facilities\nWashers and dryers for laundry service once a week.\nA food pantry where clients may receive groceries once a month.\nA clothing room where clients may receive clothing monthly or as needed.\nComputers are available for clients to use, with assistance, for job hunting.\nA room for children and their parents to read and play.\nThere is a chapel for worship and meditation.\nThere is regular Bible teaching, worship and reading of the scriptures.\nPrivate one-on-one prayer and life coaching is available.\nMail Services\nReferrals when needed, to other helping hands agencies in the community.\n\nThe House of Hope Rescue Mission is a day center for the homeless and needy in Northwest Arkansas, serving 300-400 clients weekly. We are currently open on Wednesdays and Fridays. Individuals and families can come in to get out of the heat or cold, have a hot meal, snacks and water. We provide showers and laundry facilities, a food pantry and clothing room, and help with jobs and life skills, as well as phone and mail services.\n\n\nWHO MAY COME? All people are welcome regardless of age, race, gender, or religious beliefs. All are accepted in a loving, kind environment. There are guidelines and rules to follow to make it a safe, happy place for all who enter our doors!\n\nWHAT CAN YOU DO? If you are interested in helping with any of the above activities, go to our volunteer page and sign up! You can also find out about volunteer opportunities on that page. Thank you for your interest! Church members may also sign up to volunteer at the table at the back of our worship center!"
  },
  {
    "addressLine1": "3900 North Armour Avenue",
    "city": "Fort Smith",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72904",
    "name": "Gateway House I, Inc.",
    "organization": "Gateway House I, Inc.",
    "phone": "(479) 783-8849",
    "website": "https://twitter.com/gateway_inc",
    "description": "Chemical free living center. Persons completing a 30-42 day residential treatment program for chemical dependency. This is a fee based program. Sliding fee scale (fee is based on income and other factors)."
  },
  {
    "addressLine1": "3015 South 14th Street",
    "city": "Fort Smith",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72901",
    "name": "Fort Smith Children's Emergency Shelter",
    "organization": "Fort Smith Children's Emergency Shelter",
    "phone": "(479) 783-0018",
    "website": "https://fschildrensshelter.org/",
    "description": "Youth facility, boys and girls. can stay from 30 - 60 days\n\n\nThe Children's Emergency Shelter houses children who have been removed from the custody of their guardian(s) by child welfare authorities. A child's time here includes:\n\nStays from one to 45 days\n\nFood, clothing, and toiletries\n\nTransportation to and from school\n\nTransportation to and from appointments\n\nLife skills guidance\n\nSocial activities\n\nAfter-school tutors\n\nField trips to local entertainment and parks\n\n\n\nReferrals to Children's Emergency Shelter come from:\n\nDepartment of Human Services\n\nComprehensive Juvenile Services\n\nJuvenile court\n\nLaw enforcement agencies\n\nPrivate therapists and counselors\n\nInter-agency agreements\n\nHospitals\n"
  },
  {
    "addressLine1": "5603 S 14th St",
    "city": "Fort Smith",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72901",
    "name": "Crisis Center for Women",
    "organization": "Crisis Center for Women",
    "phone": "(501) 782-1821",
    "website": "https://fscic.org/",
    "description": "Crisis line-501-782-4956 and 1-800-359-0056, Battered women's shelter. Women and children shelter. can stay from 30 days to transitional housing 1 - 2 years.\nThe safe shelter is staffed 24 hours a day, 7 days a week. We provide a domestic violence survivor with:\n\n    Safe Shelter\n    Safety Planning\n    One-On-One Case Management Services\n    Legal Advocacy Accessibility\n    Childrens Advocacy\n\n    Transitional Housing Services\n\nThe Safe Shelter also attends to physical needs providing all essential health and beauty aid products, meals, laundry facilities, transportation, etc. The emergency safe shelter can accommodate up to 32 women and their children at full capacity.\n"
  },
  {
    "addressLine1": "310 N. F Street",
    "city": "Fort Smith",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72901",
    "name": "Community Rescue Mission",
    "organization": "Community Rescue Mission",
    "phone": "(479) 782-1443",
    "website": "http://www.fscrm.org/",
    "description": "Community Rescue Mission is a not-for-profit, faith-based organization that provides safe shelter, meals, and needed support to help people get back on their feet as quickly as possible.  When people come to our door, most are broken and in crisis with no place to call home.  Imagine how you would feel if you did not know where you would lay your head tonight nor from where your next meal would come.  Multiply those concerns several times over if you had children in tow.  Whatever the circumstance, we are here to instill hope and empower lives while offering Christ-like hospitality and care.\n\nWe serve meals and provide shelter to the homeless in Fort Smith and surrounding areas.\n\nCheck in times are Monday through Friday 9am-3pm.\n\nWe serve dinner to the public Monday through Friday and we serve meals to our clients 7 days a week. We also provide all the necessary supplies to our clients."
  },
  {
    "addressLine1": "301 South E Street",
    "city": "Fort Smith",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72901",
    "name": "HOPE Campus",
    "organization": "HOPE Campus",
    "phone": "(479) 434-4013",
    "website": "http://www.hopecampus.org/",
    "description": "Riverview Hope Campus is a social services campus where regional partners will offer comprehensive assistance to the less fortunate in our area.\n\nIntake 24 hours a day, though intake coordinator available from 3-10 pm daily"
  },
  {
    "addressLine1": "201 Drennen St",
    "city": "Van Buren",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72956",
    "name": "Gospel Rescue Mission",
    "organization": "Gospel Rescue Mission",
    "phone": "(479) 474-4163",
    "website": "https://www.facebook.com/pages/Gospel-Rescue-Mission-of-Van-Buren/152948388079988",
    "description": ""
  },
  {
    "addressLine1": "600 E. Stephenson",
    "city": "Harrison",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72601",
    "name": "House of Hope",
    "organization": "House of Hope",
    "phone": "(870) 704-8077",
    "website": "https://www.houseofhopeharrison.org/",
    "description": ""
  },
  {
    "addressLine1": "1015 Hwy 62 W",
    "city": "Mountain Home",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72654",
    "name": "Serenity Main Office",
    "organization": "Serenity Main Office",
    "phone": "(870) 424-7576",
    "website": "https://serenityinc.org/",
    "description": ""
  },
  {
    "addressLine1": "104 East 10th Street",
    "city": "Mountain Home",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72653",
    "name": "Gamma House Mountain Home Arkansas",
    "organization": "Gamma House Mountain Home Arkansas",
    "phone": "(870) 425-9186",
    "website": "http://www.gammahouse.org/",
    "description": "Non Profit Transitional Housing Shelter for homeless women and children.\n\nThe goal of transitional housing is to end chronic homelessness by creating an environment that enables women to find the tools they need to build a successful and self-sufficient life for themselves and their children. Residents are offered services and support which will assist them in getting back on their feet again, physically, spiritually and emotionally. It is not our purpose to assist residents with their responsibilities, but rather to assist each resident in taking responsibility for her own life."
  },
  {
    "addressLine1": "PO Box 148",
    "city": "Hatfield",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71945",
    "name": "Aliyah House - Covenant Ministries",
    "organization": "Aliyah House - Covenant Ministries",
    "phone": "(870) 389-6311",
    "website": "http://www.cministries.info/",
    "description": "Domestic Violence Shelter.\n\nThe mission of Covenant House is to provide a place of refuge for women and children in crisis situations, particularly those facing unplanned/undesired pregnancy and victims of domestic violence resulting in homelessness. Refuge is provided regardless of age, religion, race or national origin. We vow to equip these families in body, soul, and spirit, becoming whole in all areas of life so that they may become contributing members of society.\n\nAliyah House provides housing for up to four families (mother's and their children) and features an upstairs apartment for a House Manager. Here families find a safe and peaceful home to recover from abuse and addiction, finding their worth in the Father's eyes."
  },
  {
    "addressLine1": "Post Office Box 954",
    "city": "Heber Springs",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72543",
    "name": "Margies Haven House",
    "organization": "Margies Haven House",
    "phone": "(501) 362-6757",
    "website": "http://www.margieshavenhouse.org/",
    "description": "Victims of domestic abuse shelter. Up to 30 days stay.\nMHH is a domestic violence shelter for ALL victims of domestic violence/abuse. Not just women and children. Along with domestic violence/abuse, MHH also helps victims of sexual assault, human trafficking, stalking and harassment. MHH does NOT discriminate in any way. MHH helps women, children, and MEN no matter the age, race, sexual orientation, education, social status, or religion.\n"
  },
  {
    "addressLine1": "301 E. Market Street",
    "city": "Searcy",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72143",
    "name": "Jacob's Place Homeless Mission",
    "organization": "Jacob's Place Homeless Mission",
    "phone": "(501) 380-8283",
    "website": "http://www.jacobsplace.org/",
    "description": ""
  },
  {
    "addressLine1": "715 Missouri Ave",
    "city": "West Plains",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "65775",
    "name": "Martha Vance Samaritan Outreach Center",
    "organization": "Martha Vance Samaritan Outreach Center",
    "phone": "(417) 257-7792",
    "website": "http://samaritanoutreachcenter.com/",
    "description": "We are a 36 bed coed shelter and offer soup kitchen 3 times a day, 7 days a week and food and diaper pantry.\n\nMVSOC'S mission is to provide emergency shelter, transitional housing and a viable means of support to persons who are defined as homeless along with assistance in reentering society in a self-sufficient manner.\n\n\nIn addition, we strive to address the underlying causes of homelessness.\n\nAlso provides a soup kitchen. Open to everyone for three meals a day, seven days a week. Meal times are as follows:\nBreakfast: 7:00 am\nLunch 12:00 noon\nDinner: 5:30 pm\n"
  },
  {
    "addressLine1": "606 W 3rd St",
    "city": "Hope",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71801",
    "name": "Hope In Action Shelter",
    "organization": "Hope In Action Shelter",
    "phone": "(870) 777-8227",
    "website": "https://www.facebook.com/Hope-In-Action-105397796191938/",
    "description": "The shelter is an emergency shelter; the time that an individual can stay is 3 days.\n\n20 beds at this location."
  },
  {
    "addressLine1": "424 Spruce St",
    "city": "Texarkana",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "75504",
    "name": "Domestic Violence Prevention",
    "organization": "Domestic Violence Prevention",
    "phone": "(903) 794-4000",
    "website": "https://www.dvptxk.org/",
    "description": "DVP provides emergency shelter, immediate crisis intervention and advocacy, a 24 hour crisis hoteline, emergency and medical transportation, legal advocacy and court accompaniment, educational and supportive activities for children, education and support groups for adult and child victims of sexual assault/incest and domestic violence, individual counseling for shelter residents and nonresidents, and community referrals and information. Also, a battering intervention and preventio"
  },
  {
    "addressLine1": "402 Oak Street",
    "city": "Texarkana",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "75501",
    "name": "Randy Sams' Outreach Shelter, Inc.",
    "organization": "Randy Sams' Outreach Shelter, Inc.",
    "phone": "(903) 792-7024",
    "website": "http://www.randysams.org/",
    "description": "The Randy Sams' Outreach Shelter is a 24 hour evening emergency shelter that accepts both men and women (no persons under the age of 18). There are 86 beds with restroom facilities, daily meals, and case management services. The length of stay is limited to 90 days. Rent and utility assistance may be available as funds are limited.\n\nhe RSOS is a 90-day shelter that provides basic essential activities of daily living such as meals, seperate sleeping areas for men and women, and bathrooms which include shower facilities for residential clients. Each day breakfast is served at 6:00am and dinner is served at 6:00pm. Clients are encouraged to have lunch across the street at the Friendship Center from 11:00am-1:00pm. Clients leave during the day at 8:00am and can return for check-in at 3:30pm. A complete list of rules will be reviewed during admission."
  },
  {
    "addressLine1": "110 Crescent Ave",
    "city": "Hot Springs",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71901",
    "name": "Potter's Clay Ministries, Inc.",
    "organization": "Potter's Clay Ministries, Inc.",
    "phone": "(501) 624-1366",
    "website": "http://pottersclayhotsprings.org/",
    "description": ""
  },
  {
    "addressLine1": "339 Charteroak",
    "city": "Hot Springs",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71901",
    "name": "Ouachita Children's Center",
    "organization": "Ouachita Children's Center",
    "phone": "(501) 623-5591",
    "website": "http://occnet.org/",
    "description": "Emergency Shelter for children 8 - 17 years old. Can stay up to 60 days depending on needs.\n\n Ouachita Children's Center is the only emergency shelter for youth in Garland County. Last year OCC served over 550 youth through our 24 hour shelter or community outreach programs. The average length of stay in our 18 bed shelter was 37 days. The typical youth is age 14 and in the 9th grade. Without OCC services, many young people would have no choice but to spend weeks to months in incarceration or in very troubling living situations. Working in close partnership with the Juvenile Courts of Garland and Clark County, 8 different school districts and several mental health services, OCC makes a real difference for the lives of many youth AND often their families too. Many youth are provided the services and support they need in or near their home community and thus diverted from more costly and less effective incarceration. Prevention/early intervention has not only been proven to have positive impact on youth, they are also proven to be less costly for taxpayers in the long run."
  },
  {
    "addressLine1": "131 Sanford St",
    "city": "Hot Springs",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71901",
    "name": "Samaritan Ministries of Hot Springs Men's Shelter",
    "organization": "Samaritan Ministries of Hot Springs Men's Shelter",
    "phone": "(501) 321-2888",
    "website": "http://www.samaritanhs.org/",
    "description": "Only men's shelter in the greater Hot Springs, AR area providing safe, comfortable shelter, showers, clean clothing, meals and Chapel service nightly.\nIntake for emergency shelter 4 pm - 5:45pm nightly.\n\nResident program available through an application process.\n\nOvernight Guest Services\nMen are often referred to SMHS by local agencies, churches, hospitals, and other homeless individuals. All homeless men are welcome to stay at the mission for up to 10 days each month. This time to be extended if our intake staff observes the improvement in the man's life style and if he is working to overcome the issues causing his homelessness."
  },
  {
    "addressLine1": "110 Highrise Circle",
    "city": "Hot Springs",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71901",
    "name": "Safe Haven Transitional Housing for Women and Children",
    "organization": "Safe Haven Transitional Housing for Women and Children",
    "phone": "(501) 276-7750",
    "website": "https://www.facebook.com/Safe-Haven-Shelter-for-Women-and-Children-218776778248905/",
    "description": "Safe Haven Shelter for Women and Children has, as its primary goal, to provide a safe and comfortable shelter for a diverse community of homeless women and children. We strive to create an environment of dignity, respect and compassion while providing shelter and meeting the needs of hungry and food for insecure women and children. Safe Haven Shelter provides temporary shelter of up to 180 days to homeless women and children."
  },
  {
    "addressLine1": "800 Cate Street",
    "city": "Jonesboro",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72401",
    "name": "Salvation Army Shelter Jonesboro",
    "organization": "Salvation Army Shelter Jonesboro",
    "phone": "(870) 932-3875",
    "website": "http://salvationarmyaok.org/",
    "description": "Shelter hours: Shelter opens at 4:00 pm. Open Every day.\nFamily Shelter. Men, women, and children. Can stay up to 7 nights. Can be approved for more nights. Must go through a warrant check. 20 bed capacity.\n\n\nSocial Service - Tues & Thurs 9:00 to 11:30 & 1:00 to 2:30 (Food pantry, electric assistance (when funds are availiable)\n\nOffice Hours: Mondays through Thursdays 9:00 to 3:00. Social Service Office closed on Friday.\n\nFor deliveries of donations, ring the door bell if the door is lock and someone will be with you shortly"
  },
  {
    "addressLine1": "Post Office Box 721",
    "city": "Jonesboro",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72403",
    "name": "Womens Crisis Center Ne Arkansas",
    "organization": "Womens Crisis Center Ne Arkansas",
    "phone": "(870) 933-9449",
    "website": "http://www.neafamilycrisiscenter.org/resources.php",
    "description": "Domestic violence shelter. Can stay up to 30 days\n\nThe Family Crisis Center offers services to women, children, and men who are victims of domestic violence. We also offer services to all adult victims of rape.   The goal of our services is to assist  and support victims dealing with abuse or sexual assault.\nOUR SERVICES ARE CONFIDENTIAL AND FREE\nCall the Crisis Line for confidential support and advocacy.  Advocacy includes informing individuals of their options and allowing them to make their own decisions.\nCall the Crisis Line for referrals to local agencies for legal assistance, housing, food and medical needs.\n\nCall the Crisis Line for information about self-help groups and/or counseling, which is available during both day and evening hours.\nCall the Crisis Line for emergency transportation and shelter available.\nTHE CRISIS HOTLINE IS ANSWERED 24 HOURS A DAY, 7 DAYS A WEEK.\n\n"
  },
  {
    "addressLine1": "4220 Stadium Blvd.",
    "city": "Jonesboro",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72404",
    "name": "Consolidated Youth Services",
    "organization": "Consolidated Youth Services",
    "phone": "(870) 972-1110",
    "website": "https://www.cysinc.org/",
    "description": ""
  },
  {
    "addressLine1": "912 Speedway St West",
    "city": "Trumann",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72472",
    "name": "Stepping Stone Sanctuary",
    "organization": "Stepping Stone Sanctuary",
    "phone": "870-418-1259",
    "website": "https://www.steppingstonesanctuary.com/",
    "description": "Homeless shelter for men and women.\nThe mission of Stepping Stone Sanctuary is to provide temporary housing while collaborating with other agencies to make families whole"
  },
  {
    "addressLine1": "5515 Old Walcott Rd.",
    "city": "Paragould",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72450",
    "name": "Children's Home, Inc.",
    "organization": "Children's Home, Inc.",
    "phone": "(870) 239-4031",
    "website": "http://www.childrenshomes.org/",
    "description": "Residential Group Home. Boys and girls who need care from birth to 17 years old"
  },
  {
    "addressLine1": "901 E. Lake",
    "city": "Paragould",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72451",
    "name": "Mission Outreach of Paragould",
    "organization": "Mission Outreach of Paragould",
    "phone": "(870) 236-8080",
    "website": "http://missionoutreachnea.com/",
    "description": "Emergency Homeless Shelter, Transitional Living Program, Soup Kitchen, Food pantry, clothing.\nHousing the Homeless\n\nMission Outreach operates an emergency shelter, 365 days a year. Homeless clients of NEA can find a bed, shower, food, and hope all under one roof. Mission Outreach offers job hunting resources, mental health therapy, medication assistance, and much more to each person who claims Mission Outreach as a temporary home.\n\n\nOur facility is a sixty bed homeless shelter for a six county region in Northeast Arkansas. We also operate a full-time soup kitchen that serves three meals a day, year round, and a full-time food pantry.\n\n\nShelter: Mission Outreach of NEA, Inc. is a 60 bed emergency shelter for the homeless in a six county region of Northeast Arkansas. The facility, which was built in 1982, has a separate dorm area for men, women and families. The average length of stay in our shelter is 40 days.\n\nSoup Kitchen: An on-site soup kitchen serves 3 meals per day, 365 days per year. The kitchen is staffed by volunteers and residents. Breakfast is served at 6:30 AM, lunch is served at 12 PM and dinner is served at 5 PM. You do not have to be a resident to eat in the soup kitchen as it is open to the public. We serve an average 140 meals per day.\n\nFood Pantry: An on-site food pantry distributes canned goods, fresh fruits, frozen foods and other food items twice a week. Our pantry, which is staffed by volunteers, is open on Monday's and Thursday's from 9 AM to 4 PM. Individuals must meet certain income guidelines and complete minimal paperwork to be eligible for assistance. In 2011, over 5,200 food boxes were distributed through our food pantry.\n\n\nFree Clinic: Mission Outreach of NEA, Inc. in partnership with Arkansas Methodist Medical Center provides basic medical services to those who otherwise have no access to healthcare. The clinic is staffed completely by volunteer physicians, nurses, pharmacists, lab technicians and other professionals. It is open from 6 PM to 9 PM on each first and third Thursday of each month. Our charitable medical clinic has a fully stocked pharmacy on-site and fills prescription at no cost to individuals. Eligibility requires that an individual have no form of health insurance, including Medicaid and Medicare. Our clinic is located at #1 Medical Drive, Paragould, AR 72450.\n\nAssistance Programs: Our benevolent services offer rent, utility, fuel and prescription assistance. Individuals must first qualify and be approved by our benevolent services manager and are eligible for assistance once every 12 months. No cash or checks are ever exchanged as our system works entirely off of vouchers that individuals can use with cooperating providers. Our benevolent services are open from 9 AM to 4 PM each Tuesday and Thursday.\n\nSupportive Services: Other services offered by Mission Outreach of NEA, Inc. include transportation to and from employment (limited time), transportation to and from staffing agencies, social security and other document retrieval assistance, day labor opportunities and more."
  },
  {
    "addressLine1": "Post Office Box 1954",
    "city": "Little Rock",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72203",
    "name": "Women and Children First",
    "organization": "Women and Children First",
    "phone": "(501) 376-3219",
    "website": "https://www.wcfarkansas.org/",
    "description": "24-Hour Domestic Violence Hotline:\n\n501-376-3219 or toll-free 800-332-4443\n\nOur emergency shelter is available to women and children fleeing domestic violence. Women & Children First provides a safe, secure shelter and supportive services for all victims of family violence and their children. Shelter intake is available 24-hours a day. Many families arrive traumatized and fearful, with nothing but the clothes on their backs. Women & Children First provides food, clothing, linens, and hygiene items at no cost. We rely on the generosity of donations from individuals, companies, churches, and other community groups for these supplies."
  },
  {
    "addressLine1": "1500 Navajo Trail",
    "city": "Lonoke",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72086",
    "name": "Open Arms Shelter",
    "organization": "Open Arms Shelter",
    "phone": "(501) 676-6166",
    "website": "http://www.openarmsshelter.org/",
    "description": "Temporary and long-term housing to children who are victims of abuse and neglect from birth up to 18 years of age.\n\n"
  },
  {
    "addressLine1": "405A E Michigan St",
    "city": "Stuttgart",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72160",
    "name": "Turning Point Ministries Stuttgart",
    "organization": "Turning Point Ministries Stuttgart",
    "phone": "(870) 672-9086",
    "website": "http://www.tpointministries.org/",
    "description": ""
  },
  {
    "addressLine1": "301 S Grand Ave, Suite 102",
    "city": "Stuttgart",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72160",
    "name": "Economic and Nonprofit Solutions, Inc",
    "organization": "Economic and Nonprofit Solutions, Inc",
    "phone": "(870) 672-4558",
    "website": "https://www.facebook.com/Economic-and-Nonprofit-Solutions-Inc-219455064755558/",
    "description": "Provides Housing programs, assistance to the homeless, positive youth development, neighborhood revitalization. Call for details. This is not a homeless shelter, but provides services to the homeless."
  },
  {
    "addressLine1": "515 West Monroe",
    "city": "Magnolia",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71753",
    "name": "Southern Christian Mission",
    "organization": "Southern Christian Mission",
    "phone": "(870) 235-1155",
    "website": "https://www.facebook.com/Southern-Christian-Mission-Inc-101182475189815/",
    "description": "Provides a homeless shelter and soup kitchen.\n\nSouthern Christian Mission offers three meals a day as well as beds for men, women and children. Clothing that has been donated to the mission is also available for those who need it. The mission services people from the Magnolia area as well as people from Ohio, Oklahoma, Texas and Mexico.\n\nThe residents of the mission do have chores to help create a home environment during their stay."
  },
  {
    "addressLine1": "104 Cypress",
    "city": "Marion",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72364",
    "name": "East AR Youth Services",
    "organization": "East AR Youth Services",
    "phone": "(870) 739-4219",
    "website": "http://eays.org/",
    "description": "Youth shelter for boys and girls. Can stay 30 - 60 days on emergency basis. Can stay up to 1 year for residential treatment"
  },
  {
    "addressLine1": "717 East Broadway",
    "city": "West Memphis",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72301",
    "name": "8th Street Mission",
    "organization": "8th Street Mission",
    "phone": "(870) 735-6010",
    "website": "http://www.8thstreetmission.org/",
    "description": "We currently house both men and women at our shelter, but we do not yet have a location for women with children.\nServices:\nFood: Hot meals and emergency food boxes for the hungry\nShelter: Emergency overnight shelter for the homeless\n\nClothing: Emergency clothing and low-priced thrift stores\nGasoline and Bus Vouchers: as funding permits\nPrescription Assistance: as funding permits\n\nWe provide an array of programs and services to the homeless in Eastern Arkansas, including emergency shelter, a long-term addiction recovery program, healthcare/counseling, educational/occupational training, and other vital human services.\n\nChristian based Church/Mission/Drug and Alcohol Rehab discipleship program."
  },
  {
    "addressLine1": "113 West Gaines St",
    "city": "Monticello",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71655",
    "name": "Options, Inc.",
    "organization": "Options, Inc.",
    "phone": "(870) 460-0684",
    "website": "",
    "description": "Battered women's shelter. Females over 18 with children. Male children under 14 years old"
  },
  {
    "addressLine1": "501 E. 12th Avenue",
    "city": "Pine Bluff",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71601",
    "name": "The Salvation Army PineBluff",
    "organization": "The Salvation Army PineBluff",
    "phone": "(870) 534-0504",
    "website": "http://salvationarmyaok.org/pinebluff/",
    "description": "Family Emergency Shelter and Lodge for all. women, children, and men.\n\nFull list of services provided\nDisaster Services\nEmergency Financial Assistance\nEmergency Shelter\nFood & Nutrition Programs\nSeasonal Services\nCasework Services\nTransitional Housing\nCamping Activities\nVisitation Services\nWorship Services - Children's / Teen\nWorship Services - Church\nMen's Ministries\nWorship Services - Sunday School\nWomen's Ministries\nWorship Services - Youth Ministries\nCharacter Building Programs"
  },
  {
    "addressLine1": "Post Office Box 304",
    "city": "Newport",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72112",
    "name": "White River Women's Shelter",
    "organization": "White River Women's Shelter",
    "phone": "(870) 523-5000",
    "website": "https://www.whiterivershelterar.org/",
    "description": ""
  },
  {
    "addressLine1": "Post Office Box 8225",
    "city": "Pine Bluff",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71611",
    "name": "Human Development and Research Services",
    "organization": "Human Development and Research Services",
    "phone": "(870) 879-1051",
    "website": "",
    "description": "Drug and alcohol residential program for all.\n\nProvides detoxification and halfway house services to the public."
  },
  {
    "addressLine1": "Post Office Box 6705",
    "city": "Pine Bluff",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "71611",
    "name": "Committee Against Spouse Abuse, Inc.",
    "organization": "Committee Against Spouse Abuse, Inc.",
    "phone": "(870) 535-2955",
    "website": "https://www.facebook.com/voteneely/posts",
    "description": "Emergency shelter for battered women and their children"
  },
  {
    "addressLine1": "PO Box 2066",
    "city": "Russellville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72811",
    "name": "River Valley Shelter for Battered Women & Children",
    "organization": "River Valley Shelter for Battered Women & Children",
    "phone": "(479) 968-3110",
    "website": "https://www.rivervalleyshelter.org/",
    "description": "Mentally, physically, verbally, emotionally, sexually abused women and their children.\n\n"
  },
  {
    "addressLine1": "400 Lake Front Drive",
    "city": "Russellville",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72802",
    "name": "AR River Valley Area Council, Inc. - Freedom House",
    "organization": "AR River Valley Area Council, Inc. - Freedom House",
    "phone": "(479) 968-7086",
    "website": "https://www.arvacinc.org/services/freedom-house",
    "description": "Freedom House provides shelter services to men and women over the age of 18 at our Freedom House Drug Treatment Facility. Interested participants must be willing to complete 30 days of residential treatment and 90 days intensive outpatient treatment in our sober living facility. We provide wrap around services to connect participants to other resources in the community. Including our Next Step and Fresh Start Programs."
  },
  {
    "addressLine1": "PO Box 1196",
    "city": "Searcy",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72145",
    "name": "White County Domestic Violence Prevention, Inc. - Hope Cottage",
    "organization": "White County Domestic Violence Prevention, Inc. - Hope Cottage",
    "phone": "(870) 278-5130",
    "website": "https://www.hopecottage.info/",
    "description": "HOTLINE (501) 278-4673\nBattered women's shelter. women and children allow. Can stay up to 30 days\nWhite County Domestic Violence Prevention, Inc. owns and operates Hope Cottage, a shelter for women and their children who are fleeing abusive situation."
  },
  {
    "addressLine1": "1402 N Inglewood St",
    "city": "Siloam Springs",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72761",
    "name": "Genesis House of Siloam Springs - Day Shelter",
    "organization": "Genesis House of Siloam Springs - Day Shelter",
    "phone": "(479) 549-3438",
    "website": "https://www.genesishousesiloam.com/",
    "description": "To provide a safe place of shelter and support to needy individuals striving to overcome obstacles to self sufficiency.\n\nDay Shelter\n"
  },
  {
    "addressLine1": "Post Office Box 435",
    "city": "West Memphis",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "72303",
    "name": "Families In Transition, Inc.",
    "organization": "Families In Transition, Inc.",
    "phone": "(870) 732-4077",
    "website": "https://www.facebook.com/FITWM/",
    "description": "Domestic Violence Shelter for families.\n\nFor Eligibility: Victims of domestic violence and their children; Homeless\n\nCan stay from 72 hours to 30 days initially. After a review cam possibly stay longer."
  },
  {
    "addressLine1": "960 South 3rd St.",
    "city": "Memphis",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "38106",
    "name": "Calvary Rescue Mission",
    "organization": "Calvary Rescue Mission",
    "phone": "901-775-2570",
    "website": "https://calvaryrescuemission.org/",
    "description": "Overnight shelter for men. Providing meals, shelter, counseling.\nIntake 4:00-7:00 pm daily.\n\nCALVARY Rescue Mission is a non-profit, independent, faith-based shelter for homeless men in Memphis, TN. We serve two full meals a day, offer clothing to the homeless, have a 2500 volume library, and provide nightly chapel services, counseling, a discipleship program, and lodging."
  },
  {
    "addressLine1": "383 Poplar Avenue",
    "city": "Memphis",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "38105",
    "name": "Memphis Day Shelter",
    "organization": "Memphis Day Shelter",
    "phone": "(901) 526-8403",
    "website": "http://www.memphisunionmission.org/",
    "description": "Because being on the streets can be so dangerous, we do everything we can to encourage homeless individuals to stay off the streets and come into our facilities to get help.\n\nOne way we do so is by keeping our Emergency Shelter at 383 Poplar Ave. and our Opportunity Center at 600 Poplar Ave. open to the public during the day. This allows guests to access our services, and discourages loitering and street crime.Because being on the streets can be so dangerous, we do everything we can to encourage homeless individuals to stay off the streets and come into our facilities to get help.\n\nOne way we do so is by keeping our Emergency Shelter at 383 Poplar Ave. and our Opportunity Center at 600 Poplar Ave. open to the public during the day. This allows guests to access our services, and discourages loitering and street crime.\n- See more at: http://www.memphisunionmission.org/how-we-can-help/emergencyservices.htm#sthash.vqYg5GmU.dpuf"
  },
  {
    "addressLine1": "393 Poplar Avenue",
    "city": "Memphis",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "38105",
    "name": "Memphis Union Mission",
    "organization": "Memphis Union Mission",
    "phone": "(901) 526-8403",
    "website": "http://www.memphisunionmission.org/",
    "description": "Shelter:\nMany homeless men live in fear of being robbed, beaten, or even killed. And extreme temperatures can make sleeping on the streets further dangerous.\n\nThat's why providing safe, clean shelter for our overnight guests is so important. Doing so gives hope to our guests, and communicates God's love to them in a practical way.\n\n\nTo create a physically safe environment for all of our guests, we do not tolerate violence of any kind, nor do we allow drugs, alcohol, or weapons in the building. Any guest bringing these into our facility is immediately required to leave so that we can maintain a safe environment for everyone else.\n\nWhen our shelter beds are full, particularly on cold nights, we set up over 100 additional temporary beds in our chapel and an additional 100 temporary beds at our Opportunity Center.\n\nMost of Memphis Union Mission's services are provided free of charge. Our residential recovery programs are free. Furthermore, most of our emergency services, including clothing, hygiene, and food, are also free.\n\nOvernight guests who have elected not to enter a recovery program receive four free nights each month. Once they have used up their monthly free nights, they do pay $6 a night, which includes dinner, overnight stay, and breakfast the following morning.\n\n\nOvernight guests always stay for free on nights when it is 32 degrees or below. Furthermore, we are able to provide work referrals for guests who are willing to work, and we honor vouchers from several area churches and ministries.\n\nWe are structured this way because we do not want to enable our guests. Instead, we want to encourage them to take positive steps to better their situations, including finding employment and/or confronting issues that have landed them on the streets.\n\n\nDay Shelter\nBecause being on the streets can be so dangerous, we do everything we can to encourage homeless individuals to stay off the streets and come into our facilities to get help.\n\nOne way we do so is by keeping our Emergency Shelter at 383 Poplar Ave. and our Opportunity Center at 600 Poplar Ave. open to the public during the day. This allows guests to access our services, and discourages loitering and street crime.\n\nMany\nhomeless men live in fear of being robbed, beaten, or even killed. And\nextreme temperatures can make sleeping on the streets further dangerous.\n\nThat's why providing safe, clean shelter for our\novernight guests is so important. Doing so gives hope to our guests, and\ncommunicates God's love to them in a practical way.\n\nTo create a physically safe environment for all of our\nguests, we do not tolerate violence of any kind, nor do we allow drugs,\n\nalcohol, or weapons in the building. Any guest bringing these into our\nfacility is immediately required to leave so that we can maintain a safe\nenvironment for everyone else.\n\nWhen our shelter beds are full, particularly on cold\nnights, we set up over 100 additional temporary beds in our chapel and\nan additional 100 temporary beds at our Opportunity Center.\n- See more at: http://www.memphisunionmission.org/how-we-can-help/emergencyservices.htm#sthash.vqYg5GmU.dpuf"
  },
  {
    "addressLine1": "1183 Madison Avenue",
    "city": "Memphis",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "38104",
    "name": "Alpha Omega Veterans Services, Inc.",
    "organization": "Alpha Omega Veterans Services, Inc.",
    "phone": "(901) 726-5066",
    "website": "http://www.alphaomegaveterans.org/",
    "description": "Alpha Omega Veterans Services is a 501(c)(3) non-profit charitable organization headquartered in Memphis, Tennessee that assists military veterans to reintegrate into society, often after achieving recovery and rehabilitation from chronic homelessness and debilitating mental and physical conditions. We were one of the first independent non-profit organizations in the United States that specialized in providing housing and other supportive services to military veterans.\n\nInitially serving 8 veterans, Alpha Omega now has the capacity to house over 100 veterans (male and female) and provide counseling services to many more. We have served nearly 10,000 veterans since those humble beginnings. Today, Alpha Omega provides each veteran with a 30-day to 2-year program with a goal of having them successfully rejoin society, engage in healthy independent living, and secure placement into permanent housing. Each program has an integrated system of services including food, clothing, housing, transportation and assistance with rehabilitation that have been designed to meet the needs of our veterans.\n\n\nDuring the course of their program, every veteran receives intensive counseling on both an individual and group basis to deal with combat/service-related conditions such as anger management, substance abuse, combat stress, PTSD and other mental health disorders."
  },
  {
    "addressLine1": "766 S Highland St",
    "city": "Memphis",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "00000",
    "name": "Memphis Family Shelter",
    "organization": "Memphis Family Shelter",
    "phone": "(901) 725-4277",
    "website": "http://www.memphisywca.org/hotline-shelter/",
    "description": "Emergency Shelter for Women and Children Escaping Domestic Violence\nThe YWCA Shelter  is a 27 bed facility that provides the only 24 hour, 7 day a week emergency shelter to abused women and their children. To protect the safety of our clients, the shelter is in an undisclosed location. The YWCA is the only women's shelter of any kind in the city that allows mothers of teenage sons to keep their sons with them, provided the boy is attending high school. Residents of the YWCA shelter are provided with counseling, referrals, and connected with resources that can help them begin their transition to a new life free of abuse. To be admitted to the shelter, call the YWCA hotline at 725-4277."
  },
  {
    "addressLine1": "3630 Jackson Avenue",
    "city": "Memphis",
    "state": "Arkansas",
    "stateAbbreviation": "AR",
    "postal": "38108",
    "name": "Safe Harbor of Memphis",
    "organization": "Safe Harbor of Memphis",
    "phone": "(901) 382-0966",
    "website": "http://www.safeharbormemphis.org/",
    "description": "Lighthouse is a faith-based recovery support services and transitional housing program. Emergency shelter is offered for three days during fair weather-longer in weather emergencies. After the initial 3 days, individuals who desire active recovery may enter a long term (6 months to 1 year) program and must work (if able)in order to contribute to the cost of their care. Fair wages are paid in the work program; on graduation a rent and utility deposit is paid on behalf of the graduate who also receives a Walmart voucher for household items. This is a Christian facility; however, our programs are inclusive, and we offers services regardless of race, creed, color, or doctrine."
  }
]